
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФайлыБольшие = Параметры.ФайлыБольшие;
	
	МаксимальныйРазмерФайла = Цел(ФайловыеФункции.ПолучитьМаксимальныйРазмерФайла() / (1024 * 1024));
	
	Сообщение =
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	    НСтр("ru='Некоторые файлы превышают предельный размер (%1 Мб) и не будут добавлены в хранилище."
"Продолжить импорт?';uk='Деякі файли перевищують граничний розмір (%1 Мб) і не будуть додані в сховище. Продовжити імпорт?'"),
	    Строка(МаксимальныйРазмерФайла) );
		
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
КонецПроцедуры
