
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаНачислениеПениПоЛС, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	НачислениеПениПоЛС.Организация,
		|	НачислениеПениПоЛС.ЛицевойСчет,
		|	НачислениеПениПоЛС.Услуга,
		|	КОНЕЦПЕРИОДА(НачислениеПениПоЛС.Дата, МЕСЯЦ) КАК Период,
		|	КОНЕЦПЕРИОДА(НачислениеПениПоЛС.МесяцНачисления, МЕСЯЦ) КАК МесяцНачисления,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Пени) КАК ВидНачисления,
		|	НачислениеПениПоЛС.Сумма
		|ИЗ
		|	Документ.НачислениеПениПоЛС КАК НачислениеПениПоЛС
		|ГДЕ
		|	НачислениеПениПоЛС.Ссылка = &Ссылка";	
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаНачислениеПениПоЛС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЛицевымСчетам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
