
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРаспределениеДополнительныхНачислений, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	КОНЕЦПЕРИОДА(РаспределениеДополнительныхНачисленийЛицевыеСчета.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Период,
		|	РаспределениеДополнительныхНачисленийЛицевыеСчета.Ссылка.Организация,
		|	НАЧАЛОПЕРИОДА(РаспределениеДополнительныхНачисленийЛицевыеСчета.Ссылка.ПериодНачисления, МЕСЯЦ) КАК МесяцНачисления,
		|	РаспределениеДополнительныхНачисленийЛицевыеСчета.Ссылка.Услуга,
		|	РаспределениеДополнительныхНачисленийЛицевыеСчета.ЛицевойСчет,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РазовоеНачисление) КАК ВидНачисления,
		|	РаспределениеДополнительныхНачисленийЛицевыеСчета.СуммаНачислено КАК Сумма,
		|	ДЕНЬ(КОНЕЦПЕРИОДА(РаспределениеДополнительныхНачисленийЛицевыеСчета.Ссылка.ПериодНачисления, МЕСЯЦ)) КАК ДнейНачислено
		|ИЗ
		|	Документ.РаспределениеДополнительныхНачислений.ЛицевыеСчета КАК РаспределениеДополнительныхНачисленийЛицевыеСчета
		|ГДЕ
		|	РаспределениеДополнительныхНачисленийЛицевыеСчета.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРаспределениеДополнительныхНачислений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЛицевымСчетам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
