////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.РаспределениеДополнительныхНачислений.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ПроведениеСервер.ОтразитьРасчетыПоЛицевымСчетам(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаРаспределения = ЛицевыеСчета.Итог("СуммаНачислено");
	Если СуммаРаспределения <> СуммаДокумента Тогда
		ВалютаДенежныхСредств = Константы.ВалютаУчета.Получить();			
		ТекстСообщения = НСтр("ru='Сумма документа: %СуммаДокумента% %ВалютаДенежныхСредств%, не соответствует распределенной сумме в табличной части: %СуммаРаспределения% %ВалютаДенежныхСредств%!';uk='Сума документа: %СуммаДокумента% %ВалютаДенежныхСредств%, не відповідає розподіленої сумі у табличній частині: %СуммаРаспределения% %ВалютаДенежныхСредств%!'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаДокумента%", Строка(СуммаДокумента));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаРаспределения%", Строка(СуммаРаспределения));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВалютаДенежныхСредств%", СокрЛП(Строка(ВалютаДенежныхСредств)));
		ОСМДСервер.СообщитьОбОшибке(
			ТекстСообщения,
			ЭтотОбъект,
			Отказ,
			"СуммаДокумента"
		);
	КонецЕсли;
	
КонецПроцедуры
