
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(ЛицевойСчет) тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Недостаточно данных для формирования тестового сообщения! Введите лицевой счет.";
		Сообщение.Поле = "ЛицевойСчет";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	
	СформироватьДанныеЛС();
	//Результат = СтроковыеФункцииКлиентСервер.СформироватьТекстSMSСообщения(МассивЛицевыхСчетов, Объект.ТекстШаблона);
	ОсталосьСимволов      = ВзаимодействияКлиентСервер.СформироватьИнформационнуюНадписьКоличествоСимволовСообщений(
	                          Объект.ОтправлятьВТранслите,
	                          Объект.ТекстШаблона);

	
КонецПроцедуры

&НаСервере
Процедура  СформироватьДанныеЛС()

	
	МассивЛС = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ЛицевыеСчета.ОбъектЛицевогоСчета КАК ОбъектЛС,
	 |	ЛицевыеСчета.ОбъектЛицевогоСчета.Владелец КАК Здание,
	 |	ЛицевыеСчета.Представление КАК ЛицевойСчет,
	 |	МАКСИМУМ(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец) КАК ОтветственныйВладелец,
	 |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК Долг,
	 |	НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) КАК Дата
	 |ИЗ
	 |	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Дата, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	 |		ПО ЛицевыеСчета.Ссылка = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ), ) КАК РасчетыПоЛицевымСчетамОстатки
	 |		ПО ЛицевыеСчета.Ссылка = РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет
	 |ГДЕ
	 |	ЛицевыеСчета.Ссылка = &ЛицевойСчет
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ЛицевыеСчета.ОбъектЛицевогоСчета.Владелец,
	 |	ЛицевыеСчета.ОбъектЛицевогоСчета,
	 |	ЛицевыеСчета.Представление";
	 Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	 Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	 
	 ВыборкаДанных = Запрос.Выполнить().Выгрузить();
	 Для Каждого Строка из ВыборкаДанных Цикл
		 МассивЛС.Добавить(Строка);
	 КонецЦикла;
	 
	Результат = СтроковыеФункцииКлиентСервер.СформироватьТекстSMSСообщения(МассивЛС, Объект.ТекстШаблона);	 
    ТестовоеСообшение = Результат[0];
КонецПроцедуры // ()
