////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОписаниеУслугиКорпоративныеSMSНажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("http://alphasms.ua/?ref=UPj");
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Константы.ПровайдерSMS.Получить()) Тогда
		Константы.ПровайдерSMS.Установить(Перечисления.ПровайдерыSMS.АльфаSMS);	
	КонецЕсли;
	
КонецПроцедуры
