
&НаСервере
Процедура НачислитьНаСервере()
	// Выберем здания
	Если НЕ ЗначениеЗаполнено(Объект.КодКОАТУУ) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		    "ВЫБРАТЬ
		    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец КАК Здание
		    |ИЗ
		    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних";
		Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
		тзЗдания = Запрос.Выполнить().Выгрузить();
		тзЗдания.Свернуть("Здание");
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
		    "ВЫБРАТЬ
		    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец КАК Здание
		    |ИЗ
		    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(
		    |			&НаДату,
		    |			ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
		    |				И Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних";
		Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
		Запрос.УстановитьПараметр("КодКОАТУУ", Объект.КодКОАТУУ);
		тзЗдания = Запрос.Выполнить().Выгрузить();
		тзЗдания.Свернуть("Здание");
	КонецЕсли;
	
	Для Каждого стр Из тзЗдания Цикл
	    ДокНачисления = Документы.НачислениеПоЛС.СоздатьДокумент();
		ДокНачисления.Дата = ТекущаяДата();
		ДокНачисления.Организация = Объект.Организация;
		ДокНачисления.ПериодНачисления = Объект.ПериодНачисления;
		ДокНачисления.Автор = ПараметрыСеанса.ТекущийПользователь;
		ДокНачисления.Здание = стр.Здание;
		ДокНачисления.Записать();
		Док = ДокНачисления.Ссылка.ПолучитьОбъект();
		Док.ЗаполнитьАвтоматическиНаСервере();
		Док.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Начислить(Команда)
	НачислитьНаСервере();
КонецПроцедуры
