////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПриКопировании".
//
Процедура ПриКопировании(ОбъектКопирования)
	
	Код = "";
	
КонецПроцедуры // ПриКопировании()

// Процедура - обработчик события "ОбработкаПроверкиЗаполнения".
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
			
	Если НЕ ЭтоГруппа Тогда
		
		Если ЗначениеЗаполнено(КоррСчет) И НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СокрЛП(КоррСчет)) Тогда
			ТекстСообщения = НСтр("ru='В составе Корр.счета банка должны быть только цифры.';uk=' У складі Корр.рахунку банку повинні бути тільки цифри.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "КоррСчет",, Отказ);
		КонецЕсли;
		
		Если СтрДлина(СокрЛП(Код)) <> 6 Тогда
			ТекстСообщения = НСтр("ru='МФО банка должен иметь 6 знаков.';uk='МФО банку повинен мати 6 знаків.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Код",, Отказ);
		КонецЕсли;

		Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СокрЛП(Код)) Тогда
			ТекстСообщения = НСтр("ru='В составе МФО банка должны быть только цифры.';uk=' У складі МФО банку повинні бути тільки цифри.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Код",, Отказ);
		КонецЕсли;
		
	Иначе
		
		МассивНепроверяемыхРеквизитов = Новый Массив;
		МассивНепроверяемыхРеквизитов.Добавить("Код");
		
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
			ПроверяемыеРеквизиты,
			МассивНепроверяемыхРеквизитов
		);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()
