
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПериодНачисления = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	КонецЕсли;
	
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ОтображениеПериодаНачисления = Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.Основная.Очистить();
	КонецЕсли;
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ЛицевойСчетПриИзмененииНаСервере()
	ОтветственныйВладелецИКвоПрописанных    = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(Объект.ЛицевойСчет);
	Объект.Потребитель                      = ОтветственныйВладелецИКвоПрописанных.ОтветственныйВладелец;
	Объект.Здание                           = Объект.ЛицевойСчет.Владелец;
    Объект.ОбъектЛицевогоСчета              = Объект.ЛицевойСчет.ОбъектЛицевогоСчета;
	ПриборыУчета                            = ПолучитьСписокПриборов(Объект.ЛицевойСчет);
	УслугиПоЛС = ВыбратьУслугиЛС(Справочники.Услуги.НайтиПоКоду("000000019"), Объект.ЛицевойСчет);
	Объект.Корректировки.Очистить();
	Для Каждого стрПриборы Из ПриборыУчета Цикл
		НовСтрока = Объект.Корректировки.Добавить();
		НовСтрока.Услуга = стрПриборы.Услуга;
		НовСтрока.ПриборУчета = стрПриборы.ПриборУчета;
		НовСтрока.Показание = стрПриборы.Значение;
		НовСтрока.ВидТарифа = стрПриборы.ВидТарифа;
		НовСтрока.Коэффициент = стрПриборы.Коэффициент;
		НовСтрока.ВидНачисления = Перечисления.ВидыНачислений.Начисление;
	КонецЦикла;
	//Если УслугиПоЛС.Количество() <> 0 Тогда
	//	НовСтрока1 = Объект.Корректировки.Добавить();
	//	НовСтрока1.Услуга = Справочники.Услуги.НайтиПоКоду("000000019");
	//	НовСтрока1.ВидТарифа = Перечисления.ВидыТарифов.Общий;
	//	НовСтрока1.ВидНачисления = Перечисления.ВидыНачислений.Корректировка;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	ЛицевойСчетПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция КорректировкиПоказаний(ТабЧасть, Тариф)
	ТарифВодоотвод = 20.772;//ОбщийМодульМВК.ПолучитьТарифПоУслуге(Справочники.Услуги.НайтиПоКоду("000000019"));
	УслугиПоЛС = ВыбратьУслугиЛС(Справочники.Услуги.НайтиПоКоду("000000019"), Объект.ЛицевойСчет);
	Если УслугиПоЛС.Количество() <> 0 Тогда
		КвоКубовОбщее = (ТабЧасть.ПоказаниеНовое - ТабЧасть.Показание) * ТабЧасть.Коэффициент;
		ОбщаяСумма = КвоКубовОбщее * (Тариф + ТарифВодоотвод);
		СуммаХВ = КвоКубовОбщее * Тариф;
		СуммаКН = ОбщаяСумма - (КвоКубовОбщее * Тариф);
		ТабЧасть.СуммаКорректировки = СуммаХВ;
		
		НовСтрока = Объект.Корректировки.Добавить();
		НовСтрока.Услуга = Справочники.Услуги.НайтиПоКоду("000000019");
		ТекТарифК = ТарифВодоотвод;    //ОбщийМодульМВК.ПолучитьТарифПоУслуге(НовСтрока.Услуга);
		НовСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
		НовСтрока.ВидНачисления = Перечисления.ВидыНачислений.Корректировка;
		НовСтрока.СуммаКорректировки = СуммаКН;
		НовТабЧасть = Новый Структура;
		НовТабЧасть.Вставить("СуммаКорректировки",СуммаХВ); 
		Возврат НовТабЧасть;
	Иначе
		НовТабЧасть = Новый Структура;
		НовТабЧасть.Вставить("СуммаКорректировки",(ТабЧасть.ПоказаниеНовое - ТабЧасть.Показание) * ТабЧасть.Коэффициент * Тариф);
        Возврат НовТабЧасть;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПроверитьУслугу(Услуга)
	ВидУслугиХВ = Справочники.Услуги.НайтиПоКоду("Р00000192");
	Возврат ВидУслугиХВ;
КонецФункции

&НаСервере
Функция УслугаКН()
	ВидУслугиКН = Справочники.Услуги.НайтиПоКоду("000000019");
	Возврат ВидУслугиКН;
КонецФункции

&НаКлиенте
Процедура КорректировкиПоказаниеНовоеПриИзменении(Элемент)
	ТекСтрока = Элементы.Корректировки.ТекущиеДанные;
	ВидУслугиХВ = ПроверитьУслугу(ТекСтрока.Услуга);
	Если ТекСтрока.Услуга = ВидУслугиХВ Тогда
		
			тчКоррекция = Новый Структура;
			тчКоррекция.Вставить("Услуга", ВидУслугиХВ);
			тчКоррекция.Вставить("Показание", ТекСтрока.Показание);
			тчКоррекция.Вставить("ПоказаниеНовое", ТекСтрока.ПоказаниеНовое);
			тчКоррекция.Вставить("Коэффициент", ТекСтрока.Коэффициент);
			тчКоррекция.Вставить("СуммаКорректировки", ТекСтрока.СуммаКорректировки);
			ТекТариф = 22.92;   //ОбщийМодульМВК.ПолучитьТарифПоУслуге(ВидУслугиХВ);
			тчВозврат = КорректировкиПоказаний(тчКоррекция, ТекТариф);
			ТекСтрока.СуммаКорректировки = тчВозврат.СуммаКорректировки;
		Иначе
		ВидУслугиКН = УслугаКН();
		ТекТариф = 20.772;   //ОбщийМодульМВК.ПолучитьТарифПоУслуге(ВидУслугиКН);
		ТекСтрока.СуммаКорректировки = (ТекСтрока.ПоказаниеНовое - ТекСтрока.Показание) * ТекТариф * ТекСтрока.Коэффициент;
		
	КонецЕсли;
	ТекСтрока.Разница = ТекСтрока.ПоказаниеНовое - ТекСтрока.Показание;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Функция ПолучитьСписокПриборов(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЗаводскойНомер КАК ЗаводскойНомер,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|	ПоказанияПриборовУчетаСрезПоследних.Значение,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга КАК Услуга,
		|	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа КАК ВидТарифа,
		|	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета.Коэффициент КАК Коэффициент
		|ИЗ
		|	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&НаДату, ) КАК ПоказанияПриборовУчетаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&НаДату, ОбъектУстановки = &ОбъектУстановки) КАК УстановленныеПриборыУчетаСрезПоследних
		|		ПО (УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета)";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОбъектУстановки", ЛицевойСчет);
	Список = Запрос.Выполнить().Выгрузить();

	Возврат Список;
КонецФункции

&НаКлиенте
Процедура ПечатьАктСверки(Команда)
	ОткрытьФорму("Отчет.АктСверки.Форма.ФормаОтчета");
КонецПроцедуры

&НаСервере
Процедура КорректировкиСуммаКорректировкиПриИзмененииНаСервере()
	//УслугиПоЛС = ВыбратьУслугиЛС(Справочники.Услуги.НайтиПоКоду("000000048"), Справочники.Услуги.НайтиПоКоду("000000019"), Объект.ЛицевойСчет);
	//Если УслугиПоЛС.Количество() = 2 Тогда
	//	Для Каждого стр Из Объект.Корректировки Цикл
	//		
	//	КонецЦикла;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КорректировкиСуммаКорректировкиПриИзменении(Элемент)
	КорректировкиСуммаКорректировкиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ВыбратьУслугиЛС(УслугаКН, ЛС)
	сзУслуги = Новый СписокЗначений;
	//сзУслуги.Добавить(УслугаХВ);
	сзУслуги.Добавить(УслугаКН);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.Услуга
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			ЛицевойСчет = &ЛицевойСчет
	    |				И Услуга В (&Услуга)
	    |				И Действует = ИСТИНА) КАК НазначенныеУслугиСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("Услуга", сзУслуги);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	Услуги = Запрос.Выполнить().Выгрузить();
	Возврат Услуги;
КонецФункции
