
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция получает список лицевых счетов из временного хранилища
//
&НаСервере
Процедура ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище)
	
	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
	МассивОбъектовУстановки = ТаблицаДляЗагрузки.ВыгрузитьКолонку("ЛицевойСчет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|	ЕСТЬNULL(ПоказанияПриборовУчетаСрезПоследних.Значение, 0) КАК ПоказаниеПредыдущее,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета.Наименование КАК НаименованиеОбъектЛицевогоСчета,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга КАК Услуга,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
		|	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа КАК ВидТарифаПредыдущий,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Тарифность,
		|	ВЫБОР
		|		КОГДА УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Тарифность = ЗНАЧЕНИЕ(Перечисление.ТарифностьСчетчиков.Однотарифный)
		|			ТОГДА 1
		|		КОГДА УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Тарифность = ЗНАЧЕНИЕ(Перечисление.ТарифностьСчетчиков.Двухтарифный)
		|			ТОГДА 2
		|		КОГДА УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Тарифность = ЗНАЧЕНИЕ(Перечисление.ТарифностьСчетчиков.Трехтарифный)
		|			ТОГДА 3
		|	КОНЕЦ КАК Тарифность,
		|	ПломбыПриборовУчетаСрезПоследних.ВидПломбы,
		|	ПломбыПриборовУчетаСрезПоследних.СерийныйНомер,
		|	ПломбыПриборовУчетаСрезПоследних.Действует
		|ИЗ
		|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
		|			&ПериодПоказаний,
		|			ОбъектУстановки В (&ОбъектыУстановки)
		|				И ПриборУчета.Услуга = &Услуга) КАК УстановленныеПриборыУчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&ПериодПоказаний, ) КАК ПоказанияПриборовУчетаСрезПоследних
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&ПериодПоказаний, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПломбыПриборовУчета.СрезПоследних КАК ПломбыПриборовУчетаСрезПоследних
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПломбыПриборовУчетаСрезПоследних.ПриборУчета
		|ГДЕ
		|	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеОбъектЛицевогоСчета";
		
	Запрос.Параметры.Вставить("ПериодПоказаний", КонецДня(Объект.Дата - 24*60*60));
	Запрос.Параметры.Вставить("ОбъектыУстановки", МассивОбъектовУстановки);
	Запрос.Параметры.Вставить("Услуга", Объект.Услуга);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
		
	Для каждого СтрокаТаблицаЗапроса Из ТаблицаЗапроса Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ПриборУчета", СтрокаТаблицаЗапроса.ПриборУчета);
		СтруктураПоиска.Вставить("ВидТарифаПредыдущий", СтрокаТаблицаЗапроса.ВидТарифаПредыдущий);
		МассивСтрок = Объект.Основная.НайтиСтроки(СтруктураПоиска); //Вид тарифа
		
		Если МассивСтрок.Количество() > 0 Тогда         
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.Основная.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицаЗапроса);
	
	КонецЦикла;  
	
	Объект.Основная.Сортировать("ОбъектЛицевогоСчета");
	
КонецПроцедуры // ПолучитьЛицевыеСчетаИзХранилища()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - Установка видимости элементов формы
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура УстановитьВидимостьДоступность()

	Если Объект.УказатьПломбыПриборовУчета Тогда
		Элементы.ОсновнаяВидПломбы.Видимость 			= Истина;
		Элементы.ОсновнаяВидПломбыНовый.Видимость 		= Истина;
		Элементы.ОсновнаяСерийныйНомер.Видимость 		= Истина;
		Элементы.ОсновнаяСерийныйНомерНовый.Видимость	= Истина;
	Иначе
		Элементы.ОсновнаяВидПломбы.Видимость 			= Ложь;
		Элементы.ОсновнаяВидПломбыНовый.Видимость 		= Ложь;
		Элементы.ОсновнаяСерийныйНомер.Видимость 		= Ложь;
		Элементы.ОсновнаяСерийныйНомерНовый.Видимость	= Ложь;
	КонецЕсли;
	

КонецПроцедуры // УстановитьВидимостьДоступность()


// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.Основная.Очистить();
	КонецЕсли;
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура - обработчик команды Заполнить.
//
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Для полной очистки табличной части нажмите ""Да"", 
						|Для добавления строк в табличной части нажмите ""Нет"",
						|иначе ""Отмена""';uk='Для полной очистки табличной части нажмите ""Да"",
						|Для добавления строк в табличной части нажмите ""Нет"",						
						|иначе ""Отмена""'"),
		                      РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Основная.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ДатаНачала",		НачалоМесяца(Объект.Дата));
	ПараметрыЗаполнения.Вставить("ДатаОкончания",	Объект.Дата);
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыЗаполнения.Вставить("ОтборЗдание",			Объект.Здание);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		
		ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные)
	
	СтруктураДанные = Справочники.ПриборыУчета.ПолучитьРасход(СтруктураДанные);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаКлиенте
Процедура ОсновнаяПоказаниеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Основная.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("ПриборУчета", ТекущиеДанные.ПриборУчета);
		СтруктураДанные.Вставить("ПредыдущееПоказание", ТекущиеДанные.ПоказаниеПредыдущее);
		СтруктураДанные.Вставить("ТекущееПоказание", ТекущиеДанные.Показание);
		
		СтруктураДанные = ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные);
		
		Если ЗначениеЗаполнено(СтруктураДанные.ТекстОшибки) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураДанные.ТекстОшибки);

			ТекущиеДанные.Показание = ПоказаниеПередРедактированием;
			
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
   	Если Не ТекущиеДанные = Неопределено Тогда
    	ПоказаниеПередРедактированием = ТекущиеДанные.Показание;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ОсновнаяПриборУчетаНовыйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Основная.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ОбъектУстановки",		ТекущиеДанные.ОбъектУстановки);
		СтруктураПараметров.Вставить("ВидОперации",			ПредопределенноеЗначение("Перечисление.ВидыОперацийУправленияПриборамиУчета.УстановкаПрибораУчета"));
		СтруктураПараметров.Вставить("ДатаУстановки",		Объект.Дата);
		СтруктураПараметров.Вставить("Услуга",				Объект.Услуга);
														
		ОткрытьФорму("Справочник.ПриборыУчета.Форма.ФормаВыбораНеустановленных", СтруктураПараметров, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПриборУчетаУстановлен(ПриборУчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета
		|ИЗ
		|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних КАК УстановленныеПриборыУчетаСрезПоследних
		|ГДЕ
		|	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
		|	И УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = &ПриборУчета";
		
		
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ОсновнаяПриборУчетаНовыйОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ПриборУчетаУстановлен(ВыбранноеЗначение) Тогда
			
		НСтрока = НСтр("ru='Прибор учета уже установлен';uk='Прилад обліку вже встановлений'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтрока,, "Объект.ПриборыУчета.ПриборУчета");
		
		СтандартнаяОбработка = Ложь;
	Иначе
		ТекущиеДанные = Элементы.Основная.ТекущиеДанные;
		ДобавитьстрокиПоНадобности(ТекущиеДанные.ПриборУчета,ВыбранноеЗначение,ТекущиеДанные.ИсходныйНомерСтроки,ТекущиеДанные.ОбъектУстановки);
		
	КонецЕсли;
	
	
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьстрокиПоНадобности(ПриборУчета,ПриборУчетаНовый,Индекс,ЛС)

	ТарифностьСтарыйЧисло = ПолучитьЧислоТарифов(ПриборУчета.Тарифность);
	ТарифностьНовыйЧисло = ПолучитьЧислоТарифов(ПриборУчетаНовый.Тарифность);
	
	Если ТарифностьСтарыйЧисло < ТарифностьНовыйЧисло Тогда
		
		КолВоСтрок =  ТарифностьНовыйЧисло - ТарифностьСтарыйЧисло;
		
		Пока КолВоСтрок > 0 Цикл
			НоваяСтрока = Объект.Основная.Вставить(Индекс+1);
			НоваяСтрока.ОбъектУстановки = ЛС;
			НоваяСтрока.ПриборУчетаНовый = ПриборУчетаНовый;
			КолВоСтрок = КолВоСтрок - 1;
		КонецЦикла;
	КонецЕсли;
	
	

КонецПроцедуры // ДобавитьстрокиПоНадобности()

Функция ПолучитьЧислоТарифов(Тарифность)
	
	Если Тарифность = Перечисления.ТарифностьСчетчиков.Однотарифный Тогда
		возврат 1;
	ИначеЕсли Тарифность = Перечисления.ТарифностьСчетчиков.Двухтарифный Тогда
		Возврат 2;
	Иначе
		Возврат 3;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура УказатьПломбыПриборовУчетаПриИзменении(Элемент)
	УстановитьВидимостьДоступность()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступность();
КонецПроцедуры
