
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.РасчетПоказанийПриборовУчета.Записывать = Истина;
	Для Каждого ТекСтрокаОсновная Из ТабличнаяЧастьОбъем Цикл
		Движение = Движения.РасчетПоказанийПриборовУчета.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = КонецДня(ПериодНачисления);
		Движение.ОбъектУстановки = ТекСтрокаОсновная.ЛицевойСчет;
		Движение.ПриборУчета = ТекСтрокаОсновная.ПриборУчета;
		Движение.Услуга = Справочники.Услуги.НайтиПоКоду("000000020");
		Движение.ВидТарифа = Перечисления.ВидыТарифов.Общий;    //ТекСтрокаОсновная.ВидТарифа;
		//Движение.Энергоемкость = ТекСтрокаОсновная.Энергоемкость;
		Движение.Значение = ТекСтрокаОсновная.Объем;
	КонецЦикла;
КонецПроцедуры
