
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	 		
	СсылкаНаВидеоУрок = СсылкиНаВидеоУрок(ПараметрКоманды);
	
	Если ЗначениеЗаполнено(СсылкаНаВидеоУрок) Тогда
		
		НавигационнаяСсылка = СсылкаНаВидеоУрок;
		ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СсылкиНаВидеоУрок(ПараметрКоманды)
	
	НазваниеУрока = ПараметрКоманды.Метаданные().ПолноеИмя();
	
	СсылкаНаВидеоУрок = "";
	
	Ссылки = Новый ТаблицаЗначений;
	
	Ссылки.Колонки.Добавить("Название");
	Ссылки.Колонки.Добавить("Ссылка");
	
	Макет = ПолучитьОбщийМакет("СсылкиНаВидеоУроки");
	
	Высота = Макет.ВысотаТаблицы;
	
	Для Сч = 1 По Высота Цикл
		
		Стр = Ссылки.Добавить();
		Стр.Название = СокрЛП(Макет.Область(Сч,1,Сч,1).Текст);
		Стр.Ссылка = Макет.Область(Сч,2,Сч,2).Текст;
		
	КонецЦикла;
	
	мНайдСтроки = Ссылки.НайтиСтроки(Новый Структура("Название", НазваниеУрока));
	
	Если мНайдСтроки.Количество() > 0 Тогда 
		
		СсылкаНаВидеоУрок = мНайдСтроки[0].Ссылка;
		
	КонецЕсли;
		
	Возврат СсылкаНаВидеоУрок;
		
КонецФункции