
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Форма = ПолучитьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораПериода");
	//Форма.ЛицевойСчет.ЗагрузитьЗначения(ПараметрКоманды);
	ПараметрыПечати = Форма.ОткрытьМодально();
	
	Если ПараметрыПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;

	
	Если ПараметрыПечати.ДатаНачала = ДАТА('00010101') Тогда
		Возврат;
	КонецЕсли;
	
 	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "ПФ_MXL_МакетАктСверки", ПараметрКоманды, ПараметрыВыполненияКоманды, ПараметрыПечати);

КонецПроцедуры
