
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРаспределениеОбщедомовыхПриборовУчета, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		 //"ВЫБРАТЬ
		 //|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		 //|	РаспределениеХолоднойВодыОсновная.Ссылка.Услуга,
		 //|	РаспределениеХолоднойВодыОсновная.ЛицевойСчет КАК ОбъектУстановки,
		 //|	РаспределениеХолоднойВодыОсновная.ВидТарифа,
		 //|	КОНЕЦПЕРИОДА(ДокументСсылкаРаспределениеХолоднойВодыОсновная.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Период,
		 //|	ДокументСсылкаРаспределениеХолоднойВодыОсновная.Показание КАК Значение,
		 //|	ДокументСсылкаРаспределениеХолоднойВодыОсновная.Энергоемкость
		 //|ИЗ
		 //|	Документ.РаспределениеХолоднойВоды.Основная КАК ДокументСсылкаРаспределениеХолоднойВодыОсновная
		 //|ГДЕ
		 //|	ДокументСсылкаРаспределениеХолоднойВодыОсновная.Ссылка = &Ссылка";
	
	     "ВЫБРАТЬ
		 |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		 |	РаспределениеХолоднойВодыОсновная.Ссылка.Услуга,
		 |	РаспределениеХолоднойВодыОсновная.ЛицевойСчет,
		 |	РаспределениеХолоднойВодыОсновная.ВидТарифа,
		 |	КОНЕЦПЕРИОДА(РаспределениеХолоднойВодыОсновная.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Период,
		 |	РаспределениеХолоднойВодыОсновная.Показание,
		 |	РаспределениеХолоднойВодыОсновная.Энергоемкость
		 |ИЗ
		 |	Документ.РаспределениеХолоднойВоды.Основная КАК РаспределениеХолоднойВодыОсновная
		 |ГДЕ
		 |	РаспределениеХолоднойВодыОсновная.Ссылка = &Ссылка";
	
	
	
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРаспределениеОбщедомовыхПриборовУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетПоказанийПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Выполняет контроль повторного начисления.
//
Процедура ВыполнитьКонтрольПовторногоНачисления(ДокументСсылкаРаспределениеОбщедомовыхПриборовУчета, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Если СтруктураВременныеТаблицы.ДвиженияРасчетПоказанийПриборовУчетаИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасчетПоказанийПриборовУчетаОбороты.Регистратор КАК Регистратор
		|ИЗ
		|	ДвиженияРасчетПоказанийПриборовУчетаИзменение КАК ДвиженияРасчетПоказанийПриборовУчетаИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетПоказанийПриборовУчета.Обороты(
		|				&ДатаНачала,
		|				&ДатаОкончания,
		|				Регистратор,
		|				(ОбъектУстановки, ПриборУчета, Услуга, ВидТарифа) В
		|					(ВЫБРАТЬ
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение.ОбъектУстановки КАК ОбъектУстановки,
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение.ПриборУчета КАК ПриборУчета,
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение.Услуга КАК Услуга,
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение.ВидТарифа КАК ВидТарифа
		|					ИЗ
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение КАК ДвиженияРасчетПоказанийПриборовУчетаИзменение)) КАК РасчетПоказанийПриборовУчетаОбороты
		|		ПО ДвиженияРасчетПоказанийПриборовУчетаИзменение.ОбъектУстановки = РасчетПоказанийПриборовУчетаОбороты.ОбъектУстановки
		|			И ДвиженияРасчетПоказанийПриборовУчетаИзменение.ПриборУчета = РасчетПоказанийПриборовУчетаОбороты.ПриборУчета
		|			И ДвиженияРасчетПоказанийПриборовУчетаИзменение.Услуга = РасчетПоказанийПриборовУчетаОбороты.Услуга
		|			И ДвиженияРасчетПоказанийПриборовУчетаИзменение.ВидТарифа = РасчетПоказанийПриборовУчетаОбороты.ВидТарифа
		|ГДЕ
		|	РасчетПоказанийПриборовУчетаОбороты.Регистратор <> &Ссылка");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРаспределениеОбщедомовыхПриборовУчета);
		Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДокументСсылкаРаспределениеОбщедомовыхПриборовУчета.ПериодНачисления));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДокументСсылкаРаспределениеОбщедомовыхПриборовУчета.ПериодНачисления));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ДокументОбъектРаспределениеОбщедомовыхПриборовУчета = ДокументСсылкаРаспределениеОбщедомовыхПриборовУчета.ПолучитьОбъект();
			
			ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
			ОСМДСервер.СообщитьОбОшибкахПроведенияПоПовторномуНачислению(ДокументОбъектРаспределениеОбщедомовыхПриборовУчета, ВыборкаИзРезультатаЗапроса, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

