////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция получает список лицевых счетов из временного хранилища
//
&НаСервере
Процедура ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище)
	
	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
	Объект.ЛицевыеСчета.Загрузить(ТаблицаДляЗагрузки);
	
КонецПроцедуры // ПолучитьЛицевыеСчетаИзХранилища()

// Процедура устанавливает видимость и доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если ЛицевыеСчетаСписком Тогда
		Элементы.ЛицевыеСчета.Видимость = Истина;
		Элементы.ЛицевойСчет.Видимость = Ложь;
	Иначе
		Элементы.ЛицевыеСчета.Видимость = Ложь;	
		Элементы.ЛицевойСчет.Видимость = Истина;
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.ПриостановкаУслуги Тогда
		Элементы.ГруппаПриостановка.Видимость = Истина;
		Элементы.ГруппаНазначение.Видимость = Ложь;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.НазначениеУслуги Тогда
		Элементы.ГруппаНазначение.Видимость = Истина;
		Элементы.ГруппаПриостановка.Видимость = Ложь;
		Элементы.ДатаНачала.Видимость = Истина;
		Элементы.ДатаОкончания.Видимость = Ложь;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.ОтключениеУслуги Тогда
		Элементы.ГруппаНазначение.Видимость = Истина;
		Элементы.ГруппаПриостановка.Видимость = Ложь;
		Элементы.ДатаНачала.Видимость = Ложь;
		Элементы.ДатаОкончания.Видимость = Истина;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.ВременноеНазначениеУслуги Тогда
		Элементы.ГруппаНазначение.Видимость = Истина;
		Элементы.ГруппаПриостановка.Видимость = Ложь;
		Элементы.ДатаНачала.Видимость = Истина;
		Элементы.ДатаОкончания.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьИДоступность()

// Процедура - обработчик события ПриИзменении поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	Объект.ЛицевыеСчета[0].ЛицевойСчет = ЛицевойСчет;	
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "ЛицевыеСчетаСписком".
//
&НаКлиенте
Процедура ЛицевыеСчетаСпискомПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "ВидОперации".
//
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "Здание".
//
&НаКлиенте
Процедура ЗданияПриИзменении(Элемент)
	
	Если Объект.ЛицевыеСчета.Количество() > 0 Тогда
		ЛицевойСчет = Объект.ЛицевыеСчета[0].ЛицевойСчет;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды "Подбор".
//
&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ДатаНачала",		НачалоМесяца(Объект.Дата));
	ПараметрыЗаполнения.Вставить("ДатаОкончания",	КонецМесяца(Объект.Дата));
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыЗаполнения.Вставить("ОтборЗдание",			Объект.Здание);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		
		Объект.ЛицевыеСчета.Очистить();
		
		ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыВыбораЗначения.Вставить("ОтборЗдание",			Объект.Здание);

	ОткрытьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, Элемент);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	Если Параметры.Основание = Неопределено Тогда
		ЛицевыеСчетаСписком = Истина;
	Иначе
		ЛицевыеСчетаСписком = Ложь;
	КонецЕсли;
	
	Если Объект.ЛицевыеСчета.Количество() > 0 Тогда
		ЛицевойСчет = Объект.ЛицевыеСчета[0].ЛицевойСчет;
	КонецЕсли;
	
	УстановитьВидимостьИДоступность();
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

