////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.РаспределениеТепловойЕнергии.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ПроведениеСервер.ОтразитьРасчетПоказанийПриборовУчета(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.РаспределениеТепловойЕнергии.ВыполнитьКонтрольПовторногоНачисления(Ссылка, ДополнительныеСвойства, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
	// регістр РаспределениеТепловойЕнергии
	Движения.РаспределениеТепловойЕнергии.Записывать = Истина;
	Движение = Движения.РаспределениеТепловойЕнергии.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Здание = Здание;
	Движение.Подъезд = Подъезд;
	Движение.ПериодНачисления = ПериодНачисления;
	Движение.Услуга = Услуга;
	Движение.УслугаИндивидуальная = УслугаИндивидуальная;
	Движение.ОбщедомовойПриборУчета = ОбщедомовойПриборУчета;
	Движение.ЛицевойСчетПрибораУчета = ЛицевойСчетПрибораУчета;
	Движение.ВсегоГКал = ВсегоГКал;
	Движение.ЗначениеОбщедомовое = ЗначениеОбщедомовое;
	Движение.ЗначениеМЗК = ЗначениеМЗК;
	Движение.ЗначениеИТП = ЗначениеИТП;
	Движение.ЗначениеГенераторна = ЗначениеГенераторна;
	Движение.ДосчитаноДоКонцаМесяца = ДосчитаноДоКонцаМесяца;
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры