
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЦеныНоменклатуры(ДокументСсылкаУстановкаЦенНоменклатуры, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаЦены.ТипЦен КАК ТипЦены,
		|	ВременнаяТаблицаЦены.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаЦены.Цена КАК Цена,
		|	ВременнаяТаблицаЦены.Период КАК Период
		|ИЗ
		|	ВременнаяТаблицаЦены КАК ВременнаяТаблицаЦены";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЦеныНоменклатуры", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЦеныНоменклатуры()

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУстановкаЦенНоменклатуры, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыЗапасы.Ссылка.ТипЦен КАК ТипЦен,
		|	УстановкаЦенНоменклатурыЗапасы.Номенклатура,
		|	УстановкаЦенНоменклатурыЗапасы.Цена,
		|	УстановкаЦенНоменклатурыЗапасы.Ссылка.Дата КАК Период
		|ПОМЕСТИТЬ ВременнаяТаблицаЦены
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.Запасы КАК УстановкаЦенНоменклатурыЗапасы
		|ГДЕ
		|	УстановкаЦенНоменклатурыЗапасы.Ссылка = &Ссылка
		|	И УстановкаЦенНоменклатурыЗапасы.Пометка = ИСТИНА";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУстановкаЦенНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицаЦеныНоменклатуры(ДокументСсылкаУстановкаЦенНоменклатуры, СтруктураДополнительныеСвойства);
	
КонецПроцедуры


