
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = ПолучитьГлавныйУзел() Тогда
		Предупреждение("Этот объект нельзя заархиривать.");
	ИначеЕсли НЕ ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПараметрКоманды, "Отключено") Тогда
		Ответ = Вопрос("После архивации обмен с устройством будет невозможен. Для восстановления обмена необходимо зарегистрировать устройство заново. Вы уверены, что хотите продолжить?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЭтаФорма = ПараметрыВыполненияКоманды.Источник;
			Если ЭтаФорма.ИмяФормы = "ПланОбмена.ОбменСМобильнымиУстройствами.Форма.ФормаУзла" Тогда
				ЭтаФорма.Объект.Отключено = Истина;
				Попытка
					ЭтаФорма.Записать();
				Исключение
					Сообщить("Не удалось заархивировать устройство по следующей причине: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					Возврат;
				КонецПопытки;
				ЭтаФорма.Закрыть();
				ОбменДаннымиМобПриложениеСервер.УдалитьРегистрациюИзменений(ПараметрКоманды);
			Иначе
				ОбменДаннымиМобПриложениеСервер.АрхивироватьУстройство(ПараметрКоманды);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Предупреждение("Устройство уже заархивировано. Для настройки обмена зарегистрируйте устройство заново.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьГлавныйУзел()
	
	Возврат ПланыОбмена.ОбменСМобильнымиУстройствами.ЭтотУзел();
	
КонецФункции