
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Обработчик события "ПередЗаписью" элемента справочника.
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ПустаяСтрока(Пароль) И НЕ ХранитьПароль Тогда
		Пароль = "";
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Проверяет существование указанного каталога в поле ИмяКаталогаВыгрузки.
Функция ПроверкаСуществованияКаталога() Экспорт
	
	КаталогНаДиске = Новый Файл(ФайловыйРесурс);
	Если НЕ КаталогНаДиске.Существует() Тогда
		Сообщить("Каталог не найден!");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции  //ПроверкаСуществованияКаталога()
