
&НаСервере
Процедура СформироватьОтчетНаСервере(ТабличныйДокумент)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!
	
	Макет = Отчеты.ОтчетПоОбщедомовымПриборамУчета.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РаспределениеХолоднойВодыОсновная.Показание) КАК Показание,
		|	РаспределениеХолоднойВодыОсновная.Ссылка.Здание,
		|	РаспределениеХолоднойВодыОсновная.Ссылка.ОбщедомовойПриборУчета КАК ПриборУчета
		|ИЗ
		|	Документ.РаспределениеХолоднойВоды.Основная КАК РаспределениеХолоднойВодыОсновная
		|ГДЕ
		|	РаспределениеХолоднойВодыОсновная.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РаспределениеХолоднойВодыОсновная.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	РаспределениеХолоднойВодыОсновная.Ссылка.Здание,
		|	РаспределениеХолоднойВодыОсновная.Ссылка.ОбщедомовойПриборУчета";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Отчет.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("НачалоПериода", Отчет.Период.ДатаНачала);
	//Запрос.УстановитьПараметр("НаДату", КонецДня(Отчет.Период.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	Данные = Запрос.Выполнить().Выгрузить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.НачПериода = Отчет.Период.ДатаНачала;
	ОбластьЗаголовок.Параметры.КонПериода = Отчет.Период.ДатаОкончания;
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	

	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ЗапросАкт = Новый Запрос;
		ЗапросАкт.Текст =
		    "ВЫБРАТЬ
		    |	АктСнятияПоказанийХолоднойВодыСрезПоследних.ПоказаниеПредыдущее,
		    |	АктСнятияПоказанийХолоднойВодыСрезПоследних.ПоказаниеТекущее,
		    |	АктСнятияПоказанийХолоднойВодыСрезПоследних.РазницаПоказания
		    |ИЗ
		    |	РегистрСведений.АктСнятияПоказанийХолоднойВоды.СрезПоследних(&НаДату, ПриборУчета = &ПриборУчета) КАК АктСнятияПоказанийХолоднойВодыСрезПоследних";
		ЗапросАкт.УстановитьПараметр("НаДату", КонецДня(Отчет.Период.ДатаОкончания));
		ЗапросАкт.УстановитьПараметр("ПриборУчета", ВыборкаДетальныеЗаписи.ПриборУчета);
		щ = ЗапросАкт.Выполнить().Выгрузить();
		Для Каждого стр Из щ Цикл
			ОбластьДетальныхЗаписей.Параметры.ПоказаниеПредыдущее = стр.ПоказаниеПредыдущее;
			ОбластьДетальныхЗаписей.Параметры.ПоказаниеТекущее    = стр.ПоказаниеТекущее;
			ОбластьДетальныхЗаписей.Параметры.РазницаПоказания    = стр.РазницаПоказания;
		КонецЦикла;
			
		ТабличныйДокумент.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
	ТабличныйДокумент.Вывести(ОбластьПодвал);

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	ТабличныйДокумент = Результат;
	СформироватьОтчетНаСервере(ТабличныйДокумент);
	ТабличныйДокумент.Показать();
КонецПроцедуры
