////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// В обработчике события ОбработкаЗаполнения документа выполняется
// - заполнение документа по инвентаризации запасов на складе.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИнвентаризацияЗапасов") И ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		
		ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.Склад;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	МИНИМУМ(ИнвентаризацияЗапасов.НомерСтроки) КАК НомерСтроки,
		|	ИнвентаризацияЗапасов.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ИнвентаризацияЗапасов.Количество - ИнвентаризацияЗапасов.КоличествоУчет) КАК КоличествоОтклонениеИнвентаризации,
		|	СУММА(ВЫБОР
		|			КОГДА ОприходованиеЗапасов.Количество ЕСТЬ NULL 
		|				ТОГДА 0
		|			ИНАЧЕ ОприходованиеЗапасов.Количество
		|		КОНЕЦ) КАК КоличествоОприходованное
		|ИЗ
		|	Документ.ИнвентаризацияЗапасов.Запасы КАК ИнвентаризацияЗапасов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОприходованиеЗапасов.Запасы КАК ОприходованиеЗапасов
		|		ПО ИнвентаризацияЗапасов.Номенклатура = ОприходованиеЗапасов.Номенклатура
		|			И ИнвентаризацияЗапасов.Ссылка = ОприходованиеЗапасов.Ссылка.ДокументОснование
		|			И (ОприходованиеЗапасов.Ссылка <> &ДокументСсылка)
		|			И (ОприходованиеЗапасов.Ссылка.Проведен)
		|ГДЕ
		|	ИнвентаризацияЗапасов.Ссылка = &ДокументОснование
		|	И ИнвентаризацияЗапасов.Количество - ИнвентаризацияЗапасов.КоличествоУчет > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ИнвентаризацияЗапасов.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		
		Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ОснованиеДляОприходования = ДанныеЗаполнения.Ссылка;
			Выборка = РезультатЗапроса.Выбрать();
			
			// Заполнение табличной части документа.
			Запасы.Очистить();
			
			Пока Выборка.Следующий() Цикл
				
				КоличествоОприходовать = Выборка.КоличествоОтклонениеИнвентаризации - Выборка.КоличествоОприходованное;
				Если КоличествоОприходовать <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаТабличнойЧасти = Запасы.Добавить();
				СтрокаТабличнойЧасти.Номенклатура		= Выборка.Номенклатура;
				СтрокаТабличнойЧасти.Количество			= КоличествоОприходовать;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Запасы.Количество() = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru='Нет данных для оформления оприходования!';uk='Немає даних для оформлення оприбуткування!'");
			Сообщение.Сообщить();
			
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ОприходованиеЗапасов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ПроведениеСервер.ОтразитьЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.ОприходованиеЗапасов.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.ОприходованиеЗапасов.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
КонецПроцедуры

