
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.Период.ДатаНачала = НачалоДня(ТекущаяДата());
	Отчет.Период.ДатаОкончания = КонецДня(ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтчетНаСервере()
	тзМиргород.Очистить();
	тзбагачка.Очистить();
	Макет = Отчеты.ОтчетПоЗадолженностиНасиленияФорма_18.ПолучитьМакет("Форма15_04_10_2022_Д_18");
	спУслуг = Новый СписокЗначений;
	спУслугЖЕК = Новый СписокЗначений;
	спУслугЖЕК.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000181")); // Управління багатоповерховим будинком ( Гоголя 52 )
	спУслугЖЕК.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000261")); // Управління багатоповерховим будинком ( Козацька 3 )
	спУслугЖЕК.Добавить(Справочники.Услуги.НайтиПоКоду("Р00000262")); // Управління багатоповерховим будинком ( Старосвітська 8 )
	
	КодКОАТУУМиргород = "5310900000";
	Результат.Очистить();
	// Отримаємо к-ть абонентів Миргород по ТЕ
	ЗапросЛСМиргород = Новый Запрос;
	ЗапросЛСМиргород.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Услуга В (&Услуга)
	    |				И ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ
		|				И ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд) КАК НазначенныеУслугиСрезПоследних
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет";
	ЗапросЛСМиргород.УстановитьПараметр("КодКОАТУУ", КодКОАТУУМиргород);
	ЗапросЛСМиргород.УстановитьПараметр("Услуга", спУслугЖЕК);
	ЗапросЛСМиргород.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	ЗапросЛСМиргород.УстановитьПараметр("ЖилойФонд", Перечисления.ЖилойНеЖилойФонд.Жилой);
	КвоАбонентовМиргород = ЗапросЛСМиргород.Выполнить().Выгрузить();
	НовСтрокаМиргород = тзМиргород.Добавить();
	НовСтрокаМиргород.КвоАбонентовЖЕК = КвоАбонентовМиргород.Количество() / 1000;
	спАбонентовМиргород = Новый СписокЗначений;
	Для Каждого стр Из КвоАбонентовМиргород Цикл
		спАбонентовМиргород.Добавить(стр.ЛицевойСчет);
	КонецЦикла;
	
	// Оплати по абонентам Миргород за останні 3 місяці
	тзДолжники = Новый ТаблицаЗначений;
	тзДолжники.Колонки.Добавить("ЛицевойСчет");
	тзДолжники.Колонки.Добавить("Долг");
	ЗапросДолг3Месяца = Новый Запрос;
	ЗапросДолг3Месяца.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток > РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Долг3Месяца,
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Авто, , ЛицевойСчет В (&ЛицевойСчет)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток > РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	ЗапросДолг3Месяца.УстановитьПараметр("ЛицевойСчет",   спАбонентовМиргород);
	ЗапросДолг3Месяца.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоМесяца(Отчет.Период.ДатаНачала), -3));
	ЗапросДолг3Месяца.УстановитьПараметр("КонецПериода",  КонецМесяца(Отчет.Период.ДатаОкончания));
	РезультатОплаты = ЗапросДолг3Месяца.Выполнить();
	ВыборкаОплаты = РезультатОплаты.Выбрать();
	Пока ВыборкаОплаты.Следующий() Цикл
		Если ВыборкаОплаты.Долг3Месяца = 1 Тогда
		    НовСтрокаДолг = тзДолжники.Добавить();
			НовСтрокаДолг.ЛицевойСчет = ВыборкаОплаты.ЛицевойСчет;
			НовСтрокаДолг.Долг = ВыборкаОплаты.Долг3Месяца;
		КонецЕсли;
	КонецЦикла;
	НовСтрокаМиргород.КвоАбонентовДолгБольше3Месяцев = тзДолжники.Количество() / 1000;
		
	// Виберемо заборгованість по особовим рахункам за вказаний період по Миргороду
	ЗапросДолги = Новый Запрос;
	ЗапросДолги.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	    |			&Период,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстатки
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет";
	ЗапросДолги.УстановитьПараметр("Период", Отчет.Период.ДатаОкончания);
	ЗапросДолги.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросДолги.УстановитьПараметр("Услуга", спУслугЖЕК);
	РезультатДолгМиргород = ЗапросДолги.Выполнить().Выгрузить();
	НовСтрокаМиргород.ДолгЖЕКНаНачалоПериода = РезультатДолгМиргород.Итог("СуммаОстаток") / 1000;
	
	// Виберемо нарахування за звітній період по Миргороду
	ЗапросНачисленияМиргород = Новый Запрос;
	ЗапросНачисленияМиргород.Текст =
	    "ВЫБРАТЬ
	    |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход) КАК СуммаПриход,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(
	    |			&НачалоПериода,
	    |			&КонецПериода,
	    |			Месяц,
	    |			,
	    |			ЛицевойСчет В (&ЛицевойСчет)
	    |				И Услуга В (&Услуга)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	    |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга";
	ЗапросНачисленияМиргород.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросНачисленияМиргород.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросНачисленияМиргород.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросНачисленияМиргород.УстановитьПараметр("Услуга", спУслугЖЕК);
	РезультатНачисления = ЗапросНачисленияМиргород.Выполнить().Выгрузить();
	НовСтрокаМиргород.НачисленоЖЕКЗаПериод = РезультатНачисления.Итог("СуммаПриход") / 1000;
	
	// Виберемо оплати за звітній період по Миргороду
	ЗапросОплатиМиргород = Новый Запрос;
	ЗапросОплатиМиргород.Текст =
	    "ВЫБРАТЬ
		    |	СУММА(РасчетыПоЛицевымСчетам.Сумма) КАК Сумма,
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет
		    |ИЗ
		    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		    |ГДЕ
		    |	РасчетыПоЛицевымСчетам.Услуга В(&Услуга)
		    |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &НачалоПериода И &КонецПериода
		    |	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		    |	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.ЗакрытиеМесяца)
		    |	И РасчетыПоЛицевымСчетам.ЛицевойСчет В (&ЛицевойСчет)
		    |
		    |СГРУППИРОВАТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	РасчетыПоЛицевымСчетам.ЛицевойСчет
		    |АВТОУПОРЯДОЧИВАНИЕ";
	ЗапросОплатиМиргород.УстановитьПараметр("НачалоПериода", НачалоМесяца(Отчет.Период.ДатаНачала));
	ЗапросОплатиМиргород.УстановитьПараметр("КонецПериода", КонецМесяца(Отчет.Период.ДатаОкончания));
	ЗапросОплатиМиргород.УстановитьПараметр("ЛицевойСчет", спАбонентовМиргород);
	ЗапросОплатиМиргород.УстановитьПараметр("Услуга", спУслугЖЕК);
	РезультатНачисления = ЗапросОплатиМиргород.Выполнить().Выгрузить();
	НовСтрокаМиргород.ОплаченоЖЕКЗаПериод = РезультатНачисления.Итог("Сумма") / 1000;
	
	// Залишок боргу на кінець звітного періоду
	НовСтрокаМиргород.ДолгЗаЖЕКНаКонецПериод = НовСтрокаМиргород.ДолгЖЕКНаНачалоПериода - НовСтрокаМиргород.ОплаченоЖЕКЗаПериод + НовстрокаМиргород.НачисленоЖЕКЗаПериод;
		
	// Заполним табличный документ
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Период = Отчет.Период;
	Результат.Вывести(ОбластьШапка);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Результат.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрока.Параметры.ПорядковыйНомер = 1;
	ОбластьСтрока.Параметры.Организация                       = Справочники.Организации.НайтиПоКоду("000000001");
	ОбластьСтрока.Параметры.НаселенныйПункт                   = "Миргород";
	ОбластьСтрока.Параметры.ОКПП                              = "45136285";
	ОбластьСтрока.Параметры.КвоАбонентовЖЕК                   = тзМиргород[0].КвоАбонентовЖЕК;
	ОбластьСтрока.Параметры.КвоАбонентовСДолгомБольше3Месяцев = тзМиргород[0].КвоАбонентовДолгБольше3Месяцев;
	ОбластьСтрока.Параметры.ДолгНаНачалоПериода               = тзМиргород[0].ДолгЖЕКНаНачалоПериода;
	ОбластьСтрока.Параметры.НачисленоЖЕКЗаПериод              = тзМиргород[0].НачисленоЖЕКЗаПериод;
	ОбластьСтрока.Параметры.ОплаченоЖЕКЗаПериод               = тзМиргород[0].ОплаченоЖЕКЗаПериод;
	ОбластьСтрока.Параметры.ДолгЗаЖЕКНаКонецПериод            = тзМиргород[0].ДолгЗаЖЕКНаКонецПериод;
	Результат.Вывести(ОбластьСтрока);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	Результат.Вывести(ОбластьПодвал);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтчет(Команда)
	ЗаполнитьОтчетНаСервере();
КонецПроцедуры

