
&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры // ПриСозданииНаСервере()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события "ОбработкаВыбора" формы.
//
Процедура ОбработкаВыбора(РезультатВыбора, ИсточникВыбора)
	
	Элементы.Список.Обновить();
	
КонецПроцедуры // ОбработкаВыбора()

&НаКлиенте
// Процедура вызывается по кнопке "Добавить из классификатора".
// 
Процедура ДобавитьИзКлассификатора(Команда)
	
	ОткрытьФорму("Справочник.Банки.Форма.ФормаВыбораБанков", ,ЭтаФорма);
	
КонецПроцедуры // ДобавитьИзКлассификатора()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьСписокБанков" Тогда
		ОбновитьОтображениеДанных();
	КонецЕсли;	
КонецПроцедуры
