////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
		
	ОтветственныйВладелецПред = ПолучитьОтветственногоВладельца(Объект.ЛицевойСчет);
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	Оповестить("ИзмененЛицевойСчет", Объект.ЛицевойСчет , ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция возвращает ответственного владельца лицевого счета.
//
&НаСервереБезКонтекста
Функция ПолучитьОтветственногоВладельца(ЛицевойСчет)
	
	Если НЕ ЗначениеЗаполнено(ЛицевойСчет) Тогда
		Возврат Справочники.ПотребителиУслуг.ПустаяСсылка();
	КонецЕсли;
	
	ТаблицаОтветственныйВладелец = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(), Новый Структура("ЛицевойСчет", ЛицевойСчет));
	
	Если ТаблицаОтветственныйВладелец.Количество() > 0 Тогда
		Возврат ТаблицаОтветственныйВладелец[0].ОтветственныйВладелец;
	Иначе
		Возврат Справочники.ПотребителиУслуг.ПустаяСсылка();
	КонецЕсли;
		
КонецФункции

// Процедура - обработчик команды "документыФизЛиц".
//
&НаКлиенте
Процедура КомандаДокументыФизЛиц(Команда)
	
	Если Элементы.Жильцы.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФизЛицо = Элементы.Жильцы.ТекущиеДанные.Жилец;
	Если НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("ФизЛицо", ФизЛицо);
	ПараметрыФизЛицо = Новый Структура("Отбор",СтруктураОтбора);
	ОткрытьФорму("РегистрСведений.ДокументыФизическихЛиц.Форма.ДокументыФизическогоЛица", ПараметрыФизЛицо);
	
КонецПроцедуры

// Функция возвращает ответственного владельца лицевого счета.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеЛицевойСчетПриИзменении(ЛицевойСчет)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить("Организация", ЛицевойСчет.Владелец.Организация);
	СтруктураДанные.Вставить("Здание", ЛицевойСчет.Владелец);

	
	Если НЕ ЗначениеЗаполнено(ЛицевойСчет) Тогда
		
		СтруктураДанные.Вставить("ОтветственныйВладелец", Справочники.ПотребителиУслуг.ПустаяСсылка());
		
		Возврат СтруктураДанные;
		
	КонецЕсли;
	
	ТаблицаОтветственныйВладелец = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(), Новый Структура("ЛицевойСчет", ЛицевойСчет));
	
	Если ТаблицаОтветственныйВладелец.Количество() > 0 Тогда
		СтруктураДанные.Вставить("ОтветственныйВладелец", ТаблицаОтветственныйВладелец[0].ОтветственныйВладелец);
	Иначе
		СтруктураДанные.Вставить("ОтветственныйВладелец", Справочники.ПотребителиУслуг.ПустаяСсылка());
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеЛицевойСчетПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	СтруктураДанные = ПолучитьДанныеЛицевойСчетПриИзменении(Объект.ЛицевойСчет);
	
	Объект.Организация = СтруктураДанные.Организация;
	Объект.Здание = СтруктураДанные.Здание;
	ОтветственныйВладелецПред = СтруктураДанные.ОтветственныйВладелец;
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыВыбораЗначения.Вставить("ОтборЗдание",			Объект.Здание);

	ОткрытьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖильцыСобственникПриИзменении(Элемент)
	
	Строка = Элементы.Жильцы.ТекущиеДанные;
	Если Строка.Собственник = Ложь Тогда
		
		Строка.ДоляСобственности ="";

	КонецЕсли;	

	
КонецПроцедуры

&НаКлиенте
Процедура ЖильцыПрописанПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Жильцы.ТекущиеДанные;
	Если ТекущиеДанные.Прописан = Ложь Тогда
		ТекущиеДанные.ДатаНачалаДействия = '00010101';
		ТекущиеДанные.ДатаОкончанияДействияПрописки = '00010101'; 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЖильцыПроживаетПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Жильцы.ТекущиеДанные;
	Если ТекущиеДанные.Проживает = Ложь Тогда
		ТекущиеДанные.ДатаНачалаПроживания = '00010101';
		ТекущиеДанные.ДатаОкончанияПериодаПроживания = '00010101';
	КонецЕсли;
	
КонецПроцедуры




