
&НаКлиенте
Процедура ОбновитьДанныеСправочника(Команда)
	
	ЕстьИзменения = Ложь;
	ЕстьУдаленные = Ложь;
	
	ОбновитьДанныеСправочникаНаСервере(ЕстьИзменения, ЕстьУдаленные);
	
	Если ЕстьИзменения Тогда
		Текст = НСтр("ru='Обновление выполнено успешно.';uk='Відновлення виконане успішно.'");
	Иначе
		Текст = НСтр("ru='Обновление не требуется.';uk='Відновлення не потрібно.'");
	КонецЕсли;
	
	Если ЕстьУдаленные Тогда
		Текст = Текст
			+ Символы.ПС
			+ Символы.ПС
			+ НСтр("ru='Найдены удаленные объекты метаданных"
"(см. элементы, начинающиеся с символа ""?"").';uk='Знайдені вилучені об''єкти метаданих (див. елементи, що починаються із символу ""?"").'");
	КонецЕсли;
	
	Предупреждение(Текст);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеСправочникаНаСервере(ЕстьИзменения, ЕстьУдаленные)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Справочники.ИдентификаторыОбъектовМетаданных.ОбновитьДанныеСправочника(ЕстьИзменения, ЕстьУдаленные);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

