&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаголовокИзменен = Ложь;
	ПолнотекстовыйПоискИзменен = Ложь;
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Элементы.ПараметрыАдминистрированияИБ.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ГраничнаяДатаСтимулирующегоТарифа.Видимость = НаборКонстант.ИспользоватьСтимулирующийТариф;
	
	Элементы.ВариантыСайтаЖКХ.Видимость = НаборКонстант.ИспользоватьВыгрузкуНаСайт;
	Элементы.Декорация7.Видимость = НЕ НаборКонстант.ИспользоватьВыгрузкуНаСайт;
	
	Если НаборКонстант.ВариантСайтаХВОЯ Тогда
		ВариантыСайтаЖКХ = Перечисления.ВариантыСайтаЖКХ.СайтЖКХХВОЯ;
	ИначеЕсли НаборКонстант.ВариантСайтаБитрикс Тогда
		ВариантыСайтаЖКХ = Перечисления.ВариантыСайтаЖКХ.СайтНаПлатформеБитрикс;
	Иначе
		ВариантыСайтаЖКХ = Перечисления.ВариантыСайтаЖКХ.ПустаяСсылка();
	КонецЕсли;

	Элементы.ИспользоватьПодомовойУчетЗатрат.Видимость = НаборКонстант.ИспользоватьОбменДанными;	
	
	ПолучитьПорядокОплат();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьИнтерфейс();
	
	Если ЗаголовокИзменен Тогда
		СтандартныеПодсистемыКлиент.УстановитьРасширенныйЗаголовокПриложения();
		ЗаголовокИзменен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПолнотекстовыйПоискИзменен Тогда
		ПолнотекстовыйПоискИзменен = Ложь;
		Разрешен = Константы.ИспользоватьПолнотекстовыйПоиск.Получить();
		
		Если Разрешен Тогда
			ПолнотекстовыйПоиск.УстановитьРежимПолнотекстовогоПоиска(РежимПолнотекстовогоПоиска.Разрешить);
		Иначе
			ПолнотекстовыйПоиск.УстановитьРежимПолнотекстовогоПоиска(РежимПолнотекстовогоПоиска.Запретить);
		КонецЕсли;
			
	КонецЕсли;	
	
	Дерево = РеквизитФормыВЗначение("ПорядокОплат"); 
	
	НомерСортировкиВидУслуги = 0;
	Для каждого СтрокаУровень1 Из Дерево.Строки Цикл
		
		НомерСортировкиВидУслуги = НомерСортировкиВидУслуги +1;
		Если ЗначениеЗаполнено(СтрокаУровень1.Услуга) Тогда
		
			ОбъектВидУслуги = СтрокаУровень1.Услуга.ПолучитьОбъект();
			ОбъектВидУслуги.ПолеСортировки = НомерСортировкиВидУслуги;
			Попытка
				ОбъектВидУслуги.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли; 		
		
		НомерСортировкиУслуги = 0;
		Для каждого СтрокаУровень2 Из СтрокаУровень1.Строки Цикл
			
			НомерСортировкиУслуги = НомерСортировкиУслуги +1;
			ОбъектУслуга = СтрокаУровень2.Услуга.ПолучитьОбъект();
			ОбъектУслуга.ПолеСортировки = НомерСортировкиУслуги;
			Попытка
				ОбъектУслуга.Записать();
			Исключение
			КонецПопытки;

		КонецЦикла;
	КонецЦикла;
	
	Пользователи.УстановитьДоступностьКИБДляПользователяМП();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокСистемыПриИзменении(Элемент)
	
	ЗаголовокИзменен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыАдминистрированияИБ(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ПараметрыАдминистрированияСервернойИБ");
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПорядокОплат()
	
    Дерево = РеквизитФормыВЗначение("ПорядокОплат");
	Дерево.Строки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Услуги.Ссылка КАК Услуга,
		|	ВидыУслуг.Ссылка КАК ВидУслуги
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыУслуг КАК ВидыУслуг
		|		ПО Услуги.ВидУслуги = ВидыУслуг.Ссылка
		|ГДЕ
		|	НЕ Услуги.ЭтоГруппа
		|
		|СГРУППИРОВАТЬ ПО
		|	Услуги.Ссылка,
		|	ВидыУслуг.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыУслуг.ПолеСортировки,
		|	Услуги.ПолеСортировки
		|ИТОГИ ПО
		|	ВидУслуги,
		|	Услуга";
	
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		СтрокаУровень1 = Дерево.Строки.Добавить();
		СтрокаУровень1.Услуга = Выборка.ВидУслуги;
		
		ВыборкаУслуга = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаУслуга.Следующий() Цикл
			
			СтрокаУровень2= СтрокаУровень1.Строки.Добавить();
			СтрокаУровень2.Услуга = ВыборкаУслуга.Услуга;
			
		КонецЦикла;
	КонецЦикла;
	
	ЭтаФорма.ЗначениеВРеквизитФормы(Дерево, "ПорядокОплат");
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСтимулирующийТарифПриИзменении(Элемент)
	
	Элементы.ГраничнаяДатаСтимулирующегоТарифа.Видимость = НаборКонстант.ИспользоватьСтимулирующийТариф;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаЗакон(Команда)
	ЗапуститьПриложение("http://zakon2.rada.gov.ua/laws/show/2297-17");
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВариантКоттеджныйПоселокПриИзменении(Элемент)
	
	НаборКонстант.ИспользоватьВариантГород = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВариантГородПриИзменении(Элемент)
	
	 НаборКонстант.ИспользоватьВариантКоттеджныйПоселок = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМобильноеПриложениеПриИзменении(Элемент)
	
	 Элементы.ВерсияМобильногоПриложения.Доступность = НаборКонстант.ИспользоватьМобильноеПриложение;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВыгрузкуНаСайтПриИзменении(Элемент)
	Элементы.ВариантыСайтаЖКХ.Видимость = НаборКонстант.ИспользоватьВыгрузкуНаСайт;
	Элементы.Декорация7.Видимость = НЕ НаборКонстант.ИспользоватьВыгрузкуНаСайт;
КонецПроцедуры

&НаКлиенте
Процедура ВариантыСайтаЖКХПриИзменении(Элемент)
	
	ВариантыСайтаЖКХПриИзмененииНаСерврере();
		
КонецПроцедуры

&НаСервере
Процедура ВариантыСайтаЖКХПриИзмененииНаСерврере()

	Если ВариантыСайтаЖКХ = Перечисления.ВариантыСайтаЖКХ.СайтЖКХХВОЯ Тогда
		НаборКонстант.ВариантСайтаХВОЯ = Истина;
		НаборКонстант.ВариантСайтаБитрикс = Ложь;
	ИначеЕсли ВариантыСайтаЖКХ = Перечисления.ВариантыСайтаЖКХ.СайтНаПлатформеБитрикс Тогда
		НаборКонстант.ВариантСайтаХВОЯ = Ложь;
		НаборКонстант.ВариантСайтаБитрикс = Истина;
	КонецЕсли;

КонецПроцедуры // ()


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ НаборКонстант.ИспользоватьВыгрузкуНаСайт Тогда
		НаборКонстант.ВариантСайтаХВОЯ = Ложь;
		НаборКонстант.ВариантСайтаБитрикс = Ложь;
	КонецЕсли;	
	
	Если НЕ НаборКонстант.ИспользоватьОбменДанными Тогда
		НаборКонстант.ИспользоватьПодомовойУчетЗатрат = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОбменДаннымиПриИзменении(Элемент)
	
	Элементы.ИспользоватьПодомовойУчетЗатрат.Видимость = НаборКонстант.ИспользоватьОбменДанными;	
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаВидеоУрок(Команда)
	
	НавигационнаяСсылка = "https://www.youtube.com/watch?v=GToc2arX-rc";
	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);

КонецПроцедуры


