
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// регістр РасчетПоказанийПриборовУчета Приход
	Движения.РасчетПоказанийПриборовУчета.Записывать = Истина;
	Для Каждого ТекСтрокаОсновная Из Основная Цикл
		Движение = Движения.РасчетПоказанийПриборовУчета.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = КонецДня(ПериодНачисления);
		Движение.ОбъектУстановки = ТекСтрокаОсновная.ЛицевойСчет;
		Движение.ПриборУчета = ОбщедомовойПриборУчета;
		Если Услуга = Справочники.Услуги.НайтиПоКоду("Р00000241") Тогда
		    Движение.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000256");
		ИначеЕсли Услуга = Справочники.Услуги.НайтиПоКоду("Р00000179") Тогда
		    Движение.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000255");
		ИначеЕсли Услуга = Справочники.Услуги.НайтиПоКоду("Р00000243") Тогда
		    Движение.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000257");
		ИначеЕсли Услуга = Справочники.Услуги.НайтиПоКоду("Р00000244") Тогда
		    Движение.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000258");
		КонецЕсли;
		
		Движение.ВидТарифа = ТекСтрокаОсновная.ВидТарифа;
		Движение.Энергоемкость = ТекСтрокаОсновная.Энергоемкость;
		Движение.Значение = ТекСтрокаОсновная.Показание;
	КонецЦикла;
КонецПроцедуры
