////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьНазваниеТипаАдресногоОбъекта();
	СформироватьНазваниеПризнакаАктуальности();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТипАдресногоЭлементаПриИзменении(Элемент)
	
	СформироватьНазваниеТипаАдресногоОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура ПризнакАктуальностиПриИзменении(Элемент)
	
	СформироватьНазваниеПризнакаАктуальности();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 

&НаКлиенте
Процедура СформироватьНазваниеТипаАдресногоОбъекта()
	
	Если Запись.ТипАдресногоЭлемента = 1 Тогда
		Элементы.НазваниеТипаАдресногоЭлемента.Заголовок = НСтр("ru='(регион)';uk='(регіон)'");	
	ИначеЕсли Запись.ТипАдресногоЭлемента = 2 Тогда
		Элементы.НазваниеТипаАдресногоЭлемента.Заголовок = НСтр("ru='(район)';uk='(район)'");	
	ИначеЕсли Запись.ТипАдресногоЭлемента = 3 Тогда
		Элементы.НазваниеТипаАдресногоЭлемента.Заголовок = НСтр("ru='(город)';uk='(місто)'");	
	ИначеЕсли Запись.ТипАдресногоЭлемента = 4 Тогда
		Элементы.НазваниеТипаАдресногоЭлемента.Заголовок = НСтр("ru='(нас.пункт)';uk='(нас.пункт)'");	
	ИначеЕсли Запись.ТипАдресногоЭлемента = 5 Тогда
		Элементы.НазваниеТипаАдресногоЭлемента.Заголовок = НСтр("ru='(улица)';uk='(вулиця)'");	
	ИначеЕсли Запись.ТипАдресногоЭлемента = 6 Тогда
		Элементы.НазваниеТипаАдресногоЭлемента.Заголовок = НСтр("ru='(дом)';uk='(будинок)'");	
	ИначеЕсли Запись.ТипАдресногоЭлемента = 7 Тогда
		Элементы.НазваниеТипаАдресногоЭлемента.Заголовок = НСтр("ru='(квартира)';uk='(квартира)'");
	Иначе
		Элементы.НазваниеТипаАдресногоЭлемента.Заголовок = НСтр("ru = ''");	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНазваниеПризнакаАктуальности()
	
	Если Запись.ПризнакАктуальности = 0 Тогда
		Элементы.НазваниеПризнакаАктуальности.Заголовок = НСтр("ru='(актуален)';uk='(актуальний)'");	
	ИначеЕсли Запись.ПризнакАктуальности >= 1 И Запись.ПризнакАктуальности <= 50 Тогда
		Элементы.НазваниеПризнакаАктуальности.Заголовок = НСтр("ru='(переименован)';uk='(перейменований)'");	
	ИначеЕсли Запись.ПризнакАктуальности = 51 Тогда
		Элементы.НазваниеПризнакаАктуальности.Заголовок = НСтр("ru='(переподчинен)';uk='(перепідлеглий)'");	
	ИначеЕсли Запись.ПризнакАктуальности = 99 Тогда
		Элементы.НазваниеПризнакаАктуальности.Заголовок = НСтр("ru='(не существует)';uk='(не існує)'");	
	Иначе
		Элементы.НазваниеПризнакаАктуальности.Заголовок = НСтр("ru = ''");	
	КонецЕсли;	
	
КонецПроцедуры