///////////////////////////////////////////////////////////////////////////////////
// Процедуры для подготовки и записи движений документа.

// Процедура инициализирует общие структуры, используемые при проведении документов.
// Вызывается из модуля документов при проведении.
//
Процедура ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, ДополнительныеСвойства, РежимПроведения = Неопределено) Экспорт

	// В структуре "ДополнительныеСвойства" создаются свойства с ключами "ТаблицыДляДвижений", "ДляПроведения".

	// "ТаблицыДляДвижений" - структура, которая будет содержать таблицы значений с данными для выполнения движений.
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", Новый Структура);

	// "ДляПроведения" - структура, содержащая свойства и реквизиты документа, необходимые для проведения.
	ДополнительныеСвойства.Вставить("ДляПроведения", Новый Структура);
	
	// Структура, содержащая ключ с именем "МенеджерВременныхТаблиц", в значении которого хранится менеджер временных таблиц.
	// Содержит для каждой временной таблицы ключ (имя временной таблицы) и значение (признак наличия записей во временной таблице).
	ДополнительныеСвойства.ДляПроведения.Вставить("СтруктураВременныеТаблицы", Новый Структура("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц));
	ДополнительныеСвойства.ДляПроведения.Вставить("РежимПроведения",           РежимПроведения);
	ДополнительныеСвойства.ДляПроведения.Вставить("МетаданныеДокумента",       ДокументСсылка.Метаданные());
	ДополнительныеСвойства.ДляПроведения.Вставить("Ссылка",                    ДокументСсылка);
	ДополнительныеСвойства.ДляПроведения.Вставить("МоментКонтроля",			   Дата('00010101'));

КонецПроцедуры

Процедура ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства) Экспорт

	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();

КонецПроцедуры

// Формирует массив имен регистров, по которым есть движения документа.
//
Функция ПолучитьМассивИменИспользуемыхРегистров(Регистратор, МетаданныеДокумента)
	
	МассивРегистров = Новый Массив;
	ТекстЗапроса = "";
	СчетчикТаблиц = 0;
	СчетчикЦикла = 0;
	ВсегоРегистров = МетаданныеДокумента.Движения.Количество();
	
	Для каждого Движение из МетаданныеДокумента.Движения Цикл
		
		Если СчетчикТаблиц > 0 Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|ОБЪЕДИНИТЬ ВСЕ
			|";
			
		КонецЕсли;
		
		СчетчикТаблиц = СчетчикТаблиц + 1;
		СчетчикЦикла = СчетчикЦикла + 1;
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|""" + Движение.Имя + """ КАК ИмяРегистра
		|
		|ИЗ " + Движение.ПолноеИмя() + "
		|
		|ГДЕ Регистратор = &Регистратор
		|";
		
		Если СчетчикТаблиц = 256 ИЛИ СчетчикЦикла = ВсегоРегистров Тогда
			
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Регистратор", Регистратор);
			
			ТекстЗапроса  = "";
			СчетчикТаблиц = 0;
			
			Если МассивРегистров.Количество() = 0 Тогда
				
				МассивРегистров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяРегистра");
				
			Иначе
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					МассивРегистров.Добавить(Выборка.ИмяРегистра);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивРегистров;
	
КонецФункции // ПолучитьМассивИменИспользуемыхРегистров()

// Выполняет подготовку наборов записей документа.
//
Процедура ПодготовитьНаборыЗаписейКРегистрацииДвижений(СтруктураОбъект) Экспорт
	
	Для каждого НаборЗаписей из СтруктураОбъект.Движения Цикл
		
		Если ТипЗнч(НаборЗаписей) = Тип("КлючИЗначение") Тогда
			
			НаборЗаписей = НаборЗаписей.Значение;
			
		КонецЕсли;
		
		Если НаборЗаписей.Количество() > 0 Тогда
			
			НаборЗаписей.Очистить();
			
		КонецЕсли;
		
	КонецЦикла;
	
	МассивИменРегистров = ПолучитьМассивИменИспользуемыхРегистров(СтруктураОбъект.Ссылка, СтруктураОбъект.ДополнительныеСвойства.ДляПроведения.МетаданныеДокумента);
	
	Для каждого ИмяРегистра из МассивИменРегистров Цикл
		
		СтруктураОбъект.Движения[ИмяРегистра].Записывать = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

// Записывает наборы записей документа.
//
Процедура ЗаписатьНаборыЗаписей(СтруктураОбъект) Экспорт
	
	Для каждого НаборЗаписей из СтруктураОбъект.Движения Цикл
		
		Если ТипЗнч(НаборЗаписей) = Тип("КлючИЗначение") Тогда
			
			НаборЗаписей = НаборЗаписей.Значение;
			
		КонецЕсли;
		
		Если НаборЗаписей.Записывать Тогда
			
			Если НЕ НаборЗаписей.ДополнительныеСвойства.Свойство("ДляПроведения") Тогда
				
				НаборЗаписей.ДополнительныеСвойства.Вставить("ДляПроведения", Новый Структура);
				
			КонецЕсли;
			
			Если НЕ НаборЗаписей.ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
				
				НаборЗаписей.ДополнительныеСвойства.ДляПроведения.Вставить("СтруктураВременныеТаблицы", СтруктураОбъект.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы);
				
			КонецЕсли;
//{{MRG[ <-> ]
			//Попытка
			
			НаборЗаписей.Записать();
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//			НаборЗаписей.Записать();
//}}MRG[ <-> ]
			//Исключение
			//	Сообщить("Не вдалося записати ");
			//КонецПопытки;
			НаборЗаписей.Записывать = Ложь;
			
		Иначе
				
			Если Метаданные.РегистрыНакопления.Содержит(НаборЗаписей.Метаданные()) Тогда
				
				Попытка
					
					РегистрыНакопления[НаборЗаписей.Метаданные().Имя].СоздатьПустуюВременнуюТаблицуИзменение(СтруктураОбъект.ДополнительныеСвойства);
				Исключение
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////// 
// Процедуры формирования движений регистров

// Функция возвращает значение константы КонтролироватьОстаткиПриПроведении.
// 
Функция ВыполнитьКонтрольОстатков() Экспорт
	
	Возврат Константы.КонтролироватьОстаткиПриПроведении.Получить();
	
КонецФункции // ВыполнитьКонтрольОстатков()

// Выполняет движения регистра сведений НазначенныеУслуги.
//
Процедура ОтразитьНазначенныеУслуги(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаНазначенныеУслуги = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНазначенныеУслуги;
	
	Если Отказ
	 ИЛИ ТаблицаНазначенныеУслуги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияНазначенныеУслуги = Движения.НазначенныеУслуги;
	ДвиженияНазначенныеУслуги.Записывать = Истина;
	ДвиженияНазначенныеУслуги.Загрузить(ТаблицаНазначенныеУслуги);
	
КонецПроцедуры


// Выполняет движения регистра сведений ДействиеПени.
//
Процедура ОтразитьДействиеПени(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДействиеПени = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДействиеПени;
	
	Если Отказ
	 ИЛИ ТаблицаДействиеПени.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияНазначенныеУслуги = Движения.ДействиеПени;
	ДвиженияНазначенныеУслуги.Записывать = Истина;
	ДвиженияНазначенныеУслуги.Загрузить(ТаблицаДействиеПени);
	
КонецПроцедуры

// Выполняет движения регистра сведений НазначенныеУслуги.
//
Процедура ОтразитьНазначенныеУслугиПодробно(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаНазначенныеУслугиПодробно = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНазначенныеУслугиПодробно;
	
	Если Отказ
	 ИЛИ ТаблицаНазначенныеУслугиПодробно.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияНазначенныеУслугиПодробно = Движения.НазначенныеУслугиПодробно;
	ДвиженияНазначенныеУслугиПодробно.Записывать = Истина;
	ДвиженияНазначенныеУслугиПодробно.Загрузить(ТаблицаНазначенныеУслугиПодробно);
	
КонецПроцедуры

// Выполняет движения регистра сведений УстановленныеПриборыУчета.
//
Процедура ОтразитьУстановленныеПриборыУчета(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаУстановленныеПриборыУчета = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУстановленныеПриборыУчета;
	
	Если Отказ
	 ИЛИ ТаблицаУстановленныеПриборыУчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияУстановленныеПриборыУчета = Движения.УстановленныеПриборыУчета;
	ДвиженияУстановленныеПриборыУчета.Записывать = Истина;
	ДвиженияУстановленныеПриборыУчета.Загрузить(ТаблицаУстановленныеПриборыУчета);
	
КонецПроцедуры

// Выполняет движения регистра сведений УстановленныеПриборыУчета.
//
Процедура ОтразитьПоверкиПриборовУчета(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПоверкиПриборовУчета = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПоверкиПриборовУчета;
	
	Если Отказ
	 ИЛИ ТаблицаПоверкиПриборовУчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПоверкиПриборовУчета = Движения.ПоверкиПриборовУчета;
	ДвиженияПоверкиПриборовУчета.Записывать = Истина;
	ДвиженияПоверкиПриборовУчета.Загрузить(ТаблицаПоверкиПриборовУчета);
	
КонецПроцедуры

// Выполняет движения регистра сведений НазначенныеЛьготы.
//
Процедура ОтразитьНазначенныеЛьготы(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаНазначенныеЛьготы = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНазначенныеЛьготы;
	
	Если Отказ
	 ИЛИ ТаблицаНазначенныеЛьготы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияНазначенныеЛьготы = Движения.НазначенныеЛьготы;
	ДвиженияНазначенныеЛьготы.Записывать = Истина;
	ДвиженияНазначенныеЛьготы.Загрузить(ТаблицаНазначенныеЛьготы);
	
КонецПроцедуры

// Выполняет движения регистра сведений НазначенныеСубсидии.
//
Процедура ОтразитьНазначенныеСубсидии(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаНазначенныеСубсидии = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНазначенныеСубсидии;
	
	Если Отказ
	 ИЛИ ТаблицаНазначенныеСубсидии.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияНазначенныеСубсидии = Движения.НазначенныеСубсидии;
	ДвиженияНазначенныеСубсидии.Записывать = Истина;
	ДвиженияНазначенныеСубсидии.Загрузить(ТаблицаНазначенныеСубсидии);
	
КонецПроцедуры

// Выполняет движения регистра сведений НазначенныеРегиональныеСубсидии.
//
Процедура ОтразитьНазначенныеРегиональныеСубсидии(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаНазначенныеРегиональныеСубсидии = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНазначенныеРегиональныеСубсидии;
	
	Если Отказ
	 ИЛИ ТаблицаНазначенныеРегиональныеСубсидии.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияНазначенныеСубсидии = Движения.НазначенныеРегиональныеСубсидии;
	ДвиженияНазначенныеСубсидии.Записывать = Истина;
	ДвиженияНазначенныеСубсидии.Загрузить(ТаблицаНазначенныеРегиональныеСубсидии);
	
КонецПроцедуры


// Выполняет движения регистра сведений Тарифы.
//
Процедура ОтразитьТарифы(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаТарифы = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТарифы;
	
	Если Отказ
	 ИЛИ ТаблицаТарифы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияТарифы = Движения.Тарифы;
	ДвиженияТарифы.Записывать = Истина;
	ДвиженияТарифы.Загрузить(ТаблицаТарифы);
	
КонецПроцедуры

// Выполняет движения регистра сведений ТарифыУслугПодробно.
//
Процедура ОтразитьТарифыУслугПодробно(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаТарифыУслугПодробно = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТарифыУслугПодробно;
	
	Если Отказ
	 ИЛИ ТаблицаТарифыУслугПодробно.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияТарифыУслугПодробно = Движения.ТарифыУслугПодробно;
	ДвиженияТарифыУслугПодробно.Записывать = Истина;
	ДвиженияТарифыУслугПодробно.Загрузить(ТаблицаТарифыУслугПодробно);
	
КонецПроцедуры

// Выполняет движения регистра сведений ТарифыПороговые.
//
Процедура ОтразитьТарифыПороговые(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаТарифыПороговые = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТарифыПороговые;
	
	Если Отказ
	 ИЛИ ТаблицаТарифыПороговые.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияТарифыПороговые = Движения.ТарифыПороговые;
	ДвиженияТарифыПороговые.Записывать = Истина;
	ДвиженияТарифыПороговые.Загрузить(ТаблицаТарифыПороговые);
	
КонецПроцедуры

// Выполняет движения регистра сведений СведенияОПрописанныхПотребителяхУслуг.
//
Процедура ОтразитьСведенияОПрописанныхЖильцах(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаСведенияОПрописанныхЖильцах = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСведенияОПрописанныхЖильцах;
	
	Если Отказ
	 ИЛИ ТаблицаСведенияОПрописанныхЖильцах.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСведенияОПрописанныхПотребителяхУслуг = Движения.СведенияОПрописанныхЖильцах;
	ДвиженияСведенияОПрописанныхПотребителяхУслуг.Записывать = Истина;
	ДвиженияСведенияОПрописанныхПотребителяхУслуг.Загрузить(ТаблицаСведенияОПрописанныхЖильцах);
	
КонецПроцедуры

// Выполняет движения регистра сведений СведенияОПроживающихПотребителяхУслуг.
//
Процедура ОтразитьСведенияОПроживающихЖильцах(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаСведенияОПроживающихЖильцах = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСведенияОПроживающихЖильцах;
	
	Если Отказ
	 ИЛИ ТаблицаСведенияОПроживающихЖильцах.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСведенияОПроживающихПотребителяхУслуг = Движения.СведенияОПроживающихЖильцах;
	ДвиженияСведенияОПроживающихПотребителяхУслуг.Записывать = Истина;
	ДвиженияСведенияОПроживающихПотребителяхУслуг.Загрузить(ТаблицаСведенияОПроживающихЖильцах);
	
КонецПроцедуры

// Выполняет движения регистра сведений ЛицевыеСчета.
//
Процедура ОтразитьЛицевыеСчета(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаЛицевыеСчета = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЛицевыеСчета;
	
	Если Отказ
	 ИЛИ ТаблицаЛицевыеСчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЛицевыеСчета = Движения.ЛицевыеСчета;
	ДвиженияЛицевыеСчета.Записывать = Истина;
	ДвиженияЛицевыеСчета.Загрузить(ТаблицаЛицевыеСчета);
	
КонецПроцедуры

// Выполняет движения регистра сведений МашиноМеста.
//
Процедура ОтразитьМашиноМеста(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаМашиноМеста = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаМашиноМеста;
	
	Если Отказ
	 ИЛИ ТаблицаМашиноМеста.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияМашиноМеста = Движения.МашиноМеста;
	ДвиженияМашиноМеста.Записывать = Истина;
	ДвиженияМашиноМеста.Загрузить(ТаблицаМашиноМеста);
	
КонецПроцедуры

// Выполняет движения регистра сведений ЦеныНоменклатуры.
//
Процедура ОтразитьЦеныНоменклатуры(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаЦеныНоменклатуры = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЦеныНоменклатуры;
	
	Если Отказ
	 ИЛИ ТаблицаЦеныНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЦеныНоменклатуры = Движения.ЦеныНоменклатуры;
	ДвиженияЦеныНоменклатуры.Записывать = Истина;
	ДвиженияЦеныНоменклатуры.Загрузить(ТаблицаЦеныНоменклатуры);
	
КонецПроцедуры

// Выполняет движения регистра сведений ОтветственныйВладелецЛицевогоСчета.
//
Процедура ОтразитьОтветственныйВладелецЛицевогоСчета(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаОтветственныйВладелецЛицевогоСчета = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОтветственныйВладелецЛицевогоСчета;
	
	Если Отказ
	 ИЛИ ТаблицаОтветственныйВладелецЛицевогоСчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияОтветственныйВладелецЛицевогоСчета = Движения.ОтветственныйВладелецЛицевогоСчета;
	ДвиженияОтветственныйВладелецЛицевогоСчета.Записывать = Истина;
	ДвиженияОтветственныйВладелецЛицевогоСчета.Загрузить(ТаблицаОтветственныйВладелецЛицевогоСчета);
	
КонецПроцедуры

// Выполняет движения регистра сведений СтепеньРодстваФизическихЛиц.
//
Процедура ОтразитьСтепеньРодстваФизическихЛиц(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаСтепеньРодстваФизическихЛиц = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСтепеньРодстваФизическихЛиц;
	
	Если Отказ
	 ИЛИ ТаблицаСтепеньРодстваФизическихЛиц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСтепеньРодстваФизическихЛиц = Движения.СтепеньРодстваФизическихЛиц;
	ДвиженияСтепеньРодстваФизическихЛиц.Записывать = Истина;
	ДвиженияСтепеньРодстваФизическихЛиц.Загрузить(ТаблицаСтепеньРодстваФизическихЛиц);
	
КонецПроцедуры

// Выполняет движения регистра сведений СобственникиОбъектовЛицевыхСчетов
//
Процедура ОтразитьСобственниковОбъектовЛицевыхСчетов(ДополнительныеСвойства, Движения, Отказ) Экспорт 

	 ТаблицаСведенияОСобственниках = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСведенияОСобственниках;
	
	Если Отказ
	 ИЛИ ТаблицаСведенияОСобственниках.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСобственникиОбъектовЛС = Движения.СобственникиОбектовЛицевыхСчетов;
	ДвиженияСобственникиОбъектовЛС.Записывать = Истина;
	ДвиженияСобственникиОбъектовЛС.Загрузить(ТаблицаСведенияОСобственниках);


КонецПроцедуры


// Выполняет движения регистра сведений ПоказанияПриборовУчета.
//
Процедура ОтразитьПоказанияПриборовУчета(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПоказанияПриборовУчета = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПоказанияПриборовУчета;
	
	Если Отказ
	 ИЛИ ТаблицаПоказанияПриборовУчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПоказанияПриборовУчета = Движения.ПоказанияПриборовУчета;
	ДвиженияПоказанияПриборовУчета.Записывать = Истина;
	ДвиженияПоказанияПриборовУчета.Загрузить(ТаблицаПоказанияПриборовУчета);
	
КонецПроцедуры

// Виконує рухи регістру відомостей Акт зняття з/б лічильника холодної води.
//
Процедура ОтразитьАктСнятияПоказанийХолоднойВоды(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПоказанияПриборовУчета = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПоказанияПриборовУчета;
	
	Если Отказ
	 ИЛИ ТаблицаПоказанияПриборовУчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПоказанияПриборовУчета = Движения.АктСнятияПоказанийХолоднойВоды;
	ДвиженияПоказанияПриборовУчета.Записывать = Истина;
	ДвиженияПоказанияПриборовУчета.Загрузить(ТаблицаПоказанияПриборовУчета);
	
КонецПроцедуры

// Виконує рухи регістру відомостей Акт зняття з/б лічильника гарячої води.
//
Процедура ОтразитьАктСнятияПоказанийГорячейВоды(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПоказанияПриборовУчета = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПоказанияПриборовУчета;
	
	Если Отказ
	 ИЛИ ТаблицаПоказанияПриборовУчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПоказанияПриборовУчета = Движения.АктСнятияПоказанийГорячейВоды;
	ДвиженияПоказанияПриборовУчета.Записывать = Истина;
	ДвиженияПоказанияПриборовУчета.Загрузить(ТаблицаПоказанияПриборовУчета);
	
КонецПроцедуры

// Виконує рухи регістру відомостей Акт зняття з/б лічильника теплової енергії.
//
Процедура ОтразитьАктСнятияПоказанийТЕ(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПоказанияПриборовУчета = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПоказанияПриборовУчета;
	
	Если Отказ
	 ИЛИ ТаблицаПоказанияПриборовУчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПоказанияПриборовУчета = Движения.АктСнятияПоказанийТеплосчетчика;
	ДвиженияПоказанияПриборовУчета.Записывать = Истина;
	ДвиженияПоказанияПриборовУчета.Загрузить(ТаблицаПоказанияПриборовУчета);
	
КонецПроцедуры

// Выполняет движения регистра сведений ПломбыПриборовУчета.
//
Процедура ОтразитьПломбыПриборовУчета(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПломбыПриборовУчета = ДополнительныеСвойства.ТаблицыДляДвижений.ПломбыПриборовУчета;
	
	Если Отказ
	 ИЛИ ТаблицаПломбыПриборовУчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПломбыПриборовУчета = Движения.ПломбыПриборовУчета;
	ДвиженияПломбыПриборовУчета.Записывать = Истина;
	ДвиженияПломбыПриборовУчета.Загрузить(ТаблицаПломбыПриборовУчета);
	
КонецПроцедуры


// Выполняет движения регистра накопления РасчетыПоЛицевымСчетам.
//
Процедура ОтразитьРасчетыПоЛицевымСчетам(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасчетыПоЛицевымСчетам = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыПоЛицевымСчетам;
	
	Если Отказ
	 ИЛИ ТаблицаРасчетыПоЛицевымСчетам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРасчетыПоЛицевымСчетам = Движения.РасчетыПоЛицевымСчетам;
	ДвиженияРасчетыПоЛицевымСчетам.Записывать = Истина;
	ДвиженияРасчетыПоЛицевымСчетам.Загрузить(ТаблицаРасчетыПоЛицевымСчетам);
	
КонецПроцедуры


// Выполняет движения регистра накопления РасчетыПоЛицевымСчетам при разрыве договора реструктуризации.
//
Процедура ОтразитьРасчетыПоЛицевымСчетамПриРазрывеДоговора(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасчетыПоЛицевымСчетам = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыПоЛицевымСчетамПриРазрывеДоговора;
	
	Если Отказ
	 ИЛИ ТаблицаРасчетыПоЛицевымСчетам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРасчетыПоЛицевымСчетам = Движения.РасчетыПоЛицевымСчетам;
	ДвиженияРасчетыПоЛицевымСчетам.Записывать = Истина;
	ДвиженияРасчетыПоЛицевымСчетам.Загрузить(ТаблицаРасчетыПоЛицевымСчетам);
	
КонецПроцедуры

// Выполняет движения регистра накопления РасшифровкаНачисленияЛьгот.
//
Процедура ОтразитьРасшифровкаНачисленияЛьгот(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасшифровкаНачисленияЛьгот = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасшифровкаНачисленияЛьгот;
	
	Если Отказ
	 ИЛИ ТаблицаРасшифровкаНачисленияЛьгот.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРасшифровкаНачисленияЛьгот = Движения.РасшифровкаНачисленияЛьгот;
	ДвиженияРасшифровкаНачисленияЛьгот.Записывать = Истина;
	ДвиженияРасшифровкаНачисленияЛьгот.Загрузить(ТаблицаРасшифровкаНачисленияЛьгот);
	
КонецПроцедуры

// Выполняет движения регистра накопления РасчетыПоСубсидиям.
//
Процедура ОтразитьГарантированныеНачисленияСубсидий(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаГарантированныеСубсидии = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаГарантированныеСубсидии; 
	
	Если Отказ
	 ИЛИ ТаблицаГарантированныеСубсидии.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияГарантированныеСубсидии = Движения.РасчетыПоСубсидиям;
	ДвиженияГарантированныеСубсидии.Записывать = Истина;
	ДвиженияГарантированныеСубсидии.Загрузить(ТаблицаГарантированныеСубсидии);
	
КонецПроцедуры

// Выполняет движения регистра накопления РасчетыПоРегиональнымСубсидиям.
//
Процедура ОтразитьРегиональныеНачисленияСубсидий(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРегиональныеСубсидии = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРегиональныеСубсидии; 
	
	Если Отказ
	 ИЛИ ТаблицаРегиональныеСубсидии.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРегиональныеСубсидии = Движения.РасчетыПоРегиональнымСубсидиям;
	ДвиженияРегиональныеСубсидии.Записывать = Истина;
	ДвиженияРегиональныеСубсидии.Загрузить(ТаблицаРегиональныеСубсидии);
	
КонецПроцедуры


// Выполняет движения регистра накопления ЗапасыНаСкладах.
//
Процедура ОтразитьЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаЗапасыНаСкладах = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладах;
	
	Если Отказ
	 ИЛИ ТаблицаЗапасыНаСкладах.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗапасыНаСкладах = Движения.ЗапасыНаСкладах;
	ДвиженияЗапасыНаСкладах.Записывать = Истина;
	ДвиженияЗапасыНаСкладах.Загрузить(ТаблицаЗапасыНаСкладах);
	
КонецПроцедуры

// Выполняет движения регистра накопления ВзаиморасчетыСКонтрагентами.
//
Процедура ОтразитьВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаВзаиморасчетыСКонтрагентами = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВзаиморасчетыСКонтрагентами;
	
	Если Отказ
	 ИЛИ ТаблицаВзаиморасчетыСКонтрагентами.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВзаиморасчетыСКонтрагентами = Движения.ВзаиморасчетыСПоставщиками;
	ДвиженияВзаиморасчетыСКонтрагентами.Записывать = Истина;
	ДвиженияВзаиморасчетыСКонтрагентами.Загрузить(ТаблицаВзаиморасчетыСКонтрагентами);
	
КонецПроцедуры

// Выполняет движения регистра накопления ВзаиморасчетыПоСубсидиям.
//
Процедура ОтразитьВзаиморасчетыПоСубсидиям(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаВзаиморасчетыПоСубсидиям = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВзаиморасчетыПоСубсидиям;
	
	Если Отказ
	 ИЛИ ТаблицаВзаиморасчетыПоСубсидиям.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВзаиморасчетыПоСубсидиям = Движения.ВзаиморасчетыПоСубсидиям;
	ДвиженияВзаиморасчетыПоСубсидиям.Записывать = Истина;
	ДвиженияВзаиморасчетыПоСубсидиям.Загрузить(ТаблицаВзаиморасчетыПоСубсидиям);
	
КонецПроцедуры

// Выполняет движения регистра накопления ВзаиморасчетыПоРегиональнымСубсидиям.
//
Процедура ОтразитьВзаиморасчетыПоРегиональнымСубсидиям(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаВзаиморасчетыПоРегиональнымСубсидиям = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВзаиморасчетыПоРегиональнымСубсидиям;
	
	Если Отказ
	 ИЛИ ТаблицаВзаиморасчетыПоРегиональнымСубсидиям.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВзаиморасчетыПоРегиональнымСубсидиям = Движения.ВзаиморасчетыПоРегиональнымСубсидиям;
	ДвиженияВзаиморасчетыПоРегиональнымСубсидиям.Записывать = Истина;
	ДвиженияВзаиморасчетыПоРегиональнымСубсидиям.Загрузить(ТаблицаВзаиморасчетыПоРегиональнымСубсидиям);
	
КонецПроцедуры


// Выполняет движения регистра накопления ВзаиморасчетыСКонтрагентами.
//
Процедура ОтразитьВзаиморасчетыПоЛьготам(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаВзаиморасчетыПоЛьготам = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВзаиморасчетыПоЛьготам;
	
	Если Отказ
	 ИЛИ ТаблицаВзаиморасчетыПоЛьготам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВзаиморасчетыПоЛьготам = Движения.ВзаиморасчетыПоЛьготам;
	ДвиженияВзаиморасчетыПоЛьготам.Записывать = Истина;
	ДвиженияВзаиморасчетыПоЛьготам.Загрузить(ТаблицаВзаиморасчетыПоЛьготам);
	
КонецПроцедуры

// Выполняет движения регистра накопления ДенежныеСредства.
//
Процедура ОтразитьДенежныеСредства(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДенежныеСредства = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредства;
	
	Если Отказ
	 ИЛИ ТаблицаДенежныеСредства.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияДенежныеСредства = Движения.ДенежныеСредства;
	ДвиженияДенежныеСредства.Записывать = Истина;
	ДвиженияДенежныеСредства.Загрузить(ТаблицаДенежныеСредства);
	
КонецПроцедуры

// Выполняет движения регистра накопления РасчетПоказанийПриборовУчета.
//
Процедура ОтразитьРасчетПоказанийПриборовУчета(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасчетПоказанийПриборовУчета = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетПоказанийПриборовУчета;
	
	Если Отказ
	 ИЛИ ТаблицаРасчетПоказанийПриборовУчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРасчетПоказанийПриборовУчета = Движения.РасчетПоказанийПриборовУчета;
	ДвиженияРасчетПоказанийПриборовУчета.Записывать = Истина;
	ДвиженияРасчетПоказанийПриборовУчета.Загрузить(ТаблицаРасчетПоказанийПриборовУчета);
	
КонецПроцедуры

// Выполняет движения регистра накопления ЗаменыПриборовУчета.
//
Процедура ОтразитьЗаменыПриборовУчета(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаЗаменыПриборовУчета = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаменыПриборовУчета;
	
	Если Отказ
	 ИЛИ ТаблицаЗаменыПриборовУчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗаменыПриборовУчета = Движения.ЗаменыПриборовУчета;
	ДвиженияЗаменыПриборовУчета.Записывать = Истина;
	ДвиженияЗаменыПриборовУчета.Загрузить(ТаблицаЗаменыПриборовУчета);
	
КонецПроцедуры

// Выполняет движения регистра накопления СтатьиЗатрат.
//
Процедура ОтразитьСтатьиЗатрат(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаСтатьиЗатрат = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСтатьиЗатрат;
	
	Если Отказ
	 ИЛИ ТаблицаСтатьиЗатрат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСтатьиЗатрат = Движения.СтатьиЗатрат;
	ДвиженияСтатьиЗатрат.Записывать = Истина;
	ДвиженияСтатьиЗатрат.Загрузить(ТаблицаСтатьиЗатрат);
	
КонецПроцедуры

// Выполняет движения регистра сведений  
Процедура ОтразитьОперацииУведомления(ЛицевыеСчета,МесяцНачисления,Операция) Экспорт
	
	Индекс = 0;
	
	Если Операция = "Квитанция" тогда
		ОперацияЗапись = Перечисления.ВидыОперацийУведомления.Квитанция;
	ИначеЕсли Операция = "ЭлектронноеПисьмо" Тогда
		ОперацияЗапись = Перечисления.ВидыОперацийУведомления.ЭлекторрноеПисьмо; 
	ИначеЕсли Операция = "СообщениеСМС" Тогда
		ОперацияЗапись = Перечисления.ВидыОперацийУведомления.СообщениеСМС;
	КонецЕсли;
	
	
	НаборЗаписей = РегистрыСведений.РегистрУведомлений.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	
	Пока Индекс <= ЛицевыеСчета.ВГраница() Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ТекущаяДата();
		Если не ОперацияЗапись = Перечисления.ВидыОперацийУведомления.СообщениеСМС Тогда
			Запись.ЛицевойСчет = ЛицевыеСчета[Индекс].Ссылка;
		Иначе
			Запись.ЛицевойСчет = ЛицевыеСчета[Индекс].ЛицевойСчет.Ссылка;
			Запись.МесяцНачисления = МесяцНачисления;
		КонецЕсли;
		Запись.Операция = ОперацияЗапись;
		Если ОперацияЗапись = Перечисления.ВидыОперацийУведомления.СообщениеСМС Тогда
			Запись.ИдентификаторСообщения = СокрЛП(ЛицевыеСчета[Индекс].ИдентификаторСообщения);
			Запись.СтатусСМС = ЛицевыеСчета[Индекс].СтатусСМС;
		Иначе
			Запись.ИдентификаторСообщения = "";
			Запись.СтатусСМС = "";
		КонецЕсли;
		
		Запись.Количество = 1;
		Индекс = Индекс+1;
	КонецЦикла;
	НаборЗаписей.Записывать = Истина;
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Выполняет движения регистра сведений ДополнительныеРеквизитыЛицевогоСчета.
//
Процедура ОтразитьДополнительныеРеквизитыЛицевогоСчета(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДополнительныеРеквизитыЛицевогоСчета = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДополнительныеРеквизитыЛицевогоСчета;
	
	Если Отказ
	 ИЛИ ТаблицаДополнительныеРеквизитыЛицевогоСчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияДополнительныеРеквизитыЛицевогоСчета = Движения.ДополнительныеРеквизитыЛицевогоСчета;
	ДвиженияДополнительныеРеквизитыЛицевогоСчета.Записывать = Истина;
	ДвиженияДополнительныеРеквизитыЛицевогоСчета.Загрузить(ТаблицаДополнительныеРеквизитыЛицевогоСчета);
	
КонецПроцедуры

// Выполняет движения регистра сведений ПлатежиПоРеструктуризацииДолга.
//
Процедура ОтразитьНачисленияПоРеструктуризацииДолга(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРеструктуризацияДолга = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРеструктуризацияДолга;
	
	Если Отказ
	 ИЛИ ТаблицаРеструктуризацияДолга.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРеструктуризацияДолга = Движения.ПлатежиПоРеструктуризацииДолга;
	ДвиженияРеструктуризацияДолга.Записывать = Истина;
	ДвиженияРеструктуризацияДолга.Загрузить(ТаблицаРеструктуризацияДолга);

КонецПроцедуры

// Виконує рухи регістра відомостей СостояниеРеструктуризацииДолга.
//
Процедура ОтразитьСостояниеРеструктуризации(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Если НЕ ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаСостояниеРеструктуризации") Тогда
		Возврат;
	КонецЕсли;

	ТаблицаСостояние = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСостояниеРеструктуризации;

	Если Отказ
	 ИЛИ ТаблицаСостояние.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ДвиженияСостояние = Движения.СостояниеРеструктуризацииДолга;
	ДвиженияСостояние.Записывать = Истина;
	ДвиженияСостояние.Загрузить(ТаблицаСостояние);

КонецПроцедуры

// Выполняет движения регистра накопления ДенежныеСредстваВКассахККМ.
//
Процедура ОтразитьДенежныеСредстваВКассахККМ(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДенежныеСредстваВКассахККМ = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредстваВКассахККМ;
	
	Если Отказ
	 ИЛИ ТаблицаДенежныеСредстваВКассахККМ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияДенежныеСредстваВКассахККМ = Движения.ДенежныеСредстваВКассахККМ;
	ДвиженияДенежныеСредстваВКассахККМ.Записывать = Истина;
	ДвиженияДенежныеСредстваВКассахККМ.Загрузить(ТаблицаДенежныеСредстваВКассахККМ);
	
КонецПроцедуры

// Выполняет движения регистра накопления ДенежныеСредстваВКассахККМ.
//
Процедура ОтразитьРасчетыПоЭквайрингу(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасчетыПоЭквайрингу = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыПоЭквайрингу;
	
	Если Отказ
	 ИЛИ ТаблицаРасчетыПоЭквайрингу.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРасчетыПоЭквайрингу = Движения.РасчетыПоЭквайрингу;
	ДвиженияРасчетыПоЭквайрингу.Записывать = Истина;
	ДвиженияРасчетыПоЭквайрингу.Загрузить(ТаблицаРасчетыПоЭквайрингу);
	
КонецПроцедуры

// Выполняет движения регистра сведений КачествоУслуг.
//
Процедура ОтразитьКачествоУслуг(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаНазначенныеУслуги = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНазначенныеУслуги;
	
	Если Отказ
	 ИЛИ ТаблицаНазначенныеУслуги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияНазначенныеУслуги = Движения.КачествоУслуг;
	ДвиженияНазначенныеУслуги.Записывать = Истина;
	ДвиженияНазначенныеУслуги.Загрузить(ТаблицаНазначенныеУслуги);
	
КонецПроцедуры

