
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУправлениеУслугамиПодробно, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	Запрос.Текст =
       "ВЫБРАТЬ
       |	УправлениеУслугамиЛицевыеСчета.ЛицевойСчет,
       |	УправлениеУслугамиУслуги.Ссылка.Услуга,
       |	УправлениеУслугамиУслуги.УслугаПодробно,
       |	УправлениеУслугамиУслуги.Ссылка.ДатаНачала КАК ДатаНачала,
       |	УправлениеУслугамиУслуги.Ссылка.ДатаОкончания КАК ДатаОкончания,
       |	УправлениеУслугамиЛицевыеСчета.Ссылка.Организация
       |ПОМЕСТИТЬ ВременнаяТаблицаУслуги
       |ИЗ
       |	Документ.УправлениеУслугамиПодробно.ЛицевыеСчета КАК УправлениеУслугамиЛицевыеСчета,
       |	Документ.УправлениеУслугамиПодробно.УслугиПодробно КАК УправлениеУслугамиУслуги
       |ГДЕ
       |	УправлениеУслугамиЛицевыеСчета.Ссылка = &Ссылка
       |	И УправлениеУслугамиУслуги.Ссылка = &Ссылка
       |;
       |
       |////////////////////////////////////////////////////////////////////////////////
       |ВЫБРАТЬ
       |	УслугиДатаНачала.ЛицевойСчет,
       |	УслугиДатаНачала.Услуга,
       |	УслугиДатаНачала.УслугаПодробно,
	   |	УслугиДатаНачала.ДатаНачала КАК Период,
       |	ИСТИНА КАК Действует,
       |	УслугиДатаНачала.Организация
       |ИЗ
       |	ВременнаяТаблицаУслуги КАК УслугиДатаНачала
       |ГДЕ
       |	УслугиДатаНачала.ДатаНачала <> &Пустаядата
       |
       |ОБЪЕДИНИТЬ ВСЕ
       |
       |ВЫБРАТЬ
       |	УслугиДатаОкончания.ЛицевойСчет,
       |	УслугиДатаОкончания.Услуга,
       |	УслугиДатаОкончания.УслугаПодробно,
	   |	УслугиДатаОкончания.ДатаОкончания,
       |	ЛОЖЬ,
       |	УслугиДатаОкончания.Организация
       |ИЗ
       |	ВременнаяТаблицаУслуги КАК УслугиДатаОкончания
       |ГДЕ
       |	УслугиДатаОкончания.ДатаОкончания <> &ПустаяДата";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУправлениеУслугамиПодробно);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНазначенныеУслугиПодробно", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
