
&НаКлиенте
Процедура СменитьРабочийСтол(Команда)
	ОткрытьФорму("Обработка.УправлениеРабочимСтолом.Форма.Форма");	
КонецПроцедуры

&НаКлиенте
Процедура ВводНачальныхОстатков(Команда)
	ОткрытьФорму("Документ.ВводНачальныхОстатков.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ВводНАчальныхОстатковЕксель(Команда)
	ОткрытьФорму("Обработка.ЗагрузкаИзExcel.Форма.Форма");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	СДПТ = Константы.УслугиСДПТПодробно.Получить();
	Элементы.Декорация8.Видимость = СДПТ; 
	Элементы.Декорация9.Видимость = СДПТ; 
КонецПроцедуры
