
// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода) Экспорт                                                 
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Ложь;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетКвитанцииНаОплату") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МакетКвитанцииНаОплату", "ЛицевыеСчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "МакетКвитанцииНаОплату", ПараметрыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетКвитанцииНаОплатуУпрощенная") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МакетКвитанцииНаОплатуУпрощенная", "ЛицевыеСчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "МакетКвитанцииНаОплатуУпрощенная", ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует печатную форму документа по указанному макету.
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент в который будет выводится печатная
//				   форма.
//  ИмяМакета    - Строка, имя макета печатной формы.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ЛицевыеСчета";
	
	ПервыйДокумент = Истина;
	
	Для Каждого Строка Из МассивОбъектов Цикл
		
		Счета = Строка.Счет;
		МесяцНачислений = Строка.Месяц;
		БанковскиеСчетаОрганизации = Строка.БанковскийСчет;
		Для каждого Значение Из Счета Цикл
			
			ТекущийДокумент = Значение.Значение;
			
			Если Не ПервыйДокумент И ИмяМакета = "МакетКвитанцииНаОплату" Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Если ИмяМакета = "МакетКвитанцииНаОплату" Тогда
				//Параметры: (Лицевые счета, Табличный документ,Месяц начисления, БанковскиеСчетаОрганизации)
				//ПечатьКвитанцииНаОплату.ПечатьКвитанцииНаОплату(ТекущийДокумент, ТабличныйДокумент, МесяцНачислений, БанковскиеСчетаОрганизации);
				ПечатьКвитанцииНаОплату2.ПечатьКвитанцииНаОплатуМарина(ТекущийДокумент, ТабличныйДокумент, МесяцНачислений, БанковскиеСчетаОрганизации);
			ИначеЕсли ИмяМакета = "МакетКвитанцииНаОплатуУпрощенная" Тогда
				//Параметры: (Лицевые счета, Табличный документ,Месяц начисления, БанковскиеСчетаОрганизации)
				ПечатьКвитанцииНаОплату2.ПечатьКвитанцииНаОплатуУпрощенная(ТекущийДокумент, ТабличныйДокумент, МесяцНачислений, БанковскиеСчетаОрганизации);
			КонецЕсли;
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
			
		КонецЦикла; 	
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.Защита = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции