
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуНазначенныеЛьготы(ДокументСсылкаУправлениеЛьготами, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаЛьготыНачало.ПотребительУслуг КАК ПотребительУслуг,
		|	ТаблицаЛьготыНачало.Льгота КАК Льгота,
		|	ТаблицаЛьготыНачало.ЛицевойСчет КАК ЛицевойСчет,
		|	ТаблицаЛьготыНачало.Услуга КАК Услуга,
		|	ТаблицаЛьготыНачало.КоличествоЧленовСемьи КАК КоличествоЧленовСемьи,
		|	ТаблицаЛьготыНачало.СоциальнаяНормаНаЛьготника КАК СоциальнаяНормаНаЛьготника,
		|	ТаблицаЛьготыНачало.СоциальнаяНормаНаСемью КАК СоциальнаяНормаНаСемью,
		|	НАЧАЛОПЕРИОДА(ТаблицаЛьготыНачало.ДатаНачала, ДЕНЬ) КАК Период,
		|	ИСТИНА КАК Действует
		|ИЗ
		|	ВременнаяТаблицаЛьготы КАК ТаблицаЛьготыНачало
		|ГДЕ
		|	ТаблицаЛьготыНачало.ДатаНачала <> &ПустаяДата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаЛьготыОкончание.ПотребительУслуг,
		|	ТаблицаЛьготыОкончание.Льгота,
		|	ТаблицаЛьготыОкончание.ЛицевойСчет,
		|	ТаблицаЛьготыОкончание.Услуга,
		|	ТаблицаЛьготыОкончание.КоличествоЧленовСемьи,
		|	ТаблицаЛьготыОкончание.СоциальнаяНормаНаЛьготника,
		|	ТаблицаЛьготыОкончание.СоциальнаяНормаНаСемью,
		|	КОНЕЦПЕРИОДА(ТаблицаЛьготыОкончание.ДатаОкончания, ДЕНЬ),
		|	ЛОЖЬ
		|ИЗ
		|	ВременнаяТаблицаЛьготы КАК ТаблицаЛьготыОкончание
		|ГДЕ
		|	ТаблицаЛьготыОкончание.ДатаОкончания <> &ПустаяДата";
	
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНазначенныеЛьготы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуНазначенныеЛьготы()

Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУправлениеЛьготами, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	УправлениеЛьготамиУслуги.Ссылка.Льгота,
	 |	УправлениеЛьготамиУслуги.Ссылка.ДатаНачала,
	 |	УправлениеЛьготамиУслуги.Ссылка.ДатаОкончания,
	 |	УправлениеЛьготамиУслуги.Ссылка.ПотребительУслуг,
	 |	УправлениеЛьготамиУслуги.Ссылка.ЛицевойСчет,
	 |	УправлениеЛьготамиУслуги.Услуга,
	 |	УправлениеЛьготамиУслуги.СоциальнаяНормаНаЛьготника,
	 |	УправлениеЛьготамиУслуги.СоциальнаяНормаНаСемью,
	 |	УправлениеЛьготамиУслуги.КоличествоЧленовСемьи
	 |ПОМЕСТИТЬ ВременнаяТаблицаЛьготы
	 |ИЗ
	 |	Документ.УправлениеЛьготами.Услуги КАК УправлениеЛьготамиУслуги
	 |ГДЕ
	 |	УправлениеЛьготамиУслуги.Ссылка = &Ссылка";
	 
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУправлениеЛьготами);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицуНазначенныеЛьготы(ДокументСсылкаУправлениеЛьготами, СтруктураДополнительныеСвойства);

КонецПроцедуры
