//хороший сервис для определения координат http://api.yandex.ru/maps/tools/getlonglat/
 
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ 
  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Если ВебКлиент Тогда
		ТекстСкрипта = РаботаСКартамиСервер.ПолучитьТекстМакета();
	#КонецЕсли
	
	Если ТипЗнч(Параметры) = Тип("ДанныеФормыСтруктура") Тогда
		РежимРедактора = Параметры.РежимРедактора;
		Если РежимРедактора = "ДляЗаписи" Тогда 			
			ТекЗдание = Параметры.Партнер;			
			АдресЗдания = РаботаСКартамиСервер.ПолучитьАдресЗдания(ТекЗдание);
			
			НоваяСтрока 		= СписокЗданий.Добавить();
			НоваяСтрока.Здание = ТекЗдание;		
			НоваяСтрока.Адрес 	= АдресЗдания;
			НоваяСтрока.Широта  = Параметры.Широта;
			НоваяСтрока.Долгота = Параметры.Долгота;
		ИначеЕсли РежимРедактора = "ДляСписка" Тогда			
			ЗаполнитьСписокЗданий();
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда		
		Если Не ОбщегоНазначенияКлиент.РасширениеРаботыСФайламиПодключено("Для работы с редактором необходимо установить расширение работы с файлами") Тогда
			Отказ=Истина;
			Возврат;
		КонецЕсли;
	#КонецЕсли

	ОбновитьТекущийМакет();
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СписокЗданийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьМаркерЗданияНаКарте();
	
КонецПроцедуры 

&НаКлиенте
Процедура СписокЗданийПриАктивизацииСтроки(Элемент)
	
	ПоказатьМаркерЗданияНаКарте();
		
КонецПроцедуры

&НаКлиенте
Процедура ПолеБраузераПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ТекЗдание = Элементы.СписокЗданий.ТекущиеДанные.Здание;
	
	Если ТекЗдание = Неопределено Тогда
		Возврат;
	КонецЕсли;  	
		
	Документ = Элементы.ПолеБраузера.Document;
	СтрокаСКоординатами = Документ.parentWindow.name;
	СтрокаСКоординатами = СтрЗаменить(СтрокаСКоординатами, "LabelEditor_", "");
	СтрокаСКоординатами = СтрЗаменить(СтрокаСКоординатами, "_initEnd", ""); //если нажали на кнопку, а на карте отметку не делали
	 		
	МассивКоординат = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаСКоординатами, ",");
	
	Если МассивКоординат.Количество()<>2 Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СписокЗданий.ТекущиеДанные.Широта  = МассивКоординат[0]; 
	Элементы.СписокЗданий.ТекущиеДанные.Долгота = МассивКоординат[1];
	Элементы.СписокЗданий.ТекущиеДанные.НовыеКоординатыНеЗаписаны = Истина;
	СформироватьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеБраузераДокументСформирован(Элемент)
	
	КартаЗагружена = Истина;
	
	//#Если ВебКлиент Тогда
	//	СисИнфо = Новый СистемнаяИнформация;
	//	Если Найти(СисИнфо.ИнформацияПрограммыПросмотра, "Firefox") = 0 Тогда
	//		Документ = Элементы.ПолеБраузера.Document;
	//		Документ.parentWindow.name = РаботаСКартамиСервер.СформироватьПараметрРежимРедактора("LabelEditor", ИсточникКарты);
	//	КонецЕсли;
	//#КонецЕсли
	
	// После загрузки карты нужно вывести маркер текущего партнера
	//ПоказатьМаркерПартнераНаКарте();
	
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ
 
&НаКлиенте
Процедура КомандаОбновитьСписокЗданий(Команда)
	
	Если СписокЗданий.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Список зданий будет обновлен. Продолжить?", Режим);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			СписокЗданий.Очистить();
		Иначе
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСписокЗданий();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьКоординаты(Команда)
	
	Результат = Вопрос("Сохранить новые координаты местоположения для отмеченных в списке зданий?", РежимДиалогаВопрос.ДаНет);
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	
	Для Каждого ТекСтрока Из СписокЗданий Цикл
		Если Не ТекСтрока.НовыеКоординатыНеЗаписаны	Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяШирота  = ТекСтрока.Широта;
		НоваяДолгота = ТекСтрока.Долгота;
		Здание	 	 = ТекСтрока.Здание;
		
		ЗаписатьНовыеКоординаты(Здание, НоваяШирота, НоваяДолгота);
		
		ТекСтрока.НовыеКоординатыНеЗаписаны = Ложь;
	КонецЦикла;
		
	Оповестить("ОбновлениеКоординат");
	ОповеститьОбИзменении(Тип("СправочникСсылка.ЗданияИСооружения"));
	Если РежимРедактора = "ДляЗаписи" Тогда
			
	ИначеЕсли РежимРедактора = "ДляСписка" Тогда
		ЗаполнитьСписокЗданий();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОпределитьКоординатыПоАдресу(Команда)
	
	ТекЗдание = Элементы.СписокЗданий.ТекущиеДанные.Здание;
	
	АдресЗдания = РаботаСКартамиСервер.ПолучитьАдресЗдания(ТекЗдание);	
	
	Если ПустаяСтрока(АдресЗдания) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранного здания не задан адрес в контактной информации. Определение координат по адресу невозможно!");
		Возврат;
	КонецЕсли;
	
	Попытка
		СтруктураОтвета = РаботаСКартамиКлиент.ПолучитьКоординатыПоЗапросу(АдресЗдания);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Невозможно определить координаты для здания " + СокрЛП(ТекЗдание));
	КонецПопытки;
		
	Если Не СтруктураОтвета = Неопределено Тогда 					
		НайденныеКоординаты = СтруктураОтвета.Координаты;
						
		МассивКоординат = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НайденныеКоординаты, " ");		
			
		Элементы.СписокЗданий.ТекущиеДанные.Широта  = МассивКоординат[1]; 
		Элементы.СписокЗданий.ТекущиеДанные.Долгота = МассивКоординат[0];
		Элементы.СписокЗданий.ТекущиеДанные.НовыеКоординатыНеЗаписаны = Истина;
		
		СформироватьУсловноеОформление();
		
		АвтопоискАдрес = СокрЛП(СтруктураОтвета.Область) + ", " + СокрЛП(СтруктураОтвета.НаселенныйПункт) + ", " + СокрЛП(СтруктураОтвета.Улица) + ", " + СокрЛП(СтруктураОтвета.Дом);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Адрес, для которого были определены координаты: " + СокрЛП(АвтопоискАдрес)); 
		
		ПоказатьМаркерЗданияНаКарте();
		
	КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаписатьНовыеКоординаты(ТекЗдание, НоваяШирота, НоваяДолгота)
	
	ЗданиеОбъект = ТекЗдание.ПолучитьОбъект();
	ЗданиеОбъект.Широта  = НоваяШирота;
	ЗданиеОбъект.Долгота = НоваяДолгота;
	ЗданиеОбъект.ОбменДанными.Загрузка = Истина;
	
	ЗданиеОбъект.Записать();
	
КонецПроцедуры
  
////////////////////////////////////////////////////////////////////////////////
// Работа с макетом карты

&НаКлиенте
Процедура ОбновитьТекущийМакет()
	
	ТекстМакета	= РаботаСКартамиКлиент.ПолучитьТекстМакета();	
	#Если Не ВебКлиент Тогда	
		Документ = Элементы.ПолеБраузера.Document;
		
		Документ.designMode = "On";
		Документ.write(ТекстМакета);	
		Документ.designMode = "Off"; 
		
		//передаем параметр, показывающий, что файл скрипта используется для Редактора меток		
		Документ.parentWindow.name = "LabelEditor";
	#Иначе
		ТекстСкрипта = ТекстМакета;
	#КонецЕсли
	КартаЗагружена = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьИсточникКарты()
		
	ОбновитьТекущийМакет();	
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьМаркерЗданияНаКарте()
	
	Если Не КартаЗагружена Тогда
		Возврат;
	КонецЕсли;	
	
	ТекДанные = Элементы.СписокЗданий.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//выведем на карту метку
	ТекЗдание 	= ТекДанные.Здание;
	Широта 		= ТекДанные.Широта;
	Долгота 	= ТекДанные.Долгота;
	
	Если (Широта = 0) И (Долгота = 0) Тогда
		Возврат;
	КонецЕсли;	
	
	Документ = Элементы.ПолеБраузера.Document;
		
	лЗаголовок = Строка(ТекЗдание);
	АдресЗдания = РаботаСКартамиСервер.ПолучитьАдресЗдания(ТекЗдание);
	Описание = "Адрес: " + Строка(АдресЗдания);
	Подсказка = Строка(ТекЗдание); 
	
	Попытка
		Документ.parentWindow.ClearCollection();
		Документ.parentWindow.setMarker(Широта, Долгота, "", лЗаголовок, Описание, "", Подсказка);
		Документ.parentWindow.gotoMarker(Широта, Долгота);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Работа с таблицей на форме

&НаСервере
Процедура СформироватьУсловноеОформление()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
		
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокЗданий.НовыеКоординатыНеЗаписаны");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокЗданийШирота");
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокЗданийДолгота");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЗданий()
	
	СписокЗданий.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗданияИСооружения.Ссылка КАК Здание,
		|	ЗданияИСооружения.Широта,
		|	ЗданияИСооружения.Долгота
		|ИЗ
		|	Справочник.ЗданияИСооружения КАК ЗданияИСооружения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Здание";
	 	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
		
	Для Каждого ТекСтрока Из РезультатЗапроса Цикл
		ТекЗдание 	  = ТекСтрока.Здание;
		АдресЗдания = РаботаСКартамиСервер.ПолучитьАдресЗдания(ТекЗдание);
		
		НоваяСтрока 		= СписокЗданий.Добавить();
		НоваяСтрока.Здание = ТекЗдание;		
		НоваяСтрока.Адрес 	= АдресЗдания;
		НоваяСтрока.Широта  = ТекСтрока.Широта;
		НоваяСтрока.Долгота = ТекСтрока.Долгота;
	КонецЦикла; //Для Каждого ТекСтрока Из РезультатЗапроса Цикл
	
КонецПроцедуры
