
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура устанавливает видимость и доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоПоказаниямПрибораУчета Тогда
		
		Элементы.ВидПлощади.Видимость = Ложь;	
		Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Истина;
		Элементы.ГруппаРасчтаПоСредней.Видимость = Истина;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;	
		Элементы.ДополнительныйРеквизит.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Истина;
	ИначеЕсли Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоКоличествуПриборов Тогда
		Элементы.ВидПлощади.Видимость = Ложь;	
		Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Ложь;
		Элементы.ГруппаРасчтаПоСредней.Видимость = Ложь;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;	
		Элементы.ДополнительныйРеквизит.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Истина;
		//Элементы.ПУХолоднаяВода.Видимость = Истина;
		
		Элементы.СоставныеУслуги.Видимость = Ложь;
	ИначеЕсли Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоКоличествуЖильцов Тогда
		
		Элементы.ВидПлощади.Видимость = Ложь;	
		Элементы.ВидПотребителяУслуг.Видимость = Истина;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Ложь;	
		Элементы.ГруппаРасчтаПоСредней.Видимость = Ложь;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ПороговыйМетод.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;	
		Элементы.ДополнительныйРеквизит.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Ложь;	
		
	ИначеЕсли Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоПлощади Тогда
		
		Элементы.ВидПлощади.Видимость = Истина;	
		Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Ложь;
		Элементы.ГруппаРасчтаПоСредней.Видимость = Ложь;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ПороговыйМетод.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;	
		Элементы.ДополнительныйРеквизит.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Ложь;	
		
	ИначеЕсли Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоНормамПотребления Тогда
		
		Элементы.ОснованиеНормПотребления.Видимость = Истина;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Ложь;
		Элементы.ГруппаРасчтаПоСредней.Видимость = Ложь;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ПороговыйМетод.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Ложь;	
		
		Если Объект.ОснованиеНормПотребления = Перечисления.ОснованияНормПотребления.ОдинЧеловек Тогда
			Элементы.ВидПотребителяУслуг.Видимость = Истина;	
			Элементы.ВидПлощади.Видимость = Ложь;	
			
		ИначеЕсли Объект.ОснованиеНормПотребления = Перечисления.ОснованияНормПотребления.Площадь Тогда
			Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
			Элементы.ВидПлощади.Видимость = Истина;	
			
		ИначеЕсли Объект.ОснованиеНормПотребления = Перечисления.ОснованияНормПотребления.ДополнительныйРеквизит Тогда
			Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
			Элементы.ВидПлощади.Видимость = Ложь;	
			Элементы.ДополнительныйРеквизит.Видимость = Истина;
			
		Иначе
			Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
			Элементы.ВидПлощади.Видимость = Ложь;	
		КонецЕсли;
		
	ИначеЕсли Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ФиксированноеНачисление Тогда
		
		Элементы.ВидПлощади.Видимость = Ложь;	
		Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Ложь;
		Элементы.ГруппаРасчтаПоСредней.Видимость = Ложь;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ПороговыйМетод.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;	
		Элементы.ДополнительныйРеквизит.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Ложь;	
		
	ИначеЕсли Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоКоличествуМашиноМест Тогда
		
		Элементы.ВидПлощади.Видимость = Ложь;	
		Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Ложь;
		Элементы.ГруппаРасчтаПоСредней.Видимость = Ложь;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ПороговыйМетод.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Истина;	
		Элементы.ДополнительныйРеквизит.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Ложь;	
		
	ИначеЕсли Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоРасчетнымЗначениям Тогда
		
		Элементы.ВидПлощади.Видимость = Ложь;	
		Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Истина;
		Элементы.ГруппаРасчтаПоСредней.Видимость = Ложь;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Истина;
		Элементы.ПороговыйМетод.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;	
		Элементы.ДополнительныйРеквизит.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Истина;	
		
	ИначеЕсли Объект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоДополнительнымРеквизитам Тогда
		
		Элементы.ВидПлощади.Видимость = Ложь;	
		Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Ложь;
		Элементы.ГруппаРасчтаПоСредней.Видимость = Ложь;
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ПороговыйМетод.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;	
		Элементы.ДополнительныйРеквизит.Видимость = Истина;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Ложь;	
		
	Иначе
		
		Элементы.ВидПлощади.Видимость = Ложь;	
		Элементы.ВидПотребителяУслуг.Видимость = Ложь;	
		Элементы.ОснованиеНормПотребления.Видимость = Ложь;	
		Элементы.ГруппаРасчетаЛьготы.Видимость = Ложь;	
		Элементы.БазаРаспределенияРасчетнойУслуги.Видимость = Ложь;
		Элементы.ПороговыйМетод.Видимость = Ложь;
		Элементы.ВидМашиноМеста.Видимость = Ложь;	
		Элементы.ДополнительныйРеквизит.Видимость = Ложь;
		//Элементы.ПУГарячаяВода.Видимость = Ложь;
		//Элементы.ПУХолоднаяВода.Видимость = Ложь;
		
		Элементы.СоставныеУслуги.Видимость = Ложь;	
		
	КонецЕсли;
	
	Если Объект.СпособНачисления <> Перечисления.СпособыНачисленияУслуг.ПоПоказаниямПрибораУчета И Объект.ПороговыйМетод Тогда
		
		Объект.ПороговыйМетод = Ложь;
		
	КонецЕсли;
	
	Если Объект.ПороговыйМетод Тогда
		
		Элементы.КоличествоПорогов.Видимость = Истина;
		
	Иначе
		
		Элементы.КоличествоПорогов.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Объект.ВидРасчетаПоСредней = Перечисления.ВидыРасчетаПоСредней.ПоПрошлымМесяцам Тогда
		Элементы.БазаДляРасчетаПоСредней.Видимость = Истина;
		Элементы.ГруппаДатыСезона.Видимость = Ложь;
	ИначеЕсли Объект.ВидРасчетаПоСредней = Перечисления.ВидыРасчетаПоСредней.ЗаПрошлыйСезон Тогда
		Элементы.БазаДляРасчетаПоСредней.Видимость = ложь;
		Элементы.ГруппаДатыСезона.Видимость = Истина;
	Иначе
		Элементы.БазаДляРасчетаПоСредней.Видимость = ложь;
		Элементы.ГруппаДатыСезона.Видимость = ложь;
	КонецЕсли;	
		
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРасширениеНачисленийЛицевыхСчетов") Тогда
		Элементы.СпособНачисления.СписокВыбора.Добавить(Перечисления.СпособыНачисленияУслуг.ПоДополнительнымРеквизитам);
		Элементы.ОснованиеНормПотребления.СписокВыбора.Добавить(Перечисления.ОснованияНормПотребления.ДополнительныйРеквизит);
	КонецЕсли;
	
	Элементы.Ресурсная.Видимость  = ПолучитьФункциональнуюОпцию("ИспользоватьАвансовыеПлатежи");
	
	Если Объект.ПоВидамТарифа Тогда
		
		Элементы.ВидыТарифов.Видимость = Истина;
		
	Иначе
		
		Элементы.ВидыТарифов.Видимость = Ложь;
		
	КонецЕсли;

	
КонецПроцедуры // УстановитьВидимостьИДоступность()

&НаСервере
Функция КонтрольВыбранногоЗначения(ВыбранноеЗначение)
	
	Если ВыбранноеЗначение = Объект.Ссылка Тогда
	
		Возврат Ложь;	
	
	КонецЕсли; 
	
	ВыборкаСтрок = Объект.СоставныеУслуги.НайтиСтроки(Новый Структура("Услуга", ВыбранноеЗначение));
	
	Если ВыборкаСтрок.Количество() > 0 Тогда
	
		Возврат Ложь;	
	
	КонецЕсли;
	
	Возврат Истина;	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьИДоступность();	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
Процедура СпособНачисленияПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеНормПотребленияПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставныеУслугиУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ КонтрольВыбранногоЗначения(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка =Ложь;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПороговыйМетодПриИзменении(Элемент)
	
	Если ПороговыйМетодПриИзмененииНаСервере() Тогда
	
		Объект.ПороговыйМетод = Не Объект.ПороговыйМетод;
	
	КонецЕсли; 
	
	УстановитьВидимостьИДоступность();	
	
КонецПроцедуры

&НаСервере
Функция ПороговыйМетодПриИзмененииНаСервере()

	Если Объект.ПороговыйМетод Тогда
		ТаблицаТарифов = РегистрыСведений.Тарифы.СрезПоследних( , Новый Структура("Услуга", Объект.Ссылка));
		Если ТаблицаТарифов.Количество() > 0  Тогда
			Если ТаблицаТарифов.Итог("ЗначениеТарифа") > 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Установлен тариф. Изменение метода запрещено до отмены тарифа.';uk='Встановлено тариф. Зміна методу заборонено до скасування тарифу.'"));
			    Возврат Истина;
			КонецЕсли; 			
		КонецЕсли; 
	
	Иначе	
		ТаблицаПорогов = РегистрыСведений.ТарифыПороговые.СрезПоследних( , Новый Структура("Услуга", Объект.Ссылка));
		Если ТаблицаПорогов.Количество() > 0  Тогда
			Если ТаблицаПорогов.Итог("ЗначениеТарифа") > 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Установлены пороговые тарифы. Изменение метода запрещено до отмены пороговых тарифов.';uk='Встановлено порогові тарифи. Зміна методу заборонено до скасування порогових тарифів.'"));
			    Возврат Истина;
			КонецЕсли; 			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ВидРасчетаПоСреднейПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПоВидамТарифаПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ВидыТарифов.Сортировать("ВидТарифа ВОЗР");
КонецПроцедуры

&НаКлиенте
Процедура СоставныеУслугиУслугаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СоставныеУслуги.ТекущиеДанные;
	ТекущаяСтрока.Коэффициент = 1;
КонецПроцедуры
