////////////////////////////////////////////////////////////////////////////////
// ГРУППА ЗАГРУЗОК

&НаКлиенте
Процедура ЗаполнитьТаблицуЗданий(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Сообщить(НСтр("ru='Укажите организацию.';uk='Вкажіть організацію'"));
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ТаблицаЗданий.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Путь = Объект.ПутьКФайлу;
	Объект.ТаблицаЗданий.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик=2 По КоличествоСтрок Цикл
		
		НоваяСтрока = Объект.ТаблицаЗданий.Добавить();
		НоваяСтрока.ТипСооруженияНаименование = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.Область = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.Город = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.Район = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.Улица = Excel.Cells(Счетчик, 5).Value;
		НоваяСтрока.Корпус = Excel.Cells(Счетчик, 6).Value;
		НоваяСтрока.НомерДома = Excel.Cells(Счетчик, 7).Value;
		НоваяСтрока.Индекс = Excel.Cells(Счетчик, 8).Value;
		НоваяСтрока.ДатаПринятияНаБаланс = Excel.Cells(Счетчик, 9).Value;
		НоваяСтрока.ДатаВводаВЭксплуатацию = Excel.Cells(Счетчик, 10).Value;
		НоваяСтрока.КоличествоПодъездов = Excel.Cells(Счетчик, 11).Value;
		НоваяСтрока.КоличествоЛифтов = Excel.Cells(Счетчик, 12).Value;
		НоваяСтрока.ОбщаяПлощадь = Excel.Cells(Счетчик, 13).Value;
		НоваяСтрока.ОтапливаемаяПлощадь = Excel.Cells(Счетчик, 14).Value;
		НоваяСтрока.ЖилаяПлощадь = Excel.Cells(Счетчик, 15).Value;
		НоваяСтрока.ДополнительнаяПлощадь = Excel.Cells(Счетчик, 16).Value;
		НоваяСтрока.Префикс = Excel.Cells(Счетчик, 17).Value;
		
	КонецЦикла;
	
	Excel.Workbooks.Close();
	ЗаполнитьПараметрыЗданий();
	ПроверитьУникальность("Здания");
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуОбъектовЛС(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Сообщить(НСтр("ru='Укажите организацию.';uk='Вкажіть організацію'"));
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Здание) Тогда
		
		Сообщить(НСтр("ru='Укажите здание.';uk='Вкажіть будівлю.'"));
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ТаблицаОбъектовЛС.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Путь = Объект.ПутьКФайлу;
	Объект.ТаблицаОбъектовЛС.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик=2 По КоличествоСтрок Цикл
		
		НоваяСтрока = Объект.ТаблицаОбъектовЛС.Добавить();
		НоваяСтрока.НомерКвартиры = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.Этаж = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.ПодъездКод = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.КоличествоКомнат = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.ЖилойФондНаименование = Excel.Cells(Счетчик, 5).Value;
		НоваяСтрока.ОбщаяПлощадь = Excel.Cells(Счетчик, 6).Value;
		НоваяСтрока.ОтапливаемаяПлощадь = Excel.Cells(Счетчик, 7).Value;
		НоваяСтрока.ЖилаяПлощадь = Excel.Cells(Счетчик, 8).Value;
		НоваяСтрока.ДополнительнаяПлощадь = Excel.Cells(Счетчик, 9).Value;
		НоваяСтрока.Суффикс = Excel.Cells(Счетчик, 10).Value;
		
	КонецЦикла;
	
	Excel.Workbooks.Close();
	ЗаполнитьПараметрыОбъектовЛС();
	ПроверитьУникальность("ОбъектыЛС");

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуФизЛиц(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ТаблицаФизЛиц.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Путь = Объект.ПутьКФайлу;
	Объект.ТаблицаФизЛиц.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик=2 По КоличествоСтрок Цикл
		
		НоваяСтрока = Объект.ТаблицаФизЛиц.Добавить();
		НоваяСтрока.ФИО = СокрЛП(Excel.Cells(Счетчик, 1).Value);
		НоваяСтрока.Пол = ПроверитьПолФизЛица(Excel.Cells(Счетчик, 2).Value);
		НоваяСтрока.ИНН = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.ДатаРождения = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.МестоРождения = Excel.Cells(Счетчик, 5).Value;
		
	КонецЦикла;
	
	Excel.Workbooks.Close();
	ПроверитьУникальность("ФизЛица");

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуЛицевыхСчетов(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		
		Сообщить(НСтр("ru='Укажите путь к файлу."));
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Сообщить(НСтр("ru='Укажите организацию.';uk='Вкажіть організацію'"));
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Здание) Тогда
		
		Сообщить(НСтр("ru='Укажите здание.';uk='Вкажіть будівлю.'"));
		Возврат;
		
	КонецЕсли;

	Если Объект.ТаблицаЛицевыхСчетов.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Путь = Объект.ПутьКФайлу;
	Объект.ТаблицаЛицевыхСчетов.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик=2 По КоличествоСтрок Цикл
		
		НоваяСтрока = Объект.ТаблицаЛицевыхСчетов.Добавить();
		НоваяСтрока.НомерКвартиры = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.Суффикс = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.ОтветственныйВладелецФИО = СокрЛП(Excel.Cells(Счетчик, 3).Value);
		НоваяСтрока.КоличествоПроживающих = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.КоличествоПрописанных = Excel.Cells(Счетчик, 5).Value;
		НоваяСтрока.НомерЛС = Excel.Cells(Счетчик, 6).Value;
		НоваяСтрока.Телефон = Excel.Cells(Счетчик, 7).Value;
		НоваяСтрока.ЭлПочта = Excel.Cells(Счетчик, 8).Value;
		
	КонецЦикла;
	
	Excel.Workbooks.Close();
	ЗаполнитьПараметрыЛС();
	ПроверитьУникальность("ЛицевыеСчета");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуПриборовУчета(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Сообщить(НСтр("ru='Укажите организацию.';uk='Вкажіть організацію'"));
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Здание) Тогда
		
		Сообщить(НСтр("ru='Укажите здание.';uk='Вкажіть будівлю.'"));
		Возврат;
		
	КонецЕсли;

	Если Объект.ТаблицаПриборовУчета.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Путь = Объект.ПутьКФайлу;
	Объект.ТаблицаПриборовУчета.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик=2 По КоличествоСтрок Цикл
		
		НоваяСтрока = Объект.ТаблицаПриборовУчета.Добавить();
		НоваяСтрока.УслугаНаименование = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.ЗаводскойНомер = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.НомерКвартиры = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.Суффикс = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.Разрядность = Excel.Cells(Счетчик, 5).Value;
		НоваяСтрока.Коэффициент = Excel.Cells(Счетчик, 6).Value;
        НоваяСтрока.СпособРегистрацииНаименование = Excel.Cells(Счетчик, 7).Value;
		НоваяСтрока.НачальноеПоказание = Excel.Cells(Счетчик, 8).Value;
		НоваяСтрока.ТарифностьНаименование = Excel.Cells(Счетчик, 9).Value;
		НоваяСтрока.ДатаВключения = Дата;

	КонецЦикла;
	
	Excel.Workbooks.Close();
	
	ЗаполнитьУслуги("ПриборыУчета");
	ЗаполнитьЛицевыеСчета("ПриборыУчета");
	ЗаполнитьПараметрыСчетчиков();
	ПроверитьУникальность("ПриборыУчета");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуНачальныхОстатков(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Сообщить(НСтр("ru='Укажите организацию.';uk='Вкажіть організацію'"));
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Здание) Тогда
		
		Сообщить(НСтр("ru='Укажите здание.';uk='Вкажіть будівлю.'"));
		Возврат;
		
	КонецЕсли;

	Если Объект.ТаблицаНачальныхОстатков.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Путь = Объект.ПутьКФайлу;
	Объект.ТаблицаНачальныхОстатков.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик=2 По КоличествоСтрок Цикл
		
		НоваяСтрока = Объект.ТаблицаНачальныхОстатков.Добавить();
		НоваяСтрока.НомерКвартиры = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.Суффикс = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.УслугаНаименование = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.МесяцНачисления = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.Сумма = Excel.Cells(Счетчик, 5).Value;

	КонецЦикла;
	
	Excel.Workbooks.Close();
	
	ЗаполнитьУслуги("НачальныеОстатки");
	ЗаполнитьЛицевыеСчета("НачальныеОстатки");
	ПроверитьУникальность("НачальныеОстатки");

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//ГРУППА КНОПОК СОХРАНЕНИЯ

&НаКлиенте
Процедура СохранитьЗданияВСправочник(Команда)
	
	СоздатьЗдание();
	ПроверитьУникальность("Здания");

КонецПроцедуры

&НаКлиенте
Процедура СохранитьОбъектыВСправочник(Команда)
	
	СоздатьОбъектЛС();
	ПроверитьУникальность("ОбъектыЛС");

КонецПроцедуры

&НаКлиенте
Процедура СохранитьФизЛицаВСправочник(Команда)
	
	СоздатьФизЛицо();
	ПроверитьУникальность("ФизЛица");
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЛицевыеСчетаВСправочник(Команда)
	
	СоздатьЛицевойСчет();
    ПроверитьУникальность("ЛицевыеСчета");

КонецПроцедуры

&НаКлиенте
Процедура СохранитьНачальныеОстаткиВДокумент(Команда)
	
	СоздатьДокументВводОстатков();
	ПроверитьУникальность("НачальныеОстатки");

КонецПроцедуры

&НаКлиенте
Процедура СохранитьПриборыУчетаВСправочник(Команда)
	
	СоздатьПриборУчета();
	ПроверитьУникальность("ПриборыУчета");
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьУслуги(Команда)
	
	СоздатьДокументыУправленияУслугами();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//ГРУППА СОЗДАНИЯ ЭЛЕМЕНТОВ

&НаСервере
Процедура СоздатьЗдание()
	
	СообщениеОбОшибке = ПроверитьЗаполнениеРеквизитов("Здания");
	Если СообщениеОбОшибке <> "" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Элементы справочника не удалось создать.';uk='Елементи довідника не вдалося створити.'")+СообщениеОбОшибке;
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	Если ПроверитьТаблицуНаПустоту("Здания") Тогда
		
		СообщениеОбОшибке = "Нет строк отмеченных для загрузки.";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Элементы справочника не удалось создать. "+СообщениеОбОшибке;
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	Для каждого Строка Из Объект.ТаблицаЗданий Цикл
		
		Если Строка.Загружать = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.ДатаВводаВЭксплуатацию) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Элемент не удалось создать, не указана дата ввода в эксплуатацию. (Строка №"+Строка.НомерСтроки+")";
			Сообщение.Сообщить();
            Продолжить;
		ИначеЕсли НЕ ЗначениеЗаполнено(Строка.ДатаПринятияНаБаланс) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Элемент не удалось создать, не указана дата принятия на баланс. (Строка №"+Строка.НомерСтроки+")";
			Сообщение.Сообщить();
            Продолжить;
		КонецЕсли;
		
		НовоеЗдание = Справочники.ЗданияИСооружения.СоздатьЭлемент();
		НовоеЗдание.Организация = Объект.Организация;
		НовоеЗдание.КоличествоЛифтов = Строка.КоличествоЛифтов;
		НовоеЗдание.КоличествоПодъездов = Строка.КоличествоПодъездов;
		НовоеЗдание.ДатаВводаВЭксплуатацию = Строка.ДатаВводаВЭксплуатацию;
		НовоеЗдание.ДатаПринятияНаБаланс = Строка.ДатаПринятияНаБаланс;
		НовоеЗдание.ТипСооружения = Строка.ТипСооружения;
		НовоеЗдание.Наименование = ПолучитьНаименованиеЗдания(Строка);
		НовоеЗдание.ПрефиксЛицевыхСчетов = Строка.Префикс;
		Адрес = НовоеЗдание.КонтактнаяИнформация.Добавить();
		Адрес.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		Адрес.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗданияИСооружения;
		Адрес.ЗначенияПолей = 	"Индекс=11111 
								|Регион="+Строка.Область+"
								|Район="+Строка.Район+"
								|Город="+Строка.Город+"
								|Улица="+Строка.Улица+"
								|Дом="+Строка.НомерДома+"
								|Корпус="+Строка.Корпус+"
								|Страна=УКРАИНА
								|КодСтраны=804
								|ТипДома=дом
								|ТипКорпуса=корпус";
		Адрес.Представление = ПолучитьНаименованиеЗдания(Строка);
		
		Попытка
			НовоеЗдание.Записать();
			ЗаписатьПлощадиЗдания(НовоеЗдание.Ссылка, Строка);
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Элемент не удалось создать. (Строка №"+Строка.НомерСтроки+")";
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОбъектЛС()
		
	СообщениеОбОшибке = ПроверитьЗаполнениеРеквизитов("ОбъектыЛС");
	Если СообщениеОбОшибке <> "" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Элементы справочника не удалось создать. "+СообщениеОбОшибке;
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	Если ПроверитьТаблицуНаПустоту("ОбъектыЛС") Тогда
		
		СообщениеОбОшибке = "Нет строк отмеченных для загрузки.";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Элементы справочника не удалось создать. "+СообщениеОбОшибке;
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	Для каждого Строка Из Объект.ТаблицаОбъектовЛС Цикл
		
		Если Строка.Загружать = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.НомерКвартиры) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Элемент не удалось создать, не указан номер квартиры. (Строка №"+Строка.НомерСтроки+")";
			Сообщение.Сообщить();
            Продолжить;
		КонецЕсли;
		
		ОбъектЛС = Справочники.ОбъектыЛицевыхСчетов.СоздатьЭлемент();
		ОбъектЛС.Владелец = ЭтаФорма.Здание;
		ОбъектЛС.Этаж = Строка.Этаж;
		ОбъектЛС.Суффикс = Строка.Суффикс;
		ОбъектЛС.КоличествоКомнат = Строка.КоличествоКомнат;
		ОбъектЛС.Подъезд = Строка.Подъезд;
		ОбъектЛС.ЖилойФонд = Строка.ЖилойФонд;
		ОбъектЛС.Код = Строка.НомерКвартиры;
		ОбъектЛС.Наименование = ПолучитьНаименованиеОбъектаЛС(Строка);

		Попытка
			ОбъектЛС.Записать();
			ЗаписатьПлощадиОбъектов(ОбъектЛС.Ссылка, Строка);
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Элемент не удалось создать. (Строка №"+Строка.НомерСтроки+")";
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура СоздатьФизЛицо()
	
	СообщениеОбОшибке = ПроверитьЗаполнениеРеквизитов("ФизЛица");
	Если СообщениеОбОшибке <> "" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Элементы справочника не удалось создать. "+СообщениеОбОшибке;
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	Если ПроверитьТаблицуНаПустоту("ФизЛица") Тогда
		
		СообщениеОбОшибке = "Нет строк отмеченных для загрузки.";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Элементы справочника не удалось создать. "+СообщениеОбОшибке;
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	Для каждого Строка Из Объект.ТаблицаФизЛиц Цикл
		
		Если Строка.Загружать = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		ФизЛицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
		ФизЛицо.Наименование = Строка.ФИО;
		ФизЛицо.Пол = Строка.Пол;
		ФизЛицо.ИНН = Строка.ИНН;
		ФизЛицо.ДатаРождения = Строка.ДатаРождения;
		ФизЛицо.МестоРождения = Строка.МестоРождения;
		
		Попытка
			ФизЛицо.Записать();
			Потребитель = Справочники.ПотребителиУслуг.СоздатьЭлемент();
			Потребитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
			Потребитель.ФизЛицо = ФизЛицо.Ссылка;
			Потребитель.Наименование = ФизЛицо.Наименование;
			Потребитель.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Элемент не удалось создать. (Строка №"+Строка.НомерСтроки+")";
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЛицевойСчет()
	
	СообщениеОбОшибке = ПроверитьЗаполнениеРеквизитов("ЛицевыеСчета");
	Если СообщениеОбОшибке <> "" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Элементы справочника не удалось создать. "+СообщениеОбОшибке;
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	Если ПроверитьТаблицуНаПустоту("ЛицевыеСчета") Тогда
		
		СообщениеОбОшибке = "Нет строк отмеченных для загрузки.";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Элементы справочника не удалось создать. "+СообщениеОбОшибке;
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	Для каждого Строка Из Объект.ТаблицаЛицевыхСчетов Цикл
		
		Если Строка.Загружать = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.ОбъектЛицевогоСчета) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Элемент не удалось создать, не указан номер квартиры. (Строка №"+Строка.НомерСтроки+")";
			Сообщение.Сообщить();
            Продолжить;
		КонецЕсли;
		
		ЛицевойСчет = Справочники.ЛицевыеСчета.СоздатьЭлемент();
		
		Если Строка.НомерЛС <> "" Тогда
			ЛицевойСчет.Наименование = Строка.НомерЛС;
			
		Иначе
			
			Попытка
				ЛицевойСчет.Наименование = Здание.ПрефиксЛицевыхСчетов+Формат(Число(Строка.ОбъектЛицевогоСчета.Подъезд.НомерПодъезда),"ЧЦ=3; ЧВН=")+Строка.ОбъектЛицевогоСчета.Наименование;
			Исключение
				ЛицевойСчет.Наименование = Здание.ПрефиксЛицевыхСчетов+Строка.ОбъектЛицевогоСчета.Наименование;
			КонецПопытки;
		КонецЕсли;
		
		ЛицевойСчет.Владелец = Здание;
		ЛицевойСчет.ОбъектЛицевогоСчета = Строка.ОбъектЛицевогоСчета;
		ЛицевойСчет.МобТелефон = Строка.Телефон;
		ЛицевойСчет.ЭлПочта = Строка.ЭлПочта;
		Попытка
			ЛицевойСчет.Записать();
			СоздатьДокументОткрытиеЛС(ЛицевойСчет.Ссылка, Строка.КоличествоПроживающих, Строка.КоличествоПрописанных, Строка.ОтветственныйВладелец);
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Элемент не удалось создать. (Строка №"+Строка.НомерСтроки+")";
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПриборУчета()
	
    СообщениеОбОшибке = ПроверитьЗаполнениеРеквизитов("ПриборыУчета");
	Если СообщениеОбОшибке <> "" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Элементы справочника не удалось создать. "+СообщениеОбОшибке;
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	Если ПроверитьТаблицуНаПустоту("ПриборыУчета") Тогда
		
		СообщениеОбОшибке = "Нет строк отмеченных для загрузки.";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Элементы справочника не удалось создать. "+СообщениеОбОшибке;
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	Для каждого Строка Из Объект.ТаблицаПриборовУчета Цикл
		
		Если Строка.Загружать = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Счетчик = Справочники.ПриборыУчета.СоздатьЭлемент();
		Счетчик.Услуга = Строка.Услуга;
		Счетчик.ЕдиницаИзмерения = Строка.ЕдиницаИзмерения;
		Счетчик.Разрядность = Строка.Разрядность;
		Счетчик.Коэффициент = Строка.Коэффициент;
		Счетчик.Тарифность = Строка.Тарифность;
		Счетчик.ЗаводскойНомер = Строка.ЗаводскойНомер;

		Попытка
			Счетчик.Записать();
			СоздатьДокументУстановкиПрибораУчета(Счетчик.Ссылка, Строка)
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Элемент не удалось создать. (Строка №"+Строка.НомерСтроки+")";
			Сообщение.Сообщить();
		КонецПопытки;

	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//ГРУППА СОЗДАНИЯ ДОКУМЕНТОВ

&НаСервере
Процедура СоздатьДокументОткрытиеЛС(ЛицевойСчет, КоличествоПроживающих, КоличествоПрописанных, ОтветственныйВладелец);
	
	ОткрытиеЛС = Документы.ОткрытиеЛицевогоСчета.СоздатьДокумент();
	ОткрытиеЛС.ЛицевойСчет = ЛицевойСчет;
	ОткрытиеЛС.Здание = Здание;
	ОткрытиеЛС.Организация = Объект.Организация;
	ОткрытиеЛС.КоличествоПроживающих = КоличествоПроживающих;
	ОткрытиеЛС.КоличествоПрописанных = КоличествоПрописанных;
	ОткрытиеЛС.ОтветственныйВладелец = ОтветственныйВладелец;
	ОткрытиеЛС.Дата = Дата;
	ОткрытиеЛС.Комментарий = "Документ сформирован обработкой ""Ввод начальных остатков"".";
	
	ОткрытиеЛС.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);			
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументВводОстатков()
	
	СообщениеОбОшибке = ПроверитьЗаполнениеРеквизитов("НачальныеОстатки");
	Если СообщениеОбОшибке <> "" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документ ввода начальных остатков не удалось создать. "+СообщениеОбОшибке;
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
		
	Если ПроверитьТаблицуНаПустоту("НачальныеОстатки") Тогда
		
		СообщениеОбОшибке = "Нет строк отмеченных для загрузки.";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документ ввода начальных остатков не удалось создать. "+СообщениеОбОшибке;
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;

	
	ВводНО = Документы.ВводНачальныхОстатков.СоздатьДокумент();
	ВводНО.РазделУчета = "Лицевые счета";
	ВводНО.Организация = Объект.Организация;
	ВводНО.Комментарий = "Документ сформирован обработкой ""Ввод начальных остатков"".";
	ВводНО.Дата = Дата;
	Для каждого Строка из Объект.ТаблицаНачальныхОстатков Цикл
		Если Строка.Загружать = Истина Тогда
			
			НоваяСтрока = ВводНО.ЛицевыеСчета.Добавить();
			НоваяСтрока.Здание = Здание;
			НоваяСтрока.ЛицевойСчет = Строка.ЛицевойСчет;
			НоваяСтрока.Услуга = Строка.Услуга;
			НоваяСтрока.МесяцНачисления = Строка.МесяцНачисления;
			НоваяСтрока.Сумма = Строка.Сумма;
			
		КонецЕсли;		
	КонецЦикла;
	
	ВводНО.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);			
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументУстановкиПрибораУчета(Счетчик,Строка)
		
	Установка = Документы.УправлениеПриборамиУчета.СоздатьДокумент();
	Установка.ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.УстановкаПрибораУчета;
	Установка.ОбъектУстановки = Строка.ЛицевойСчет;
	Установка.Здание = Здание;
	Установка.Организация = Объект.Организация;
	Установка.Комментарий = "Документ сформирован обработкой ""Ввод начальных остатков"".";
	Установка.Дата = ТекущаяДата();
				
	НоваяСтрока = Установка.ПриборыУчета.Добавить();
	НоваяСтрока.ДатаВключения = Строка.ДатаВключения;
	НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
	НоваяСтрока.НачальноеПоказание = Строка.НачальноеПоказание;
	НоваяСтрока.ПриборУчета = Счетчик;
	
	Установка.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыУправленияУслугами()
	
	Если ПроверитьТаблицуНаПустоту("НачальныеОстатки") Тогда
		
		СообщениеОбОшибке = "Нет строк отмеченных для загрузки.";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документы управления услугами не удалось создать. "+СообщениеОбОшибке;
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		
		СообщениеОбОшибке = "Нет строк отмеченных для загрузки.";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документ управления услугами не удалось создать. Дата не указана.";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	Таблица = Объект.ТаблицаНачальныхОстатков.Выгрузить();
	ТаблицаЛС = Таблица.Скопировать(,"ЛицевойСчет,Услуга");
	Менеджер=Новый МенеджерВременныхТаблиц;
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ТаблицаЛС.ЛицевойСчет,
	|	ТаблицаЛС.Услуга
	|ПОМЕСТИТЬ ТаблицаЛС
	|ИЗ
	|	&ТаблицаЛС КАК ТаблицаЛС";
	Запрос.УстановитьПараметр("ТаблицаЛС",ТаблицаЛС);
	Запрос.МенеджерВременныхТаблиц=Менеджер;
	Результат=Запрос.Выполнить();
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ТаблицаЛС.ЛицевойСчет,
	|	ТаблицаЛС.Услуга
	|ИЗ
	|	ТаблицаЛС КАК ТаблицаЛС
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЛС.ЛицевойСчет,
	|	ТаблицаЛС.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаЛС.ЛицевойСчет
	|АВТОУПОРЯДОЧИВАНИЕ";

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();
    ПредыдущийЛС = Справочники.ЛицевыеСчета.ПустаяСсылка();
	Пока Выборка.Следующий() Цикл
		Если ПредыдущийЛС = Справочники.ЛицевыеСчета.ПустаяСсылка() Тогда
			ПредыдущийЛС = Выборка.ЛицевойСчет;
			
			Документ = Документы.УправлениеУслугами.СоздатьДокумент();
			Документ.Дата = Дата;
			Документ.Здание = ПредыдущийЛС.Владелец;
			Документ.Организация = Документ.Здание.Владелец;
			Документ.Комментарий = "Документ сформирован обработкой ""Ввод начальных остатков"".";
			НовыйСчет = Документ.ЛицевыеСчета.Добавить();
			НовыйСчет.ЛицевойСчет = ПредыдущийЛС;			
			НоваяУслуга = Документ.Услуги.Добавить();
			НоваяУслуга.Услуга = Выборка.Услуга;
					
		ИначеЕсли ПредыдущийЛС = Выборка.ЛицевойСчет Тогда
			
			НоваяУслуга = Документ.Услуги.Добавить();
			НоваяУслуга.Услуга = Выборка.Услуга;

		ИначеЕсли ПредыдущийЛС <> Выборка.ЛицевойСчет Тогда
			Документ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			
			ПредыдущийЛС = Выборка.ЛицевойСчет;
			
			Документ = Документы.УправлениеУслугами.СоздатьДокумент();
			Документ.Дата = Дата;
			Документ.Здание = ПредыдущийЛС.Владелец;
			Документ.Организация = Документ.Здание.Владелец;
			Документ.Комментарий = "Документ сформирован обработкой ""Ввод начальных остатков"".";
			НовыйСчет = Документ.ЛицевыеСчета.Добавить();
			НовыйСчет.ЛицевойСчет = ПредыдущийЛС;			
			НоваяУслуга = Документ.Услуги.Добавить();
			НоваяУслуга.Услуга = Выборка.Услуга;

		КонецЕсли;
	КонецЦикла;
	
	Документ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//ГРУППА СОХРАНЕНИЯ В РЕГИСТРЫ

&НаСервере
Процедура ЗаписатьПлощадиЗдания(Сооружение, Строка)
	
	НаборВидыПлощадей = РегистрыСведений.ПлощадьЗданий.СоздатьНаборЗаписей();
	
	Если Строка.ЖилаяПлощадь <> 0 тогда
		
		НаборВидыПлощадей.Отбор.Здание.Установить(Сооружение);
		НаборВидыПлощадей.Отбор.ВидПлощади.Установить(Справочники.ВидыПлощадей.ЖилаяПолощадь);
		
		НаборВидыПлощадей.Прочитать();
		
		НоваяПлощадь = НаборВидыПлощадей.Добавить();
		НоваяПлощадь.Здание = Сооружение;
		НоваяПлощадь.ВидПлощади = Справочники.ВидыПлощадей.ЖилаяПолощадь;
		
		НоваяПлощадь.Площадь =  Строка.ЖилаяПлощадь;
		НаборВидыПлощадей.Записать();
		
	КонецЕсли;
	
	Если Строка.ОбщаяПлощадь <> 0 тогда
		
		НаборВидыПлощадей.Отбор.Здание.Установить(Сооружение);
		НаборВидыПлощадей.Отбор.ВидПлощади.Установить(Справочники.ВидыПлощадей.ОбщаяПлощадь);
		
		НаборВидыПлощадей.Прочитать();
		
		НоваяПлощадь = НаборВидыПлощадей.Добавить();
		НоваяПлощадь.Здание = Сооружение;
		НоваяПлощадь.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь;
		
		НоваяПлощадь.Площадь =  Строка.ОбщаяПлощадь;
		НаборВидыПлощадей.Записать();
		
	КонецЕсли;
	
	Если Строка.ОтапливаемаяПлощадь <> 0 тогда
		
		НаборВидыПлощадей.Отбор.Здание.Установить(Сооружение);
		НаборВидыПлощадей.Отбор.ВидПлощади.Установить(Справочники.ВидыПлощадей.ОтапливаемаяПлощадь);
		
		НаборВидыПлощадей.Прочитать();
		
		НоваяПлощадь = НаборВидыПлощадей.Добавить();
		НоваяПлощадь.Здание = Сооружение;
		НоваяПлощадь.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь;
		
		НоваяПлощадь.Площадь =  Строка.ОтапливаемаяПлощадь;
		НаборВидыПлощадей.Записать();
		
	КонецЕсли;
	
	Если Строка.ДополнительнаяПлощадь <> 0 тогда
		
		НаборВидыПлощадей.Отбор.Здание.Установить(Сооружение);
		НаборВидыПлощадей.Отбор.ВидПлощади.Установить(Справочники.ВидыПлощадей.ДополнительнаяПлощадь);
		
		НаборВидыПлощадей.Прочитать();
		
		НоваяПлощадь = НаборВидыПлощадей.Добавить();
		НоваяПлощадь.Здание = Сооружение;
		НоваяПлощадь.ВидПлощади = Справочники.ВидыПлощадей.ДополнительнаяПлощадь;
		
		НоваяПлощадь.Площадь =  Строка.ДополнительнаяПлощадь;
		НаборВидыПлощадей.Записать();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьПлощадиОбъектов(Помещение, Строка)
	
	НаборВидыПлощадей = РегистрыСведений.ПлощадьОбъектовЛицевыхСчетов.СоздатьНаборЗаписей();
	
	Если Строка.ЖилаяПлощадь <> 0 тогда
		
		НаборВидыПлощадей.Отбор.Помещение.Установить(Помещение);
		НаборВидыПлощадей.Отбор.ВидПлощади.Установить(Справочники.ВидыПлощадей.ЖилаяПолощадь);
		НаборВидыПлощадей.Отбор.Период.Установить(Дата);
		
		НаборВидыПлощадей.Прочитать();
		
		НоваяПлощадь = НаборВидыПлощадей.Добавить();
		НоваяПлощадь.Помещение = Помещение;
		НоваяПлощадь.ВидПлощади = Справочники.ВидыПлощадей.ЖилаяПолощадь;
		НоваяПлощадь.Период = Дата;
		
		НоваяПлощадь.Площадь =  Строка.ЖилаяПлощадь;
		НаборВидыПлощадей.Записать();
		
	КонецЕсли;
	
	Если Строка.ОбщаяПлощадь <> 0 тогда
		
		НаборВидыПлощадей.Отбор.Помещение.Установить(Помещение);
		НаборВидыПлощадей.Отбор.ВидПлощади.Установить(Справочники.ВидыПлощадей.ОбщаяПлощадь);
		
		НаборВидыПлощадей.Прочитать();
		
		НоваяПлощадь = НаборВидыПлощадей.Добавить();
		НоваяПлощадь.Помещение = Помещение;
		НоваяПлощадь.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь;
		НоваяПлощадь.Период = Дата;
		
		НоваяПлощадь.Площадь =  Строка.ОбщаяПлощадь;
		НаборВидыПлощадей.Записать();
		
	КонецЕсли;
	
	Если Строка.ОтапливаемаяПлощадь <> 0 тогда
		
		НаборВидыПлощадей.Отбор.Помещение.Установить(Помещение);
		НаборВидыПлощадей.Отбор.ВидПлощади.Установить(Справочники.ВидыПлощадей.ОтапливаемаяПлощадь);
		
		НаборВидыПлощадей.Прочитать();
		
		НоваяПлощадь = НаборВидыПлощадей.Добавить();
		НоваяПлощадь.Помещение = Помещение;
		НоваяПлощадь.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь;
		НоваяПлощадь.Период = Дата;
		
		НоваяПлощадь.Площадь =  Строка.ОтапливаемаяПлощадь;
		НаборВидыПлощадей.Записать();
		
	КонецЕсли;
	
	Если Строка.ДополнительнаяПлощадь <> 0 тогда
		
		НаборВидыПлощадей.Отбор.Помещение.Установить(Помещение);
		НаборВидыПлощадей.Отбор.ВидПлощади.Установить(Справочники.ВидыПлощадей.ДополнительнаяПлощадь);
		
		НаборВидыПлощадей.Прочитать();
		
		НоваяПлощадь = НаборВидыПлощадей.Добавить();
		НоваяПлощадь.Помещение = Помещение;
		НоваяПлощадь.ВидПлощади = Справочники.ВидыПлощадей.ДополнительнаяПлощадь;
		НоваяПлощадь.Период = Дата;
		
		НоваяПлощадь.Площадь =  Строка.ДополнительнаяПлощадь;
		НаборВидыПлощадей.Записать();
		
	КонецЕсли;

КонецПроцедуры
////////////////////////////////////////////////////////////////////////////////
//ГРУППА ПОМЕТКИ

&НаКлиенте
Процедура ОтметитьЗдания(Команда)
	
	Для каждого Строка из Объект.ТаблицаЗданий Цикл
		Строка.Загружать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьОбъекты(Команда)
	
	Для каждого Строка из Объект.ТаблицаОбъектовЛС Цикл
		Строка.Загружать = Истина;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьФизЛица(Команда)
	
	Для каждого Строка из Объект.ТаблицаФизЛиц Цикл
		Строка.Загружать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуСОбъектов(Команда)
	
	Для каждого Строка из Объект.ТаблицаОбъектовЛС Цикл
		Строка.Загружать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуСоЗданий(Команда)
	
	Для каждого Строка из Объект.ТаблицаЗданий Цикл
		Строка.Загружать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуСФизическихЛиц(Команда)
	
	Для каждого Строка из Объект.ТаблицаФизЛиц Цикл
		Строка.Загружать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьЛицевыеСчета(Команда)
	
	Для каждого Строка из Объект.ТаблицаЛицевыхСчетов Цикл
		Строка.Загружать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуСЛицевыхСчетов(Команда)
	
	Для каждого Строка из Объект.ТаблицаЛицевыхСчетов Цикл
		Строка.Загружать = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВзаиморасчеты(Команда)
	
	Для каждого Строка из Объект.ТаблицаНачальныхОстатков Цикл
		Строка.Загружать = Истина;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуСоВзаиморасчетов(Команда)
	
	Для каждого Строка из Объект.ТаблицаНачальныхОстатков Цикл
		Строка.Загружать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
//ГРУППА ПРОВЕРКА УНИКАЛЬНОСТИ

&НаСервере
Процедура ПроверитьУникальность(МестоВызова)
	
	Если МестоВызова = "Здания" Тогда
		Таблица = Объект.ТаблицаЗданий;
	ИначеЕсли МестоВызова = "ОбъектыЛС" Тогда
		Таблица = Объект.ТаблицаОбъектовЛС;
    ИначеЕсли МестоВызова = "ФизЛица" Тогда
		Таблица = Объект.ТаблицаФизЛиц;
    ИначеЕсли МестоВызова = "ЛицевыеСчета" Тогда
		Таблица = Объект.ТаблицаЛицевыхСчетов;
	ИначеЕсли МестоВызова = "ПриборыУчета" Тогда
		Таблица = Объект.ТаблицаПриборовУчета;
    ИначеЕсли МестоВызова = "НачальныеОстатки" Тогда
		Таблица = Объект.ТаблицаНачальныхОстатков;
	КонецЕсли;
	
	Выборка = ПолучитьВыборкуДляПроверки(МестоВызова);
	Если Выборка = Ложь Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Строка из Таблица Цикл
		
		Если Выборка.Количество() = 0 Тогда
			Строка.Уникальность = Истина;
			Строка.Загружать = Истина;
		КонецЕсли;
		
		Выборка.Сбросить();
		
		Пока Выборка.Следующий() Цикл
			Если МестоВызова = "Здания" Тогда
				Если ПолучитьНаименованиеЗдания(Строка) = Выборка.Наименование Тогда
					Строка.Уникальность = Ложь;
					Строка.Загружать = Ложь;
					Прервать;
				КонецЕсли;
			ИначеЕсли МестоВызова = "ОбъектыЛС" Тогда
				Если Строка.НомерКвартиры = Строка(Выборка.Код) 
					И Строка.Суффикс = Выборка.Суффикс Тогда
					Строка.Уникальность = Ложь;
					Строка.Загружать = Ложь;
					Прервать;
				КонецЕсли;
			ИначеЕсли МестоВызова = "ФизЛица" Тогда
				Если Строка.ИНН = Выборка.ИНН Тогда
					Строка.Уникальность = Ложь;
					Строка.Загружать = Ложь;
					Прервать;
				ИначеЕсли Строка.ФИО = Выборка.Наименование 
					И Строка.ДатаРождения = Выборка.ДатаРождения Тогда
					Строка.Уникальность = Ложь;
					Строка.Загружать = Ложь;
					Прервать;
				КонецЕсли;
			ИначеЕсли МестоВызова = "ЛицевыеСчета" Тогда
				Если Строка.ОбъектЛицевогоСчета = Выборка.ОбъектЛицевогоСчета Тогда
					Строка.Уникальность = Ложь;
					Строка.Загружать = Ложь;
					Прервать;
				КонецЕсли;
			ИначеЕсли МестоВызова = "ПриборыУчета" Тогда
				Если Строка.ЗаводскойНомер = Выборка.ЗаводскойНомер Тогда
					Строка.Уникальность = Ложь;
					Строка.Загружать = Ложь;
					Прервать;
				КонецЕсли;
			ИначеЕсли МестоВызова = "НачальныеОстатки" Тогда
				Если Строка.ЛицевойСчет = Выборка.ЛицевойСчет 
					И Строка.Услуга = Выборка.Услуга 
					И Строка.МесяцНачисления = Выборка.МесяцНачисления Тогда
					Строка.Уникальность = Ложь;
					Строка.Загружать = Ложь;
					Прервать;
				КонецЕсли;
			КонецЕсли;
			Строка.Уникальность = Истина;
			Строка.Загружать = Истина;
		КонецЦикла;
				
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВыборкуДляПроверки(МестоВызова)
	
	Попытка
		Если МестоВызова = "Здания" Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗданияИСооруженияКонтактнаяИнформация.Ссылка,
			|	ЗданияИСооруженияКонтактнаяИнформация.Ссылка.Наименование КАК Наименование
			|ИЗ
			|	Справочник.ЗданияИСооружения.КонтактнаяИнформация КАК ЗданияИСооруженияКонтактнаяИнформация
			|ГДЕ
			|	ЗданияИСооруженияКонтактнаяИнформация.Ссылка.Организация = &Организация";
			
			Запрос.УстановитьПараметр("Организация", Объект.Организация);
			
		ИначеЕсли МестоВызова = "ОбъектыЛС" Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОбъектыЛицевыхСчетов.Ссылка,
			|	ОбъектыЛицевыхСчетов.Код,
			|	ОбъектыЛицевыхСчетов.Суффикс
			|ИЗ
			|	Справочник.ОбъектыЛицевыхСчетов КАК ОбъектыЛицевыхСчетов
			|ГДЕ
			|	ОбъектыЛицевыхСчетов.Владелец = &Владелец";
			
			Запрос.УстановитьПараметр("Владелец", Здание);
			
		ИначеЕсли МестоВызова = "ФизЛица" Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФизическиеЛица.Ссылка,
			|	ФизическиеЛица.ИНН,
			|	ФизическиеЛица.Наименование,
			|	ФизическиеЛица.ДатаРождения
			|ИЗ
			|	Справочник.ФизическиеЛица КАК ФизическиеЛица";
						
		ИначеЕсли МестоВызова = "ЛицевыеСчета" Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЛицевыеСчета.Ссылка,
			|	ЛицевыеСчета.ОбъектЛицевогоСчета
			|ИЗ
			|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
			|ГДЕ
			|	ЛицевыеСчета.Владелец = &Владелец";
			
			Запрос.УстановитьПараметр("Владелец", Здание);
			
		ИначеЕсли МестоВызова = "ПриборыУчета" Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПриборыУчета.Ссылка,
			|	ПриборыУчета.ЗаводскойНомер
			|ИЗ
			|	Справочник.ПриборыУчета КАК ПриборыУчета";

		ИначеЕсли МестоВызова = "НачальныеОстатки" Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВводНачальныхОстатковЛицевыеСчета.Ссылка.Ссылка КАК Ссылка,
			|	ВводНачальныхОстатковЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
			|	ВводНачальныхОстатковЛицевыеСчета.Услуга КАК Услуга,
			|	ВводНачальныхОстатковЛицевыеСчета.МесяцНачисления КАК МесяцНачисления
			|ИЗ
			|	Документ.ВводНачальныхОстатков.ЛицевыеСчета КАК ВводНачальныхОстатковЛицевыеСчета
			|ГДЕ
			|	ВводНачальныхОстатковЛицевыеСчета.Здание = &Здание";
			
			Запрос.УстановитьПараметр("Здание", Здание);
			
		КонецЕсли;
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
				
		Возврат Выборка;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Табличный документ заполнен не правильно.";
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ДРУГИЕ ФУНКЦИИ

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ПутьКФайлу;
	Фильтр = "Электронная таблица Excel(*.xls)|*.xls";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыЗданий()
	
	Для каждого Строка из Объект.ТаблицаЗданий Цикл
		
		Если Строка.ТипСооруженияНаименование = "Здание" Тогда
			Строка.ТипСооружения = Перечисления.ТипыСооружений.Здание;
		ИначеЕсли Строка.ТипСооруженияНаименование = "Паркинг" Тогда
			Строка.ТипСооружения = Перечисления.ТипыСооружений.Паркинг;
		ИначеЕсли Строка.ТипСооруженияНаименование = "Общежитие" Тогда
			Строка.ТипСооружения = Перечисления.ТипыСооружений.Общежитие;
		Иначе
			Строка.ТипСооружения = Перечисления.ТипыСооружений.ПустаяСсылка();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименованиеЗдания(Строка)
	
	Наименование ="";
	
	Если Строка.НомерДома <> "" Тогда
		Наименование = Наименование + "дом №" + Строка.НомерДома;
	КонецЕсли;
	Если Строка.Корпус <> "" Тогда
		Наименование = Наименование + ", корпус" + Строка.Корпус;
	КонецЕсли;
	Если Строка.Улица <> "" Тогда
		Наименование = Наименование + ", " + Строка.Улица;
	КонецЕсли;
	Если Строка.Район <> "" Тогда
		Наименование = Наименование + ", " + Строка.Район;
	КонецЕсли;
	Если Строка.Город <> "" Тогда
		Наименование = Наименование + ", " + Строка.Город;
	КонецЕсли;
	Если Строка.Область <> "" Тогда
		Наименование = Наименование + ", " + Строка.Область;
	КонецЕсли;
	Если Строка.Индекс <> "" Тогда
		Наименование = Наименование + ", " + Строка.Индекс;
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыОбъектовЛС()
		
	Для Каждого Строка из Объект.ТаблицаОбъектовЛС Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Подъезды.Ссылка
		               |ИЗ
		               |	Справочник.Подъезды КАК Подъезды
		               |ГДЕ
		               |	Подъезды.Владелец = &Владелец
		               |	И Подъезды.НомерПодъезда = &НомерПодъезда";
		
		Запрос.УстановитьПараметр("Владелец",Здание);
		Запрос.УстановитьПараметр("НомерПодъезда",Строка.ПодъездКод);
		
		СсылкаНаПодьезд = Запрос.Выполнить().Выгрузить();
		
		Если СсылкаНаПодьезд.Количество() = 0 Тогда
			СсылкаНаПодьезд = Справочники.Подъезды.СоздатьЭлемент();
			СсылкаНаПодьезд.НомерПодъезда = Строка.ПодъездКод;
			СсылкаНаПодьезд.Вид = "Подъезд";
			СсылкаНаПодьезд.Владелец = Здание;
			СсылкаНаПодьезд.ОбменДанными.Загрузка = Истина;
			СсылкаНаПодьезд.Наименование = "Подъезд № " + Строка.ПодъездКод;
			
			СсылкаНаПодьезд.Записать();
			Строка.Подъезд = СсылкаНаПодьезд.Ссылка;
		Иначе
			Строка.Подъезд = СсылкаНаПодьезд[0].Ссылка;
		КонецЕсли;
		
		Если Строка.ЖилойФондНаименование = "Нежилой фонд" 
			ИЛИ Строка.ЖилойФондНаименование = "Нет" 
			ИЛИ Строка.ЖилойФондНаименование = 0 Тогда
			Строка.ЖилойФонд = Перечисления.ЖилойНеЖилойФонд.НеЖилой;	
		Иначе
			Строка.ЖилойФонд = Перечисления.ЖилойНеЖилойФонд.Жилой;
		КонецЕсли;
		
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПроверитьПолФизЛица(Значение)
	
	Если Значение = "Жен" ИЛИ Значение = "Ж" ИЛИ Значение = "Женский" Тогда
		
		Возврат Перечисления.ПолФизическогоЛица.Женский;
		
	Иначе
		
		Возврат Перечисления.ПолФизическогоЛица.Мужской;
	
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьНаименованиеОбъектаЛС(Строка)

	Если Строка.ЖилойФонд = Перечисления.ЖилойНеЖилойФонд.Жилой Тогда
		Наименование = "кв. №" + Прав("    "+Строка.НомерКвартиры,4) + Строка.Суффикс;
	Иначе
		Наименование = "оф. №" + Прав("    "+Строка.НомерКвартиры,4) + Строка.Суффикс;
	КонецЕсли;

	Возврат Наименование;
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеРеквизитов(МестоВызова)
	
	Если МестоВызова = "ОбъектыЛС" Тогда
		
		Если НЕ ЗначениеЗаполнено(Здание) Тогда
			Возврат "Здание не указано."
		ИначеЕсли НЕ ЗначениеЗаполнено(Дата) Тогда
			Возврат "Дата (для площадей) не указана."
		Иначе
			Возврат ""
		КонецЕсли;
		
	ИначеЕсли МестоВызова = "Здания" Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Возврат "Организация не указана."
		Иначе
			Возврат ""
		КонецЕсли;
		
	ИначеЕсли МестоВызова = "НачальныеОстатки" Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Возврат "Организация не указана."
		ИначеЕсли НЕ ЗначениеЗаполнено(Здание) Тогда
			Возврат "Здание не указано."
		ИначеЕсли НЕ ЗначениеЗаполнено(Дата) Тогда
			Возврат "Дата не указана."
		ИначеЕсли НЕ ПроверитьРеквизитыТаблицы(МестоВызова) Тогда
			Возврат "В таблице заполнены не все реквизиты."
		Иначе
			Возврат ""
		КонецЕсли;
		
	ИначеЕсли МестоВызова = "ПриборыУчета" Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Возврат "Организация не указана."
		ИначеЕсли НЕ ЗначениеЗаполнено(Здание) Тогда
			Возврат "Здание не указано."
		ИначеЕсли НЕ ПроверитьРеквизитыТаблицы(МестоВызова) Тогда
			Возврат "В таблице заполнены не все реквизиты."
		Иначе
			Возврат ""
		КонецЕсли;

	Иначе
		
		Возврат ""

	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОФорматеНажатие(Элемент)
	ОткрытьСправкуФормы();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Услуги.Ссылка
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|ГДЕ
		|	Услуги.ЭтоГруппа = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыПломбПриборовУчета.Ссылка
		|ИЗ
		|	Справочник.ВидыПломбПриборовУчета КАК ВидыПломбПриборовУчета
		|ГДЕ
		|	ВидыПломбПриборовУчета.ПометкаУдаления = ЛОЖЬ";

	Результат = Запрос.ВыполнитьПакет();

	Выборка = Результат[0].Выбрать();

	Пока Выборка.Следующий() Цикл
		Услуга = СоответствиеУслуг.Добавить();
		Услуга.Услуга = Выборка.Ссылка;
	КонецЦикла;
	
	ВыборкаПломбы = Результат[1].Выбрать();

	Пока ВыборкаПломбы.Следующий() Цикл
		ВидПломбы = ВидыПломб.Добавить();
		ВидПломбы.ВидПломбы = ВыборкаПломбы.Ссылка;
	КонецЦикла;


КонецПроцедуры

&НаСервере
Функция ЗаполнитьУслуги(МестоВызова)
	
	Если МестоВызова = "ПриборыУчета" Тогда
		Таблица = Объект.ТаблицаПриборовУчета;
	ИначеЕсли МестоВызова = "НачальныеОстатки" Тогда
		Таблица = Объект.ТаблицаНачальныхОстатков;
	КонецЕсли;
	
	Для каждого Строка из Таблица Цикл
		Для каждого СтрокаСоответствия Из СоответствиеУслуг Цикл
			Если Строка.УслугаНаименование = СтрокаСоответствия.Наименование Тогда
				Строка.Услуга = СтрокаСоответствия.Услуга;
				Продолжить;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЛицевыеСчета(МестоВызова)
	
	Если МестоВызова = "ПриборыУчета" Тогда
		Таблица = Объект.ТаблицаПриборовУчета;
	ИначеЕсли МестоВызова = "НачальныеОстатки" Тогда
		Таблица = Объект.ТаблицаНачальныхОстатков;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛицевыеСчета.Ссылка,
		|	ЛицевыеСчета.ОбъектЛицевогоСчета.Код КАК НомерКвартиры,
		|	ЛицевыеСчета.ОбъектЛицевогоСчета.Суффикс КАК Суффикс
		|ИЗ
		|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
		|ГДЕ
		|	ЛицевыеСчета.Владелец = &Владелец
		|	И ЛицевыеСчета.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд";
		
	Запрос.УстановитьПараметр("Владелец", Здание);
	Запрос.УстановитьПараметр("ЖилойФонд", ?(МестоВызова = "ПриборыУчета",ЖилойФондПриборыУчета,ЖилойФондНачальныеОстатки));

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Для Каждого Строка ИЗ Таблица Цикл	
			Если Строка.НомерКвартиры = Строка(Выборка.НомерКвартиры)
				И Строка.Суффикс = Выборка.Суффикс Тогда
				Строка.ЛицевойСчет = Выборка.Ссылка;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыСчетчиков()
	
	Для каждого Строка из Объект.ТаблицаПриборовУчета Цикл
		//Строка.Услуга = Справочники.Услуги.НайтиПоНаименованию(Строка.УслугаНаименование);
		Строка.ЕдиницаИзмерения = Строка.Услуга.ЕдиницаИзмерения;
		
		Если Строка.СпособРегистрацииНаименование = "Расход за период расчета" Тогда	
			Строка.СпособРегистрацииПоказаний = Перечисления.СпособыРегистрацииПоказанийСчетчиков.РасходЗаПериодРасчета;
		Иначе
			Строка.СпособРегистрацииПоказаний = Перечисления.СпособыРегистрацииПоказанийСчетчиков.НарастающимИтогом;
		КонецЕсли;
		
		Если Строка.ТарифностьНаименование = "3" Тогда	
			Строка.Тарифность = Перечисления.ТарифностьСчетчиков.Трехтарифный;
		ИначеЕсли Строка.ТарифностьНаименование = "2" Тогда
			Строка.Тарифность = Перечисления.ТарифностьСчетчиков.Двухтарифный;
		Иначе
			Строка.Тарифность = Перечисления.ТарифностьСчетчиков.Однотарифный;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыЛС()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	""ОбъектЛС"" КАК Вид,
		|	ОбъектыЛицевыхСчетов.Ссылка,
		|	ОбъектыЛицевыхСчетов.Код КАК Код,
		|	ОбъектыЛицевыхСчетов.Суффикс
		|ИЗ
		|	Справочник.ОбъектыЛицевыхСчетов КАК ОбъектыЛицевыхСчетов
		|ГДЕ
		|	ОбъектыЛицевыхСчетов.Владелец = &Владелец
		|	И ОбъектыЛицевыхСчетов.ЖилойФонд = &ЖилойФонд
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Потребитель"",
		|	ПотребителиУслуг.Ссылка,
		|	ПотребителиУслуг.Наименование,
		|	NULL
		|ИЗ
		|	Справочник.ПотребителиУслуг КАК ПотребителиУслуг";

	Запрос.УстановитьПараметр("Владелец", Здание);
	Запрос.УстановитьПараметр("ЖилойФонд", ЖилойФондЛицевыеСчета);

	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Для каждого Строка из Объект.ТаблицаЛицевыхСчетов Цикл
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Строка.ОбъектЛицевогоСчета) 
				И ЗначениеЗаполнено(Строка.ОтветственныйВладелец) Тогда
				Прервать;
			ИначеЕсли Выборка.Вид = "ОбъектЛС" Тогда
				Если Число(Строка.НомерКвартиры) = Выборка.Код 
					И Строка.Суффикс = Выборка.Суффикс Тогда
					Строка.ОбъектЛицевогоСчета = Выборка.Ссылка;
				КонецЕсли;		
			ИначеЕсли Выборка.Вид = "Потребитель" Тогда
				Если Строка.ОтветственныйВладелецФИО = Выборка.Код Тогда
					Строка.ОтветственныйВладелец = Выборка.Ссылка;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПриборовУчетаУслугаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаПриборовУчета.ТекущиеДанные;
	ТекущиеДанные.ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения(ТекущиеДанные.Услуга);
КонецПроцедуры

&НаСервере
Функция ПолучитьЕдиницуИзмерения(Услуга)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Услуги.Ссылка,
		|	Услуги.ЕдиницаИзмерения
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|ГДЕ
		|	Услуги.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Услуга);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ЕдиницаИзмерения;
	КонецЦикла;

КонецФункции

&НаСервере
Функция ПроверитьРеквизитыТаблицы(МестоВызова)
	
	Если МестоВызова = "ПриборыУчета" Тогда
		
		Таблица = Объект.ТаблицаПриборовУчета;
		
		Для Каждого Строка из Таблица Цикл
			Если Строка.Загружать = Истина Тогда
				
				Если НЕ ЗначениеЗаполнено(Строка.ЗаводскойНомер) Тогда
					Возврат  Ложь;
				ИначеЕсли НЕ ЗначениеЗаполнено(Строка.Тарифность) Тогда
					Возврат  Ложь;
				ИначеЕсли НЕ ЗначениеЗаполнено(Строка.Разрядность) Тогда
					Возврат  Ложь;
				ИначеЕсли НЕ ЗначениеЗаполнено(Строка.Коэффициент) Тогда
					Возврат  Ложь;
				ИначеЕсли НЕ ЗначениеЗаполнено(Строка.СпособРегистрацииПоказаний) Тогда
					Возврат  Ложь;
				ИначеЕсли НЕ ЗначениеЗаполнено(Строка.ДатаВключения) Тогда
					Возврат  Ложь;
				ИначеЕсли НЕ ЗначениеЗаполнено(Строка.Услуга) Тогда
					Возврат  Ложь;
				ИначеЕсли НЕ ЗначениеЗаполнено(Строка.ЛицевойСчет) Тогда
					Возврат  Ложь;
				ИначеЕсли НЕ ЗначениеЗаполнено(Строка.ЕдиницаИзмерения) Тогда
					Возврат  Ложь;
				Иначе
					Возврат Истина;
				КонецЕсли;
			
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли МестоВызова = "НачальныеОстатки" Тогда
		
		Таблица = Объект.ТаблицаНачальныхОстатков;
		
		Для Каждого Строка из Таблица Цикл
			Если Строка.Загружать = Истина Тогда
				
				Если НЕ ЗначениеЗаполнено(Строка.ЛицевойСчет) Тогда
					Возврат  Ложь;
				ИначеЕсли НЕ ЗначениеЗаполнено(Строка.Сумма) Тогда
					Возврат  Ложь;
				Иначе
					Возврат Истина;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПроверитьТаблицуНаПустоту(МестоВызова)

	Если МестоВызова = "Здания" Тогда
		Таблица = Объект.ТаблицаЗданий;
	ИначеЕсли МестоВызова = "ОбъектыЛС" Тогда
		Таблица = Объект.ТаблицаОбъектовЛС;
    ИначеЕсли МестоВызова = "ФизЛица" Тогда
		Таблица = Объект.ТаблицаФизЛиц;
    ИначеЕсли МестоВызова = "ЛицевыеСчета" Тогда
		Таблица = Объект.ТаблицаЛицевыхСчетов;
	ИначеЕсли МестоВызова = "ПриборыУчета" Тогда
		Таблица = Объект.ТаблицаПриборовУчета;
    ИначеЕсли МестоВызова = "НачальныеОстатки" Тогда
		Таблица = Объект.ТаблицаНачальныхОстатков;
    КонецЕсли;
	
	ПустаяТаблица = Истина;
	
	Для каждого Строка из Таблица Цикл
		Если Строка.Загружать = Истина Тогда
			ПустаяТаблица = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПустаяТаблица;
	
КонецФункции

&НаКлиенте
Процедура ОтметитьПриборыУчета(Команда)
	Для каждого Строка из Объект.ТаблицаПриборовУчета Цикл
		Строка.Загружать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуСПриборовУчета(Команда)
	Для каждого Строка из Объект.ТаблицаПриборовУчета Цикл
		Строка.Загружать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаВидеоУрок(Команда)
	
	НавигационнаяСсылка = "https://www.youtube.com/watch?v=UbaluKFQ96k";
	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);

КонецПроцедуры


