
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУправлениеТарифами, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
    Запрос.Текст =
		 "ВЫБРАТЬ
		 |	УправлениеТарифамиТарифы.Ссылка.Организация,
		 |	УправлениеТарифамиТарифы.Ссылка.Здание,
		 |	УправлениеТарифамиТарифы.Ссылка.Дата КАК Период,
		 |	УправлениеТарифамиТарифы.ВидТарифа,
		 |	УправлениеТарифамиТарифы.ЗначениеТарифа,
		 |	УправлениеТарифамиТарифы.Услуга,
		 |	УправлениеТарифамиТарифы.НормаПотребления,
		 |	УправлениеТарифамиТарифы.ЗначениеТарифаПоНорме,
		 |	УправлениеТарифамиТарифы.ЗначениеСтимулирующегоТарифа,
		 |	УправлениеТарифамиТарифы.ЗначениеСтимулирующегоТарифаПоНорме,
		 |	УправлениеТарифамиТарифы.ЗначениеТарифаЛьгота,
		 |	УправлениеТарифамиТарифы.ЗначениеТарифаПоНормеЛьгота
		 |ИЗ
		 |	Документ.УправлениеТарифами.Тарифы КАК УправлениеТарифамиТарифы
		 |ГДЕ
		 |	УправлениеТарифамиТарифы.Ссылка = &Ссылка
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	УправлениеТарифамиТарифыУслугПодробно.Ссылка.Организация,
		 |	УправлениеТарифамиТарифыУслугПодробно.Ссылка.Здание,
		 |	УправлениеТарифамиТарифыУслугПодробно.Ссылка.Дата КАК Период,
		 |	УправлениеТарифамиТарифыУслугПодробно.Услуга,
		 |	УправлениеТарифамиТарифыУслугПодробно.УслугаПодробно,
		 |	УправлениеТарифамиТарифыУслугПодробно.ЗначениеТарифа,
		 |	УправлениеТарифамиТарифыУслугПодробно.ЗначениеСтимулирующегоТарифа,
		 |	УправлениеТарифамиТарифыУслугПодробно.ЗначениеТарифаЛьгота
		 |ИЗ
		 |	Документ.УправлениеТарифами.ТарифыУслугПодробно КАК УправлениеТарифамиТарифыУслугПодробно
		 |ГДЕ
		 |	УправлениеТарифамиТарифыУслугПодробно.Ссылка = &Ссылка
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	УправлениеТарифамиТарифыПороговые.Ссылка.Организация,
		 |	УправлениеТарифамиТарифыПороговые.Ссылка.Здание,
		 |	НАЧАЛОПЕРИОДА(УправлениеТарифамиТарифыПороговые.Ссылка.Дата, МЕСЯЦ) КАК Период,
		 |	УправлениеТарифамиТарифыПороговые.Услуга,
		 |	УправлениеТарифамиТарифыПороговые.ВидТарифа,
		 |	УправлениеТарифамиТарифыПороговые.Порог,
		 |	УправлениеТарифамиТарифыПороговые.ЗначениеПорога,
		 |	УправлениеТарифамиТарифыПороговые.ЗначениеТарифа,
		 |	УправлениеТарифамиТарифыПороговые.ЗначениеСтимулирующегоТарифа
		 |ИЗ
		 |	Документ.УправлениеТарифами.ТарифыПороговые КАК УправлениеТарифамиТарифыПороговые
		 |ГДЕ
		 |	УправлениеТарифамиТарифыПороговые.Ссылка = &Ссылка
		 |	И УправлениеТарифамиТарифыПороговые.ЗначениеПорога <> 0";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУправлениеТарифами);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаТарифы", РезультатЗапроса[0].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаТарифыУслугПодробно", РезультатЗапроса[1].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаТарифыПороговые", РезультатЗапроса[2].Выгрузить());
	
КонецПроцедуры
