////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТабличнойЧасти Из Тарифы Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидТарифа) Тогда
			СтрокаТабличнойЧасти.ВидТарифа = Перечисления.ВидыТарифов.Общий;
		КонецЕсли;
	КонецЦикла;	
	
	Для каждого СтрокаТабличнойЧасти Из ТарифыПороговые Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидТарифа) Тогда
			СтрокаТабличнойЧасти.ВидТарифа = Перечисления.ВидыТарифов.Общий;
		КонецЕсли;	
	КонецЦикла;	
	
	ТаблицаПроверки = ПроверкаУслугиПороговой();
	
	Если ТаблицаПроверки.Количество() > 0 Тогда
		
		ТекстСообщения = НСтр("ru='Изменены значения пороговых тарифов.';uk='Змінено значення порогових тарифів.'");
		
		ОСМДСервер.СообщитьОбОшибке(
			ТекстСообщения,
			ЭтотОбъект,
			Отказ
		);
		
	КонецЕсли; 	
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.УправлениеТарифами.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ПроведениеСервер.ОтразитьТарифы(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьТарифыУслугПодробно(ДополнительныеСвойства, Движения, Отказ);
	Если ПроверкаПервойзаписиУслугиПороговой() Тогда
		ПроведениеСервер.ОтразитьТарифыПороговые(ДополнительныеСвойства, Движения, Отказ);
	Иначе
		ПроведениеСервер.ОтразитьТарифыПороговые(ДополнительныеСвойства, Движения, Истина);
	КонецЕсли;
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Функция ПроверкаУслугиПороговой()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УправлениеТарифами.Услуга,
		|	УправлениеТарифами.ЗначениеСтимулирующегоТарифа,
		|	УправлениеТарифами.Порог,
		|	УправлениеТарифами.ЗначениеПорога,
		|	УправлениеТарифами.ЗначениеТарифа
		|ПОМЕСТИТЬ втУправлениеТарифами
		|ИЗ
		|	&УправлениеТарифами КАК УправлениеТарифами
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыПороговые.Порог,
		|	ТарифыПороговые.ЗначениеТарифа,
		|	ТарифыПороговые.ЗначениеПорога,
		|	ТарифыПороговые.ЗначениеСтимулирующегоТарифа,
		|	ТарифыПороговые.Услуга,
		|	втУправлениеТарифами.ЗначениеТарифа КАК ЗначениеТарифа1,
		|	втУправлениеТарифами.ЗначениеПорога КАК ЗначениеПорога1,
		|	втУправлениеТарифами.ЗначениеСтимулирующегоТарифа КАК ЗначениеСтимулирующегоТарифа1,
		|	втУправлениеТарифами.Услуга КАК Услуга1
		|ИЗ
		|	РегистрСведений.ТарифыПороговые КАК ТарифыПороговые
		|		ПОЛНОЕ СОЕДИНЕНИЕ втУправлениеТарифами КАК втУправлениеТарифами
		|		ПО ТарифыПороговые.Услуга = втУправлениеТарифами.Услуга
		|			И ТарифыПороговые.Порог = втУправлениеТарифами.Порог
		|			И (ТарифыПороговые.ЗначениеТарифа <> втУправлениеТарифами.ЗначениеТарифа
		|				ИЛИ ТарифыПороговые.ЗначениеПорога <> втУправлениеТарифами.ЗначениеПорога
		|				ИЛИ ВЫБОР
		|					КОГДА &ИспользоватьСтимулирующийТариф
		|						ТОГДА ТарифыПороговые.ЗначениеСтимулирующегоТарифа <> втУправлениеТарифами.ЗначениеСтимулирующегоТарифа
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ)
		|ГДЕ
		|	ТарифыПороговые.Период = &Период
		|	И ТарифыПороговые.Здание = &Здание
		|	И ТарифыПороговые.Регистратор <> &Ссылка
		|	И НЕ втУправлениеТарифами.Услуга ЕСТЬ NULL ";
		
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Дата));	
	Запрос.УстановитьПараметр("Здание", Здание);	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	Запрос.УстановитьПараметр("ИспользоватьСтимулирующийТариф", ПолучитьФункциональнуюОпцию("ИспользоватьСтимулирующийТариф"));	
	Запрос.УстановитьПараметр("УправлениеТарифами", ТарифыПороговые.Выгрузить());	
	
	ТаблицаПроверки = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПроверки;
	
КонецФункции

Функция ПроверкаПервойзаписиУслугиПороговой()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТарифыПороговые.Порог,
		|	ТарифыПороговые.ЗначениеТарифа,
		|	ТарифыПороговые.ЗначениеПорога,
		|	ТарифыПороговые.ЗначениеСтимулирующегоТарифа,
		|	ТарифыПороговые.Услуга
		|ИЗ
		|	РегистрСведений.ТарифыПороговые КАК ТарифыПороговые
		|ГДЕ
		|	ТарифыПороговые.Период = &Период
		|	И ТарифыПороговые.Здание = &Здание
		|	И ТарифыПороговые.Регистратор <> &Ссылка";
		
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Дата));	
	Запрос.УстановитьПараметр("Здание", Здание);	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Пустой();
	
КонецФункции
