

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураНастройки = Константы.НастройкаОбменДаннымиХвояСайтЖКХ.Получить().Получить();
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	
	Если ТипЗнч(СтруктураНастройки) = Тип("Структура") Тогда
		ФТППароль = СтруктураНастройки.Пароль;	
		ФТПЛогин = СтруктураНастройки.Логин;	
		ФТПСервер = СтруктураНастройки.Сервер;	
		ФТППассивныйРежим = СтруктураНастройки.ПассивныйРежим;
		ДатаНачалаВыгрузкиНаСайт = СтруктураНастройки.ДатаНачалаВыгрузкиНаСайт;
		Организация = СтруктураНастройки.Организация;
		Попытка
		ФТПУдаленныйКаталог = СтруктураНастройки.УдаленныйКаталог;	
		Исключение
		КонецПопытки;
		Попытка
		АдресСайта = СтруктураНастройки.АдресСайта;	
		Исключение
		КонецПопытки;
		Если ЗначениеЗаполнено(ДатаНачалаВыгрузкиНаСайт) Тогда
			ОтображениеПериода = Формат(ДатаНачалаВыгрузкиНаСайт, НСтр(ФорматнаяСтрока));
		Иначе
			ОтображениеПериода = "";
		КонецЕсли;
		Попытка
		ВерсияСайта = СтруктураНастройки.ВерсияСайта;	
		Исключение
		КонецПопытки;
		
		Попытка
		КоличесвоЛицевыхСчетовВПакете = СтруктураНастройки.КоличесвоЛицевыхСчетовВПакете;	
		Исключение
		КонецПопытки;
		
	Иначе
		ФТППассивныйРежим = Истина;
		ОтображениеПериода = "";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация.БанковскийСчетПоУмолчанию) Тогда
		Элементы.Декорация3.Заголовок = НСтр("ru='Не выбран банковский счет организации. Оплаты не возможны. ';uk='Не встановлено банківський рахунок організації. Оплати неможливі.'");
		Элементы.Декорация3.ЦветТекста = Новый Цвет (255,0,0);
	Иначе
		Элементы.Декорация3.Заголовок = НСтр("ru='Банковский счет: ';uk='Банківський рахунок: '") + Организация.БанковскийСчетПоУмолчанию.Наименование;
	КонецЕсли;
	
	Если КоличесвоЛицевыхСчетовВПакете = 0 Тогда
		КоличесвоЛицевыхСчетовВПакете = 2000;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьПодключениеФТП(Команда)
	
	Сервер 			= СокрЛП(ФТПСервер);
	Логин 			= СокрЛП(ФТПЛогин);
	Пароль 			= СокрЛП(ФТППароль);
	ПассивныйРежим 	= ФТППассивныйРежим;
	
	Если ПустаяСтрока(Сервер) Или ПустаяСтрока(Логин) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Указаны не все параметры соединения с FTP-сервером!';uk=""Вказані в повному обсязі параметри з'єднання з FTP-сервером!"""));	
		Возврат;
	КонецЕсли;                                            		
	Попытка
		ПодключениеКФТП = Новый FTPСоединение(Сервер, , Логин, Пароль, ,ПассивныйРежим, 60);
	Исключение		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка подключения. Причина: ';uk='Помилка підключення. Причина:'") + ОписаниеОшибки());	
		Возврат;		
	КонецПопытки; 	
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Подключение к FTP-серверу успешно выполнено';uk='Підключення до FTP-сервера успішно виконано'"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗакрытьНаСервере()
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Пароль", СокрЛП(ФТППароль));
	СтруктураНастройки.Вставить("Логин", СокрЛП(ФТПЛогин));
	СтруктураНастройки.Вставить("Сервер", СокрЛП(ФТПСервер));
	СтруктураНастройки.Вставить("УдаленныйКаталог", СокрЛП(ФТПУдаленныйКаталог));
	СтруктураНастройки.Вставить("ПассивныйРежим", ФТППассивныйРежим);
	СтруктураНастройки.Вставить("АдресСайта", СокрЛП(АдресСайта));
	СтруктураНастройки.Вставить("ДатаНачалаВыгрузкиНаСайт", ДатаНачалаВыгрузкиНаСайт);
	СтруктураНастройки.Вставить("Организация", Организация);
	СтруктураНастройки.Вставить("ВерсияСайта", ВерсияСайта);
	СтруктураНастройки.Вставить("КоличесвоЛицевыхСчетовВПакете", КоличесвоЛицевыхСчетовВПакете);
	
	Константы.НастройкаОбменДаннымиХвояСайтЖКХ.Установить(Новый ХранилищеЗначения(СтруктураНастройки));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
	Если ЗначениеЗаполнено(ДатаНачалаВыгрузкиНаСайт) И ДатаНачалаВыгрузкиНаСайт >= НачалоМесяца(ТекущаяДата()) Тогда
		Предупреждение(НСтр("ru='Ошибка выбора даты выгрузки на сайт.';uk='Помилка вибору дати вивантаження на сайт.'"));
		Возврат;
	КонецЕсли;
	ЗаписатьЗакрытьНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказатьПодключение(Команда)
	
	ДанныеОрганизации = ПолучитьДанныеОрганизации(Организация);
	
	АдресПисьма = "sales@hvoya.com.ua";
	ТемаПисьма = НСтр("ru='Заказ на подключение к услуге ""ХВОЯ:Сайт ЖКХ""';uk='Замовлення на підключення до послуги ""ХВОЯ: Сайт ЖКГ""'");
	ТелоПисьма = НСтр("ru='
				|Организация: " + ДанныеОрганизации.Наименование + "
				|Код ЕДРПОУ:  " + ДанныеОрганизации.КодПоЕДРПОУ + "
				|E-mail:      " + ДанныеОрганизации.EMail + "
				|
				|Просим назначить реквизиты подключения к услуге и направить их на резервную электронную почту
				|E-mail:      ххх@хххххх
				|
				|При возникновении дополнительных вопросов, просим звонить на телефон ответственного сотрудника
				|ФИО  хххххххххххххх
				|Тел.: +хх ххх ххххххх  
				|
				|Заявка на подключение к услуге ""ХВОЯ:Сайт ЖКХ"" оформлена из БД ""ОСМД, расчет квартплаты""'");
	
	РаботаСПочтовымиСообщениямиКлиент.ОткрытьФормуОтправкиПочтовогоСообщения( ,АдресПисьма,ТемаПисьма,ТелоПисьма, ,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписаниеРегламентногоЗаданияВыполнить(Команда)
	
	СтруктураРегламентногоЗадания = ПолучитьСтруктуруРегламентноеЗаданиеОбменаССайтом();
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(СтруктураРегламентногоЗадания.Расписание);
	
	Если Диалог.ОткрытьМодально() Тогда
		
		РегламентныеЗаданияКлиент.УстановитьРасписаниеРегламентногоЗадания(
			СтруктураРегламентногоЗадания.Идентификатор,
			Диалог.Расписание);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруРегламентноеЗаданиеОбменаССайтом()
	
	СтруктураРегламентногоЗадания = Новый Структура;
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ОбменДаннымиХвояСайтЖКХ);
	
	СтруктураРегламентногоЗадания.Вставить("Расписание",РегламентноеЗадание.Расписание);
	СтруктураРегламентногоЗадания.Вставить("Идентификатор",Строка(РегламентноеЗадание.УникальныйИдентификатор));
	
	Возврат СтруктураРегламентногоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ОтображениеПериодаПриИзменении(Элемент)
	
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ОтображениеПериода = Формат(ДатаНачалаВыгрузкиНаСайт, НСтр(ФорматнаяСтрока));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ДатаНачалаВыгрузкиНаСайт = Дата('00010101'), ТекущаяДата(), ДатаНачалаВыгрузкиНаСайт));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ДатаНачалаВыгрузкиНаСайт = НачалоМесяца(ДатаКалендаряНачало);
	
	ОтображениеПериодаПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДатаНачалаВыгрузкиНаСайт = ?(ЗначениеЗаполнено(ДатаНачалаВыгрузкиНаСайт), 
						ДобавитьМесяц(ДатаНачалаВыгрузкиНаСайт, Направление),
						ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), Направление));
						
	ОтображениеПериодаПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ДатаНачалаВыгрузкиНаСайт = Неопределено;
	ОтображениеПериодаПриИзменении(Элемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОрганизации(Организация)
	
	EMail = "";
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ОрганизацииКонтактнаяИнформация.Представление
	              |ИЗ
	              |	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	              |ГДЕ
	              |	ОрганизацииКонтактнаяИнформация.Ссылка = &Организация
	              |	И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации)";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Если ЗначениеЗаполнено(EMail) Тогда
			EMail = EMail + " ;";	
		КонецЕсли; 
		EMail = Результат.Представление;	
	КонецЦикла;
	
	ДанныеОрганизации = Новый Структура;
	ДанныеОрганизации.Вставить("Наименование", Организация.НаименованиеПолное);
	ДанныеОрганизации.Вставить("КодПоЕДРПОУ", Организация.КодПоЕДРПОУ);
	ДанныеОрганизации.Вставить("EMail", EMail);
	
	Возврат ДанныеОрганизации;
	
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Организация.БанковскийСчетПоУмолчанию) Тогда
		Элементы.Декорация3.Заголовок = НСтр("ru='Не выбран банковский счет организации. Оплаты не возможны. ';uk='Не встановлено банківський рахунок організації. Оплати неможливі.'");
		Элементы.Декорация3.ЦветТекста = Новый Цвет (255,0,0);
	Иначе
		Элементы.Декорация3.Заголовок = НСтр("ru='Банковский счет: ';uk='Банківський рахунок: '") + Организация.БанковскийСчетПоУмолчанию.Наименование;
		
	КонецЕсли;
	
КонецПроцедуры
