
&НаКлиенте
Процедура Заполить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Нстр("ru='Поле ""Организация"" не заполнено';uk='Полі ""Організація"" не заповнено'");
		Сообщение.Поле = "Объект.Организация";
		Сообщение.Сообщить();
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Здание) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Поле ""Здание"" не заполнено';uk='Полі ""Будівля"" не заповнена'");
		Сообщение.Поле = "Объект.Здание";
		Сообщение.Сообщить();
	Иначе
		Таблица.Очистить();
		ЗаполнитьНаСервере();
	КонецЕсли;
	
 КонецПроцедуры

 &НаСервере
 Процедура ЗаполнитьНаСервере()
	 
	Запрос  = Новый Запрос;
	Запрос.Текст  =  "ВЫБРАТЬ
	                 |	РегистрУведомлений.МесяцНачисления,
	                 |	РегистрУведомлений.ЛицевойСчет КАК ЛицевойСчет,
	                 |	РегистрУведомлений.Период,
	                 |	РегистрУведомлений.Операция,
	                 |	РегистрУведомлений.СтатусСМС,
	                 |	РегистрУведомлений.ИдентификаторСообщения,
	                 |	РегистрУведомлений.ЛицевойСчет.МобТелефон КАК МобТелефон
	                 |ИЗ
	                 |	РегистрСведений.РегистрУведомлений КАК РегистрУведомлений
	                 |ГДЕ
	                 |	РегистрУведомлений.Период МЕЖДУ &НачалоПериода И &КонецПериода
	                 |	И РегистрУведомлений.ЛицевойСчет.Владелец = &Здание
	                 |
	                 |УПОРЯДОЧИТЬ ПО
	                 |	ЛицевойСчет" ;
	 Запрос.УстановитьПараметр("НачалоПериода",Период.ДатаНачала);
	 Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	 Запрос.УстановитьПараметр("Здание",Объект.Здание);
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 НоваяСтрока = Таблица.Добавить();
		 НоваяСтрока.Период = Выборка.Период;
		 НоваяСтрока.ЛицевойСчет  = Выборка.ЛицевойСчет;
		 НоваяСтрока.НомерСотовогоТелефона =  Выборка.МобТелефон;
		 НоваяСтрока.МесяцНачисления  = Выборка.МесяцНачисления;
		 НоваяСтрока.СтатусСМС = Выборка.СтатусСМС;
		 НоваяСтрока.ИдентификаторСообщения = Выборка.ИдентификаторСообщения;
	 КонецЦикла;
 	
 
 КонецПроцедуры // ()
 

&НаКлиенте
Процедура ОбновитьСтатусыСМС(Команда)
	
	Если Таблица.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не заполнен список сообщений.';uk='Чи не заповнений список повідомлень.'");
		Сообщение.Поле = "Таблица";
		Сообщение.Сообщить(); 
	КонецЕсли;	
	ОбновитьСтатусыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусыНаСервере()

	Логин = Константы.ЛогинДляОтправкиSMS.Получить();
	Пароль = Константы.ПарольДляОтправкиSMS.Получить();

	
	Для каждого Строка Из Таблица Цикл
		Строка.СтатусСМС = ОтправкаSMSЧерезАльфаSMS.СтатусДоставки(Строка.ИдентификаторСообщения,Логин,Пароль);
	КонецЦикла;

	

КонецПроцедуры // ОбновитьСтатусыНаСервере()


&НаКлиенте
Процедура Записать(Команда)
	
	ВыполнитьЗаписьНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьЗаписьНаСервере()

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаТЧ.Период,
	               |	ТаблицаТЧ.ЛицевойСчет,
	               |	ТаблицаТЧ.НомерСотовогоТелефона КАК НомерТелефона,
	               |	ТаблицаТЧ.МесяцНачисления,
	               |	ТаблицаТЧ.СтатусСМС,
	               |	ТаблицаТЧ.ИдентификаторСообщения
	               |ПОМЕСТИТЬ ТаблицаТЧ
	               |ИЗ
	               |	&ТаблицаТЧ КАК ТаблицаТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РегистрУведомлений.Период,
	               |	РегистрУведомлений.МесяцНачисления,
	               |	РегистрУведомлений.ЛицевойСчет,
	               |	РегистрУведомлений.Операция,
	               |	ЕСТЬNULL(РегистрУведомлений.ИдентификаторСообщения, """") КАК ИдентификаторСообщения,
	               |	РегистрУведомлений.Количество,
	               |	ТаблицаТЧ.СтатусСМС КАК СтатусСМС
	               |ИЗ
	               |	ТаблицаТЧ КАК ТаблицаТЧ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрУведомлений КАК РегистрУведомлений
	               |		ПО ТаблицаТЧ.ЛицевойСчет = РегистрУведомлений.ЛицевойСчет
	               |			И ТаблицаТЧ.ИдентификаторСообщения = РегистрУведомлений.ИдентификаторСообщения";
	Запрос.УстановитьПараметр("ТаблицаТЧ",Таблица.Выгрузить());	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не заполнен список сообщений';uk='Чи не заповнений список повідомлень'");
		Сообщение.Поле = "Таблица";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Если СокрЛП(Выборка.ИдентификаторСообщения) =  "" Тогда
			Продолжить;                                     
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.РегистрУведомлений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторСообщения.Значение = Выборка.ИдентификаторСообщения;
		НаборЗаписей.Отбор.ИдентификаторСообщения.Использование = Истина;
		
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДата();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,Выборка);
		НаборЗаписей.Записать();
	КонецЦикла;
	
	
				   
		
КонецПроцедуры // ()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		Объект.Организация = Параметры.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("Здание") Тогда
		Объект.Здание = Параметры.Здание;
	КонецЕсли;
	
КонецПроцедуры


