////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция возвращает список прописанных жильцов.
//
&НаСервере
Функция ПолучитьПрописанныхЖильцов(ЛицевойСчет, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОПрописанныхЖильцахСрезПоследних.Жилец
		|ИЗ
		|	РегистрСведений.СведенияОПрописанныхЖильцах.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК СведенияОПрописанныхЖильцахСрезПоследних
		|ГДЕ
		|	СведенияОПрописанныхЖильцахСрезПоследних.Прописан = ИСТИНА";
		
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет); 
	Запрос.УстановитьПараметр("Период", Дата); 
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Жилец");
	
КонецФункции

// Процедура - обработчик события НачалоВыбора поля ввода "ПотребительУслуг".
//
&НаКлиенте
Процедура ПотребительУслугНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НовыйМассив = ПолучитьПрописанныхЖильцов(Объект.ЛицевойСчет, Объект.Дата);
	
	ФиксированныйМассивФизЛиц = Новый ФиксированныйМассив(НовыйМассив);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ФиксированныйМассивФизЛиц);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.ПотребительУслуг.ПараметрыВыбора = НовыеПараметры;

КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("ОтборОрганизация",	Объект.Организация);

	ОткрытьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, Элемент);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки

КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	Оповестить("ИзмененЛицевойСчет", Объект.ЛицевойСчет , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФизЛицо(Команда)
	
	ОткрытьФормуМодально("Справочник.ФизическиеЛица.ФормаВыбора", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Объект.ПотребительУслуг = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	
		Если ЕстьДействующаяСубсидия() Тогда
			Ответ = Вопрос(НСтр("ru = 'Для данного лицевого счета установлена субсидия. Одновременное предоставление льготы и субсидии может противоречить законодательству Украины. Продолжить?'; uk = 'Для цього особового рахунку встановлена субсидія. Одночасне надання пільги і субсидії може суперечити законодавству України. Продовжити?'"),
			РежимДиалогаВопрос.ДаНет);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Отказ = истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция  ЕстьДействующаяСубсидия()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НазначенныеСубсидииСрезПоследних.ЛицевойСчет
		|ИЗ
		|	РегистрСведений.НазначенныеСубсидии.СрезПоследних(&ДатаДокумента, ЛицевойСчет = &ЛицевойСчет) КАК НазначенныеСубсидииСрезПоследних
		|ГДЕ
		|	НазначенныеСубсидииСрезПоследних.Действует = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	НазначенныеСубсидииСрезПоследних.ЛицевойСчет";

	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);

	Результат = Запрос.Выполнить();

	Если Не Результат.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	

КонецФункции