
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУправлениеСубсидиями, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	Субсидии.ЛицевойСчет,
	 |	Субсидии.Услуга,
	 |	Субсидии.Период,
	 |	Субсидии.Действует,
	 |	Субсидии.СуммаСубсидии,
	 |	Субсидии.ГраницаСубсидии
	 |ИЗ
	 |	(ВЫБРАТЬ
	 |		СубсидииНачало.ЛицевойСчет КАК ЛицевойСчет,
	 |		СубсидииНачало.Услуга КАК Услуга,
	 |		СубсидииНачало.Период КАК Период,
	 |		СубсидииНачало.Действует КАК Действует,
	 |		СубсидииНачало.СуммаСубсидии КАК СуммаСубсидии,
	 |		СубсидииНачало.ГраницаСубсидии КАК ГраницаСубсидии
	 |	ИЗ
	 |		(ВЫБРАТЬ
	 |			УправлениеСубсидиями.Ссылка.ЛицевойСчет КАК ЛицевойСчет,
	 |			УправлениеСубсидиями.Услуга КАК Услуга,
	 |			УправлениеСубсидиями.Ссылка.ДатаНачала КАК Период,
	 |			ИСТИНА КАК Действует,
	 |			УправлениеСубсидиями.СуммаСубсидии КАК СуммаСубсидии,
	 |			УправлениеСубсидиями.ГраницаСубсидии КАК ГраницаСубсидии
	 |		ИЗ
	 |			Документ.УправлениеСубсидиями.Субсидии КАК УправлениеСубсидиями
	 |		ГДЕ
	 |			УправлениеСубсидиями.Ссылка.ДатаНачала <> &ПустаяДата
	 |			И УправлениеСубсидиями.Ссылка = &Ссылка) КАК СубсидииНачало
	 |	
	 |	ОБЪЕДИНИТЬ ВСЕ
	 |	
	 |	ВЫБРАТЬ
	 |		СубсидииОкончание.ЛицевойСчет,
	 |		СубсидииОкончание.Услуга,
	 |		СубсидииОкончание.Период,
	 |		СубсидииОкончание.Действует,
	 |		СубсидииОкончание.СуммаСубсидии,
	 |		СубсидииОкончание.ГраницаСубсидии
	 |	ИЗ
	 |		(ВЫБРАТЬ
	 |			УправлениеСубсидиями.Ссылка.ЛицевойСчет КАК ЛицевойСчет,
	 |			УправлениеСубсидиями.Услуга КАК Услуга,
	 |			КОНЕЦПЕРИОДА(УправлениеСубсидиями.Ссылка.ДатаОкончания, ДЕНЬ) КАК Период,
	 |			ЛОЖЬ КАК Действует,
	 |			УправлениеСубсидиями.СуммаСубсидии КАК СуммаСубсидии,
	 |			УправлениеСубсидиями.ГраницаСубсидии КАК ГраницаСубсидии
	 |		ИЗ
	 |			Документ.УправлениеСубсидиями.Субсидии КАК УправлениеСубсидиями
	 |		ГДЕ
	 |			УправлениеСубсидиями.Ссылка.ДатаОкончания <> &ПустаяДата
	 |			И УправлениеСубсидиями.Ссылка = &Ссылка) КАК СубсидииОкончание) КАК Субсидии";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУправлениеСубсидиями);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНазначенныеСубсидии", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
