
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр                      = НСтр("ru='Файл Ексель (*.xlsx)|*.xlsx'");
	ДиалогВыбораФайла.Заголовок                   = Заголовок;
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "xlsx";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
	    Объект.Файл = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	Для Каждого стр Из Объект.ТабличнаяЧасть Цикл
		ЛС = НайтиЛицевойСчет(СтрЗаменить(Строка(стр.ЛицевойСчет), Символы.НПП, ""));
		// Найдем закрытие месяца и отменим проведение
		ЗапросЗакрМес = Новый Запрос;
		ЗапросЗакрМес.Текст = 
		    "ВЫБРАТЬ
		    |	ЗакрытиеМесяца.Ссылка
		    |ИЗ
		    |	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		    |ГДЕ
		    |	ЗакрытиеМесяца.Проведен = ИСТИНА
		    |	И ЗакрытиеМесяца.Здание = &Здание
		    |	И ЗакрытиеМесяца.Дата = &Дата";
		ЗапросЗакрМес.УстановитьПараметр("Здание", ЛС.Владелец);
		ЗапросЗакрМес.УстановитьПараметр("Дата", КонецДня(Объект.Дата));
		Результат = ЗапросЗакрМес.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
			    ОбъектЗакрМес = Выборка.Ссылка.ПолучитьОбъект();
				ОбъектЗакрМес.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЦикла;
		КонецЕсли;
		
		// Найдем документ управление услугами и изменим
		ЗапросУслуги = Новый Запрос;
		ЗапросУслуги.Текст = 
		    "ВЫБРАТЬ
		    |	УправлениеУслугами.Ссылка
		    |ИЗ
		    |	Документ.УправлениеУслугами КАК УправлениеУслугами
		    |ГДЕ
		    |	УправлениеУслугами.Дата МЕЖДУ &ДатаНач И &ДатаКон
		    |	И УправлениеУслугами.Проведен = ИСТИНА
		    |	И УправлениеУслугами.Здание = &Здание";
		ЗапросУслуги.УстановитьПараметр("ДатаНач", НачалоДня(Объект.ДатаНазначенияУслуги));
		ЗапросУслуги.УстановитьПараметр("ДатаКон", КонецДня(Объект.ДатаНазначенияУслуги));
		ЗапросУслуги.УстановитьПараметр("Здание", ЛС.Владелец);
		Результат = ЗапросУслуги.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				ОбъектНазнУслуги = Выборка.Ссылка.ПолучитьОбъект();
				ОбъектНазнУслуги.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ТабличнаяЧастьДок = ОбъектНазнУслуги.Услуги;
				Отбор = Новый Структура;
				Отбор.Вставить("Услуга",Справочники.Услуги.НайтиПоКоду("Р00000169"));
				МассивСтрок = ТабличнаяЧастьДок.НайтиСтроки(Отбор);				
				Для каждого Строка Из МассивСтрок Цикл 
	                ТабличнаяЧастьДок.Удалить(Строка); 
				КонецЦикла;
				ОбъектНазнУслуги.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			КонецЦикла;
		КонецЕсли;
		
		// Проведем переначисление по лицевому счету
		ЗапросНачисления = Новый Запрос;
		ЗапросНачисления.Текст =
		    "ВЫБРАТЬ
		    |	НачислениеПоЛС.Ссылка,
		    |	НачислениеПоЛС.Проведен
		    |ИЗ
		    |	Документ.НачислениеПоЛС КАК НачислениеПоЛС
		    |ГДЕ
		    |	НачислениеПоЛС.ПериодНачисления = &ПериодНачисления
		    |	И НачислениеПоЛС.Проведен = ИСТИНА
		    |	И НачислениеПоЛС.Здание = &Здание";
		ЗапросНачисления.УстановитьПараметр("ПериодНачисления", НачалоМесяца(Объект.Дата));
		ЗапросНачисления.УстановитьПараметр("Здание", ЛС.Владелец);
		Результат = ЗапросНачисления.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				ОбъектНачисления = Выборка.Ссылка.ПолучитьОбъект();
				ОбъектНачисления.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ОбъектНачисления.ЗаполнитьАвтоматическиНаСервере();
				Попытка
				    ОбъектНачисления.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Исключение
					Сообщить("Не вдалося провести документ начисление " + ОбъектНачисления.Ссылка);
				КонецПопытки;	
			КонецЦикла;
		КонецЕсли;
		
		Если ОбъектНачисления.Проведен = Истина Тогда
			// Проведем закрытие месяца
			Если ОбъектЗакрМес = Неопределено Тогда   // Создадим документ закрытие месяца
				Док = Документы.ЗакрытиеМесяца.СоздатьДокумент();
				Док.Дата = КонецМесяца(Объект.Дата);
				Док.Организация = Объект.Организация;
				Док.Здание = Выборка.Ссылка;
				//Док.ЭтотОбъект.ОтображениеПериода = ЭтотОбъект.ОтображениеПериода;
				Попытка
				    Док.Записать(РежимЗаписиДокумента.Проведение);
				Исключение		
					Док.Записать();
				    Сообщить("Не вдалося провести документ " + Док.Ссылка);		
				КонецПопытки;
			Иначе
				Попытка
				    ОбъектЗакрМес.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Исключение
					Сообщить("Не вдалося провести документ закрытие меняца " + ОбъектЗакрМес.Ссылка);
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	Путь = Объект.Файл;
	Объект.ТабличнаяЧасть.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.ActiveSheet.UsedRange.Rows.Count();
	Для Счетчик = 1 По КоличествоСтрок Цикл
		НоваяСтрока                  = Объект.ТабличнаяЧасть.Добавить();
		НоваяСтрока.ЛицевойСчет      = Excel.Cells(Счетчик, 1).Value;
	КонецЦикла;
	Excel.Workbooks.Close();
	Excel.Quit();
	ВыполнитьОбработкуНаСервере();
КонецПроцедуры

&НаСервере
Функция НайтиЛицевойСчет(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(
	    |			&НаДату,
	    |			ЛицевойСчет.Наименование = &Наименование
	    |				И Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Наименование", ЛицевойСчет);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛС = Выборка.ЛицевойСчет;
	КонецЦикла;
	Возврат ЛС;
КонецФункции
