
// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Услуга = Параметры.Услуга;
	
	АдресТаблицыПороговВХранилище = Параметры.АдресТаблицыПороговВХранилище;
	ПороговыеТарифы.Загрузить(ПолучитьИзВременногоХранилища(АдресТаблицыПороговВХранилище));
	
	КоличествоПорогов = ПороговыеТарифы.Количество();
	
	УстановитьВидимостьИДоступность();	
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура помещает результаты подбора в хранилище.
//
&НаСервере
Процедура ЗаписатьПодборВХранилище()
	
	ПоместитьВоВременноеХранилище(ПороговыеТарифы.Выгрузить( , "Порог, Тариф, ТарифСтимулирующий, ЗначениеПорога"), АдресТаблицыПороговВХранилище);
	
КонецПроцедуры // ЗаписатьПодборВХранилище()

// Процедура - обработчик нажатия кнопки ОК.
//
&НаКлиенте
Процедура ОК(Команда)
	
	Если НЕ ПроверкаЗаполнения() Тогда
		
		ТекстПредупреждения = НСтр("ru='Ошибка заполения порогов и тарифов.';uk='Помилка заповнених порогів та тарифів.'");

		Предупреждение(ТекстПредупреждения);
		Возврат;
	КонецЕсли; 
	
	ЗаписатьПодборВХранилище();
	Закрыть(КодВозвратаДиалога.OK);
	
КонецПроцедуры // ОК()

&НаКлиенте
Процедура ПороговыеТарифыПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущийЭлемент.Имя = "ПороговыеТарифыЗначениеПорога" Тогда
		Если Элемент.ТекущаяСтрока = КоличествоПорогов - 1 Тогда
			Отказ = Истина;
		КонецЕсли; 	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСтимулирующийТариф") Тогда
		Элементы.ПороговыеТарифыТарифСтимулирующий.Видимость = Истина;
	Иначе
		Элементы.ПороговыеТарифыТарифСтимулирующий.Видимость = Ложь;
	КонецЕсли;
	
	ПредПорог = 0;
	НомерСтроки = 0;
	Для Каждого СтрокаПорога Из ПороговыеТарифы Цикл
		НомерСтроки = НомерСтроки +1;
		СтрокаПорога.ЕдиницаИзмерения = Услуга.ЕдиницаИзмерения;
		Если НомерСтроки = КоличествоПорогов Тогда
			СтрокаПорога.ЗначениеПорога = 9999999999;	
		КонецЕсли;
		
		
		Если СтрокаПорога.Порог = Перечисления.ПорогиТарифовУслуг.Порог1 Тогда
			НаимПорога = НСтр("ru='За объем до %1 %2 включительно в месяц';uk='За обсяг до %1 %2 включно на місяць'");
		ИначеЕсли СтрокаПорога.ЗначениеПорога < 1000000 Тогда
			НаимПорога = НСтр("ru='За объем свыше %3 %2 до %1 %2 включительно в месяц';uk='За обсяг понад %3 %2 до %1 %2 включно на місяць'");
		Иначе
			НаимПорога = НСтр("ru='За объем свыше %3 %2 в месяц';uk='За обсяг понад %3 %2 на місяць'");
		КонецЕсли;
		
		НаимПорога = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НаимПорога,
					СтрокаПорога.ЗначениеПорога,
					СтрокаПорога.ЕдиницаИзмерения,
					ПредПорог);
		
		СтрокаПорога.Наименование = НаимПорога;
		
		ПредПорог = СтрокаПорога.ЗначениеПорога;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПороговыеТарифыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элемент.ТекущийЭлемент.Имя = "ПороговыеТарифыЗначениеПорога" Тогда
		УстановитьВидимостьИДоступность();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПроверкаЗаполнения()

	ПредПорог = 0;
	Для Каждого СтрокаПорога Из ПороговыеТарифы Цикл
		
		Если ПредПорог > СтрокаПорога.ЗначениеПорога Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если СтрокаПорога.ЗначениеПорога = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если СтрокаПорога.Тариф = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСтимулирующийТариф") Тогда
			Если СтрокаПорога.ТарифСтимулирующий = 0 Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		ПредПорог = СтрокаПорога.ЗначениеПорога;
		
	КонецЦикла;
	
	Возврат Истина;

КонецФункции // ПроверкаЗаполнения()
 