

&НаСервере
Процедура ПолучитьПараметрыЗаполнения(СтруктураЗаполнения)
	
	СтруктураЗаполнения.Вставить("Здание", СтруктураЗаполнения.ЛицевойСчет.Владелец);
	СтруктураЗаполнения.Вставить("Организация", СтруктураЗаполнения.ЛицевойСчет.Владелец.Организация);
	СтруктураЗаполнения.Вставить("ВидОперации", Перечисления.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеОтветственногоВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("ЛицевойСчет", ПараметрКоманды);
	ПолучитьПараметрыЗаполнения(СтруктураЗаполнения);
	
	ОткрытьФорму("Документ.ИзменениеЛицевогоСчета.ФормаОбъекта", Новый Структура("Основание", СтруктураЗаполнения));
	

КонецПроцедуры
