////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланированиеАвансов.Ссылка
		|ИЗ
		|	Документ.ПланированиеАвансов КАК ПланированиеАвансов
		|ГДЕ
		|	ПланированиеАвансов.Дата >= &ДатаНач
		|	И ПланированиеАвансов.Дата <= &ДатаКон
		|	И ПланированиеАвансов.Организация = &Организация
		|	И ПланированиеАвансов.Здание = &Здание
		|	И ПланированиеАвансов.Услуга = &Услуга
		|	И НЕ ПланированиеАвансов.ПометкаУдаления";
		
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		Если РезультатЗапроса.Ссылка <> Ссылка Тогда
			Отказ = истина;	
		КонецЕсли;
	КонецЦикла;
	
	СуммаРаспределения = ЛицевыеСчета.Итог("СуммаНачислено");
	Если СуммаРаспределения <> СуммаДокумента Тогда
		ВалютаДенежныхСредств = Константы.ВалютаУчета.Получить();			
		ТекстСообщения = НСтр("ru = 'Сумма документа: %СуммаДокумента% %ВалютаДенежныхСредств%, не соответствует распределенной сумме в табличной части: %СуммаРаспределения% %ВалютаДенежныхСредств%! Распределите сумму документа повторно, либо измените ее на первоначальное значение.'; uk = 'Сума документа: %СуммаДокумента% %ВалютаДенежныхСредств%, не відповідає розподіленої сумі у табличній частині: %СуммаРаспределения% %ВалютаДенежныхСредств%! Розподіліть суму документу повторно, або змініть її на первинне значення.'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаДокумента%", Строка(СуммаДокумента));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаРаспределения%", Строка(СуммаРаспределения));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВалютаДенежныхСредств%", СокрЛП(Строка(ВалютаДенежныхСредств)));
		ОСМДСервер.СообщитьОбОшибке(
			ТекстСообщения,
			ЭтотОбъект,
			Отказ,
			"СуммаДокумента"
		);
	КонецЕсли;
	
КонецПроцедуры
