
&НаСервере
Процедура ПолучитьПараметрыЗаполнения(СтруктураЗаполнения)
	
	СтруктураЗаполнения.Вставить("Организация", СтруктураЗаполнения.ЛицевойСчет.Владелец.Организация);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("ЛицевойСчет", ПараметрКоманды);
	ПолучитьПараметрыЗаполнения(СтруктураЗаполнения);
	
	ОткрытьФорму("Документ.УправлениеРегиональнымиСубсидиями.ФормаОбъекта",Новый Структура("Основание", СтруктураЗаполнения));
	
КонецПроцедуры
