
&НаКлиенте
Процедура ОтображениеПериодаПриИзменении(Элемент)
	ЭтаФорма.Объект.Дата 		= КонецМесяца(ЭтаФорма.Объект.Дата);
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ЭтаФорма.ОтображениеПериода	= Формат(ЭтаФорма.Объект.Дата, НСтр(ФорматнаяСтрока));
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.Объект.Дата= Дата('00010101'), ТекущаяДата(), ЭтаФорма.Объект.Дата));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ЭтаФорма.Объект.Дата = КонецДня(ДатаКалендаряНачало);
	
	ОтображениеПериодаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	ЭтаФорма.Объект.Дата = ?(ЗначениеЗаполнено(ЭтаФорма.Объект.Дата), 
						ДобавитьМесяц(ЭтаФорма.Объект.Дата, Направление),
						ДобавитьМесяц(КонецМесяца(ТекущаяДата()), Направление));
						
	ОтображениеПериодаПриИзменении(Элемент);
КонецПроцедуры

&НаСервере
Процедура СоздатьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗданияИСооружения.Ссылка
		|ИЗ
		|	Справочник.ЗданияИСооружения КАК ЗданияИСооружения
		|ГДЕ
		|	ЗданияИСооружения.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Док = Документы.ЗакрытиеМесяца.СоздатьДокумент();
		Док.Дата = КонецМесяца(Объект.Дата);
		Док.Организация = Объект.Организация;
		Док.Здание = Выборка.Ссылка;
		//Док.ЭтотОбъект.ОтображениеПериода = ЭтотОбъект.ОтображениеПериода;
		Попытка
		    Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение		
			Док.Записать();
		    Сообщить("Не вдалося провести документ " + Док.Ссылка);		
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	СоздатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.Дата = ТекущаяДата();
КонецПроцедуры
