
&НаКлиенте
Процедура СсылкаНаЗаконНажатие(Элемент)
	ЗапуститьПриложение("http://zakon2.rada.gov.ua/laws/show/319-2016-%D0%BF");
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если  Константы.НеПроверятьПересечениеЛьготИСубсидийПриЗапуске.Получить() тогда
		Отказ = Истина;
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НазначенныеСубсидииСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
		|ПОМЕСТИТЬ Субсидии
		|ИЗ
		|	РегистрСведений.НазначенныеСубсидии.СрезПоследних(&ТекПериод, ) КАК НазначенныеСубсидииСрезПоследних
		|ГДЕ
		|	НазначенныеСубсидииСрезПоследних.Действует = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	НазначенныеСубсидииСрезПоследних.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НазначенныеЛьготыСрезПоследних.ЛицевойСчет
		|ПОМЕСТИТЬ Льготы
		|ИЗ
		|	РегистрСведений.НазначенныеЛьготы.СрезПоследних(&ТекПериод, ) КАК НазначенныеЛьготыСрезПоследних
		|ГДЕ
		|	НазначенныеЛьготыСрезПоследних.Действует = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	НазначенныеЛьготыСрезПоследних.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Льготы.ЛицевойСчет, ЗНАЧЕНИЕ(Справочник.ЛицевыеСчета.ПустаяСсылка)) КАК ЛС_Льготы,
		|	ЕСТЬNULL(Субсидии.ЛицевойСчет, ЗНАЧЕНИЕ(Справочник.ЛицевыеСчета.ПустаяСсылка)) КАК ЛС_Субсидия
		|ПОМЕСТИТЬ ТАБ
		|ИЗ
		|	Льготы КАК Льготы
		|		ПОЛНОЕ СОЕДИНЕНИЕ Субсидии КАК Субсидии
		|		ПО Льготы.ЛицевойСчет = Субсидии.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТАБ.ЛС_Льготы,
		|	ТАБ.ЛС_Субсидия
		|ИЗ
		|	ТАБ КАК ТАБ";
		
		Запрос.УстановитьПараметр("ТекПериод", ТекущаяДата());
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.ЛС_Льготы <> Справочники.ЛицевыеСчета.ПустаяСсылка()
				И Выборка.ЛС_Субсидия <> Справочники.ЛицевыеСчета.ПустаяСсылка() ТОГДА
				НоваяСтрока = ЛицевыеСчета.Добавить();
				НоваяСтрока.ЛицевойСчет = Выборка.ЛС_Льготы;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	Если ЛицевыеСчета.Количество() = 0 Тогда
		Отказ = Истина;
	КонецЕсли;	


	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии()
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()

	Константы.НеПроверятьПересечениеЛьготИСубсидийПриЗапуске.Установить(НеПоказывать);

КонецПроцедуры // ()


