
&НаКлиенте
Процедура ЗаполнитьОбъектыЛицевыхСчетов(Команда)
	ОткрытьФорму("Справочник.ОбъектыЛицевыхСчетов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ВводОстатковЕксел(Команда)
	ОткрытьФорму("Обработка.ЗагрузкаИзExcel.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ВводНачальныхОстатков(Команда)
	ОткрытьФорму("Документ.ВводНачальныхОстатков.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура СменитьРабочийСтол(Команда)
	ОткрытьФорму("Обработка.УправлениеРабочимСтолом.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКВидеоУроку(Команда)
	
	Если ЭтаФорма.ТекущийЭлемент.Имя = "ПерейтиКВидеоУроку1" Тогда
		НавигационнаяСсылка = "https://www.youtube.com/watch?v=GToc2arX-rc";
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "ПерейтиКВидеоУроку2" Тогда
		НавигационнаяСсылка = "https://www.youtube.com/watch?v=FFaM62LLUSc";
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "ПерейтиКВидеоУроку3" Тогда
		НавигационнаяСсылка = "https://www.youtube.com/watch?v=HnH2N7c_E4g";
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "ПерейтиКВидеоУроку4" Тогда
		НавигационнаяСсылка = "https://www.youtube.com/watch?v=9uEFPGMQAPg";
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "ПерейтиКВидеоУроку5" Тогда
		НавигационнаяСсылка = "https://www.youtube.com/watch?v=Cw1t_xRZWk0";
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "ПерейтиКВидеоУроку6" Тогда
		НавигационнаяСсылка = "https://www.youtube.com/watch?v=teZksCiEOR8";
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "ПерейтиКВидеоУроку7" Тогда
		НавигационнаяСсылка = "https://www.youtube.com/watch?v=Wk1aZO_eNC8";
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "ПерейтиКВидеоУроку8" Тогда
		НавигационнаяСсылка = "https://www.youtube.com/watch?v=UbaluKFQ96k";
	КонецЕсли;
	
	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
КонецПроцедуры

