&НаКлиенте
Процедура МесяцНачисленийПриИзменении(Элемент)
	
	ЭтаФорма.МесяцНачислений 		= КонецМесяца(ЭтаФорма.МесяцНачислений);
	ЭтаФорма.ОтображениеПериодаНачисления 	= Формат(ЭтаФорма.МесяцНачислений, "ДФ='MMMM yyyy'");
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "МесяцНачислений".
//
&НаКлиенте
Процедура МесяцНачисленийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.МесяцНачислений= Дата('00010101'), ТекущаяДата(), ЭтаФорма.МесяцНачислений));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ЭтаФорма.МесяцНачислений = КонецДня(ДатаКалендаряНачало);
	
	МесяцНачисленийПриИзменении(Элемент);
	
КонецПроцедуры

// Процедура - обработчик события Регулирование поля ввода "МесяцНачислений".
//
&НаКлиенте
Процедура МесяцНачисленийРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ЭтаФорма.МесяцНачислений = ?(ЗначениеЗаполнено(ЭтаФорма.МесяцНачислений), 
						ДобавитьМесяц(ЭтаФорма.МесяцНачислений, Направление),
						ДобавитьМесяц(КонецМесяца(ТекущаяДата()), Направление));
						
	МесяцНачисленийПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ПериодПечати",ЭтаФорма.МесяцНачислений);
	ПараметрыПечати.Вставить("БанковскийСчетНаПечать",БанковскиеСчетаОрганизации);

	Закрыть(ПараметрыПечати);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПериодПечатиКвитанцииНаОплатуНаСервере(ЭтаФорма.ЛицевойСчет);
	ЗаполнитьБанковскиеСчетаОрганизации(ЛицевойСчет);
КонецПроцедуры

&НаСервере                                       
Процедура УстановитьПериодПечатиКвитанцииНаОплатуНаСервере(ЛицевойСч)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	РасчетыПоЛицевымСчетам.МесяцНачисления КАК МесяцНачисления
	                      |ИЗ
	                      |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	                      |ГДЕ
	                      |	РасчетыПоЛицевымСчетам.ЛицевойСчет В(&ЛицевойСчет)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	МесяцНачисления УБЫВ");
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСч);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.МесяцНачислений = Выборка.МесяцНачисления;
	КонецЦикла;
	
	ЭтаФорма.МесяцНачислений 		= КонецМесяца(ЭтаФорма.МесяцНачислений);
	ЭтаФорма.ОтображениеПериодаНачисления 	= Формат(ЭтаФорма.МесяцНачислений, "ДФ='MMMM yyyy'");
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьБанковскиеСчетаОрганизации(ЛицевойСчет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БанковскиеСчета.Ссылка
	               |ИЗ
	               |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	               |ГДЕ
	               |	(БанковскиеСчета.ДатаЗакрытия > &ДатаЗакрытия
	               |			ИЛИ БанковскиеСчета.ДатаЗакрытия = &ПустаяДата)
	               |	И БанковскиеСчета.Владелец = &Организация
	               |	И БанковскиеСчета.ПометкаУдаления = ЛОЖЬ";
				   Запрос.УстановитьПараметр("ДатаЗакрытия",НачалоМесяца(МесяцНачислений));
				   Запрос.УстановитьПараметр("ПустаяДата",'00010101');
				   Запрос.УстановитьПараметр("Организация",ЛицевойСчет[0].Значение.Владелец.Организация);
				   Выборка = Запрос.Выполнить().Выбрать();			   
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = БанковскиеСчетаОрганизации.Добавить();
		НоваяСтрока.БанковскийСчет = Выборка.Ссылка;
	КонецЦикла;
	
	Для каждого Строка Из БанковскиеСчетаОрганизации Цикл
		Если Строка.БанковскийСчет = ЛицевойСчет[0].Значение.Владелец.Организация.БанковскийСчетПоУмолчанию Тогда
			Строка.Печать = Истина;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры 
