
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Форма = ПолучитьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораПериодаОплаты");
	Форма.ЛицевойСчет.ЗагрузитьЗначения(ПараметрКоманды);
	ПараметрыПечати = Форма.ОткрытьМодально();
	
	Если ПараметрыПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
//{{MRG[ <-> ]
//	СсылкаДопПечатнойФормы = ПечатьКвитанцииНаОплату.ПолучитьСсылкуДопПечатнойФормы();
//	Если ЗначениеЗаполнено(СсылкаДопПечатнойФормы) Тогда
//}}MRG[ <-> ]

//{{MRG[ <-> ]
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "МакетКвитанцияНаОплатуУпрощенная", ПараметрКоманды, ПараметрыВыполненияКоманды, ПараметрыПечати);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		Список = Новый СписокЗначений;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		Список.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЛицевыеСчета");
//		Для Каждого ЛицевойСчет Из ПараметрКоманды Цикл
//			Список.Добавить(ЛицевойСчет);
//		КонецЦикла;
//		МассивОбъектов = Новый Массив;
//		Структура = Новый Структура;
//		Структура.Вставить("Счет", Список);
//		Структура.Вставить("Месяц", ПараметрыПечати.ПериодПечати);
//		Структура.Вставить("БанковскийСчет", ПараметрыПечати.БанковскийСчетНаПечать);
//		МассивОбъектов.Добавить(Структура);
//		// Получим ключ уникальности открываемой формы
//		КлючУникальности = Строка(Новый УникальныйИдентификатор);
//		ПараметрыОткрытия = Новый Структура("СсылкаДопПечатнойФормы,ИменаМакетов,МассивОбъектов,ПараметрыПечати");
//		ПараметрыОткрытия.СсылкаДопПечатнойФормы = СсылкаДопПечатнойФормы;
//		ПараметрыОткрытия.ИменаМакетов		 = "МакетКвитанцииНаОплатуУпрощенная";
//		ПараметрыОткрытия.МассивОбъектов	 = МассивОбъектов;
//		ПараметрыОткрытия.ПараметрыПечати	 = ПараметрыПечати;
//		// Откроем форму печати документов
//		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ПараметрыВыполненияКоманды, КлючУникальности);
//	Иначе
//		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "МакетКвитанцияНаОплатуУпрощенная", ПараметрКоманды, ПараметрыВыполненияКоманды, ПараметрыПечати);
//	КонецЕсли;
//}}MRG[ <-> ]
КонецПроцедуры
