////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура - отключает даты запрета изменения объекта.
//
Процедура ОтключитьДатыЗапретаИзменения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыЗапретаИзменения.ДатаЗапрета
		|ИЗ
		|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
		|ГДЕ
		|	ДатыЗапретаИзменения.Объект = &Здание
		|	И ДатыЗапретаИзменения.Раздел = &Раздел";
		
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("Раздел", ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.Здания);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
	
		Если РезультатЗапроса.ДатаЗапрета > КонецМесяца(Дата) Тогда
			Отказ = Истина;
			НСтрока = НСтр("ru='Открытие месяца запрещено';uk='Відкриття мiсяця заборонене'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтрока,, ,, Отказ);
		Иначе
			
			НаборЗаписей = РегистрыСведений.ДатыЗапретаИзменения.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Пользователь.Установить(Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей);
			НаборЗаписей.Отбор.Раздел.Установить(ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.Здания);
			НаборЗаписей.Отбор.Объект.Установить(Здание);
			
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяСтрока = НаборЗаписей.Добавить();
				НоваяСтрока.Пользователь = Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей;
				НоваяСтрока.Раздел = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.Здания;
				НоваяСтрока.Объект = Здание;
				НоваяСтрока.ДатаЗапрета = ДобавитьМесяц(Дата, -1);
				НоваяСтрока.Комментарий = "";
			Иначе
				НоваяСтрока = НаборЗаписей[0];
				НоваяСтрока.ДатаЗапрета = ДобавитьМесяц(Дата, -1);
				НоваяСтрока.Комментарий = "";
			КонецЕсли;
			
			НаборЗаписей.Записать(Истина);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

// Процедура - включает даты запрета изменения объекта.
//
Процедура ВключитьДатыЗапретаИзменения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыЗапретаИзменения.ДатаЗапрета
		|ИЗ
		|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
		|ГДЕ
		|	ДатыЗапретаИзменения.Объект = &Здание
		|	И ДатыЗапретаИзменения.Раздел = &Раздел";
		
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("Раздел", ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.Здания);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
	
		Если ДобавитьМесяц(РезультатЗапроса.ДатаЗапрета, 2) < КонецМесяца(Дата) Тогда
			Отказ = Истина;
			НСтрока = НСтр("ru='Закрытие месяца запрещено. Существуют ранее не закрытые периоды.';uk='Відкриття мiсяця заборонене. iснують ранiше не закритi перiоди'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтрока,, ,, Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ДатыЗапретаИзменения.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Пользователь.Установить(Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей);
	НаборЗаписей.Отбор.Раздел.Установить(ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.Здания);
	НаборЗаписей.Отбор.Объект.Установить(Здание);
	
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.Пользователь = Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей;
		НоваяСтрока.Раздел = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.Здания;
		НоваяСтрока.Объект = Здание;
		НоваяСтрока.ДатаЗапрета = Дата;
		НоваяСтрока.Комментарий = "";
	Иначе
		НоваяСтрока = НаборЗаписей[0];
		НоваяСтрока.ДатаЗапрета = Дата;
		НоваяСтрока.Комментарий = "";
	КонецЕсли;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ВключитьДатыЗапретаИзменения(Отказ);		
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ЗакрытиеМесяца.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ПроведениеСервер.ОтразитьРасчетыПоЛицевымСчетам(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьСостояниеРеструктуризации(ДополнительныеСвойства, Движения, Отказ);
	//ПроведениеСервер.ОтразитьГарантированныеНачисленияСубсидий(ДополнительныеСвойства, Движения, Отказ);
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	//Документы.ЗакрытиеМесяца.ПровестиСубсидии(Ссылка);
	
	Документы.ЗакрытиеМесяца.СформироватьНачислениеДляБухгалтерии(Ссылка);
	Документы.ЗакрытиеМесяца.СформироватьЛьготыСубсидииДляБухгалтерии(Ссылка);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	Документы.ЗакрытиеМесяца.УдалитьНачислениеДляБухгалтерии(Ссылка);
	Документы.ЗакрытиеМесяца.УдалитьЛьготыСубсидииДляБухгалтерии(Ссылка);
	
	
	ТаблицаНастройки = Константы.НастройкаОбменДаннымиХвояСайтЖКХ.Получить().Получить();
	Если ТипЗнч(ТаблицаНастройки) = Тип("ТаблицаЗначений") Тогда
		
		НайденныеСтроки = ТаблицаНастройки.НайтиСтроки(Новый Структура("Организация", Здание.Организация));
		Если НайденныеСтроки.Количество() <> 0 Тогда
			НайденныеСтроки[0].ДатаНачалаВыгрузкиНаСайт = НачалоМесяца(Дата);	
		КонецЕсли;
		
		Константы.НастройкаОбменДаннымиХвояСайтЖКХ.Установить(Новый ХранилищеЗначения(ТаблицаНастройки));
    КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ОтключитьДатыЗапретаИзменения(Отказ);
	КонецЕсли;
	
КонецПроцедуры
