
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаЗакрытиеЛицевогоСчета, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет,
	|	ЛОЖЬ КАК Действует,
	|	&ДатаДокумента КАК Период
	|ИЗ
	|	РегистрСведений.ЛицевыеСчета.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК ЛицевыеСчетаСрезПоследних
	|ГДЕ
	|	ЛицевыеСчетаСрезПоследних.Действует = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НазначенныеСубсидииСрезПоследних.ЛицевойСчет,
	|	НазначенныеСубсидииСрезПоследних.Услуга,
	|	ЛОЖЬ КАК Действует,
	|	&ДатаДокумента КАК Период
	|ИЗ
	|	РегистрСведений.НазначенныеСубсидии.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК НазначенныеСубсидииСрезПоследних
	|ГДЕ
	|	НазначенныеСубсидииСрезПоследних.Действует = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НазначенныеУслугиСрезПоследних.Организация,
	|	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
	|	НазначенныеУслугиСрезПоследних.Услуга,
	|	ЛОЖЬ КАК Действует,
	|	&ДатаДокумента КАК Период
	|ИЗ
	|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК НазначенныеУслугиСрезПоследних
	|ГДЕ
	|	НазначенныеУслугиСрезПоследних.Действует = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
	|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
	|	ЛОЖЬ КАК Действует,
	|	&ДатаДокумента КАК Период
	|ИЗ
	|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
	|			&ДатаДокумента,
	|			ОбъектУстановки = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК УстановленныеПриборыУчетаСрезПоследних
	|ГДЕ
	|	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НазначенныеУслугиПодробноСрезПоследних.Организация,
	|	НазначенныеУслугиПодробноСрезПоследних.ЛицевойСчет,
	|	НазначенныеУслугиПодробноСрезПоследних.Услуга,
	|	НазначенныеУслугиПодробноСрезПоследних.УслугаПодробно,
	|	ЛОЖЬ КАК Действует,
	|	&ДатаДокумента КАК Период
	|ИЗ
	|	РегистрСведений.НазначенныеУслугиПодробно.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК НазначенныеУслугиПодробноСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НазначенныеЛьготыСрезПоследних.ПотребительУслуг,
	|	НазначенныеЛьготыСрезПоследних.Льгота,
	|	НазначенныеЛьготыСрезПоследних.Услуга,
	|	ЛОЖЬ КАК Действует,
	|	&ДатаДокумента КАК Период,
	|	НазначенныеЛьготыСрезПоследних.ЛицевойСчет
	|ИЗ
	|	РегистрСведений.НазначенныеЛьготы.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК НазначенныеЛьготыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет,
	|	&ДатаДокумента КАК Период,
	|	ЗНАЧЕНИЕ(Справочник.ПотребителиУслуг.ПустаяСсылка) КАК ОтветственныйВладелец
	|ИЗ
	|	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОПрописанныхЖильцахСрезПоследних.ЛицевойСчет,
	|	СведенияОПрописанныхЖильцахСрезПоследних.Жилец,
	|	ЛОЖЬ КАК Прописан,
	|	&ДатаДокумента КАК Период
	|ИЗ
	|	РегистрСведений.СведенияОПрописанныхЖильцах.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК СведенияОПрописанныхЖильцахСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОПроживающихЖильцахСрезПоследних.ЛицевойСчет,
	|	СведенияОПроживающихЖильцахСрезПоследних.Жилец,
	|	&ДатаДокумента КАК Период,
	|	ЛОЖЬ КАК Проживает
	|ИЗ
	|	РегистрСведений.СведенияОПроживающихЖильцах.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК СведенияОПроживающихЖильцахСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МашиноМестаСрезПоследних.ЛицевойСчет,
	|	МашиноМестаСрезПоследних.ВидМашиноМеста,
	|	&ДатаДокумента КАК Период,
	|	"""" КАК НомерМашиноМеста,
	|	0 КАК КоличествоМашиноМест
	|ИЗ
	|	РегистрСведений.МашиноМеста.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК МашиноМестаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыЛицевогоСчетаСрезПоследних.ЛицевойСчет,
	|	ДополнительныеРеквизитыЛицевогоСчетаСрезПоследних.ДополнительныйРеквизит,
	|	&ДатаДокумента КАК Период,
	|	0 КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеРеквизитыЛицевогоСчета.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК ДополнительныеРеквизитыЛицевогоСчетаСрезПоследних";
	 
	Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(ДокументСсылкаЗакрытиеЛицевогоСчета.Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет", ДокументСсылкаЗакрытиеЛицевогоСчета.ЛицевойСчет);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗакрытиеЛицевогоСчета);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЛицевыеСчета", РезультатЗапроса[0].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНазначенныеСубсидии", РезультатЗапроса[1].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНазначенныеУслуги", РезультатЗапроса[2].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУстановленныеПриборыУчета", РезультатЗапроса[3].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНазначенныеУслугиПодробно", РезультатЗапроса[4].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНазначенныеЛьготы", РезультатЗапроса[5].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтветственныйВладелецЛицевогоСчета", РезультатЗапроса[6].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСведенияОПрописанныхЖильцах", РезультатЗапроса[7].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСведенияОПроживающихЖильцах", РезультатЗапроса[8].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаМашиноМеста", РезультатЗапроса[9].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДополнительныеРеквизитыЛицевогоСчета", РезультатЗапроса[10].Выгрузить());
	
КонецПроцедуры
