////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ЗакрытиеЛицевогоСчета.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ПроведениеСервер.ОтразитьЛицевыеСчета(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьНазначенныеСубсидии(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьНазначенныеУслуги(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьНазначенныеУслугиПодробно(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьУстановленныеПриборыУчета(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьНазначенныеЛьготы(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьОтветственныйВладелецЛицевогоСчета(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьСведенияОПрописанныхЖильцах(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьСведенияОПроживающихЖильцах(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьМашиноМеста(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьДополнительныеРеквизитыЛицевогоСчета(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры
