////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
КонецПроцедуры

// Процедура - обработчик события формы "ПриЗагрузкеДанныхИзНастроекНаСервере".
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОтборОрганизация	 		= Настройки.Получить("ОтборОрганизация");
	ОтборЗдание		 			= Настройки.Получить("ОтборЗдание");
	ОтборПодъезд	 			= Настройки.Получить("ОтборПодъезд");
	ОтборЖилойФонд				= Настройки.Получить("ОтборЖилойФонд");
	
	УстановитьСвязиПараметровВыбора();
	
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет.ОбъектЛицевогоСчета.Владелец",	ОтборЗдание,		ЗначениеЗаполнено(ОтборЗдание));
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Организация",								ОтборОрганизация,	ЗначениеЗаполнено(ОтборОрганизация));
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд",	ОтборПодъезд,		ЗначениеЗаполнено(ОтборПодъезд));
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд",	ОтборЖилойФонд,		ЗначениеЗаполнено(ОтборЖилойФонд));
	
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура УстановитьОтбор()
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Организация",								ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет.ОбъектЛицевогоСчета.Владелец",	ОтборЗдание, ЗначениеЗаполнено(ОтборЗдание));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд",	ОтборПодъезд, ЗначениеЗаполнено(ОтборПодъезд));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗданиеПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодъездПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЖилойФондПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд", ОтборЖилойФонд, ЗначениеЗаполнено(ОтборЖилойФонд));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбора()
	
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Организация", "ОтборОрганизация", РежимИзмененияСвязанногоЗначения.НеИзменять);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		Элементы.ОтборЗдание.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
		Если ОтборЗдание.Организация <> ОтборОрганизация Тогда
			ОтборЗдание = Справочники.ЗданияИСооружения.ПустаяСсылка();
			ОтборПодъезд = Справочники.Подъезды.ПустаяСсылка();
		КонецЕсли;
	Иначе		
		Элементы.ОтборЗдание.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив());
	КонецЕсли;
	
КонецПроцедуры	

