
//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
// Функция помещает результаты подбора в хранилище
Функция ЗаписатьПодборВХранилище() 
	
	Возврат ПоместитьВоВременноеХранилище(ОтобранныеЛицевыеСчета.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ЗаписатьПодборВХранилище());
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДатаНачала") тогда
		ДатаНачала = Параметры.ДатаНачала;
	КонецЕсли;
	Если Параметры.Свойство("ДатаОкончания") тогда
		ДатаОкончания = Параметры.ДатаОкончания;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборОрганизация") тогда
		ОтборОрганизация = Параметры.ОтборОрганизация;
		Если ЗначениеЗаполнено(ОтборОрганизация) тогда
			Элементы.ОтборОрганизация.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("ОтборЗдание") тогда
		ОтборЗдание = Параметры.ОтборЗдание;
		Если ЗначениеЗаполнено(ОтборЗдание) тогда
			Элементы.ОтборЗдание.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("ОтборПодъезд") тогда
		ОтборПодъезд = Параметры.ОтборПодъезд;
		Если ЗначениеЗаполнено(ОтборПодъезд) тогда
			Элементы.ОтборПодъезд.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("ОтборЖилойФонд") тогда
		ОтборЖилойФонд = Параметры.ОтборЖилойФонд;
		Если ЗначениеЗаполнено(ОтборЖилойФонд) тогда
			Элементы.ОтборЖилойФонд.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ЛицевойСчет
	|ПОМЕСТИТЬ втЛС
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет
	|	ИЗ
	|		РегистрСведений.ЛицевыеСчета КАК ЛицевыеСчета
	|	ГДЕ
	|		ЛицевыеСчета.Период >= &ДатаНач
	|		И ЛицевыеСчета.Период <= &ДатаКон
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЛицевыеСчета.ЛицевойСчет
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ЛицевыеСчетаСрезПоследних.ЛицевойСчет
	|	ИЗ
	|		РегистрСведений.ЛицевыеСчета.СрезПоследних(&ДатаНач, ) КАК ЛицевыеСчетаСрезПоследних
	|	ГДЕ
	|		ЛицевыеСчетаСрезПоследних.Действует) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	|ИЗ
	|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|ГДЕ
	|	НЕ ЛицевыеСчета.Ссылка В
	|				(ВЫБРАТЬ
	|					втЛС.ЛицевойСчет
	|				ИЗ
	|					втЛС КАК втЛС)";
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", ДатаОкончания);
	
	ТабЛС = Запрос.Выполнить().Выгрузить();
	МассивЛС = ТабЛС.ВыгрузитьКолонку("ЛицевойСчет");
	СпЛС.ЗагрузитьЗначения(МассивЛС);
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗданиеПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(ЛицевыеСчета, "Здание", ОтборЗдание, ЗначениеЗаполнено(ОтборЗдание));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодъездПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(ЛицевыеСчета, "Подъезд", ОтборПодъезд, ЗначениеЗаполнено(ОтборПодъезд));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(ЛицевыеСчета, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЖилойФондПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(ЛицевыеСчета, "ЖилойФонд", ОтборЖилойФонд, ЗначениеЗаполнено(ОтборЖилойФонд));
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьВыбранныеЛицевыеСчета(СтруктураОтбора)
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(СтруктураОтбора.Ключ) = Тип("СправочникСсылка.ЗданияИСооружения") тогда
		ТекстОтбора = "Владелец = &ЗначениеОтбора"; 	
	ИначеЕсли ТипЗнч(СтруктураОтбора.Ключ) = Тип("СправочникСсылка.Подъезды") тогда
		ТекстОтбора = "ОбъектЛицевогоСчета.Подъезд = &ЗначениеОтбора"; 	
	Иначе
		ТекстОтбора = ""; 	
	КонецЕсли;
	
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
		|	ВложенныйЗапрос.ЛицевойСчет,
		|	ВложенныйЗапрос.Здание,
		|	ВложенныйЗапрос.ОбъектЛицевогоСчета,
		|	ВложенныйЗапрос.Подъезд
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|		ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец КАК Здание,
		|		ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
		|		ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд КАК Подъезд
		|	ИЗ
		|		РегистрСведений.ЛицевыеСчета.СрезПоследних(
		|				&ДатаНач,
		|				Действует
		|					И ВЫБОР
		|						КОГДА &ЖилойФонд = ЗНАЧЕНИЕ(Перечисление.ЖилойНеЖилойФонд.ПустаяСсылка)
		|							ТОГДА ИСТИНА
		|						ИНАЧЕ ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд
		|					КОНЕЦ
		|					И ЛицевойСчет." + ТекстОтбора +") КАК ЛицевыеСчетаСрезПоследних
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЛицевыеСчета.ЛицевойСчет,
		|		ЛицевыеСчета.ЛицевойСчет.Владелец,
		|		ЛицевыеСчета.ЛицевойСчет.ОбъектЛицевогоСчета,
		|		ЛицевыеСчета.ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд
		|	ИЗ
		|		РегистрСведений.ЛицевыеСчета КАК ЛицевыеСчета
		|	ГДЕ
		|		ЛицевыеСчета.Период >= &ДатаНач
		|		И ЛицевыеСчета.Период <= &ДатаКон
		|		И ЛицевыеСчета.ЛицевойСчет." + ТекстОтбора +"
		|		И ВЫБОР
		|				КОГДА &ЖилойФонд = ЗНАЧЕНИЕ(Перечисление.ЖилойНеЖилойФонд.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛицевыеСчета.ЛицевойСчет.ОбъектЛицевогоСчета.ЖилойФонд = &ЖилойФонд
		|			КОНЕЦ) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО ВложенныйЗапрос.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет";
	
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", ДатаОкончания);
	Запрос.УстановитьПараметр("ЗначениеОтбора", СтруктураОтбора.Ключ);
	Запрос.УстановитьПараметр("ЖилойФонд", ОтборЖилойФонд);
	
	ТаблицаЛС = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицаЛС Из ТаблицаЛС цикл
		Если ОтборЭлекстроннаяПочта Тогда
			Если ОтборЭлектроннаяПочтаЗначение ="Заполнено" Тогда
				Если  СокрЛП(СтрокаТаблицаЛС.ЛицевойСчет.ЭлПочта) = "" Тогда
					Продолжить;
				КонецЕсли;
			Иначе
				Если  СокрЛП(СтрокаТаблицаЛС.ЛицевойСчет.ЭлПочта) <> "" Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ОтборТелефон Тогда
			Если  СокрЛП(СтрокаТаблицаЛС.ЛицевойСчет.МобТелефон) <> "" Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
					
		Если ОтборТолькоДействующие и СтрокаТаблицаЛС.ОтветственныйВладелец = Справочники.ПотребителиУслуг.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ЛицевойСчет", СтрокаТаблицаЛС.ЛицевойСчет);
		Строки = ОтобранныеЛицевыеСчета.НайтиСтроки(СтруктураОтбора); 
		Если Строки.Количество() > 0 тогда
			ЗаполнитьЗначенияСвойств(Строки[0],СтрокаТаблицаЛС);
		Иначе
			НоваяСтрока = ОтобранныеЛицевыеСчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицаЛС);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЛицевойСчетВОтобранные(СтрокаСпискаЛицевыхСчетов)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ЛицевойСчет", СтрокаСпискаЛицевыхСчетов.ЛицевойСчет);
	Строки = ОтобранныеЛицевыеСчета.НайтиСтроки(СтруктураОтбора);
	ОтветственныйВладелец = ПолучитьВладелца(СтрокаСпискаЛицевыхСчетов.ЛицевойСчет);
	
	Если Строки.Количество() > 0 тогда
		ЗаполнитьЗначенияСвойств(Строки[0],СтрокаСпискаЛицевыхСчетов);
		Строки[0].ОтветственныйВладелец = ОтветственныйВладелец;
	Иначе
		НоваяСтрока = ОтобранныеЛицевыеСчета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаСпискаЛицевыхСчетов);
		НоваяСтрока.ОтветственныйВладелец = ОтветственныйВладелец;
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьВладелца(ЛицевойСчет)

		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец
		|ИЗ
		|	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|ГДЕ
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет = &ЛицевойСчет";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.ПотребителиУслуг.ПустаяСсылка();
	КонецЕсли;	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.ОтветственныйВладелец;
	

КонецФункции // ()


&НаКлиенте
Процедура ЛицевыеСчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаСпискаЛицевыхСчетов = Элемент.ТекущиеДанные;
	
	Если СтрокаСпискаЛицевыхСчетов.Свойство("ГруппировкаСтроки") тогда
		
		Если ТипЗнч(СтрокаСпискаЛицевыхСчетов.ГруппировкаСтроки) = Тип("СтрокаГруппировкиДинамическогоСписка") тогда
			
			СтруктураОтбора = Новый Структура;
			Если ТипЗнч(СтрокаСпискаЛицевыхСчетов.ГруппировкаСтроки.Ключ) = Тип("Строка") тогда
				СтруктураОтбора.Вставить("Ключ", СтрокаСпискаЛицевыхСчетов.РодительскаяГруппировкаСтроки.Ключ);
			Иначе
				СтруктураОтбора.Вставить("Ключ", СтрокаСпискаЛицевыхСчетов.ГруппировкаСтроки.Ключ);
			КонецЕсли;
			
			ПолучитьВыбранныеЛицевыеСчета(СтруктураОтбора);
			
		Иначе

			ДобавитьЛицевойСчетВОтобранные(СтрокаСпискаЛицевыхСчетов);	
			
		КонецЕсли;
		
	Иначе
		
		ДобавитьЛицевойСчетВОтобранные(СтрокаСпискаЛицевыхСчетов);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобранныеЛицевыеСчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(ЛицевыеСчета, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(ЛицевыеСчета, "Здание", ОтборЗдание, ЗначениеЗаполнено(ОтборЗдание));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(ЛицевыеСчета, "Подъезд", ОтборПодъезд, ЗначениеЗаполнено(ОтборПодъезд));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(ЛицевыеСчета, "ЖилойФонд", ОтборЖилойФонд, ЗначениеЗаполнено(ОтборЖилойФонд));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(ЛицевыеСчета, "ЛицевойСчет", спЛС, Истина, ВидСравненияКомпоновкиДанных.НеВСписке);
	
	Элементы.ЛицевыеСчета.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;

	ОтборТолькоДействующие = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтборЭлекстроннаяПочтаПриИзменении(Элемент)
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(ЛицевыеСчета, "ЭлПочта", Истина, ОтборЭлекстроннаяПочта,ВидСравненияКомпоновкиДанных.Заполнено);
КонецПроцедуры

&НаКлиенте
Процедура ОтборТелефонПриИзменении(Элемент)
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(ЛицевыеСчета, "МобТелефон", Истина, ОтборТелефон,ВидСравненияКомпоновкиДанных.Заполнено);
КонецПроцедуры


