
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаАктСнятияПоказанийТеплосчетчикаПоказанияПриборов, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	КОНЕЦПЕРИОДА(АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Период,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ПриборУчета,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ЕдиницаИзмерения,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ВидТарифа,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Коэффициент,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ПоказаниеПредыдущее,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ПоказаниеТекущее,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.РазницаПоказания,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.ЛицевойСчет,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.Организация,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.Здание,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.Исполнитель,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.Автор КАК Ответственный,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.ПериодНачисления,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.НаработкаТеплосчетчикаПредыдущее,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.НаработкаТеплосчетчикаТекущее,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.РазницаЧасы,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ОбъемВодыПоТеплоСчетчикуПредыдущее,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ОбъемВодыПоТеплоСчетчикуТекущее,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.РазницаВода,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ЧасыПростояПредыдущие,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ЧасыПростояТекущие,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ЧасыПростояРазница,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.ТемператураПодача,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.ТемператураОбратка,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.РасходТеплоносителя,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.МоментальнаяМощность,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.СреднеДневноеПотребление
		 |ИЗ
		 |	Документ.АктСнятияПоказанийТеплосчетчика.ПоказанияПриборов КАК АктСнятияПоказанийТеплосчетчикаПоказанияПриборов
		 |ГДЕ
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАктСнятияПоказанийТеплосчетчикаПоказанияПриборов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПоказанияПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура Печать(МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСнятияПоказаний") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктСнятияПоказаний", "АктСнятияПоказаний", ПечатьДокумента(МассивОбъектов, ОбъектыПечати, "АктСнятияПоказаний"));
	КонецЕсли;	
	
КонецПроцедуры

Функция ПечатьДокумента(ТекущийДокумент, ОбъектыПечати, ИмяМакета)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктСнятияПоказаний";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ЕдиницаИзмерения,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ПоказаниеПредыдущее,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.НаработкаТеплосчетчикаПредыдущее,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ОбъемВодыПоТеплоСчетчикуПредыдущее,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ЧасыПростояПредыдущие,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ПриборУчета.ЗаводскойНомер КАК ЗаводскойНомер,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.Здание КАК Здание,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ПриборУчета.Услуга КАК Услуга,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ПриборУчета,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.Исполнитель,
		|	КОНЕЦПЕРИОДА(АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Дата,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ПоказаниеТекущее,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.РазницаПоказания,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.НаработкаТеплосчетчикаТекущее,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.РазницаЧасы,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ОбъемВодыПоТеплоСчетчикуТекущее,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.РазницаВода,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ЧасыПростояТекущие,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ЧасыПростояРазница,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.ТемператураПодача,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.ТемператураОбратка,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.РасходТеплоносителя,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.МоментальнаяМощность,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.Организация
		|ИЗ
		|	Документ.АктСнятияПоказанийТеплосчетчика.ПоказанияПриборов КАК АктСнятияПоказанийТеплосчетчикаПоказанияПриборов
		|ГДЕ
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Макет = Документы.АктСнятияПоказанийТеплосчетчика.ПолучитьМакет("АктСнятияПоказаний");
	ОбластьМакета = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	
	Для Каждого стр Из РезультатЗапроса Цикл
		Если стр.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000106") Тогда
			ОбластьМакета.Параметры.Водомер = стр.ПоказаниеПредыдущее;
			ОбластьМакета.Параметры.ВодомерПосл = стр.ПоказаниеТекущее;
			ОбластьМакета.Параметры.ВодомерРазница = стр.РазницаПоказания;
		Иначе
			ОбластьМакета.Параметры.Дата = стр.Дата;
			ОбластьМакета.Параметры.Адрес = стр.Здание;
			ОбластьМакета.Параметры.НомерСчетчика = стр.ПриборУчета;
			ОбластьМакета.Параметры.Простой = стр.ЧасыПростояПредыдущие;
			ОбластьМакета.Параметры.Наработка = стр.НаработкаТеплосчетчикаПредыдущее;
			ОбластьМакета.Параметры.ЕдИзм = стр.ЕдиницаИзмерения;
			ОбластьМакета.Параметры.ТЕ = стр.ПоказаниеПредыдущее;
			ОбластьМакета.Параметры.ВодаТепло = стр.ОбъемВодыПоТеплоСчетчикуПредыдущее;
			ОбластьМакета.Параметры.Исполнитель = стр.Исполнитель;
			ОбластьМакета.Параметры.ПростойПосл = стр.ЧасыПростояТекущие;
			ОбластьМакета.Параметры.ПростойРазница = стр.ЧасыПростояРазница;
			ОбластьМакета.Параметры.НаработкаПосл = стр.НаработкаТеплосчетчикаТекущее;
			ОбластьМакета.Параметры.НаработкаРазница = стр.РазницаЧасы;
			ОбластьМакета.Параметры.ТЕпосл = стр.ПоказаниеТекущее;
			ОбластьМакета.Параметры.ТЕразница = стр.РазницаПоказания;
			ОбластьМакета.Параметры.ВодаТеплоПосл = стр.ОбъемВодыПоТеплоСчетчикуТекущее;
			ОбластьМакета.Параметры.ВодаТеплоРазница = стр.РазницаВода;
			ОбластьМакета.Параметры.Тподача = стр.ТемператураПодача;
			ОбластьМакета.Параметры.ТОбратка = стр.ТемператураОбратка;
			ОбластьМакета.Параметры.РасходТН = стр.РасходТеплоносителя;
			ОбластьМакета.Параметры.Мощность = стр.МоментальнаяМощность;
			ОбластьМакета.Параметры.Организация = стр.Организация;
		КонецЕсли;
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
КонецФункции