
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Обработчик события "ПередОткрытием" формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Организация = ОСМДПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнаяОрганизация");
		Объект.ТипОбмена   = Перечисления.ТипыОбменаССайтом.Напрямую;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Обработчик события "ПриОткрытии" формы.
//
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
КонецПроцедуры // ПриОткрытии()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

&НаКлиенте
// Обработчик события "ПриИзменении" поля ввода "ТипОбмена".
//
Процедура ТипОбменаПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры // ТипОбменаПриИзменении()

&НаКлиенте
// Обработчик события "НачалоВыбора" поля ввода "ФайловыйРесурс".
//
Процедура ФайловыйРесурсНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборКаталога();
	
КонецПроцедуры // ФайловыйРесурсНачалоВыбора()

&НаКлиенте
// Обработчик события "Открытие" поля ввода "ФайловыйРесурс".
//
Процедура ФайловыйРесурсОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	ПроверитьНаличиеКаталога();
	
	ЗапуститьПриложение(Объект.ФайловыйРесурс);
	
КонецПроцедуры // ФайловыйРесурсОткрытие()

&НаКлиенте
// Обработчик события "ПриИзменении" флага "ХранитьПароль".
//
Процедура ХранитьПарольПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры // ХранитьПарольПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
// Обработка команды "ПроверитьПодключение".
//
Процедура ПроверитьПодключение(Команда)
	
	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Необходимо записать элемент.';uk='Необхідно записати елемент.'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.ХранитьПароль Тогда
		Пароль = ОткрытьФормуМодально("ОбщаяФорма.ВебИнтеграцияВводПароля");
	Иначе
		Пароль = Объект.Пароль;
	КонецЕсли;
	
	Если ВебИнтеграцияОбщегоНазначения.ПроверитьПодключениеКСайту(Объект.АдресСайта,
																			 Объект.Логин,
																			 Пароль,,Объект.ВидШаблонаСайта) Тогда
		Сообщить(НСтр("ru='Подключение выполнено успешно.';uk='Підключення виконано успішно.'"));
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось подключиться к сайту.';uk='Не вдалося підключитися до сайту.'"));
	КонецЕсли;
	
КонецПроцедуры // ПроверитьПодключение()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
// Управление видимостью элементов формы.
//
Процедура УправлениеФормой()
	
	Если Объект.ТипОбмена = ПредопределенноеЗначение("Перечисление.ТипыОбменаССайтом.ЧерезФайловыйРесурс") Тогда
		Элементы.ФайловыйРесурс.Видимость         = Истина;
		Элементы.НадписьПояснениеОбмен.Видимость  = Истина;
		Элементы.АдресСайта.ОтметкаНезаполненного = Ложь;
		Элементы.Логин.ОтметкаНезаполненного      = Ложь;
	Иначе
		Элементы.ФайловыйРесурс.Видимость         = Ложь;
		Элементы.НадписьПояснениеОбмен.Видимость  = Ложь;
		Элементы.АдресСайта.ОтметкаНезаполненного = Истина;
		Элементы.Логин.ОтметкаНезаполненного      = Истина;
	КонецЕсли;
	
	Элементы.НадписьХранитьПарольПояснение.Видимость = (НЕ Объект.ХранитьПароль);
	
КонецПроцедуры // УправлениеФормой()

&НаКлиенте
// Процедура выбора каталога.
//
Процедура ВыборКаталога()
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогВыбораКаталога.Заголовок               = "Выберите каталог";
	ДиалогВыбораКаталога.ПредварительныйПросмотр = Ложь;
	ДиалогВыбораКаталога.ИндексФильтра           = 0;
	ДиалогВыбораКаталога.Каталог                 = Объект.ФайловыйРесурс;
	
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Объект.ФайловыйРесурс = ДиалогВыбораКаталога.Каталог;
	КонецЕсли;
	
КонецПроцедуры // ВыборКаталога()

&НаСервере
// Проверяет наличие указанного каталога.
//
Процедура ПроверитьНаличиеКаталога()
	
	//СправочникОбъект = РеквизитФормыВЗначение("Объект", Тип("СправочникОбъект.ДанныеДляДоступаНаСайт"));
	//
	//Если НЕ СправочникОбъект.ПроверкаСуществованияКаталога() Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");
	
КонецПроцедуры // ПроверитьНаличиеКаталога()


