////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ С КАРТАМИ

Функция ПолучитьТекстМакета() Экспорт
	
	ИмяМакета = "СкриптЯндексКарты";
	Попытка
		Сервис = Новый HTTPСоединение("geocode-maps.yandex.ru");
		Сервис.Получить("/1.x/?geocode=40,40",ПолучитьИмяВременногоФайла());			
	Исключение
		ИмяМакета = "НетИнтернета";
	КонецПопытки;
	
	Возврат РаботаСКартамиСервер.ПолучитьТекстМакета(ИмяМакета);
	
КонецФункции

// Выполняет обращение к сервису геокодирования и разбирает ответ в структуру
//
//  Параметры:
//   Адрес - Строка - адрес, для которого нужно определить координаты
//
//  Возвращаемое значение:
//   СтруктураОтвета - Структура - структура, содержащая координаты и адрес, для которого были определены координаты
//
Функция ПолучитьКоординатыПоЗапросу(Адрес) Экспорт
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Координаты","");
	СтруктураОтвета.Вставить("Область",""); 
	СтруктураОтвета.Вставить("НаселенныйПункт",""); 
	СтруктураОтвета.Вставить("Район","");
	СтруктураОтвета.Вставить("Улица","");
	СтруктураОтвета.Вставить("Дом",""); 	
	
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если Лев(СистемнаяИнформация.ВерсияПриложения, 3) = "8.1" Тогда
		Сервис = Новый HTTPСоединение("geocode-maps.yandex.ru",,,,, Истина);
	ИначеЕсли Лев(СистемнаяИнформация.ВерсияПриложения, 3) = "8.2" Тогда
		Сервис = Новый HTTPСоединение("geocode-maps.yandex.ru",,,,, Истина);
	ИначеЕсли Лев(СистемнаяИнформация.ВерсияПриложения, 3) = "8.3" Тогда		
		Сервис = Новый HTTPСоединение("geocode-maps.yandex.ru",,,,,, Новый ЗащищенноеСоединениеOpenSSL()); //на платформе 8.1 эту строку комментируем!		
	КонецЕсли;
	
	ИмяФайла = ПолучитьИмяВременногоФайла(); 	
	
	Попытка
		Сервис.Получить("/1.x/?geocode=" + РаботаСКартамиСервер.ПреобразоватьСтрокуВУТФ8(Адрес), ИмяФайла);
	Исключение
		Сообщить(ОписаниеОшибки());
		Сообщить("Обновите Вашу платформу до последнего релиза...");
		Возврат Неопределено;
	КонецПопытки;
	
	//Сервис.Получить("/1.x/?geocode=" + РаботаСКартамиСервер.ПреобразоватьСтрокуВУТФ8(Адрес), ИмяФайла);
	////Сервис.Получить("/1.x/?geocode=" + ПреобразоватьСтрокуВУТФ8(Адрес) + "&key=СюдаНужноВбитьИндивидуальныйКлюч==", ИмяФайла);
	
	//Разбор XML ответа
	StreamXML = New XMLReader;
	StreamXML.OpenFile(ИмяФайла);		
	StreamXML.Read();
	
	НашлиДом = Ложь;	
	
	//Чтение XML строки
	Пока StreamXML.Read() Цикл
		
		Если StreamXML.NodeType = XMLNodeType.StartElement И StreamXML.Name = "kind" Тогда
			StreamXML.Read();
			Если Строка(StreamXML.Value) = "house" Тогда
				НашлиДом = Истина;	
			КонецЕсли;
		КонецЕсли;
		
		Если НашлиДом Тогда
			Если StreamXML.NodeType = XMLNodeType.StartElement И StreamXML.Name = "pos" Тогда
				StreamXML.Read();
				СтруктураОтвета.Координаты = Строка(StreamXML.Value);
				
				//конвертируем в NMEA
				СтруктураОтвета.Координаты = РаботаСКартамиСервер.КонвертироватьWGS84NMEA(СтруктураОтвета.Координаты);
				
				Прервать;
			КонецЕсли;
			
			Если StreamXML.NodeType = XMLNodeType.StartElement И StreamXML.Name = "AdministrativeAreaName" Тогда
				StreamXML.Read();
				СтруктураОтвета.Область = Строка(StreamXML.Value);			
			КонецЕсли;
			
			Если StreamXML.NodeType = XMLNodeType.StartElement И StreamXML.Name = "LocalityName" Тогда
				StreamXML.Read();
				СтруктураОтвета.НаселенныйПункт = Строка(StreamXML.Value);			
			КонецЕсли;
			
			Если StreamXML.NodeType = XMLNodeType.StartElement И StreamXML.Name = "DependentLocalityName" Тогда
				StreamXML.Read();
				СтруктураОтвета.Район = Строка(StreamXML.Value);			
			КонецЕсли;
			
			Если StreamXML.NodeType = XMLNodeType.StartElement И StreamXML.Name = "ThoroughfareName" Тогда
				StreamXML.Read();
				СтруктураОтвета.Улица = Строка(StreamXML.Value);			
			КонецЕсли;
			
			Если StreamXML.NodeType = XMLNodeType.StartElement И StreamXML.Name = "PremiseNumber" Тогда
				StreamXML.Read();
				СтруктураОтвета.Дом = Строка(StreamXML.Value);			
			КонецЕсли;
		КонецЕсли;
		
	    Продолжить;
	КонецЦикла;
	
	StreamXML.Close();
	
	Если НашлиДом Тогда
		Возврат СтруктураОтвета;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
КонецФункции 

