
&НаКлиенте
Процедура Готово(Команда)
	#Если Не ВебКлиент Тогда
	
	ТекФайл = Новый Файл(Объект.ИмяФайлаДанных);
	Расширение = ТекФайл.Расширение;
	
	Если НРег(СокрЛП(Расширение)) = ".xml" Тогда
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ТекФайл.ПолноеИмя);
		
		СписокНужныхДанных = Новый Структура;
		СписокНужныхДанных.Вставить("number",);
		СписокНужныхДанных.Вставить("date",);
		СписокНужныхДанных.Вставить("status",);
		СписокНужныхДанных.Вставить("text",);
		СписокНужныхДанных.Вставить("title",);
		СписокНужныхДанных.Вставить("category");
		
		Пока ЧтениеXML.Прочитать() Цикл
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

				Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
					Если ЧтениеXML.Имя = "filedate" Тогда
						ДатаДокумента = ЧтениеXML.Значение;
					КонецЕсли;
					
					ИмяАтрибута =  ЧтениеXML.Имя;
					Атрибут = ЧтениеXML.Значение;
					
					Если ИмяАтрибута = "number" Тогда
						СписокНужныхДанных.number = Атрибут;
					ИначеЕсли ИмяАтрибута = "date" Тогда
						СписокНужныхДанных.date = Атрибут;
					ИначеЕсли ИмяАтрибута = "status" Тогда
						СписокНужныхДанных.status = ПроверитьСтатусНаСервере(Атрибут);
					ИначеЕсли ИмяАтрибута = "text" Тогда
						СписокНужныхДанных.text = Атрибут;
					ИначеЕсли ИмяАтрибута = "title" Тогда
						СписокНужныхДанных.title = Атрибут;
					ИначеЕсли ИмяАтрибута = "category" Тогда
						СписокНужныхДанных.category = ПолучитьВидЗаявки(Атрибут);
					ИначеЕсли  ИмяАтрибута = "user" Тогда
						НоваяСтрока = ТаблицаДляЗагрузки.Добавить();
						
						НоваяСтрока.НомерДокумента = СписокНужныхДанных.number;
						НоваяСтрока.ДатаДокумента = СписокНужныхДанных.date;
						НоваяСтрока.СтатусЗаявки = СписокНужныхДанных.status;
						НоваяСтрока.ТекстЗаявки = СписокНужныхДанных.text;
						НоваяСтрока.ЗаголовокЗаявки = СписокНужныхДанных.title;
						НоваяСтрока.ЛицевойСчет = ПолучитьЛицевойСчет(Атрибут);
						НоваяСтрока.ВидЗаявки = СписокНужныхДанных.category;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Если ТаблицаДляЗагрузки.Количество() > 0 Тогда
			СоздатьЗаявкуДляАС();
		КонецЕсли;
	КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидЗаявки(Атрибут)
	Если Атрибут = "Обычная" Тогда
		Возврат Перечисления.ВидыЗаявокНаПроведенияРемонта.Обычная;
	Иначе
		Возврат Перечисления.ВидыЗаявокНаПроведенияРемонта.Аварийная;
	КонецЕсли;
КонецФункции // ПолучитьВидЗаявки()
 

&НаСервере
Процедура СоздатьЗаявкуДляАС()
	Для каждого Строка Из ТаблицаДляЗагрузки Цикл
		Ссылка = Документы.ЗаявкаНаПроведениеРемонта.НайтиПоНомеру(Строка.НомерДокумента,ДатаДокумента);
		
		НовыйДокумент = ?(ПустаяСтрока(Ссылка),Документы.ЗаявкаНаПроведениеРемонта.СоздатьДокумент(),Ссылка.ПолучитьОбъект());
		
		Если ПустаяСтрока(Ссылка) Тогда
			НовыйДокумент.Дата = ?(Строка.ДатаДокумента = Дата(0001,01,01,00,00,00), ДатаДокумента, Строка.ДатаДокумента);
			НовыйДокумент.Номер = Строка.НомерДокумента;
			НовыйДокумент.Автор = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		НовыйДокумент.АвторПоследнегоИзменения = ПараметрыСеанса.ТекущийПользователь;
		НовыйДокумент.ДатаПоследнегоИзменения = ТекущаяДата();
		НовыйДокумент.ЛицевойСчет = Строка.ЛицевойСчет;
		НовыйДокумент.СтатусЗаявки = Строка.СтатусЗаявки;
		НовыйДокумент.ТекстЗаявки = Строка.ТекстЗаявки;
		НовыйДокумент.Здание = Строка.ЛицевойСчет.Владелец;
		НовыйДокумент.ВидЗаявки = Строка.ВидЗаявки;
		НовыйДокумент.Организация = ОСМДПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПараметрыСеанса.ТекущийПользователь,"ОсновнаяОрганизация"); 
		НовыйДокумент.Заказчик = ОпределитьОтветственногоВладельца(Новый Структура("ЛицевойСчет",Строка.ЛицевойСчет)).ОтветственныйВладелец;
		Если Строка.ЛицевойСчет = Справочники.ЛицевыеСчета.ПустаяСсылка() Тогда
			НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийЗаявокНаПроведениеРемонта.ПроведениеРаботПоЗданию;
		Иначе	
			НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийЗаявокНаПроведениеРемонта.ПроведениеРаботПоЛицевомуСчету;
		КонецЕсли; 
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьОтветственногоВладельца(СтруктураДанные)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЛицевыеСчетаСрезПоследних.КоличествоПрописанных, 0) КАК КоличествоПрописанных,
		|	ЕСТЬNULL(ЛицевыеСчетаСрезПоследних.КоличествоПроживающих, 0) КАК КоличествоПроживающих,
		|	ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец, ЗНАЧЕНИЕ(Справочник.ПотребителиУслуг.ПустаяСсылка)) КАК ОтветственныйВладелец,
		|	ЕСТЬNULL(МашиноМестаСрезПоследних.НомерМашиноМеста, """") КАК НомерМашиноМеста,
		|	ЕСТЬNULL(МашиноМестаСрезПоследних.КоличествоМашиноМест, 0) КАК КоличествоМашиноМест
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК ЛицевыеСчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО ЛицевыеСчетаСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МашиноМеста.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК МашиноМестаСрезПоследних
		|		ПО ЛицевыеСчетаСрезПоследних.ЛицевойСчет = МашиноМестаСрезПоследних.ЛицевойСчет
		|ГДЕ
		|	ЛицевыеСчетаСрезПоследних.Действует = ИСТИНА";
		
	Запрос.УстановитьПараметр("ЛицевойСчет", СтруктураДанные.ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		СтруктураДанные.Вставить("ОтветственныйВладелец",	РезультатЗапроса.ОтветственныйВладелец);
		СтруктураДанные.Вставить("КоличествоПрописанных",	РезультатЗапроса.КоличествоПрописанных);
		СтруктураДанные.Вставить("КоличествоПроживающих",	РезультатЗапроса.КоличествоПроживающих);
		СтруктураДанные.Вставить("НомерМашиноМеста",			РезультатЗапроса.НомерМашиноМеста);
		СтруктураДанные.Вставить("КоличествоМашиноМест",		РезультатЗапроса.КоличествоМашиноМест);
		
	Иначе
		СтруктураДанные.Вставить("ОтветственныйВладелец",	Справочники.ПотребителиУслуг.ПустаяСсылка());
		СтруктураДанные.Вставить("КоличествоПрописанных",	0);
		СтруктураДанные.Вставить("КоличествоПроживающих",	0);
		СтруктураДанные.Вставить("НомерМашиноМеста",			"");
		СтруктураДанные.Вставить("КоличествоМашиноМест",		0);
		
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Функция ПроверитьСтатусНаСервере(Атрибут)
	Если Атрибут = "5" Тогда
		Статус = Перечисления.ВидыСтатусовЗаявкиНаПроведениеРемонта.НоваяЗаявка;
	ИначеЕсли Атрибут = "6" ИЛИ Атрибут = "7" Тогда
		Статус = Перечисления.ВидыСтатусовЗаявкиНаПроведениеРемонта.Принята;
	ИначеЕсли Атрибут = "8" ИЛИ Атрибут = "9" Тогда
		Статус = Перечисления.ВидыСтатусовЗаявкиНаПроведениеРемонта.Выполнена;
	КонецЕсли;
	
	Возврат Статус;
КонецФункции // ()

&НаСервере
Функция ПолучитьЛицевойСчет(Атрибут)
	Возврат Справочники.ЛицевыеСчета.НайтиПоНаименованию(Атрибут);
КонецФункции // ПолучитьЛицевойСчет()
 
&НаКлиенте
Процедура ВыборФайла(Элемент, ПроверятьСуществование=Ложь, Знач РасширениеПоУмолчанию = "xml", 
	АрхивироватьФайлДанных = Истина, ВыборФайлаПравил = Ложь)
	
	ДиалогВыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр						=	"Файл данных (*.xml)|*.xml";
	ДиалогВыбораФайла.Расширение					=	"xml";
	
	ДиалогВыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	ДиалогВыбораФайла.ПолноеИмяФайла				=	Элемент.ТекстРедактирования;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	=	ПроверятьСуществование;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Объект.ИмяФайлаДанных = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры  //ВыборФайла()

&НаКлиенте
Процедура ПутьКФайлуДляЗагрузкиОткрытие(Элемент, СтандартнаяОбработка)
	ЗапуститьПриложение("explorer " + Элемент.ТекстРедактирования);
	СтандартнаяОбработка = ЛОЖЬ;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуДляЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		ВыборФайла(Элемент, , , );
КонецПроцедуры
