////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// В обработчике события ОбработкаЗаполнения документа выполняется
// - заполнение документа по документу-основанию.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Претензия") Тогда
		// Заполнение шапки
		ДатаПретензии = ДанныеЗаполнения.Дата;
		ДатаСобрания = ДанныеЗаполнения.ДатаСобрания;
		Должник = ДанныеЗаполнения.Должник;
		Здание = ДанныеЗаполнения.Здание;
		ЛицевойСчет = ДанныеЗаполнения.ЛицевойСчет;
		КонецПериода = ДанныеЗаполнения.НаДату;
		НачалоПериода = ДанныеЗаполнения.НачалоПериода;
		Организация = ДанныеЗаполнения.Организация;
		НачальнаяСуммаДолга = ДанныеЗаполнения.СуммаДолга;
	КонецЕсли;
	
КонецПроцедуры
