
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаЗакрытиеЛицевогоСчета, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоСубсидиямОстатки.Организация,
		|	РасчетыПоСубсидиямОстатки.ЛицевойСчет,
		|	РасчетыПоСубсидиямОстатки.Услуга,
		|	РасчетыПоСубсидиямОстатки.МесяцНачисления КАК МесяцНачисления,
		|	СУММА(РасчетыПоСубсидиямОстатки.СуммаОстаток) КАК Сумма
		|ИЗ
		|	РегистрНакопления.РасчетыПоСубсидиям.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ЛицевойСчет.Владелец = &Здание) КАК РасчетыПоСубсидиямОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоСубсидиямОстатки.ЛицевойСчет,
		|	РасчетыПоСубсидиямОстатки.МесяцНачисления,
		|	РасчетыПоСубсидиямОстатки.Услуга,
		|	РасчетыПоСубсидиямОстатки.Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	МесяцНачисления";
		
		
	Запрос.УстановитьПараметр("Период", Новый Граница(ДокументСсылкаЗакрытиеЛицевогоСчета.Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", ДокументСсылкаЗакрытиеЛицевогоСчета.Организация);
	Запрос.УстановитьПараметр("Здание", ДокументСсылкаЗакрытиеЛицевогоСчета.Здание);
	Запрос.УстановитьПараметр("Дата", ДокументСсылкаЗакрытиеЛицевогоСчета.Дата);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	ТаблицаСубсидии =  РезультатЗапроса.Выгрузить();
	
		
	
	ТаблицаРасчетыПоСубсидиям = Новый ТаблицаЗначений;
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("ВидДвижения");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("Период");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("Организация");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("ЛицевойСчет");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("Услуга");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("МесяцНачисления");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("Сумма");
	
	Для каждого Строка Из ТаблицаСубсидии Цикл
	
		 НоваяСтрока = ТаблицаРасчетыПоСубсидиям.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		 НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
		 НоваяСтрока.Период = ДокументСсылкаЗакрытиеЛицевогоСчета.Дата;
	
	
	КонецЦикла; 
	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГарантированныеСубсидии", ТаблицаРасчетыПоСубсидиям);


КонецПроцедуры

