
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
// Обработчик события "ПриОткрытии" формы.
//
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
КонецПроцедуры // ПриОткрытии()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

&НаКлиенте
// Обработчик события "ПриИзменении" флага "Статус".
//
Процедура СтатусПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры // СтатусПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
// Управление видимостью элементов формы.
//
Процедура УправлениеФормой()
	
	Элементы.Ошибка.Видимость = (НЕ Запись.Статус);
	
КонецПроцедуры // УправлениеФормой()


