
&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	ЗапросЛС = Новый Запрос;
	ЗапросЛС.Текст = 
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
		|ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(
	    |			&НаДату,
	    |			Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних";
	ЗапросЛС.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	РезультатЛС = ЗапросЛС.Выполнить().Выгрузить();
	
	Для Каждого стрЛС Из РезультатЛС Цикл
		Запрос = Новый Запрос;
		Запрос.Текст =
		   "ВЫБРАТЬ
		   |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Наименование КАК ЛицевойСчет,
		   |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.Наименование КАК ФИО,
		   |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЗаводскойНомер КАК НомерПрибораУчета,
		   |	ПоказанияПриборовУчетаСрезПоследних.Значение КАК ПоказаниеПрибора,
		   |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга.ВидУслуги КАК Услуга,
		   |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо.Ссылка КАК Ссылка,
		   |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток КАК Остаток
		   |ИЗ
		   |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, ЛицевойСчет = &ЛицевойСчет) КАК ЛицевыеСчетаСрезПоследних
		   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&НаДату, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		   |		ПО ЛицевыеСчетаСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&НаДату, ОбъектУстановки = &ЛицевойСчет) КАК УстановленныеПриборыУчетаСрезПоследних
		   |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&НаДату, ) КАК ПоказанияПриборовУчетаСрезПоследних
		   |			ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
		   |		ПО ЛицевыеСчетаСрезПоследних.ЛицевойСчет = УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки
		   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(, , Авто, , ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
		   |		ПО ЛицевыеСчетаСрезПоследних.ЛицевойСчет = РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет";
		
		Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ЛицевойСчет", стрЛС.ЛицевойСчет);
		Результат = Запрос.Выполнить().Выгрузить();
		ЛС = "";
		Для Каждого стр Из Результат Цикл
			
			Если ЛС <> стр.ЛицевойСчет Тогда
				НоваяСтрока = Объект.ТабличнаяЧасть.Добавить();
			    Адрес = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(стр.Ссылка, Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизЛица);
				Представление    = Адрес;//Параметры.Представление;
				НаименованиеВида = Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизЛица.Наименование;//Строка(Параметры.Вид);
				
				спПараметры = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Адрес, ",");
				НоваяСтрока.ЛицевойСчет = стр.ЛицевойСчет;
				НоваяСтрока.ФИО = стр.ФИО;//ОбщийМодульМВК.ВыделитьСлово(стр.ФИО);
				Попытка
					Если спПараметры.Количество() = 7 Тогда
					    НоваяСтрока.Город = спПараметры[4];
					Иначе
						НоваяСтрока.Город = спПараметры[3];
					КонецЕсли;
					НоваяСтрока.Улица = спПараметры[2];
					НоваяСтрока.Дом   = спПараметры[1];
					НоваяСтрока.Квартира = спПараметры[0];
				Исключение
				КонецПопытки;
				
				Если стр.Услуга = Справочники.ВидыУслуг.ХолоднаяВода Тогда
				    НоваяСтрока.НомерПрибора1 = "-ХВ-" + стр.НомерПрибораУчета;
				ИначеЕсли стр.Услуга = Справочники.ВидыУслуг.Водоотведение Тогда
					НоваяСтрока.НомерПрибора1 = "-ГВ-" + стр.НомерПрибораУчета;
				КонецЕсли;
				НоваяСтрока.Показания1    = стр.ПоказаниеПрибора;
				
				НоваяСтрока.ДатаНачисления = НачалоМесяца(ТекущаяДата());//стр.МесяцНачисления;
				НоваяСтрока.Сальдо = стр.Остаток;
				НоваяСтрока.ОКПО = "03362560";
				НоваяСтрока.ДатаФормирования = НачалоМесяца(ТекущаяДата());
				ЛС = стр.ЛицевойСчет;
			Иначе
				Адрес = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(стр.Ссылка, Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизЛица);
				Представление    = Адрес;//Параметры.Представление;
				НаименованиеВида = Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизЛица.Наименование;//Строка(Параметры.Вид);
				
				спПараметры = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Адрес, ",");
				
				Если НЕ ЗначениеЗаполнено(НоваяСтрока.НомерПрибора2) Тогда
					Если стр.Услуга = Справочники.ВидыУслуг.ХолоднаяВода Тогда
					    НоваяСтрока.НомерПрибора2 = "-ХВ-" + стр.НомерПрибораУчета;
					ИначеЕсли стр.Услуга = Справочники.ВидыУслуг.Водоотведение Тогда
						НоваяСтрока.НомерПрибора2 = "-ГВ-" + стр.НомерПрибораУчета;
					КонецЕсли;
					НоваяСтрока.Показания2    = стр.ПоказаниеПрибора;
				ИначеЕсли НЕ ЗначениеЗаполнено(НоваяСтрока.НомерПрибора3) Тогда
					Если стр.Услуга = Справочники.ВидыУслуг.ХолоднаяВода Тогда
					    НоваяСтрока.НомерПрибора3 = "-ХВ-" + стр.НомерПрибораУчета;
					ИначеЕсли стр.Услуга = Справочники.ВидыУслуг.Водоотведение Тогда
						НоваяСтрока.НомерПрибора3 = "-ГВ-" + стр.НомерПрибораУчета;
					КонецЕсли;
					НоваяСтрока.Показания3    = стр.ПоказаниеПрибора;
				ИначеЕсли НЕ ЗначениеЗаполнено(НоваяСтрока.НомерПрибора4) Тогда
					Если стр.Услуга = Справочники.ВидыУслуг.ХолоднаяВода Тогда
					    НоваяСтрока.НомерПрибора4 = "-ХВ-" + стр.НомерПрибораУчета;
					ИначеЕсли стр.Услуга = Справочники.ВидыУслуг.Водоотведение Тогда
						НоваяСтрока.НомерПрибора4 = "-ГВ-" + стр.НомерПрибораУчета;
					КонецЕсли;
					НоваяСтрока.Показания4    = стр.ПоказаниеПрибора;
				ИначеЕсли НЕ ЗначениеЗаполнено(НоваяСтрока.НомерПрибора5) Тогда
					Если стр.Услуга = Справочники.ВидыУслуг.ХолоднаяВода Тогда
					    НоваяСтрока.НомерПрибора5 = "-ХВ-" + стр.НомерПрибораУчета;
					ИначеЕсли стр.Услуга = Справочники.ВидыУслуг.Водоотведение Тогда
						НоваяСтрока.НомерПрибора5 = "-ГВ-" + стр.НомерПрибораУчета;
					КонецЕсли;
					НоваяСтрока.Показания5    = стр.ПоказаниеПрибора;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТаблицу(Команда)
	Файл = Новый XBase;
	Файл.Кодировка = КодировкаXBase.ANSI;
	Файл.поля.Добавить("LS","N",15,0);
	Файл.поля.Добавить("ID","C",7,0);
	Файл.поля.Добавить("FIO","C",50,0);
	Файл.поля.Добавить("TOWN","C",30,0);
	Файл.поля.Добавить("VUL","C",35,0);
	Файл.поля.Добавить("BUD","C",20,0);
	Файл.поля.Добавить("FLAT","C",10,0);
	Файл.поля.Добавить("IDLICH1","C",16,0);
	Файл.поля.Добавить("POKBEG1","N",12,0);
	Файл.поля.Добавить("POKEND1","N",12,0);
	Файл.поля.Добавить("IDLICH2","C",16,0);
	Файл.поля.Добавить("POKBEG2","N",12,0);
	Файл.поля.Добавить("POKEND2","N",12,0);
	Файл.поля.Добавить("IDLICH3","C",16,0);
	Файл.поля.Добавить("POKBEG3","N",12,0);
	Файл.поля.Добавить("POKEND3","N",12,0);
	Файл.поля.Добавить("IDLICH4","C",16,0);
	Файл.поля.Добавить("POKBEG4","N",12,0);
	Файл.поля.Добавить("POKEND4","N",12,0);
	Файл.поля.Добавить("IDLICH5","C",16,0);
	Файл.поля.Добавить("POKBEG5","N",12,0);
	Файл.поля.Добавить("POKEND5","N",12,0);
	Файл.поля.Добавить("D_SALDO","D",8,0);
	Файл.поля.Добавить("SALDO","N",12,2);
	Файл.поля.Добавить("KOD_USLUGA","N",2,0);
	Файл.поля.Добавить("USLUGA","C",35,0);
	Файл.поля.Добавить("INFO","C",150,0);
	Файл.поля.Добавить("OKPO","C",10,0);
	Файл.поля.Добавить("D_FORM","D",8,0);
	Попытка
		Файл.СоздатьФайл(Объект.ФайлDBF);
	Исключение
		Предупреждение("Помилка створення файлу " + Файл);
		Возврат;
	КонецПопытки;
	
	Для Каждого стр Из Объект.ТабличнаяЧасть Цикл
		Файл.Добавить();
		Файл.LS      = стр.ЛицевойСчет;
		Файл.FIO     = стр.ФИО;
		Файл.TOWN    = стр.Город;
		Файл.VUL     = стр.Улица;
		Файл.BUD     = стр.Дом;
		Файл.FLAT    = стр.Квартира;
		Файл.IDLICH1 = стр.НомерПрибора1;
		Файл.POKBEG1 = стр.Показания1;
		Файл.POKEND1 = 0;
		Файл.IDLICH2 = стр.НомерПрибора2;
		Файл.POKBEG2 = стр.Показания2;
		Файл.POKEND2 = 0;
		Файл.IDLICH3 = стр.НомерПрибора3;
		Файл.POKBEG3 = стр.Показания3;
		Файл.POKEND3 = 0;
		Файл.IDLICH4 = стр.НомерПрибора4;
		Файл.POKBEG4 = стр.Показания4;
		Файл.POKEND4 = 0;
		Файл.IDLICH5 = стр.НомерПрибора5;
		Файл.POKBEG5 = стр.Показания5;
		Файл.POKEND5 = 0;
		Файл.D_SALDO = стр.ДатаНачисления;
		Файл.SALDO   = стр.Сальдо;
		Файл.OKPO    = стр.ОКПО;
		Файл.D_FORM  = стр.ДатаФормирования;
		Файл.Записать();
	КонецЦикла;
	
	Файл.ЗакрытьФайл();
	Предупреждение("Файл " + Файл + " успішно створений.");
КонецПроцедуры

&НаКлиенте
Процедура ФайлDBFНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр                      = НСтр("ru='Файл XBase (*.dbf)|*.dbf'");
	ДиалогВыбораФайла.Заголовок                   = Заголовок;
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "dbf";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
	    Объект.ФайлDBF = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры
