
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаЗаявкаНаПроведениеРемонта, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВременнаяТаблицаЗапасы.Период КАК Период,
	|	ВременнаяТаблицаЗапасы.Организация КАК Организация,
	|	ВременнаяТаблицаЗапасы.Склад КАК Склад,
	|	ВременнаяТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ВременнаяТаблицаЗапасы.КоличествоФакт КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаЗапасы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыНаСкладах()

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаЗаявкаНаПроведениеРемонта, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаПроведениеРемонтаЗапасы.НомерСтроки,
	|	ЗаявкаНаПроведениеРемонтаЗапасы.Ссылка.Дата КАК Период,
	|	ЗаявкаНаПроведениеРемонтаЗапасы.Ссылка.Организация,
	|	ЗаявкаНаПроведениеРемонтаЗапасы.Ссылка.Склад,
	|	ЗаявкаНаПроведениеРемонтаЗапасы.Номенклатура,
	|	ЗаявкаНаПроведениеРемонтаЗапасы.КоличествоФакт
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.ЗаявкаНаПроведениеРемонта.Запасы КАК ЗаявкаНаПроведениеРемонтаЗапасы
	|ГДЕ
	|	ЗаявкаНаПроведениеРемонтаЗапасы.Ссылка = &Ссылка
	|	И ЗаявкаНаПроведениеРемонтаЗапасы.Ссылка.СтатусЗаявки <> &Отменена
	|	И ЗаявкаНаПроведениеРемонтаЗапасы.КоличествоФакт > 0";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗаявкаНаПроведениеРемонта);
	Запрос.УстановитьПараметр("Отменена", Перечисления.ВидыСтатусовЗаявкиНаПроведениеРемонта.Отменена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаЗаявкаНаПроведениеРемонта, СтруктураДополнительныеСвойства);
	
КонецПроцедуры

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаЗаявкаНаПроведениеРемонта, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если Не ПроведениеСервер.ВыполнитьКонтрольОстатков() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияЗапасыНаСкладахИзменение"
	// содержат записи, необходимо выполнить контроль отрицательных остатков.
	
	Если СтруктураВременныеТаблицы.ДвиженияЗапасыНаСкладахИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияЗапасыНаСкладахИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Склад) КАК СкладПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыНаСкладахОстатки.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыНаСкладахИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыНаСкладах,
		|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыНаСкладах
		|ИЗ
		|	ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|				&МоментКонтроля,
		|				(Организация, Склад, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыНаСкладахИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыНаСкладахИзменение.Склад КАК Склад,
		|						ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК Номенклатура
		|					ИЗ
		|						ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение)) КАК ЗапасыНаСкладахОстатки
		|		ПО ДвиженияЗапасыНаСкладахИзменение.Организация = ЗапасыНаСкладахОстатки.Организация
		|			И ДвиженияЗапасыНаСкладахИзменение.Склад = ЗапасыНаСкладахОстатки.Склад
		|			И ДвиженияЗапасыНаСкладахИзменение.Номенклатура = ЗапасыНаСкладахОстатки.Номенклатура
		|ГДЕ
		|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		// Отрицательный остаток запасов на складе.
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ДокументОбъектЗаявкаНаПроведениеРемонта = ДокументСсылкаЗаявкаНаПроведениеРемонта.ПолучитьОбъект();
			
			ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
			ОСМДСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладахСписком(ДокументОбъектЗаявкаНаПроведениеРемонта, ВыборкаИзРезультатаЗапроса, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция проверяет, проведен документ или нет, и вызывает процедуру печати
// документа.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ЗаявкаНаПроведениеРемонта";
	
	ПервыйДокумент = Истина;
	
	Для каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		
		Если ИмяМакета = "ЗаказНаряд" Тогда
			
			КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаявкаНаПроведениеРемонта.Дата,
			|	ЗаявкаНаПроведениеРемонта.Заказчик,
			|	ЗаявкаНаПроведениеРемонта.Здание,
			|	ЗаявкаНаПроведениеРемонта.ЛицевойСчет,
			|	ЗаявкаНаПроведениеРемонта.Номер,
			|	ЗаявкаНаПроведениеРемонта.ОтветственныйЗаПроведениеРемонта,
			|	ЗаявкаНаПроведениеРемонта.СуммаДокумента,
			|	ЗаявкаНаПроведениеРемонта.ТекстЗаявки,
			|	ЗаявкаНаПроведениеРемонта.Работы.(
			|		НомерСтроки,
			|		ВидРабот,
			|		Цена,
			|		КоличествоПлан,
			|		КоличествоФакт,
			|		СуммаФакт
			|	),
			|	ЗаявкаНаПроведениеРемонта.Запасы.(
			|		НомерСтроки,
			|		Номенклатура,
			|		Цена,
			|		КоличествоПлан,
			|		КоличествоФакт,
			|		СуммаФакт
			|	),
			|	ЗаявкаНаПроведениеРемонта.Организация.Префикс КАК Префикс,
			|	ЗаявкаНаПроведениеРемонта.ЛицевойСчет.ОбъектЛицевогоСчета КАК Квартира,
			|	ЗаявкаНаПроведениеРемонта.ОценкаПроведенияРемонта КАК Оценка
			|ИЗ
			|	Документ.ЗаявкаНаПроведениеРемонта КАК ЗаявкаНаПроведениеРемонта
			|ГДЕ
			|	ЗаявкаНаПроведениеРемонта.Ссылка = &ТекущийДокумент";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказНаряд";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Документ.ЗаявкаНаПроведениеРемонта.ПФ_MXL_ЗаказНаряд");
			
			Макет.КодЯзыкаМакета = КодЯзыкаПечать;
			
			Шапка = Макет.ПолучитьОбласть("Шапка");
			ОбластьРаботыШапка = Макет.ПолучитьОбласть("РаботыШапка");
			ОбластьРаботы = Макет.ПолучитьОбласть("Работы");
			ОбластьЗапасыШапка = Макет.ПолучитьОбласть("ЗапасыШапка");
			ОбластьЗапасы = Макет.ПолучитьОбласть("Запасы");
			Подвал = Макет.ПолучитьОбласть("Подвал");
			
			ТабличныйДокумент.Очистить();
			
			ВставлятьРазделительСтраниц = Ложь;
			Пока Выборка.Следующий() Цикл
				
				Номер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Выборка.Номер, Истина, Истина);
				
				ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
				ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ТекущийДокумент.Ссылка);

				ОбластьМакета.Параметры.ТекстЗаголовка = НСтр("ru='Заявка на проведение ремонта № ';uk='Заявка на проведення ремонту №'", КодЯзыкаПечать)
				+ Номер
				+ НСтр("ru=' от ';uk=' від '", КодЯзыкаПечать)
				+ Формат(Выборка.Дата, "Л="+КодЯзыкаПечать+"; ДЛФ=DD");
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВставлятьРазделительСтраниц Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				Шапка.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Вывести(Шапка, Выборка.Уровень());
				
				ТабличныйДокумент.Вывести(ОбластьРаботыШапка);
				ВыборкаРаботы = Выборка.Работы.Выбрать();
				Пока ВыборкаРаботы.Следующий() Цикл
					ОбластьРаботы.Параметры.Заполнить(ВыборкаРаботы);
					ТабличныйДокумент.Вывести(ОбластьРаботы, ВыборкаРаботы.Уровень());
				КонецЦикла;
				
				ТабличныйДокумент.Вывести(ОбластьЗапасыШапка);
				ВыборкаЗапасы = Выборка.Запасы.Выбрать();
				Пока ВыборкаЗапасы.Следующий() Цикл
					ОбластьЗапасы.Параметры.Заполнить(ВыборкаЗапасы);
					ТабличныйДокумент.Вывести(ОбластьЗапасы, ВыборкаЗапасы.Уровень());
				КонецЦикла;
				
				Подвал.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Вывести(Подвал);
				
				ВставлятьРазделительСтраниц = Истина;
			КонецЦикла;			
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаказНаряд") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЗаказНаряд", "Заказ наряд", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЗаказНаряд"));
	КонецЕсли;	
	
КонецПроцедуры

// Функция получает данные печати.
//
Функция ПолучитьДанныеПечати(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	Возврат Новый Структура("Данные, Макеты",
	ДанныеПоВсемОбъектам,
	Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
	ОписаниеОбластей,
	ТипыМакетов,
	ДвоичныеДанныеМакетов));
	
КонецФункции


