//
// Важно: Для пользователя конфигурации должна быть определена роль, 
// у которой установлено право «Активные пользователи»
//
// Важно: Работа с СЛК должна выполняться только в серверном контексте, что 
// позволит избежать установки компоненты СЛК клиентским приложением на локальный 
// компьютер (тонкий и веб клиенты). Поэтому в свойствах данного моудля должны быть
// установлены флаги "Сервер" и "ВызовСервера".

//
// Серия используемых ключей
//
Функция Серия() Экспорт
	Возврат "4BFE";
КонецФункции

// 
// Подключение компоненты СЛК
//
Процедура ПодключитьКомпоненту() Экспорт
	
	// Подключение компоненты из общего макета "КомпонентаСЛК", в который
	// должен быть загружен zip-архив с модулями компоненты для всех поддерживаемых
	// операционных систем.
	//
	// Архив с компонентой включен в поставку - licenceaddin-{%version%}-template.zip
	//
	// Обязательно указываем тип компоненты - ТипВнешнейКомпоненты.Native
	
	Если НЕ ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаСЛК", "Licence", ТипВнешнейКомпоненты.Native) Тогда
		СисИнфо = Новый СистемнаяИнформация;
		ВызватьИсключение "(EAttachAddIn) Ошибка подключения компоненты СЛК " + СисИнфо.ТипПлатформы;
	КонецЕсли;
	Возврат;
	
	#Область Отладка
	// Подключение компоненты СЛК 2.1
	//ПодключитьВнешнююКомпоненту("d:\Projects\Licence\v2.1\Bin\LicenceAddIn.dll", "Licence", ТипВнешнейКомпоненты.Native);
	
	//
	// Для отладки загрузка из файла, в реальной работе необходимо подключать компоненту 
	// только из макета.
	//
	СисИнфо = Новый СистемнаяИнформация;
	Если СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		Компонента = "d:\Projects\Licence\v3.0\LicenceAddIn\bin\Debug\licenceaddin.dll";
		//Компонента = "c:\licenceaddin.dll";
	ИначеЕсли СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Компонента = "d:\Projects\Licence\v3.0\LicenceAddIn\bin\Debug\licenceaddin-x86_64.dll";
	ИначеЕсли СисИнфо.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
		Компонента = "/media/sf_Projects/Licence/v3.0/LicenceAddIn/bin/Debug/licenceaddin.so";
		//Компонента = "/media/sf_Projects/Licence/v3.0/LicenceAddIn/bin/Release/licenceaddin.so";
	ИначеЕсли СисИнфо.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		Компонента = "/media/sf_Projects/Licence/v3.0/LicenceAddIn/bin/Debug/licenceaddin-x86_64.so";
		//Компонента = "/media/sf_Projects/Licence/v3.0/LicenceAddIn/bin/Release/licenceaddin-x86_64.so";
	Иначе
		ВызватьИсключение "Платформа " + СисИнфо.ТипПлатформы + " не поддерживается";
	КонецЕсли;
	
	Если НЕ ПодключитьВнешнююКомпоненту(Компонента, "Licence", ТипВнешнейКомпоненты.Native) Тогда
		ВызватьИсключение "Ошибка подключения компоненты СЛК " + СисИнфо.ТипПлатформы;
	КонецЕсли;
	#КонецОбласти 
КонецПроцедуры

//
// Подключение компоненты и создание объекта
//
Функция ОбъектКомпоненты() Экспорт
	//
	// Для оптимизации получаем менеджер объектов из специального модуля, у которого
	// установлен режим повторного использования возращаемых объектов "на время сеанса" 
	//
	Возврат СЛКПовтИсп.ОбъектКомпоненты();
КонецФункции

//
// Получение менеджера защищенных объектов СЛК
//
Функция МенеджерОбъектов() Экспорт
	//
	// Для оптимизации получаем менеджер объектов из специального модуля, у которого
	// установлен режим повторного использования возращаемых объектов "на время сеанса" 
	//
	Возврат СЛКПовтИсп.МенеджерОбъектов();
КонецФункции

//
// Получение параметров связи из хранилища настроек
//
Функция ПолучитьПараметрыСвязи() Экспорт

	ПривилегированныйРежим();
	Параметры = ХранилищеОбщихНастроек.Загрузить("СЛК", "ПараметрыСвязи", , "СЛК");
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура("АдресСервера, ПортСервера", "localhost", "9099");
	КонецЕсли;

	Возврат Параметры;
КонецФункции // ()

//
// Сохранение параметров свзяи в хранилище настроек
//
Процедура СохранитьПараметрыСвязи(АдресСервера, ПортСервера) Экспорт
	ПривилегированныйРежим();
	Параметры = Новый Структура("АдресСервера, ПортСервера", АдресСервера, ПортСервера);
	ХранилищеОбщихНастроек.Сохранить("СЛК", "ПараметрыСвязи", Параметры, , "СЛК");
КонецПроцедуры

//
// Возврат версии компоненты СЛК
//
Функция Версия() Экспорт
	СисИнфо = Новый СистемнаяИнформация;
	Возврат ОбъектКомпоненты().Версия + " (" + СисИнфо.ТипПлатформы + ")";
КонецФункции

//
// Получение версии сервера СЛК
//
Функция ВерсияСервера() Экспорт
	Менеджер = МенеджерОбъектов();
	// Получение информации о сервере
	Инфо = Менеджер.ПолучитьИнформациюОСервере();
	Возврат Инфо.Version + " (" + Инфо.OSType + " " + Инфо.CPU + ", " + Инфо.ConsoleUrl + ")" + 
		// Проверка возможности обновления
		?(Инфо.VersionOutdated, " - рекомендуется обновить до версии " + Менеджер.Версия(), "");
КонецФункции

//
// Получение адрес веб консоли СЛК
//
Функция АдресКонсоли() Экспорт
	Возврат МенеджерОбъектов().ПолучитьАдресКонсоли();
КонецФункции

//
// Проверка, что версия загруженной компоненты СЛК соответствует (больше или равна)
// переданному значению
//
Процедура ПроверитьВерсию(НеобходимаяВерсия) Экспорт
	Компонента = ОбъектКомпоненты();
	Попытка
		ВерсияПодходит = Компонента.ПроверитьВерсию(НеобходимаяВерсия);
	Исключение
		ВерсияПодходит = Ложь;
	КонецПопытки;
	
	Если ВерсияПодходит = Неопределено Тогда
		ВызватьИсключение Компонента.ПолучитьОписаниеОшибки();
	ИначеЕсли НЕ ВерсияПодходит Тогда
		ВызватьИсключение "(EVersionMismatch) Устаревшая версия СЛК " + Компонента.Версия + ", для работы конфигурации необходима СЛК " + НеобходимаяВерсия + " или выше";
	КонецЕсли;
КонецПроцедуры

//
// Информация о текущем сеансе работы
//
Функция ДанныеСеанса() Экспорт
	НомерСеанса = НомерСеансаИнформационнойБазы();
	
	Сеансы = ПолучитьСеансыИнформационнойБазы();
	Для Каждого С Из Сеансы Цикл
		Если С.НомерСеанса = НомерСеанса Тогда
			Сеанс = С;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Строка(Сеанс.НомерСеанса) + "," + Сеанс.ИмяКомпьютера + "," + Сеанс.ИмяПриложения + "," + Сеанс.Пользователь + "," + ТекущийРежимЗапуска();
КонецФункции

//
// Информация об ИБ
//
Функция ОписаниеИБ() Экспорт
	
	СисИнфо = Новый СистемнаяИнформация;

	ИсходнаяСтрока = СтрокаСоединенияИнформационнойБазы();
	
	Сервер = "";
	ИБ = "";
	
	Фрагменты = СтрЗаменить(ИсходнаяСтрока,";",Символы.ПС);
	Для Ном = 1 По СтрЧислоСтрок(Фрагменты) Цикл
		Стр = СтрЗаменить(СтрПолучитьСтроку(Фрагменты, Ном), "=", Символы.ПС);
		Параметр = СтрПолучитьСтроку(Стр, 1);
		Значение = СтрЗаменить(СтрПолучитьСтроку(Стр, 2), """", "");
		Если Параметр = "File" Тогда
			Возврат СисИнфо.ВерсияПриложения + ", Файл (" + Значение + "), " + СисИнфо.ТипПлатформы + ", " + Метаданные.РежимСовместимости;
		ИначеЕсли Параметр = "Srvr" Тогда
			Сервер = Значение;
		ИначеЕсли Параметр = "Ref" Тогда
			ИБ = Значение;
		КонецЕсли;	
	КонецЦикла;
	Возврат СисИнфо.ВерсияПриложения + ", Сервер (" + Сервер + ", " + ИБ + "), " + СисИнфо.ТипПлатформы + ", " + Метаданные.РежимСовместимости;
КонецФункции

// Получение возможности освобождения лицензии при
// завершении работы
Функция ОсвобождатьЛицензиюПриЗавершенииРаботы() Экспорт
	
	ЭтоКлиентСервернаяБаза = Не Найти(ВРег(СтрокаСоединенияИнформационнойБазы()), "FILE=");
	
	СисИнфо = Новый СистемнаяИнформация();
	
	Версия = СтрЗаменить(Метаданные.РежимСовместимости, "_", ".");
	Позиция = Найти(Версия, "8");
	Версия = ?(Позиция > 0, Прав(Версия, СтрДлина(Версия) - Позиция + 1), СисИнфо.ВерсияПриложения);
	
	ВерсияНиже8_3_8 = СЛКОбщие.СравнитьВерсии(Версия, "8.3.8") < 0;
	
	Возврат ЭтоКлиентСервернаяБаза И ВерсияНиже8_3_8;
КонецФункции 
 
//
// Отладочная информация
//
Функция ПолучитьОтладочнуюСтроку() Экспорт
	Возврат МенеджерОбъектов().ПолучитьОтладочнуюСтроку();
КонецФункции

//
// Запуск СЛК
//
Процедура Старт() Экспорт
	Менеджер = МенеджерОбъектов();
	
	// Если нужно, получаем лицензию
	//Менеджер.ПолучитьЛицензию();
КонецПроцедуры

// Завершение работы и осаобождение лицензии 
// (только на платформе или в режиме совместимости 8.3.7 и ниже)
Процедура Стоп() Экспорт
	Попытка
		МенеджерОбъектов().ПопыткаОсвободитьЛицензию();
	Исключение
		//
	КонецПопытки
КонецПроцедуры

//
// Получение лицензии сеанса
//
Функция ПолучитьЛицензию() Экспорт
	Возврат МенеджерОбъектов().ПолучитьЛицензию();
КонецФункции

//
// Создание объекта по его имени в файле данных
//
Функция СоздатьОбъект(Имя) Экспорт
	
	// Если необходимо оптимизировать обращение к защищенному объекту, 
	// то функции получения объекта нужно поместить в модуль, у которого
	// установлен режим повторного использования возращаемых объектов "на время сеанса" 
	// (аналогично получению менеджера объектов).
	
	Возврат СЛКПовтИсп.СоздатьОбъект(Имя);
	
	//
	// Получение объекта без кэширования 
	//
	//Возврат МенеджерОбъектов().СоздатьОбъект(Имя);
КонецФункции

//
// Активация лицензии
//
Функция УстановитьЛицензию(КодАктивации, ИНН, КПП, СерийныйНомерБолванки = Неопределено) Экспорт
	Возврат МенеджерОбъектов().УстановитьЛицензию(КодАктивации, ИНН, КПП, СерийныйНомерБолванки);
КонецФункции

//
// Обновление/восстановление лицензий 
//
Функция ОбновитьЛицензии(ИНН = Неопределено, КПП = Неопределено) Экспорт
	Возврат МенеджерОбъектов().ОбновитьЛицензии(ИНН, КПП);
КонецФункции

//
// Деактивация лицензии и получение резервного кода активации
//
Функция ДеактивироватьЛицензию(СерийныйНомер, Причина, Комментарий = Неопределено, Логин, Пароль) Экспорт
	Возврат МенеджерОбъектов().ДеактивироватьЛицензию(СерийныйНомер, Причина, Комментарий, Логин, Пароль);
КонецФункции

//
// Получение строки запроса в Центр Лицензирования для установки лицензии
// Если параметры не указаны, то формируется запрос на получение и установку
// демонстрационной лицензии
//
Функция СоздатьФайловыйЗапрос(КодАктивации = Неопределено, ИНН = Неопределено, КПП = Неопределено, СерийныйНомерБолванки = Неопределено) Экспорт
	Возврат МенеджерОбъектов().СоздатьФайловыйЗапрос(КодАктивации, ИНН, КПП, СерийныйНомерБолванки);
КонецФункции

//
// Получение строки запроса в Центр Лицензирования для обновления/восстановления лицензий
//
Функция СоздатьФайловыйЗапросОбновления(ИНН = Неопределено, КПП = Неопределено) Экспорт
	Возврат МенеджерОбъектов().СоздатьФайловыйЗапросОбновления(ИНН, КПП);
КонецФункции

//
// Получение строки запроса в Центр Лицензирования для обновления/восстановления лицензий
//
Функция СоздатьФайловыйЗапросДеактивации(СерийныйНомер, Причина, Комментарий = Неопределено, Логин, Пароль) Экспорт
	Возврат МенеджерОбъектов().СоздатьФайловыйЗапросДеактивации(СерийныйНомер, Причина, Комментарий, Логин, Пароль);
КонецФункции

//
// Установка ответа из Центра Лицензирования на запрос установки / обновления лицензий
//
Функция УстановитьФайловыйОтвет(Ответ) Экспорт
	Возврат МенеджерОбъектов().УстановитьФайловыйОтвет(Ответ);
КонецФункции

//
// Получение строк телефонного запроса в Центр Лицензирования для установки лицензии
//
Функция СоздатьТелефонныйЗапрос(КодАктивации, ИНН = Неопределено, КПП = Неопределено, 
	СерийныйНомерБолванки = Неопределено, СерийныйНомерОсновногоКлюча = Неопределено, БазовыйРегНомер = Неопределено) Экспорт
	Возврат МенеджерОбъектов().СоздатьТелефонныйЗапрос(КодАктивации, ИНН, КПП, СерийныйНомерБолванки, СерийныйНомерОсновногоКлюча, БазовыйРегНомер);
КонецФункции                       

//
// Установка телефонного ответа из Центра Лицензирования 
//
Функция УстановитьТелефонныйОтвет(Ответ) Экспорт
	Возврат МенеджерОбъектов().УстановитьТелефонныйОтвет(Ответ);
КонецФункции

//
// Получение списка установленных лицензий
//
Функция ПолучитьЛицензии(ПоВсемСериям = Ложь, ТолькоДоступные = Ложь) Экспорт
	Возврат МенеджерОбъектов().ПолучитьЛицензии(ПоВсемСериям, ТолькоДоступные);
КонецФункции 

//
// Получение информации о сервере СЛК
//
Функция ПолучитьИнформациюОСервере() Экспорт
	Возврат МенеджерОбъектов().ПолучитьИнформациюОСервере();
КонецФункции

//
// Получение списка установленных лицензий
//
Функция ПолучитьСчетчики() Экспорт
	Возврат МенеджерОбъектов().ПолучитьСчетчики();
КонецФункции 

//
// Получение параметров кода активации (Серия, С/Н ключа)
//
Функция ПолучитьПараметрыКодаАктивации(КодАктивации) Экспорт
	Возврат МенеджерОбъектов().ПолучитьПараметрыКодаАктивации(КодАктивации);
КонецФункции

//
// Чтение пользовательской памяти
//
Функция ПрочитатьПамять(СерийныйНомер, Пароль) Экспорт
	Возврат МенеджерОбъектов().ПрочитатьПамять(СерийныйНомер, Пароль);
КонецФункции
 
//
// Запись пользовательских данных
//
Процедура ЗаписатьПамять(СерийныйНомер, Пароль, Данные) Экспорт
	МенеджерОбъектов().ЗаписатьПамять(СерийныйНомер, Пароль, Данные);
КонецПроцедуры

//
// Сброс пользовательских данных и паролей
//
Процедура ОбнулитьПамять(СерийныйНомер) Экспорт
	МенеджерОбъектов().ОбнулитьПамять(СерийныйНомер); //, ПарольРазработчикаДляКонкретнойСерии);
КонецПроцедуры

//
// Установка паролей на чтение и запись данных
//
Процедура УстановитьПароли(СерийныйНомер, ПарольНаЧтение, ПарольНаЗапись, НовыйПарольНаЧтение, НовыйПарольНаЗапись) Экспорт
	МенеджерОбъектов().УстановитьПароли(СерийныйНомер, ПарольНаЧтение, ПарольНаЗапись, НовыйПарольНаЧтение, НовыйПарольНаЗапись);
КонецПроцедуры

//
// Получение значения лицензионного параметра
//
Функция ПолучитьПараметр(СерийныйНомер, ИмяПараметра, ИспользоватьОсновнойКлюч = Ложь) Экспорт
	Возврат МенеджерОбъектов().ПолучитьПараметр(СерийныйНомер, ИмяПараметра, ИспользоватьОсновнойКлюч);
КонецФункции 
 
