
Функция ПрочитатьКодыСмайлов() Экспорт    
	
	ТаблицаСмайлов = ПолучитьОбщийМакет("ТЛГ_ТаблицаСмайлов1");
	Высота = ТаблицаСмайлов.ВысотаТаблицы;
	
	Результат = Новый Соответствие;
	Для Сч = 1 По Высота Цикл
		Результат.Вставить(ТаблицаСмайлов.Область(Сч,1,Сч,1).Текст, ТаблицаСмайлов.Область(Сч,2,Сч,2).Текст);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция  СоздатьКлавиатуру(Клавиатура) Экспорт     
	
	Если ТипЗнч(Клавиатура) = Тип("СправочникСсылка.КлавиатурыTelegram") Тогда
		СоставКлавиатуры = Клавиатура.Состав.Выгрузить(, "Текст,ВозвращаемоеЗначение");
		ДЛя каждого Колонка Из СоставКлавиатуры.Колонки Цикл
			Колонка.Имя = "Клавиатура" + Колонка.Имя;
		КонецЦикла;
		
	Иначе
		СоставКлавиатуры = Клавиатура;             
	КонецЕсли; 
	
	Если СоставКлавиатуры.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Результат = Новый Структура;
	Результат.Вставить("inline_keyboard");
	МассивСтрока = Новый Массив;
	МассивЭлементыСтроки = Новый Массив;
	
	
	Для Каждого Элемент Из СоставКлавиатуры Цикл
		Кнопка = Новый Структура;
		Кнопка.Вставить("text", СформироватьТекстСоСмайлами(Элемент.КлавиатураТекст));
		Кнопка.Вставить("callback_data", Элемент.КлавиатураВозвращаемоеЗначение);
		//Кнопка.Вставить("url", "https://www.google.com.ua");
		МассивЭлементыСтроки.Добавить(Кнопка);
	КонецЦикла;
	
	МассивСтрока.Добавить(МассивЭлементыСтроки);
	
	Результат["inline_keyboard"] = МассивСтрока;
	
	Возврат Результат;
	
КонецФункции

//Создал Петров В.А
Функция  СоздатьКлавиатуруВертикальную(Клавиатура) Экспорт     
	
	Если ТипЗнч(Клавиатура) = Тип("СправочникСсылка.КлавиатурыTelegram") Тогда
		СоставКлавиатуры = Клавиатура.Состав.Выгрузить(, "Текст,ВозвращаемоеЗначение");
		ДЛя каждого Колонка Из СоставКлавиатуры.Колонки Цикл
			Колонка.Имя = "Клавиатура" + Колонка.Имя;
		КонецЦикла;
		
	Иначе
		СоставКлавиатуры = Клавиатура;             
	КонецЕсли; 
	
	Если СоставКлавиатуры.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Результат = Новый Структура;
	Результат.Вставить("inline_keyboard");
	МассивСтрока = Новый Массив;
	
	
	
	Для Каждого Элемент Из СоставКлавиатуры Цикл
		МассивЭлементыСтроки = Новый Массив;
		Кнопка = Новый Структура;
		Кнопка.Вставить("text", СформироватьТекстСоСмайлами(Элемент.КлавиатураТекст));
		Кнопка.Вставить("callback_data", Элемент.КлавиатураВозвращаемоеЗначение);
		//Кнопка.Вставить("url", "https://www.google.com.ua");
		МассивЭлементыСтроки.Добавить(Кнопка);
		МассивСтрока.Добавить(МассивЭлементыСтроки);
	КонецЦикла;
	
	
	
	Результат["inline_keyboard"] = МассивСтрока;
	
	Возврат Результат;
	
КонецФункции

//Создал Петров В.А 
//Эта функция нужна для Формирования клавиатуры из массива данных описывающих приборы учета подключенных к Лицевому счету
//Кнопки сформированной клавиатуры вернут в callback_data Строки с гуид прибора и тариф
Функция  СоздатьКлавиатуруВиртуальнойКнопки(МассивСчетчиковДляКнопок, Клавиатура, КодЯзыка) Экспорт     
		
	Если ТипЗнч(Клавиатура) = Тип("СправочникСсылка.КлавиатурыTelegram") Тогда
		СоставКлавиатуры = Клавиатура.Состав.Выгрузить(, "Текст,ВозвращаемоеЗначение");
		ДЛя каждого Колонка Из СоставКлавиатуры.Колонки Цикл
			Колонка.Имя = "Клавиатура" + Колонка.Имя;
		КонецЦикла;
		
	Иначе
		СоставКлавиатуры = Клавиатура;             
	КонецЕсли; 
	
	Если СоставКлавиатуры.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Результат = Новый Структура;
	Результат.Вставить("inline_keyboard");
	МассивСтрока = Новый Массив;
	
	ИндексКнопки = 0;
	Для Каждого Счетчик Из МассивСчетчиковДляКнопок Цикл
		
			Кнопка = Новый Структура;
			МассивЭлементыСтроки = Новый Массив;
			УникальныйИдентификатор = Новый УникальныйИдентификатор(Счетчик.СсылкаНаПрибор);
			СсылкаНаПрибор = Справочники.ПриборыУчета.ПолучитьСсылку(УникальныйИдентификатор);
			
			text = "N" + Строка(СсылкаНаПрибор.Наименование) +
					 "/" + Строка(Перечисления.ВидыТарифов[Число(Счетчик.ВидТарифа)]) +
					"/" + Строка(Счетчик.ПоказанияПрибора) + Строка(Счетчик.ЕдиницаИзмерения) ;
			Кнопка.Вставить("text", text);
			callback_data ="/virt_button"  +Строка(Счетчик.СсылкаНаПрибор) + Строка(Счетчик.ВидТарифа) + Строка(ИндексКнопки);
			Кнопка.Вставить("callback_data", callback_data );
			МассивЭлементыСтроки.Добавить(Кнопка);
			МассивСтрока.Добавить(МассивЭлементыСтроки);
			ИндексКнопки = ИндексКнопки+1;
	КонецЦикла;
	Кнопка = Новый Структура;	
   	МассивЭлементыСтроки = Новый Массив;
	text = НСтр("ru = 'Вернуться в главное меню'; uk = 'Повернутися до головного меню'", КодЯзыка);
	
	Кнопка.Вставить("text", text);
	callback_data ="/start";
	Кнопка.Вставить("callback_data", callback_data );
	МассивЭлементыСтроки.Добавить(Кнопка);
	МассивСтрока.Добавить(МассивЭлементыСтроки);
	
	Результат["inline_keyboard"] = МассивСтрока;
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьСтруктуруСообщения(chat_id, text, parse_mode = Неопределено, disable_web_page_preview = Неопределено, 
	disable_notification = Неопределено, reply_to_message_id = Неопределено, reply_markup = Неопределено)    Экспорт
	
	СтруктураНастроек = Новый Структура();
	СтруктураНастроек.Вставить("chat_id", 					chat_id);
	СтруктураНастроек.Вставить("text", 						text);

	Если parse_mode <> Неопределено Тогда
		СтруктураНастроек.Вставить("parse_mode", 				parse_mode);
	КонецЕсли;
	Если disable_web_page_preview <> Неопределено Тогда
		СтруктураНастроек.Вставить("disable_web_page_preview", 	disable_web_page_preview);
	КонецЕсли;
	Если disable_notification <> Неопределено Тогда
		СтруктураНастроек.Вставить("disable_notification", 		disable_notification);
	КонецЕсли;
	Если reply_to_message_id <> Неопределено Тогда
		СтруктураНастроек.Вставить("reply_to_message_id", 		reply_to_message_id);
	КонецЕсли;
	Если reply_markup <> Неопределено Тогда
		СтруктураНастроек.Вставить("reply_markup", 				reply_markup);
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураНастроек);
	Возврат СтрЗаменить(ЗаписьJSON.Закрыть(),"\\","\");
	
КонецФункции

Функция ОтправитьСообщение(IDКлиента, ТекстСообщения, Файл = Неопределено, ДопПараметры = Неопределено, мРезультат = Неопределено, Клавиатура = Неопределено) Экспорт
	
	СтруктураОтвет = Новый Структура("ок,ответ");
	Если Не ЗначениеЗаполнено(IDКлиента) Тогда
		СтруктураОтвет.ок = Ложь;
		СтруктураОтвет.Ответ = "Не найден ID контакта в 1С";
		мРезультат = Ложь;
		Возврат СтруктураОтвет;
	КонецЕсли; 
	
	
	//Обычное сообщение (без файлов)
	Если Файл = Неопределено Тогда
		
		ТелоСообщения = ПолучитьСтруктуруСообщения(IDКлиента, ТекстСообщения,,,,, Клавиатура);
		Результат = ОтправитьЗапросКСервисуТелеграмм("sendMessage",, ТелоСообщения,, IDКлиента);

	Иначе
		//значит отправляем файл
		//нужно понять какой
		//Пока берем за основу, что Файл - это Путь к файлу...
		ОтправлятьКакИзображение = ФайлЯвляетсяИзображением(Файл);
		ТелоСообщенияСтруктура = ПолучитьСтруктуруСообщенияСВложением(IDКлиента, ТекстСообщения, Файл, ОтправлятьКакИзображение, Клавиатура);

		Если ОтправлятьКакИзображение Тогда
			Команда = "sendPhoto";
		Иначе
			Команда = "sendDocument";
		КонецЕсли; 
		Результат = ОтправитьЗапросКСервисуТелеграмм(Команда,,  ТелоСообщенияСтруктура.ТелоЗапроса, ТелоСообщенияСтруктура.Boundary, IDКлиента);
		
	КонецЕсли; 
	
	Если ТипЗнч(Результат) = тип("Структура") Тогда
		Результат.Свойство("ok", мРезультат);
		Результат.Свойство("ok", СтруктураОтвет.ок);
		Результат.Свойство("result", СтруктураОтвет.ответ);
	Иначе
		мРезультат = Ложь;
		СтруктураОтвет.ок = Ложь;
	КонецЕсли; 
	
	Возврат СтруктураОтвет;
	
КонецФункции

Функция ОпределитьПараметрыСообщения(ТекстСообщения, ОткрывающийТег = "[", ЗакрывающийТег = "]") Экспорт  

	
	ПараметрыСообщения = Новый Соответствие;
	
	Текст = ТекстСообщения;
	Позиция = СтрНайти(Текст, ОткрывающийТег);
	Пока Позиция > 0 Цикл
		Текст = Сред(Текст, Позиция + 1);
		Позиция = СтрНайти(Текст, ЗакрывающийТег);
		Если Позиция > 0 Тогда
			НайденныйПараметр = Лев(Текст, Позиция-1);
			ПараметрыСообщения.Вставить(НайденныйПараметр);
			Текст = Сред(Текст, Позиция + 1);
		КонецЕсли;
		Позиция = СтрНайти(Текст, ОткрывающийТег);
	КонецЦикла;
	
	Возврат ПараметрыСообщения;
	
КонецФункции
	
Функция СформироватьТекстСоСмайлами(Знач ТекстСообщения) Экспорт 

	
	ПараметрыСообщения = ОпределитьПараметрыСообщения(ТекстСообщения, "{", "}");
	КодыСмайлов = ПрочитатьКодыСмайлов();
	
	РезультатТекст = ТекстСообщения;
	Для Каждого ПараметрСообщения Из ПараметрыСообщения Цикл
		РезультатТекст = СтрЗаменить(РезультатТекст, "{" + ПараметрСообщения.Ключ + "}", КодыСмайлов[ ПараметрСообщения.Ключ]);
	КонецЦикла;

	Возврат РезультатТекст;

КонецФункции 

Функция ОтправитьЗапросКСервисуТелеграмм(ИмяКоманды, СтруктураПараметров = Неопределено, ТелоЗапроса = Неопределено, Boundary = "", IDКонтакта = "") Экспорт
	
	//Попытка
	//	СтруктураПараметров.offset = "626298964";
	//Исключение
	//КонецПопытки;
	
	Сервер = "api.telegram.org";
	Адрес = ПолучитьТекстЗапросаКТелеграмм(ИмяКоманды, СтруктураПараметров);
	
	Соединение = Новый HTTPСоединение(Сервер,,,,Новый ИнтернетПрокси(истина),5, Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(Адрес);
	Если ТелоЗапроса <> Неопределено Тогда
		Если ТипЗнч(ТелоЗапроса) = Тип("ДвоичныеДанные") Тогда
			Запрос.Заголовки.Вставить("Content-Type","multipart/form-data; boundary=" + Boundary);
			Запрос.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);
		ИначеЕсли ТипЗнч(ТелоЗапроса) = Тип("Строка") И Boundary = "" Тогда
			Запрос.Заголовки.Вставить("Content-Type","application/json");
			Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, "CESU-8");
		ИначеЕсли ТипЗнч(ТелоЗапроса) = Тип("Строка") И НЕ ПустаяСтрока(Boundary) Тогда
			Запрос.Заголовки.Вставить("Content-Type","multipart/form-data; boundary="+Boundary);
			Запрос.УстановитьИмяФайлаТела(ТелоЗапроса);	
		КонецЕсли; 
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	Иначе
		Ответ = Соединение.Получить(Запрос);
	КонецЕсли;

	Чтение = Новый ЧтениеJSON;
	ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку(); 
	Чтение.УстановитьСтроку(ОтветСтрокой);
	Результат = ПрочитатьJSON(Чтение);
	
	Если Результат.Свойство("ok") И НЕ Результат.ok Тогда
		ЗаписьОбОшибке(IDКонтакта, ОтветСтрокой);
	КонецЕсли; 

	Возврат Результат;
	
КонецФункции

Функция ПолучитьТекстЗапросаКТелеграмм(ИмяКоманды, СтруктураПараметров)  
	
	Сервер = "api.telegram.org";
	КлючАПИ = Константы.КлючAPI.Получить();
	
	Адрес = "bot<token>/";
	Адрес = СтрЗаменить(Адрес, "<token>", КлючАПИ);
	Адрес = Адрес + ИмяКоманды;
	
	ТекстПараметров = СформироватьТекстЗапроса(СтруктураПараметров);
	
	Если НЕ ПустаяСтрока(ТекстПараметров) Тогда
		ТекстПараметров = "?" + ТекстПараметров;
		Адрес = Адрес + ТекстПараметров;
	КонецЕсли;
	
	Возврат Адрес;

КонецФункции

Функция СформироватьТекстЗапроса(СтруктураПараметров)        
	
	Если СтруктураПараметров = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "";
	
	Для Каждого ЭлементСтруктуры Из СтруктураПараметров Цикл
		
		Если ЭлементСтруктуры.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("Структура") Тогда
			ТекстЗапроса = ТекстЗапроса + СформироватьТекстЗапроса(ЭлементСтруктуры.Значение);
			Продолжить;
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + ?(ПустаяСтрока(ТекстЗапроса), "", "&") + ЭлементСтруктуры.Ключ + "=" + ЭлементСтруктуры.Значение;
		
	КонецЦикла;		
	
	Возврат ТекстЗапроса;
	
КонецФункции

//доп	
Процедура ЗаписьОбОшибке( IDКонтакта = "", ТекстОшибки = "") Экспорт
	
	ЗаписьЖурналаРегистрации("Сообщение в Telegram", УровеньЖурналаРегистрации.Ошибка,
		,, "Ошибка при отправке сообщения на ID - " + IDКонтакта + " : 
		| " + ТекстОшибки);

КонецПроцедуры  

Функция ФайлЯвляетсяИзображением(ПутьКФайлу) 
	
	Файл = Новый Файл(ПутьКФайлу);
	Расширение = НРег(Файл.Расширение) + ";";
	
	Если СтрНайти(МассивФорматовИзображений(), Расширение) <> 0 Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции 

Функция ПолучитьСтруктуруСообщенияСВложением(chat_id, text, Файл, КакИзображение = Ложь, Клавиатура = Неопределено) Экспорт
	
	Boundary = ПолучитьРазделитель();
	
	СтруктураНастроекСообщения = Новый Структура();
	СтруктураНастроекСообщения.Вставить("chat_id", chat_id);
	СтруктураНастроекСообщения.Вставить("caption", text);
	Если Клавиатура <> НЕопределено Тогда
		СтруктураНастроекСообщения.Вставить("reply_markup", Клавиатура);		
	КонецЕсли; 
	
	ФайлРезультат =  ПолучитьДанныеДляОтправки(Файл, СтруктураНастроекСообщения, Boundary, КакИзображение);
	Возврат Новый Структура("ТелоЗапроса,Boundary", ФайлРезультат, Boundary);
	

КонецФункции 

Функция ПолучитьДанныеДляОтправки(ПутьКФайлу, СтруктураСообщения, Boundary, КакФото = Ложь) Экспорт
	
	ТипДокумента = "document";
	Если КакФото Тогда
		ТипДокумента = "photo";
	КонецЕсли; 
	Файл = Новый Файл(ПутьКФайлу);
	ЗаголовокФайла = Файл.ИмяБезРасширения;
	
		
	Итог = "";
	
	СтруктураСообщения.Удалить("text");
	Разделитель = Символы.ПС;
	для Каждого стр из СтруктураСообщения Цикл 
		Итог = Итог	+ "--" + Boundary+Разделитель;
		Итог = Итог	+ "Content-Disposition: form-data; name="""+стр.Ключ+""""+Разделитель;
		Итог = Итог + Символы.ПС;    
		ЗначениеПараметра =  стр.Значение;	
		
		Если ТипЗнч(ЗначениеПараметра) = Тип("Структура") Тогда
			ЗначениеПараметра =  ПолучитьСтрокуJSON(ЗначениеПараметра);
		КонецЕсли;
		Итог = Итог	+ ЗначениеПараметра+Разделитель;
	КонецЦикла;
	
	ИмяОтправляемогоФайла = ЗаголовокФайла+Файл.Расширение;
	Итог = Итог+"--" + Boundary+Разделитель;
	Итог = Итог+"Content-Disposition: form-data; name=""" + ТипДокумента + """; filename="""+ИмяОтправляемогоФайла+""" "+Разделитель;
	Итог = Итог+"Content-Type: text/plain"+Разделитель;
	
	ИмяФайлаНачала 		= ПолучитьИмяВременногоФайла("txt");
	ИмяИтоговогоФайла	= ПолучитьИмяВременногоФайла("txt");
	ИмяФайлаОкончания 	= ПолучитьИмяВременногоФайла("txt");
	
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайлаНачала,КодировкаТекста.ANSI);
	ЗаписьТекста.Закрыть();
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайлаНачала, КодировкаТекста.UTF8);   
	ЗаписьТекста.ЗаписатьСтроку(Итог);
	ЗаписьТекста.Закрыть();
	
	МассивФайловОбъединения = Новый Массив;
	МассивФайловОбъединения.Добавить(ИмяФайлаНачала);
	МассивФайловОбъединения.Добавить(ПутьКФайлу);
	
	Итог = Разделитель+"--" + Boundary + "--";
	
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайлаОкончания,КодировкаТекста.ANSI);
	ЗаписьТекста.Закрыть();
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайлаОкончания,КодировкаТекста.UTF8);
	ЗаписьТекста.ЗаписатьСтроку(Итог);
	ЗаписьТекста.Закрыть();
	
	МассивФайловОбъединения.Добавить(ИмяФайлаОкончания);
	
	ОбъединитьФайлы(МассивФайловОбъединения,ИмяИтоговогоФайла);
	
	УдалитьФайлы(ИмяФайлаНачала);    
	УдалитьФайлы(ИмяФайлаОкончания);    
	
	Возврат ИмяИтоговогоФайла;
	
КонецФункции

Функция МассивФорматовИзображений() Экспорт
	
	ФорматыИзображений = ".bmp;.gif;.jpeg;.jpg;.png;.tif;.ico";	
	               
	Возврат ФорматыИзображений;
КонецФункции

Функция ПолучитьРазделитель()

	 Возврат СтрЗаменить(Строка(Новый УникальныйИдентификатор()),"-","");

КонецФункции 

Функция ПолучитьСтрокуJSON(Структура) 
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Структура);
	Возврат СтрЗаменить(ЗаписьJSON.Закрыть(),"\\","\");

	
	
КонецФункции

Процедура ОбратнаяСвязь(id, КодЯзыка, ok)Экспорт
	
	Ключ = Константы.КлючAPI.Получить();
	Сервер = "api.telegram.org";
	Команда = "sendMessage";
	
	Структура_keyboardКН = Новый Структура();
	Структура_keyboardКН.Вставить("text", 						"Отправить номер телефона.");
	Структура_keyboardКН.Вставить("request_contact", 			Истина);
	МассивСтрокиКнопки = Новый Массив;
	МассивСтрокиКнопки.Добавить(Структура_keyboardКН);
	МассивКнопок = Новый Массив;
	МассивКнопок.Добавить(МассивСтрокиКнопки);
	Структура_reply_markup = Новый Структура();
	Структура_reply_markup.Вставить("resize_keyboard",Истина);
	Структура_reply_markup.Вставить("one_time_keyboard",Истина);
	Структура_reply_markup.Вставить("keyboard",МассивКнопок);
	
	СтруктураТелаСообщения = Новый Структура;
	СтруктураТелаСообщения.Вставить("chat_id",Формат(id,"ЧГ="));
	КодЯзыка = "ru";
	ТекстСообщения = НСтр("ru = 'Для регистрации нажмите 	\ud83d\udc47 /Отправить номер телефона/ . '; uk = 'Для реєстрації натисніть \ud83d\udc47 /Надіслати номер телефону/ '", КодЯзыка);
	СтруктураТелаСообщения.Вставить("text", ТекстСообщения);
	СтруктураТелаСообщения.Вставить("reply_markup", Структура_reply_markup);

	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураТелаСообщения);
	ТелоСообщения =  СтрЗаменить(ЗаписьJSON.Закрыть(),"\\","\");

	Адрес = ПолучитьТекстЗапросаКТелеграмм(Команда, Неопределено);
	
	Соединение = Новый HTTPСоединение(Сервер,,,,Новый ИнтернетПрокси(истина),5, Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(Адрес);
	
	Запрос.Заголовки.Вставить("Content-Type","application/json");
	Запрос.УстановитьТелоИзСтроки(ТелоСообщения, "CESU-8");
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	
	ОтветСоотв = ПрочитатьJSON(Чтение,Истина);
	ok = ОтветСоотв["ok"] ;

КонецПроцедуры

Процедура ОтправитьСообщениеСервис (ТекстСообщения, ПолучательID,ok) Экспорт
	Если ТекстСообщения <> Null Тогда
	Ключ = Константы.КлючAPI.Получить();
	Сервер = "api.telegram.org";
	Команда = "sendMessage";
	
	СтруктураНастроек = Новый Структура();
	СтруктураНастроек.Вставить("chat_id", 					Формат(ПолучательID,"ЧГ="));
	СтруктураНастроек.Вставить("text", 						СокрЛП(ТекстСообщения));
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураНастроек);
	ТелоСообщения =  СтрЗаменить(ЗаписьJSON.Закрыть(),"\\","\");

	Адрес = ПолучитьТекстЗапросаКТелеграмм(Команда, Неопределено);
	
	Соединение = Новый HTTPСоединение(Сервер,,,,Новый ИнтернетПрокси(истина),5, Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(Адрес);
	
	Запрос.Заголовки.Вставить("Content-Type","application/json");
	Запрос.УстановитьТелоИзСтроки(ТелоСообщения, "CESU-8");
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	
	ОтветСоотв = ПрочитатьJSON(Чтение,Истина);
	ok = ОтветСоотв["ok"] ;
	КонецЕсли;
	 ok = Истина;
КонецПроцедуры

Процедура ОтправитьФото (ТекстСообщения, ПолучательID, ok)
	
	Ключ = Константы.КлючAPI.Получить();
	Сервер = "api.telegram.org";
	Команда = "sendPhoto";
	Ресурс = "bot"+Ключ+"/"+Команда+"?chat_id="+Формат(ПолучательID,"ЧГ=")+"&photo="+СокрЛП(ТекстСообщения); 
	Соединение = Новый HTTPСоединение(Сервер,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(Ресурс); 
	
	Ответ = Соединение.Получить(Запрос);
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	
	ОтветСоотв = ПрочитатьJSON(Чтение,Истина);
	ok = ОтветСоотв["ok"] ;
КонецПроцедуры

Процедура ОтправитьСообщениеАдминистратору(ТекстСообщения)Экспорт
	Ключ = Константы.КлючAPI.Получить();
	idАдминистратора = Константы.IdАдминистратораБота.Получить();	
	Если ЗначениеЗаполнено(Ключ) и ЗначениеЗаполнено(idАдминистратора) Тогда
		Сервер = "api.telegram.org";
		Команда = "sendMessage";
		
		СтруктураТелаСообщения = Новый Структура;
		СтруктураТелаСообщения.Вставить("chat_id",Формат(idАдминистратора,"ЧГ="));
		СтруктураТелаСообщения.Вставить("text", ТекстСообщения);
		
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураТелаСообщения);
		ТелоСообщения =  СтрЗаменить(ЗаписьJSON.Закрыть(),"\\","\");

		Адрес = ПолучитьТекстЗапросаКТелеграмм(Команда, Неопределено);
		
		Соединение = Новый HTTPСоединение(Сервер,,,,Новый ИнтернетПрокси(истина),5, Новый ЗащищенноеСоединениеOpenSSL);
		Запрос = Новый HTTPЗапрос(Адрес);
		
		Запрос.Заголовки.Вставить("Content-Type","application/json");
		Запрос.УстановитьТелоИзСтроки(ТелоСообщения, "CESU-8");
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		
		ОтветСоотв = ПрочитатьJSON(Чтение,Истина);
		ok = ОтветСоотв["ok"] ;
	КонецЕсли;
	
 КонецПроцедуры