
// В обработчике события ОбработкаЗаполнения документа выполняется
// - заполнение документа по документу-основанию.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Предписание") Тогда
		// Заполнение шапки
		Должник = ДанныеЗаполнения.Должник;
		Здание = ДанныеЗаполнения.Здание;
		ЛицевойСчет = ДанныеЗаполнения.ЛицевойСчет;
		НаДату = ДанныеЗаполнения.НаДату;
		ОплатитьДо = ДанныеЗаполнения.ОплатитьДо;
		Организация = ДанныеЗаполнения.Организация;
		СуммаДолга = ДанныеЗаполнения.СуммаДолга;
	КонецЕсли;
	
КонецПроцедуры
