////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
// Процедура устанавливает видимость реквизитов формы.
//
// Параметры:
//  Нет.
//
Процедура УстановитьВидимостьРеквизитов()
	
	Если Объект.ЮрФизЛицо = ЮрЛицо Тогда
		Элементы.НомерСвидетельства.Видимость = Истина;
		Элементы.ФизическоеЛицо.Видимость = Ложь;
		Объект.ФизическоеЛицо = Неопределено;
		Элементы.КодПоЕДРПОУ.Видимость = Истина;
	Иначе
		Элементы.НомерСвидетельства.Видимость = Ложь;
		Элементы.ФизическоеЛицо.Видимость = Истина;
		Объект.НомерСвидетельства = "";
		Элементы.КодПоЕДРПОУ.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьРеквизитов()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЮрЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
	
	Если Объект.ЮрФизЛицо = ЮрЛицо Тогда
		Элементы.НомерСвидетельства.Видимость = Истина;
		Элементы.ФизическоеЛицо.Видимость = Ложь;
		Объект.ФизическоеЛицо = Неопределено;
	Иначе
		Элементы.НомерСвидетельства.Видимость = Ложь;
		Элементы.ФизическоеЛицо.Видимость = Истина;
		Объект.НомерСвидетельства = "";
	КонецЕсли;
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, Объект, "ГруппаКонтактнаяИнформация");
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Запись системы налогообложения в регистр
	ТекДата = ТекущаяДата();
	НоваяЗапись = РегистрыСведений.ПлательщикНДС.СоздатьМенеджерЗаписи();
	НоваяЗапись.Контрагент = Объект.Ссылка;
	НоваяЗапись.СистемаНалогообложения = Объект.СистемаНалогообложения;
	НоваяЗапись.Период = ТекДата;
	НоваяЗапись.Записать();
    // Конец записи системы налогообложения в регистр
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик события ПриОткрытии.
//
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
// Процедура обработчик события ПриИзменении поля ввода Наименование.
//
Процедура НаименованиеПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;

КонецПроцедуры // НаименованиеПриИзменении()

&НаКлиенте
// Процедура обработчик события ПриИзменении поля ввода ЮрФизЛицо.
//
Процедура ЮрФизЛицоПриИзменении(Элемент)
	
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры // ЮрФизЛицоПриИзменении()

&НаКлиенте
// Процедура - обработчик события НачалоВыбора поля БанковскийСчетПоУмолчанию.
//
Процедура БанковскийСчетПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		СтандартнаяОбработка = Ложь;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Элемент справочника еще не записан.';uk='Елемент довідника ще не записаний.'");
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры // БанковскийСчетПоУмолчаниюНачалоВыбора()

&НаКлиенте
// Процедура - обработчик события НачалоВыбора поля ДоговорПоУмолчанию.
//
Процедура ДоговорПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		СтандартнаяОбработка = Ложь;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Элемент справочника еще не записан.';uk='Елемент довідника ще не записаний.'");
		Сообщение.Сообщить();
		
	КонецЕсли;	
	
КонецПроцедуры // ДоговорПоУмолчаниюНачалоВыбора()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "КОНТАКТНАЯ ИНФОРМАЦИЯ"

// СтандартныеПодсистемы.КонтактнаяИнформация

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры



// Конец СтандартныеПодсистемы.КонтактнаяИнформация