
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаКорректировкаДолга, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА КорректировкаДолга.СуммаКорректировки > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	КорректировкаДолга.Дата КАК Период,
		|	КорректировкаДолга.Организация,
		|	КорректировкаДолга.ЛицевойСчетДебитор КАК ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА КорректировкаДолга.СуммаКорректировки > 0
		|			ТОГДА -КорректировкаДолга.СуммаКорректировки
		|		ИНАЧЕ КорректировкаДолга.СуммаКорректировки
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	Документ.КорректировкаДолга КАК КорректировкаДолга
		|ГДЕ
		|	КорректировкаДолга.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА КорректировкаДолга.СуммаКорректировки > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	КорректировкаДолга.Дата,
		|	КорректировкаДолга.Организация,
		|	КорректировкаДолга.ЛицевойСчетКредитор,
		|	-ВЫБОР
		|		КОГДА КорректировкаДолга.СуммаКорректировки > 0
		|			ТОГДА -КорректировкаДолга.СуммаКорректировки
		|		ИНАЧЕ КорректировкаДолга.СуммаКорректировки
		|	КОНЕЦ
		|ИЗ
		|	Документ.КорректировкаДолга КАК КорректировкаДолга
		|ГДЕ
		|	КорректировкаДолга.Ссылка = &Ссылка
		|	И НЕ КорректировкаДолга.ЛицевойСчетКредитор = ЗНАЧЕНИЕ(Справочник.ЛицевыеСчета.ПустаяСсылка)";	
		
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаКорректировкаДолга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЛицевымСчетам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
