#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ (Параметры.Отбор.Свойство("Организация")) Тогда		
		Возврат
	КонецЕсли; 
	
	Если НЕ (Параметры.Свойство("СтрокаПоиска") И ЗначениеЗаполнено(Параметры.СтрокаПоиска)) Тогда		
		Возврат
	КонецЕсли; 
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗданияИСооружения.Ссылка
	                      |ИЗ
	                      |	Справочник.ЗданияИСооружения КАК ЗданияИСооружения
	                      |ГДЕ
	                      |	ЗданияИСооружения.Организация = &Организация
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗданияИСооружения.Ссылка
	                      |
						  |ИМЕЮЩИЕ
						  |	ПОДСТРОКА(ЗданияИСооружения.Наименование, 1, &ДлинаПодстроки) ПОДОБНО &СтрокаПоиска
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ЗданияИСооружения.Наименование");
				  
	Запрос.УстановитьПараметр("Организация", Параметры.Отбор.Организация);
	Запрос.УстановитьПараметр("СтрокаПоиска", Параметры.СтрокаПоиска);
	Запрос.УстановитьПараметр("ДлинаПодстроки", СтрДлина(Параметры.СтрокаПоиска));
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		ДанныеВыбора = Новый СписокЗначений;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка);	
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
