Перем ЭтоНовый; // В переменной хранится признак нового элемента.

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = ЭтоНовый();
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗданияИСооружения);
	НайденныеСтроки = КонтактнаяИнформация.НайтиСтроки(ПараметрыОтбора);

	Если НайденныеСтроки.Количество() > 0  Тогда
		Наименование = НайденныеСтроки[0].Представление;
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ПриЗаписи.
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый Тогда
		
		ЭтоНовый = Ложь;
		
		НаборЗаписей = РегистрыСведений.ДатыЗапретаИзменения.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Пользователь.Установить(Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей);
		НаборЗаписей.Отбор.Раздел.Установить(ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.Здания);
		НаборЗаписей.Отбор.Объект.Установить(Ссылка);
		
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.Пользователь = Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей;
			НоваяСтрока.Раздел = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.Здания;
			НоваяСтрока.Объект = Ссылка;
//{{MRG[ <-> ]
			//НоваяСтрока.ДатаЗапрета = ДобавитьМесяц(КонецМесяца(ДатаНачалаУчета), -1);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//			НоваяСтрока.ДатаЗапрета = ДобавитьМесяц(КонецМесяца(ДатаНачалаУчета), -1);
//}}MRG[ <-> ]
			НоваяСтрока.Комментарий = "";
		Иначе
			НоваяСтрока = НаборЗаписей[0];
//{{MRG[ <-> ]
			//НоваяСтрока.ДатаЗапрета = ДобавитьМесяц(КонецМесяца(ДатаНачалаУчета), -1);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//			НоваяСтрока.ДатаЗапрета = ДобавитьМесяц(КонецМесяца(ДатаНачалаУчета), -1);
//}}MRG[ <-> ]
			НоваяСтрока.Комментарий = "";
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()
