
&НаСервере
Процедура ЗакрытьЛСНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	    |	ЛицевыеСчета.ЛицевойСчет.Владелец КАК Здание
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета КАК ЛицевыеСчета
	    |ГДЕ
	    |	ЛицевыеСчета.ЛицевойСчет.КодКОАТУУ = &КодКОАТУУ";
	Запрос.УстановитьПараметр("КодКОАТУУ", Объект.КодКОАТУУ);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() <> 0 Тогда
		Для Каждого стр Из Результат Цикл
			НовДок = Документы.ЗакрытиеЛицевогоСчета.СоздатьДокумент();
			НовДок.Автор = ПараметрыСеанса.ТекущийПользователь;
			НовДок.Дата = Объект.ДатаЗакрытия;
			НовДок.Здание = стр.Здание;
			НовДок.ЛицевойСчет = стр.ЛицевойСчет;
			НовДок.Организация = Справочники.Организации.НайтиПоКоду("000000001");
			Попытка
				НовДок.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				НовДок.Записать();
				Сообщить("Не вдалося закрити особовий рахунок №" + стр.ЛицевойСчет + ". Документ №" + НовДок.Номер);
			КонецПопытки;
		КонецЦикла;
	Иначе
		Сообщить("Не вибрано жодного особистого рахунку!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЛС(Команда)
	ЗакрытьЛСНаСервере();
КонецПроцедуры
