
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВариантКоттеджныйПоселок") Тогда
	
		ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
		СхемаКомпоновкиДанных = ОтчетОбъект.СхемаКомпоновкиДанных;
		ОтчетМетаданные = ОтчетОбъект.Метаданные();

		Для сч=0 По СхемаКомпоновкиДанных.НаборыДанных.Количество() - 1 Цикл
			ПолеЗдание = СхемаКомпоновкиДанных.НаборыДанных[сч].Поля.Найти("Здание");
				
			Если ПолеЗдание <> Неопределено Тогда
				ПолеЗдание.Заголовок = НСтр("ru='Коттеджный поселок';uk='Котеджне селище'");
			КонецЕсли;
			
			ПолеКвартира = СхемаКомпоновкиДанных.НаборыДанных[сч].Поля.Найти("Квартира");
				
			Если ПолеКвартира <> Неопределено Тогда
				ПолеКвартира.Заголовок = НСтр("ru='Коттедж';uk='Котедж'");
			КонецЕсли;
			
		КонецЦикла;
		 
		ОтчетОбъект.СхемаКомпоновкиДанных = СхемаКомпоновкиДанных;
		
	ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьВариантГород") Тогда
		
		ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
		СхемаКомпоновкиДанных = ОтчетОбъект.СхемаКомпоновкиДанных;
		ОтчетМетаданные = ОтчетОбъект.Метаданные();

		Для сч=0 По СхемаКомпоновкиДанных.НаборыДанных.Количество() - 1 Цикл
			ПолеЗдание = СхемаКомпоновкиДанных.НаборыДанных[сч].Поля.Найти("Здание");
				
			Если ПолеЗдание <> Неопределено Тогда
				ПолеЗдание.Заголовок = НСтр("ru='Объект учета';uk='Об`єкт обліку'");
			КонецЕсли;
			
			ПолеКвартира = СхемаКомпоновкиДанных.НаборыДанных[сч].Поля.Найти("Квартира");
				
			Если ПолеКвартира <> Неопределено Тогда
				ПолеКвартира.Заголовок = НСтр("ru='Дом';uk='Дім'");
			КонецЕсли;
			
		КонецЦикла;
		 
		ОтчетОбъект.СхемаКомпоновкиДанных = СхемаКомпоновкиДанных;
		
	КонецЕсли;
	
КонецПроцедуры
