////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	РасчетыПоЛицевымСчетам.НомерСтроки КАК НомерСтроки,
	|	РасчетыПоЛицевымСчетам.Организация КАК Организация,
	|	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
	|	РасчетыПоЛицевымСчетам.Услуга КАК Услуга,
	|	РасчетыПоЛицевымСчетам.МесяцНачисления КАК МесяцНачисления,
	|	РасчетыПоЛицевымСчетам.Сумма КАК СуммаПередЗаписью,
	|	РасчетыПоЛицевымСчетам.Сумма КАК СуммаИзменение,
	|	РасчетыПоЛицевымСчетам.Сумма КАК СуммаПриЗаписи
	|ПОМЕСТИТЬ ДвиженияРасчетыПоЛицевымСчетамИзменение
	|ИЗ
	|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияРасчетыПоЛицевымСчетамИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()
