
#Область ПриемЗапросов

Процедура ПолучитьUpdate()Экспорт 
	
	ЗапросМакс = Новый Запрос("ВЫБРАТЬ
	                          |	МАКСИМУМ(update.update_id) КАК update_id
	                          |ИЗ
	                          |	РегистрСведений.update КАК update");
	Выборка = ЗапросМакс.Выполнить().Выбрать();
	Если Выборка.Следующий() ТОгда
		OffSet = "?offset="+Формат(Выборка.update_id, "ЧГ=");
	Иначе
		OffSet = "";
	КонецЕсли;
	
	Ключ = Константы.КлючAPI.Получить();
	Сервер = "api.telegram.org";
	Команда = "getUpdates"+OffSet;
	Ресурс = "bot"+Ключ+"/"+Команда;
	Соединение = Новый HTTPСоединение(Сервер,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(Ресурс); 
	
	Ответ = Соединение.Получить(Запрос);
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	
	ОтветСоотв = ПрочитатьJSON(Чтение,Истина);
	Если ОтветСоотв["ok"] Тогда
		getUpdatesОбОтв(ОтветСоотв);
	КонецЕсли;
	
КонецПроцедуры

Процедура setWebhook(ok)Экспорт 
	
	Ключ = Константы.КлючAPI.Получить();
	Сервер = "api.telegram.org";
	Команда = "setWebhook";
	Ресурс = "bot"+Ключ+"/"+Команда+"?url="+КодироватьСтроку(Константы.URLWebhook.Получить(),СпособКодированияСтроки.КодировкаURL);
	Соединение = Новый HTTPСоединение(Сервер,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Запрос = Новый HTTPЗапрос(Ресурс); 
	
	Ответ = Соединение.Получить(Запрос);
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	
	ОтветСоотв = ПрочитатьJSON(Чтение,Истина);
	ok=ОтветСоотв["ok"];
	
КонецПроцедуры

Процедура getUpdatesОбОтв(ОтветСоотв)
	
	ТабID = Новый ТаблицаЗначений;
	ТабID.Колонки.Добавить("update_id", ОбщегоНазначенияКлиентСервер.ПолучитьОписаниеТиповЧисла(15));
	
	Для Каждого upd Из ОтветСоотв["result"] Цикл
		
		СтрТаб = ТабID.Добавить();
		СтрТаб.update_id = upd["update_id"];
				  
	КонецЦикла;
			
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТабID.update_id
	                      |ПОМЕСТИТЬ ТабID
	                      |ИЗ
	                      |	&ТабID КАК ТабID
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ТабID.update_id КАК update_id
	                      |ИЗ
	                      |	ТабID КАК ТабID
	                      |ГДЕ
	                      |	НЕ ТабID.update_id В
	                      |				(ВЫБРАТЬ
	                      |					update.update_id
	                      |				ИЗ
	                      |					РегистрСведений.update КАК update) ");
						  
	Запрос.УстановитьПараметр("ТабID",ТабID);
	
	НовыеАпдейты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("update_id");
	
	Для Каждого upd Из ОтветСоотв["result"] Цикл
		Если НовыеАпдейты.Найти(upd["update_id"]) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если upd["message"] <> Неопределено Тогда
			message = upd["message"];
			мз = РегистрыСведений.update.СоздатьМенеджерЗаписи();
			мз.update_id = upd["update_id"];
			мз.date = ТекущаяДата();
			мз.text = message["text"];
			мз.message_id 	= message["message_id"];
			мз.first_name 	= message["from"]["first_name"];
			мз.id 			= message["from"]["id"];
			мз.Записать();
			
			// +ХВОЯ 2020-01-04 Петров Если принял контакт пользователя в ответе	
			Контакт = message.Получить("contact"); 
			Если Контакт <> Неопределено Тогда 
				Если ПользователяЕщёНетВЗарегестрированных(message["from"]["id"]) Тогда 
					ИзменитьРегПользователиТелеграммПроходящиеРегистрацию(message["from"]["id"], ,Контакт["phone_number"]);
					мз.text = "/have_got_contact";
				КонецЕсли;
			КонецЕсли;
			мз.Записать();
			// -ХВОЯ Петров
		КонецЕсли;
		
		Если upd["callback_query"] <> Неопределено Тогда
			Ответ = upd["callback_query"];
			мз = РегистрыСведений.update.СоздатьМенеджерЗаписи();
			мз.update_id = upd["update_id"];
			мз.date = ТекущаяДата();
			мз.text = Ответ["data"];
			мз.first_name 	= Ответ["from"]["first_name"];
			мз.id 			= Ответ["from"]["id"];
			мз.Записать();
		КонецЕсли;

		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаЗапросов

Процедура ОбработатьЗапросы() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	update.update_id,
	                      |	update.date,
	                      |	update.text,
	                      |	update.message_id КАК message_id,
	                      |	update.first_name,
	                      |	update.id КАК id
	                      |ИЗ
	                      |	РегистрСведений.update КАК update
	                      |ГДЕ
	                      |	НЕ update.Обработан
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	message_id
	                      |ИТОГИ ПО
	                      |	id");
	ВыборкаЮзеров = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЮзеров.Следующий() Цикл
		ВыборкаЗапросов = ВыборкаЮзеров.Выбрать();
		Пока ВыборкаЗапросов.Следующий() Цикл
			ok = Ложь;
			ОбработатьЗапрос(ВыборкаЗапросов, ok);
			Если ok Тогда
				мз = РегистрыСведений.update.СоздатьМенеджерЗаписи();
				мз.update_id =ВыборкаЗапросов.update_id;
				мз.Прочитать();
				мз.Обработан = Истина;
				мз.Записать();
			КонецЕсли;
		
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

//Редактировал Петров В, 
Процедура ОбработатьЗапрос(ЗапросПользователя, ok)
	
	Запрос  = СокрЛП(ЗапросПользователя.text);
	
	ПользовательНайден = НайтиПользователя(ЗапросПользователя.id);
	
	//Блок обработки запросов незарегестрированных пользователей
	Если ПользовательНайден = Ложь Тогда
		
		Если Запрос = "/start"  Тогда
			
			TelegramKeyboard.ОтправитьСообщениеСервис("Вас вітає Телеграм-Бот КП ""Тепловодсервіс"" \ud83d\udc4b", ЗапросПользователя.id, ok);
			textКлВыборЯзыка = НСтр("ru = 'Оберіть мову \ud83d\ude44'; uk = 'Оберіть мову \ud83d\ude44'");
			Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
												textКлВыборЯзыка,, ,, 
												TelegramKeyboard.СоздатьКлавиатуру(Справочники.КлавиатурыTelegram.ЯзыкПользователяТелеграмм));

			Результат = Null;
		ИначеЕсли Запрос = "/ru_language" Тогда
			ИзменитьРегПользователиТелеграммПроходящиеРегистрацию(ЗапросПользователя.id, "ru");
			TelegramKeyboard.ОбратнаяСвязь(ЗапросПользователя.id, "ru",ok);//отправить телефон пользователем
			Результат = Null;
			//ОтправитьСообщениеСервис("Для регистрации введите лицевой счет", ЗапросПользователя.id, ok);
		ИначеЕсли Запрос = "/uk_language" Тогда
			ИзменитьРегПользователиТелеграммПроходящиеРегистрацию(ЗапросПользователя.id, "uk");
			TelegramKeyboard.ОбратнаяСвязь(ЗапросПользователя.id, "uk",ok);//отправить телефон пользователем
			Результат = Null;
			//отправить телефон пользователем
			//ОтправитьСообщениеСервис("Для реєстрации введіть особовий рахунок", ЗапросПользователя.id, ok);	
		Иначе	
			//Если нет язіка КодЯзыка = "ru";
			//Если нет в проходящих регистрацию то неизвесный телефон отправить клавиатуру
			//Проверить телефон
			TelegramKeyboard.ОтправитьСообщениеСервис(СформироватьТекстовоеСообщение(Запрос, ЗапросПользователя, Ложь), ЗапросПользователя.id, ok);
			
			//БылоЕсли  ЛицевойСчет = НайтиИскомыйЛС(Запрос);
				//Если ЛицевойСчет <> Неопределено Тогда
				//	//Получить язік Пользователя, если вдруг, то функция вернет "ru" 
				//	КодЯзыка = КодЯзыкаПользователяПередРегистрацией(ЗапросПользователя.id);
				//	
				//	ЗарегистрироватьПользователя(ЗапросПользователя.id, ЛицевойСчет, КодЯзыка);
				//	
				//	textРегистрациии1 = НСтр("ru = 'Регистрация прошла успешно. '; uk = 'Реєстрація пройшла вдало '", КодЯзыка);
				//	
				//	ОтправитьСообщениеСервис(NULL, ЗапросПользователя.id, ok);
				//	Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
				//									textРегистрациии1,, ,, 
				//									TelegramKeyboard.СоздатьКлавиатуру(Справочники.КлавиатурыTelegram["УспешнаяРегистрация" + КодЯзыка]));

				//	Результат = Null;
				//Иначе
				//	КодЯзыка = КодЯзыкаПользователяПередРегистрацией(ЗапросПользователя.id);
				//	//Если Не ЗначениеЗаполнено(КодЯзыка) Тогда 
				//	//	 КодЯзыка = "ru";
				//	//КонецЕсли;
				//	Текст1 = НСтр("ru = 'Не найден Лицевой счет. Регистрация не удалась. Введите еще раз  лицевой счёт '; uk = 'Не Знайден особовий рахунок. Зареєструватись не вдалось. Введіть ще раз  особовий рахунок'", КодЯзыка);
				//	textРегистрациии2 = КодироватьСтроку(Текст1 + Символ(9995), СпособКодированияСтроки.КодировкаURL);

				//	ОтправитьСообщениеСервис(textРегистрациии2, ЗапросПользователя.id, ok);
				//	
				//	Результат = Null;

				//КонецЕсли;
			//КонецБыло	
		КонецЕсли;
	КонецЕсли;
	
	//Блок обработки запросов зарегистрированных пользователей
	Если ПользовательНайден = Истина Тогда
		КодЯзыка = КодЯзыкаПользователя(ЗапросПользователя.id);
		//Call_back - Если он не равен Неопределено Значит пользователь хочет ввести показания для счетчика, и в Call_back будет  
		//ссылка на прибор и вид тарифа
		// Иначе вернет неопределено  и обработаем  "Неизвестный запрос"
		Call_back = Неопределено;
		Попытка
		Call_back = ЭтоДанныеПоПриборуУчетаДляВнесения(ЗапросПользователя.id, ЗапросПользователя.update_id);
		Исключение
		КонецПопытки;

		Если Call_back <> Неопределено Тогда
			Попытка 
			    Показания = Число(ЗапросПользователя.text);
			Исключение
			КонецПопытки;
			
			Если ТипЗнч(Показания) = Тип("Число") Тогда
				
				//Попытка записать показания введеные пользователем
				ГуидСтрока = Сред(Call_back, 13, 36);			
				УникальныйИдентификатор = Новый УникальныйИдентификатор(ГуидСтрока);
				СсылкаНаПрибор = Справочники.ПриборыУчета.ПолучитьСсылку(УникальныйИдентификатор);
				М = РегистрыСведений.ПользователиТелеграмм.СоздатьНаборЗаписей();
				М.Отбор.idПользователя.Установить(ЗапросПользователя.id);
				М.Прочитать();
				ЛС = (М[0].ЛицевойСчет);
				
				НаборЗаписей = РегистрыСведений.ПоказанияПриборовУчетаИзТелеграмм.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ПриборУчета.Установить(СсылкаНаПрибор);  
				НаборЗаписей.Отбор.ВидТарифа.Установить(Перечисления.ВидыТарифов[Число(Лев(Прав(Call_back,2),1))]);	
				НаборЗаписей.Отбор.ЛицевойСчет.Установить(ЛС);  
				НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());	
				ТекЗапись = НаборЗаписей.Добавить();					
				ТекЗапись.ПриборУчета = СсылкаНаПрибор; 
		
				ТекЗапись.ВидТарифа = Перечисления.ВидыТарифов[Число(Лев(Прав(Call_back,2),1))];
				ТекЗапись.ЛицевойСчет = ЛС;
				ТекЗапись.Значение = Показания;
				ТекЗапись.Период = ТекущаяДата();	
				НаборЗаписей.Записать();
				
				//Создание ответа
				text1 = НСтр("ru = 'Ви внесли показання \ud83d\udcdd'; uk = 'Ви внесли показання \ud83d\udcdd'");
				text2 = НСтр("ru = 'Для Приладу - '; uk = 'Для Приладу - '");
				text3 = НСтр("ru = 'Тариф '; uk = 'Тариф '");

				ТекстСообщения = text1+ Символы.ПС
						+ text2+ Строка(СсылкаНаПрибор.Наименование)+ Символы.ПС
						+ text3 + Строка(Перечисления.ВидыТарифов[Число(Лев(Прав(Call_back,2),1))])+ Символы.ПС;
				TelegramKeyboard.ОтправитьСообщениеСервис(ТекстСообщения, ЗапросПользователя.id, ok);		
				
				М = РегистрыСведений.ПользователиТелеграмм.СоздатьНаборЗаписей();
				М.Отбор.idПользователя.Установить(ЗапросПользователя.id);
				М.Прочитать();
				ЛС = (М[0].ЛицевойСчет);
				МассивКнопокСчетчиков = Новый Массив;
				МассивСчетчиковДляКнопок =  ПолучитьКнопкиВводаСчетчиков(ЛС);
				text = НСтр("ru = 'Вводіть показання лічильника псля натискання на клавіатуру '; uk = 'Вводіть показання лічильника псля натискання на клавіатуру '", КодЯзыка );
				Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
														text,, ,, 
														TelegramKeyboard.СоздатьКлавиатуруВиртуальнойКнопки(МассивСчетчиковДляКнопок, Справочники.КлавиатурыTelegram.КнопкаВводаПоказаний, КодЯзыка));
														
					
				Результат = Null;								
			Иначе 
				Текст1 = НСтр("ru = '	\ud83e\udd1aВведені дані не є коректними \ud83d\ude1f'; uk = '	\ud83e\udd1aВведені дані не є коректними \ud83d\ude1f'", КодЯзыка);
				//ТекстСообщения = КодироватьСтроку(Текст1 + Символ(9995), СпособКодированияСтроки.КодировкаURL);
				ТекстСообщения = Текст1;
				TelegramKeyboard.ОтправитьСообщениеСервис(ТекстСообщения, ЗапросПользователя.id, ok);
				
				М = РегистрыСведений.ПользователиТелеграмм.СоздатьНаборЗаписей();
				М.Отбор.idПользователя.Установить(ЗапросПользователя.id);
				М.Прочитать();
				ЛС = (М[0].ЛицевойСчет);
				МассивКнопокСчетчиков = Новый Массив;
				МассивСчетчиковДляКнопок =  ПолучитьКнопкиВводаСчетчиков(ЛС);
				text = НСтр("ru = 'Вводіть показання лічильника після натискання на клавіатуру \ud83d\udc47'; uk = 'Вводіть показання лічильника після натискання на клавіатуру \ud83d\udc47'", КодЯзыка);
				Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
														text,, ,, 
														TelegramKeyboard.СоздатьКлавиатуруВиртуальнойКнопки(МассивСчетчиковДляКнопок, Справочники.КлавиатурыTelegram.КнопкаВводаПоказаний, КодЯзыка));
														
													
				Результат = Null;
	
			КонецЕсли;	
		Иначе
			TelegramKeyboard.ОтправитьСообщениеСервис(СформироватьТекстовоеСообщение(Запрос, ЗапросПользователя, Истина), ЗапросПользователя.id, ok);
			
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры


//Редактировал Петров В Клавиатуры связанные с вводом и выодом информации по счетчикам
//Добавил ответ клавиатуры  "/hv_indication"
//							"/hv_show_indication"
//							"/hv_input_indication"
//							СтрЧислоВхождений(ТипЗапроса, "/virt_button")
Функция СформироватьТекстовоеСообщение(ТипЗапроса, ЗапросПользователя, Зарегистрирован)
	Попытка 
		КодЯзыка = КодЯзыкаПользователя(ЗапросПользователя.id);
	Исключение
		КодЯзыка = "ru";
	КонецПопытки;
	
	ТекстРезультат = НСтр("ru = 'Невідомий запит \u2639\ufe0f '; uk = 'Невідомий запит \u2639\ufe0f '", КодЯзыка); 
	Результат = ТекстРезультат;

	//Результат = КодироватьСтроку(ТекстРезультат + Символ(9995), СпособКодированияСтроки.КодировкаURL);

	Если ТипЗапроса = "/start" и НЕ Зарегистрирован Тогда
		//Результат = СокрЛП(ПолучитьОбщийМакет("ОтветStartНезарегестрированномуПользователю").ПолучитьТекст()) ;

		//конструкцияне работает  и какой может быть шаблон если я не знаю языка пользователя
		ТексОтветаИзШаблона = СокрЛП(ПолучитьОбщийМакет("ОтветStartНезарегестрированномуПользователю").ПолучитьТекст()) ;
		Выполнить("Результат = " + ТексОтветаИзШаблона );
		
	КонецЕсли;
	
	Если ТипЗапроса = "/start" и Зарегистрирован Тогда
		Текст2 = "";
		Шаблон = СокрЛП(ПолучитьОбщийМакет("ОтветStart").ПолучитьТекст()); 
		Текст1 = СтрЗаменить(Шаблон, "%enterprise%", ОпределитьПредприятие(ЗапросПользователя.id));
		Выполнить("Текст2 = " + Текст1 );
		Текст3 = Текст2 + " \ud83c\udfe1";
		Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
												Текст3,, ,, 
												TelegramKeyboard.СоздатьКлавиатуру(Справочники.КлавиатурыTelegram["МенюStart" + КодЯзыка]));

		Результат = Null;
	КонецЕсли;
	
	Если ТипЗапроса = "/ru_language" и Зарегистрирован Тогда
		ИзменитьЯзыкПользователю(ЗапросПользователя.id, "ru");
		КодЯзыка = "ru";
		textПослеВыборЯзыка = НСтр("ru = 'Обрана Українська мова \ud83d\ude09 \ud83d\ude09'; uk = 'Обрана Українська мова \ud83d\ude09 \ud83d\ude09'", КодЯзыка);
		Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
												textПослеВыборЯзыка,, ,, 
												TelegramKeyboard.СоздатьКлавиатуру(Справочники.КлавиатурыTelegram["ВозвратВСтарт" + КодЯзыка]));
		Результат = Null;

	КонецЕсли;
	Если ТипЗапроса = "/uk_language" и Зарегистрирован Тогда
		ИзменитьЯзыкПользователю(ЗапросПользователя.id, "uk");
		КодЯзыка = "uk";
		textПослеВыборЯзыка = НСтр("ru = 'Выбран Украинский язык \ud83d\ude09'; uk = 'Обрана Українська мова \ud83c\uddfa\ud83c\udde6'", КодЯзыка);
		Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
												textПослеВыборЯзыка,, ,, 
												TelegramKeyboard.СоздатьКлавиатуру(Справочники.КлавиатурыTelegram["ВозвратВСтарт" + КодЯзыка]));
		Результат = Null;

	КонецЕсли;

	Если ТипЗапроса = "/hv_language" и Зарегистрирован Тогда
			textКлВыборЯзыка = НСтр("ru = 'Оберіть мову '; uk = 'Оберіть мову '", КодЯзыка);
			Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
												textКлВыборЯзыка,, ,, 
												TelegramKeyboard.СоздатьКлавиатуру(Справочники.КлавиатурыTelegram.ЯзыкПользователяТелеграмм));

			Результат = Null;

	КонецЕсли;
	Если ТипЗапроса = "/hv_debts" и Зарегистрирован Тогда
		Попытка
			М = РегистрыСведений.ПользователиТелеграмм.СоздатьНаборЗаписей();
			М.Отбор.idПользователя.Установить(ЗапросПользователя.id);
			М.Прочитать();
			ЛС = (М[0].ЛицевойСчет);
			Текст = ДанныеПоЛицевомуСчету(ЛС, КодЯзыка);
			
			Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
					Текст,, ,, 
					TelegramKeyboard.СоздатьКлавиатуру(Справочники.КлавиатурыTelegram["ВозвратВСтарт" + КодЯзыка]));
			Результат = Null;
		Исключение
		    Текст = НСтр("ru = 'Зареестрованих боргів не виявлено \ud83d\ude00 '; uk = 'Зареестрованих боргів не виявлено \ud83d\ude00 '", КодЯзыка);
			Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
					Текст,, ,, 
					TelegramKeyboard.СоздатьКлавиатуру(Справочники.КлавиатурыTelegram["ВозвратВСтарт" + КодЯзыка]));
			Результат = Null;
		КонецПопытки
	КонецЕсли;
	
	Если ТипЗапроса = "/hv_give_receipt" и Зарегистрирован Тогда
		Текст = НСтр("ru = 'Формування квитанцій ще на стадії розробки '; uk = 'Формування квитанцій ще на стадії розробки '", КодЯзыка);
		Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
												Текст,, ,, 
												TelegramKeyboard.СоздатьКлавиатуру(Справочники.КлавиатурыTelegram["ВозвратВСтарт" + КодЯзыка]));
		Результат = Null;
	КонецЕсли;
	
	Если ТипЗапроса = "/hv_voting" и Зарегистрирован Тогда
		Попытка
		Голосование = ПолучитьПоследнееГолосование(ЗапросПользователя.id);
		Шаблон = СокрЛП(ПолучитьОбщийМакет("ИтогиПоследнегоГолосования").ПолучитьТекст());
		Текст = СтрЗаменить(Шаблон, "%data%", Строка(Голосование.Дата));
		Текст = СтрЗаменить(Текст, "%problem%", Строка(Голосование.Вопрос));
		Текст = СтрЗаменить(Текст, "%result%", Строка(Голосование.Итог));
		ТекстИзШаблона = "";
		Выполнить("ТекстИзШаблона = " + Текст );

		Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
												ТекстИзШаблона,, ,, 
												TelegramKeyboard.СоздатьКлавиатуру(Справочники.КлавиатурыTelegram["ВозвратВСтарт" + КодЯзыка]));
		Результат = Null;
	Исключение
		ТекстГолосования = НСтр("ru = 'Немає зареєстрованних голосувань \ud83d\ude00 '; uk = 'Немає зареєстрованних голосувань \ud83d\ude00 '", КодЯзыка);
		Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
												ТекстГолосования,, ,, 
												TelegramKeyboard.СоздатьКлавиатуру(Справочники.КлавиатурыTelegram["ВозвратВСтарт" + КодЯзыка]));
		Результат = Null;
	КонецПопытки;
	КонецЕсли;
	
	
	//Редактировал Петров В
	Если ТипЗапроса = "/hv_indication" и Зарегистрирован Тогда   //Стартовое меню счетчики
		М = РегистрыСведений.ПользователиТелеграмм.СоздатьНаборЗаписей();
		М.Отбор.idПользователя.Установить(ЗапросПользователя.id);
		М.Прочитать();
		ЛС = (М[0].ЛицевойСчет);
		ТекстТелеграммаСчетчики = НСтр("ru = 'Інформація для '; uk = 'Інформація для '", КодЯзыка);
		Текст = ТекстТелеграммаСчетчики + Строка(ЛС.ОбъектЛицевогоСчета) + Символы.ПС;
		Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
												Текст,, ,, 
												TelegramKeyboard.СоздатьКлавиатуруВертикальную(Справочники.КлавиатурыTelegram["Счетчики" + КодЯзыка]));
		Результат = Null;
	КонецЕсли;
	
	Если ТипЗапроса = "/hv_show_indication" и Зарегистрирован Тогда  //
		М = РегистрыСведений.ПользователиТелеграмм.СоздатьНаборЗаписей();
		М.Отбор.idПользователя.Установить(ЗапросПользователя.id);
		М.Прочитать();
		ЛС = (М[0].ЛицевойСчет);
		
		ТекстТелеграммаПоказанияСчетчики = НСтр("ru = 'Останні зареєстровані показання лічильників для'; uk = 'Останні зареєстровані показання лічильників для '", КодЯзыка);
		Текст = ТекстТелеграммаПоказанияСчетчики + Строка(ЛС.ОбъектЛицевогоСчета);
		Текст = Текст + ПолучитьПоказанияСчетчиков(ЛС, КодЯзыка);
		Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
												Текст,, ,, 
												TelegramKeyboard.СоздатьКлавиатуруВертикальную(Справочники.КлавиатурыTelegram["Счетчики" + КодЯзыка]));
		Результат = Null;
	КонецЕсли;
	
	Если ТипЗапроса = "/hv_input_indication" и Зарегистрирован Тогда
		М = РегистрыСведений.ПользователиТелеграмм.СоздатьНаборЗаписей();
		М.Отбор.idПользователя.Установить(ЗапросПользователя.id);
		М.Прочитать();
		ЛС = (М[0].ЛицевойСчет);
		МассивКнопокСчетчиков = Новый Массив;
		МассивСчетчиковДляКнопок =  ПолучитьКнопкиВводаСчетчиков(ЛС);
		ТекстТелеграммаВводПоказанияСчетчики = НСтр("ru = 'Вносіть показання після натискання на кнопку: \ud83d\udc47 '; uk = 'Вносіть показання після натискання на кнопку: \ud83d\udc47'", КодЯзыка);
		
		//text = "Вводите показания счетчиков после нажатия на клавиатуру";
		Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
												ТекстТелеграммаВводПоказанияСчетчики,, ,, 
												TelegramKeyboard.СоздатьКлавиатуруВиртуальнойКнопки(МассивСчетчиковДляКнопок, Справочники.КлавиатурыTelegram.КнопкаВводаПоказаний, КодЯзыка));
												
											
		Результат = Null;
		
	КонецЕсли;

	Если  СтрЧислоВхождений(ТипЗапроса, "/virt_button")  и Зарегистрирован Тогда
		
		Попытка 
			СтрокаГуид = Сред(ТипЗапроса, 13, 36);			
			УникальныйИдентификатор = Новый УникальныйИдентификатор(СтрокаГуид);
			СсылкаНаПрибор = Справочники.ПриборыУчета.ПолучитьСсылку(УникальныйИдентификатор);
			ВносимПоказанияТекст = НСтр("ru = 'Вносіть показання. Тільки цифри'; uk = 'Вносіть показання. Тільки цифри '", КодЯзыка);
			
			Результат = "N" + Строка(СсылкаНаПрибор.Наименование)
						+ "/" + Строка(Перечисления.ВидыТарифов[Число(Лев(Прав(ТипЗапроса,2),1))])+ Символы.ПС
						+"______________________________" + Символы.ПС 
						+ ВносимПоказанияТекст;
						//+ "Внесите показания. Только значащие цыфры";

						
		Исключение
			Результат = Null;	
		КонецПопытки;		
				
		Возврат Результат;
		
	КонецЕсли;
	
	Если ТипЗапроса = "/have_got_contact" и Не Зарегистрирован Тогда			
		Если ПользователяЕщёНетВЗарегестрированных(ЗапросПользователя.id) Тогда 
			
			ПользовательПроходящийРегистрацию = РегистрыСведений.ПользователиТелеграммПроходящиеРегистрацию.СоздатьМенеджерЗаписи();
			ПользовательПроходящийРегистрацию.idПользователя = ЗапросПользователя.id;
			ПользовательПроходящийРегистрацию.Прочитать();
			КодЯзыка = ПользовательПроходящийРегистрацию.КодЯзыка;
			
			НомерТелефона = ОставитьТолькоЦифрыВСтроке(СокрЛП(ПользовательПроходящийРегистрацию.НомерТелефона));
			ЛС = Найти1ЛСПоНомеруТелефона(НомерТелефона);    
			Если ЛС <> Справочники.ЛицевыеСчета.ПустаяСсылка() Тогда
				textРегистрациии1 = НСтр("ru = 'Реєстрація пройшла вдало.\ud83d\udc4d '; uk = 'Реєстрація пройшла вдало.\ud83d\udc4d '", КодЯзыка)+ Символы.ПС;
				ЗарегистрироватьПользователя(ЗапросПользователя.id, ЛС, КодЯзыка);
				ПользовательПроходящийРегистрацию.Удалить();
				Текст2 = "";
				Шаблон = СокрЛП(ПолучитьОбщийМакет("ОтветStart").ПолучитьТекст()); 
				Текст1 = СтрЗаменить(Шаблон, "%enterprise%", ОпределитьПредприятие(ЗапросПользователя.id));
				Выполнить("Текст2 = " + Текст1 );
				textРегистрациии2 =  textРегистрациии1 + Текст2 + " \ud83c\udfe1";;
				Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
												textРегистрациии2,, ,, 
												TelegramKeyboard.СоздатьКлавиатуру(Справочники.КлавиатурыTelegram["МенюStart" + КодЯзыка]));
				Результат = Null;
			Иначе
				//нет такого телефона подключ'нного к лс.  Нужно отправить Сообщение Администратору бота что есть попітка подключения к боту
				// с номера телефона такого-то  и відать клавиатуру завершить регистрацию
				//и клавиатура завершить регистрацию после привязки администратором телефона к ЛС
				textАдминистратору = НСтр("ru = 'Неудачная попытка зарегестрироваться в боте. Номер телефона - '") + СокрЛП(ПользовательПроходящийРегистрацию.НомерТелефона) +  НСтр("ru = '. ID пользователя - '") + Строка(ЗапросПользователя.id);
				TelegramKeyboard.ОтправитьСообщениеАдминистратору(textАдминистратору);
				text1 = НСтр("ru = 'Номер телефона - '") + СокрЛП(ПользовательПроходящийРегистрацию.НомерТелефона) +  НСтр("ru = '. ID пользователя - '") + Строка(ЗапросПользователя.id);
				text = text1 + Символы.ПС+ НСтр("ru = 'Телефон не знайден.'; uk = 'Телефон не знайден.'", КодЯзыка);
				text =  text + Символы.ПС + НСтр("ru = 'Адмінстратор зв''яжеться з вами найближчим часом. '; uk = 'Адмінстратор зв''яжеться з вами найближчим часом. '", КодЯзыка);
				text =  text + Символы.ПС + НСтр("ru = 'Після розмови з ним, наберіть команду /start. '; uk = 'Після розмови з ним, наберіть команду /start. '", КодЯзыка);
				Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, text,,,,);
								
				Результат = Null;

			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
		
	Если ТипЗапроса = "/have_got_contact" и Зарегистрирован Тогда			
			text = НСтр("ru = 'Номер телефону отримано. \ud83d\udc4d '; uk = 'Номер телефону отримано. \ud83d\udc4d '", КодЯзыка);
			Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
												text,, ,, 
												TelegramKeyboard.СоздатьКлавиатуру(Справочники.КлавиатурыTelegram["МенюStart" + КодЯзыка]));
			Результат = Null;
	КонецЕсли;

	//Пока не используем ,но кто знает как повернётся
	Если ТипЗапроса = "/finish" и Не Зарегистрирован Тогда			
			ПользовательПроходящийРегистрацию = РегистрыСведений.ПользователиТелеграммПроходящиеРегистрацию.СоздатьМенеджерЗаписи();
			ПользовательПроходящийРегистрацию.idПользователя = ЗапросПользователя.id;
			ПользовательПроходящийРегистрацию.Прочитать();
			КодЯзыка = ПользовательПроходящийРегистрацию.КодЯзыка;
			
			НомерТелефона = ОставитьТолькоЦифрыВСтроке(СокрЛП(ПользовательПроходящийРегистрацию.НомерТелефона));
			ЛС = Найти1ЛСПоНомеруТелефона(НомерТелефона);    
			Если ЛС <> Справочники.ЛицевыеСчета.ПустаяСсылка() Тогда
				textРегистрациии1 = НСтр("ru = 'Реєстрація пройшла вдало.\ud83d\udc4d '; uk = 'Реєстрація пройшла вдало.\ud83d\udc4d '", КодЯзыка)+ Символы.ПС;
				ЗарегистрироватьПользователя(ЗапросПользователя.id, ЛС, КодЯзыка);
				ПользовательПроходящийРегистрацию.Удалить();
				Текст2 = "";
				Шаблон = СокрЛП(ПолучитьОбщийМакет("ОтветStart").ПолучитьТекст()); 
				Текст1 = СтрЗаменить(Шаблон, "%enterprise%", ОпределитьПредприятие(ЗапросПользователя.id));
				Выполнить("Текст2 = " + Текст1 );
				textРегистрациии2 =  textРегистрациии1 + Текст2;
				Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
												textРегистрациии2,, ,, 
												TelegramKeyboard.СоздатьКлавиатуру(Справочники.КлавиатурыTelegram["МенюStart" + КодЯзыка]));
				Результат = Null;
			Иначе
				//и клавиатура завершить регистрацию после привязки администратором телефона к ЛС
				textАдминистратору = НСтр("ru = 'Неудачная попытка зарегестрироватьсяя в боте. Номер телефона - '") + СокрЛП(ПользовательПроходящийРегистрацию.НомерТелефона) +  НСтр("ru = '. ID пользователя - '") + Строка(ЗапросПользователя.id);
				TelegramKeyboard.ОтправитьСообщениеАдминистратору(textАдминистратору);
				text =  НСтр("ru = 'За цим номером не знайден особистий рахунок.'; uk = 'За цим номером не знайден особистий рахунок.'", КодЯзыка);
				text =  text + Символы.ПС + НСтр("ru = 'Адмінстратор поідомлен. Він зв''яжеться з вами. І прив''яже ваш номер до вашого Особового рахунку.'; uk = 'Адмінстратор поідомлен. Він зв''яжеться з вами. І прив''яже ваш номер до вашого Особового рахунку. '", КодЯзыка);
				Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, text,,,,);
								
				Результат = Null;

			КонецЕсли;

	КонецЕсли;
	
	//Пока не используем ,но кто знает как повернётся
	Если ТипЗапроса = "/финиш" и Не Зарегистрирован Тогда			
			ПользовательПроходящийРегистрацию = РегистрыСведений.ПользователиТелеграммПроходящиеРегистрацию.СоздатьМенеджерЗаписи();
			ПользовательПроходящийРегистрацию.idПользователя = ЗапросПользователя.id;
			ПользовательПроходящийРегистрацию.Прочитать();
			КодЯзыка = ПользовательПроходящийРегистрацию.КодЯзыка;
			
			НомерТелефона = ОставитьТолькоЦифрыВСтроке(СокрЛП(ПользовательПроходящийРегистрацию.НомерТелефона));
			ЛС = Найти1ЛСПоНомеруТелефона(НомерТелефона);    
			Если ЛС <> Справочники.ЛицевыеСчета.ПустаяСсылка() Тогда
				textРегистрациии1 = НСтр("ru = 'Регистрация прошла успешно.\ud83d\udc4d '; uk = 'Реєстрація пройшла вдало.\ud83d\udc4d '", КодЯзыка)+ Символы.ПС;
				ЗарегистрироватьПользователя(ЗапросПользователя.id, ЛС, КодЯзыка);
				ПользовательПроходящийРегистрацию.Удалить();
				Текст2 = "";
				Шаблон = СокрЛП(ПолучитьОбщийМакет("ОтветStart").ПолучитьТекст()); 
				Текст1 = СтрЗаменить(Шаблон, "%enterprise%", ОпределитьПредприятие(ЗапросПользователя.id));
				Выполнить("Текст2 = " + Текст1 );
				textРегистрациии2 =  textРегистрациии1 + Текст2;
				Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, 
												textРегистрациии2,, ,, 
												TelegramKeyboard.СоздатьКлавиатуру(Справочники.КлавиатурыTelegram["МенюStart" + КодЯзыка]));
				Результат = Null;
			Иначе
				//и клавиатура завершить регистрацию после привязки администратором телефона к ЛС
				textАдминистратору = НСтр("ru = 'Неудачная попытка зарегестрироватьсяя в боте. Номер телефона - '") + СокрЛП(ПользовательПроходящийРегистрацию.НомерТелефона) +  НСтр("ru = '. ID пользователя - '") + Строка(ЗапросПользователя.id);
				TelegramKeyboard.ОтправитьСообщениеАдминистратору(textАдминистратору);
				text =  НСтр("ru = 'По этому номеру телефона не найден Лицевой счёт.'; uk = 'За цим номером не знайден особистий рахунок.'", КодЯзыка);
				text =  text + Символы.ПС + НСтр("ru = 'Администратор уведомлён. Он свяжется с вами. И привяжет ваш номер телефона к вашему лицевому счёту'; uk = 'Адмінстратор поідомлен. Він зв''яжеться з вами. І прив''яже ваш номер до вашого Особістого рахунку. '", КодЯзыка);
				Ответ = TelegramKeyboard.ОтправитьСообщение(ЗапросПользователя.id, text,,,,);
								
				Результат = Null;

			КонецЕсли;

	КонецЕсли;

	//Конец блока Редактировал Петров В
	Возврат Результат;	
КонецФункции

#КонецОбласти

#Область Действия

Функция НайтиПользователя(id)
	Итог = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиТелеграмм.idПользователя
		|ИЗ
		|	РегистрСведений.ПользователиТелеграмм КАК ПользователиТелеграмм";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Найти(id,Выборка.idПользователя) <> 0 тогда
			Итог = Истина;
		    Прервать;
		КонецЕсли; 
	КонецЦикла;
	Возврат Итог;
	
КонецФункции  

Процедура ЗарегистрироватьПользователя(id, ЛицевойСчет, КодЯзыка)
	мз = РегистрыСведений.ПользователиТелеграмм.СоздатьМенеджерЗаписи();
	мз.idПользователя = id;
	мз.ЛицевойСчет = ЛицевойСчет;
	мз.КодЯзыка = КодЯзыка;
	мз.Период = ТекущаяДата();
	мз.Записать();

КонецПроцедуры

#Область ДействийПоОСМД 
Функция НайтиИскомыйЛС(ТекстЗапроса)
	
	НайденныйЛС = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛицевыеСчета.Ссылка,
	                |	ЛицевыеСчета.Наименование КАК Наименование
	                |ИЗ
	                |	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Наименование УБЫВ";
	ВЫБОРКА = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Найти(ТекстЗапроса,Выборка.Наименование) <> 0 тогда
			НайденныйЛС = Выборка.Ссылка;
		    Прервать;
		КонецЕсли;
		
	КонецЦикла;	

	Возврат НайденныйЛС;
		
КонецФункции

//Создал Петров
Функция КодЯзыкаПользователя(id) Экспорт
	
	КодЯзыка = "ru"; 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиТелеграмм.idПользователя,
		|	ПользователиТелеграмм.КодЯзыка
		|ИЗ
		|	РегистрСведений.ПользователиТелеграмм КАК ПользователиТелеграмм
		|ГДЕ
		|	ПользователиТелеграмм.idПользователя = &id";
	
	Запрос.УстановитьПараметр("id", id);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КодЯзыка = ВыборкаДетальныеЗаписи.КодЯзыка;
	КонецЦикла;
	
	Возврат КодЯзыка;	
	
КонецФункции

//Создал Петров
Функция КодЯзыкаПользователяПередРегистрацией(id) Экспорт
	
	КодЯзыка = "ru"; 
	language = "/uk_language";
	
	Запросuk = Новый Запрос;
	Запросuk.Текст = 
		"ВЫБРАТЬ
		|	update.update_id
		|ИЗ
		|	РегистрСведений.update КАК update
		|ГДЕ
		|	update.id = &id
		|	И update.text = &language";
	
	Запросuk.УстановитьПараметр("id", id);
	Запросuk.УстановитьПараметр("language", language);
	
	РезультатЗапросаuk = Запросuk.Выполнить();
	
	ВыборкаДетальныеЗаписиuk = РезультатЗапросаuk.Выбрать();
	Если ВыборкаДетальныеЗаписиuk.Количество() > 0 Тогда
	     КодЯзыка = "uk";
	КонецЕсли;
	
	language = "/ru_language";
	Запросru = Новый Запрос;
	Запросru.Текст = 
		"ВЫБРАТЬ
		|	update.update_id
		|ИЗ
		|	РегистрСведений.update КАК update
		|ГДЕ
		|	update.id = &id
		|	И update.text = &language";
	
	Запросru.УстановитьПараметр("id", id);
	Запросru.УстановитьПараметр("language", language);
	
	РезультатЗапросаru = Запросru.Выполнить();
	
	ВыборкаДетальныеЗаписиru = РезультатЗапросаru.Выбрать();
	Если ВыборкаДетальныеЗаписиru.Количество() > 0 Тогда
	     КодЯзыка = "ru";
	КонецЕсли;
	Возврат КодЯзыка;	
	
КонецФункции

Функция  ИзменитьЯзыкПользователю(id, ЯзыкПользователя)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиТелеграмм.idПользователя,
		|	ПользователиТелеграмм.КодЯзыка
		|ИЗ
		|	РегистрСведений.ПользователиТелеграмм КАК ПользователиТелеграмм
		|ГДЕ
		|	ПользователиТелеграмм.idПользователя = &id";
	
	Запрос.УстановитьПараметр("id", id); 
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписи = РегистрыСведений.ПользователиТелеграмм.СоздатьНаборЗаписей();
		НаборЗаписи.Отбор.idПользователя.Установить(ВыборкаДетальныеЗаписи.idПользователя);
		НаборЗаписи.Прочитать();
		Если НаборЗаписи.Количество() > 0 Тогда
			Для каждого ЗаписьНабора из НаборЗаписи Цикл
			    ЗаписьНабора.КодЯзыка = ЯзыкПользователя;
			КонецЦикла;
			НаборЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;

КонецФункции

Функция ДанныеПоЛицевомуСчету(ЛицевойСчет, КодЯзыка)
	
	Результат = НСтр("ru = 'Не вдалося отримати данні за особовим рахунком '; uk = 'Не вдалося отримати данні за особовим рахунком '", КодЯзыка);
	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетамОстатки.Организация,
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга,
	               |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(, ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.Организация,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга
	               |ИТОГИ
	               |	СУММА(СуммаОстаток)
	               |ПО
	               |	ЛицевойСчет";
	РезултатЗапроса = Запрос.Выполнить();
	
	Если РезултатЗапроса.Пустой() Тогда
		ТекстОтвета = НСтр("ru = 'Зареєстрованих боргів не знайдено '; uk = 'Зареєстрованих боргів не знайдено '", КодЯзыка);
		Возврат ТекстОтвета;
	КонецЕсли;	
	
	ВыборкаОбщийОстаток = РезултатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	
	Пока  ВыборкаОбщийОстаток.Следующий() Цикл
		
		ОбщаяЗадолженность = ВыборкаОбщийОстаток.СуммаОстаток;
		ТекстОтвета = НСтр("ru = 'Загальна заборгованість становить '; uk = 'Загальна заборгованість становить '", КодЯзыка);
		Результат = ТекстОтвета + ОбщаяЗадолженность +Символы.ПС+Символы.ПС;
	
	
		ВыборкаПоУслугам = ВыборкаОбщийОстаток.Выбрать();
		Пока ВыборкаПоУслугам.Следующий() Цикл
			Результат = Результат+ ВыборкаПоУслугам.Услуга.Наименование+"..."+ВыборкаПоУслугам.СуммаОстаток+"грн."+Символы.ПС;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


Функция ОпределитьПредприятие(Пользователь)
	М = РегистрыСведений.ПользователиТелеграмм.СоздатьНаборЗаписей();
	М.Отбор.idПользователя.Установить(Пользователь);
	М.Прочитать();
	ЛС = (М[0].ЛицевойСчет);
	Предприятие = СтрЗаменить(ЛС.Владелец.Организация.Наименование,"""", "*");
	Возврат Предприятие;
КонецФункции

Функция  ПолучитьПоследнееГолосование(Пользователь)
	Предприятие =  ОпределитьПредприятие(Пользователь);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГолосованиеРезультатыГолосования.Ссылка.Организация,
		|	ГолосованиеРезультатыГолосования.Ссылка.Здание,
		|	ГолосованиеРезультатыГолосования.Ссылка.ВопросГолосования,
		|	РезультатыГолосования.КоличествоЗа КАК За,
		|	РезультатыГолосования.КоличествоПротив КАК Против,
		|	РезультатыГолосования.КоличествоВоздержался КАК Воздержался,
		|	ГолосованиеРезультатыГолосования.Ссылка.Ссылка КАК Документ,
		|	ГолосованиеРезультатыГолосования.Ссылка.КоличествоУчасниковГолосованияПлан,
		|	ГолосованиеРезультатыГолосования.Ссылка.КоличествоУчасниковГолосованияФакт,
		|	ВЫБОР
		|		КОГДА РезультатыГолосования.КоличествоЗа > РезультатыГолосования.КоличествоПротив
		|			ТОГДА ВЫБОР
		|					КОГДА РезультатыГолосования.КоличествоЗа >= ГолосованиеРезультатыГолосования.Ссылка.НеобходимоГолосовЗА
		|						ТОГДА ""Принят""
		|					ИНАЧЕ ""Не принят""
		|				КОНЕЦ
		|		ИНАЧЕ ""Не принят""
		|	КОНЕЦ КАК ПринятНеПринят
		|ИЗ
		|	Документ.Голосование.РезультатыГолосования КАК ГолосованиеРезультатыГолосования
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ГолосованиеРезультатыГолосования.Ссылка КАК Ссылка,
		|			СУММА(ВЫБОР
		|					КОГДА ГолосованиеРезультатыГолосования.ВариантОтвета = ЗНАЧЕНИЕ(Перечисление.ВариантыОтветовНаВопросыГолосования.За)
		|						ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК КоличествоЗа,
		|			СУММА(ВЫБОР
		|					КОГДА ГолосованиеРезультатыГолосования.ВариантОтвета = ЗНАЧЕНИЕ(Перечисление.ВариантыОтветовНаВопросыГолосования.Против)
		|						ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК КоличествоПротив,
		|			СУММА(ВЫБОР
		|					КОГДА ГолосованиеРезультатыГолосования.ВариантОтвета = ЗНАЧЕНИЕ(Перечисление.ВариантыОтветовНаВопросыГолосования.Воздержался)
		|						ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК КоличествоВоздержался
		|		ИЗ
		|			Документ.Голосование.РезультатыГолосования КАК ГолосованиеРезультатыГолосования
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ГолосованиеРезультатыГолосования.Ссылка) КАК РезультатыГолосования
		|		ПО ГолосованиеРезультатыГолосования.Ссылка = РезультатыГолосования.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ГолосованиеРезультатыГолосования.Ссылка.Организация,
		|	ГолосованиеРезультатыГолосования.Ссылка.Здание,
		|	ГолосованиеРезультатыГолосования.Ссылка.ВопросГолосования,
		|	РезультатыГолосования.КоличествоЗа,
		|	РезультатыГолосования.КоличествоПротив,
		|	РезультатыГолосования.КоличествоВоздержался,
		|	ГолосованиеРезультатыГолосования.Ссылка.Ссылка,
		|	ГолосованиеРезультатыГолосования.Ссылка.КоличествоУчасниковГолосованияПлан,
		|	ГолосованиеРезультатыГолосования.Ссылка.КоличествоУчасниковГолосованияФакт,
		|	ВЫБОР
		|		КОГДА РезультатыГолосования.КоличествоЗа > РезультатыГолосования.КоличествоПротив
		|			ТОГДА ВЫБОР
		|					КОГДА РезультатыГолосования.КоличествоЗа >= ГолосованиеРезультатыГолосования.Ссылка.НеобходимоГолосовЗА
		|						ТОГДА ""Принят""
		|					ИНАЧЕ ""Не принят""
		|				КОНЕЦ
		|		ИНАЧЕ ""Не принят""
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГолосованиеРезультатыГолосования.Ссылка.Дата УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Структура = Новый Структура();
		Структура.Вставить("Итог", Выборка.ПринятНеПринят);
		Структура.Вставить("Вопрос", Выборка.ВопросГолосования);
		Структура.Вставить("Дата",Формат(Выборка.Документ.Дата, "ДЛФ=ДД"));
		Возврат Структура;
		Прервать;
	КонецЦикла;
	
КонецФункции

//Создал Петров В.А Возвращает текст с последними введенными показаниями из разных источников
Функция ПолучитьПоказанияСчетчиков(ЛС, КодЯзыка);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета
	|ПОМЕСТИТЬ ВТ_Счетчики
	|ИЗ
	|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(, ОбъектУстановки = &ЛС) КАК УстановленныеПриборыУчетаСрезПоследних
	|ГДЕ
	|	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Счетчики.ПриборУчета,
	|	МАКСИМУМ(ПоказанияПриборовУчетаИзТелеграммСрезПоследних.Период) КАК Период
	|ПОМЕСТИТЬ ВыборВсехПослПриборовИПериодов
	|ИЗ
	|	ВТ_Счетчики КАК ВТ_Счетчики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчетаИзТелеграмм.СрезПоследних КАК ПоказанияПриборовУчетаИзТелеграммСрезПоследних
	|		ПО ВТ_Счетчики.ПриборУчета = ПоказанияПриборовУчетаИзТелеграммСрезПоследних.ПриборУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Счетчики.ПриборУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Счетчики.ПриборУчета,
	|	ПоказанияПриборовУчетаССайтаСрезПоследних.Период
	|ИЗ
	|	ВТ_Счетчики КАК ВТ_Счетчики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчетаССайта.СрезПоследних КАК ПоказанияПриборовУчетаССайтаСрезПоследних
	|		ПО ВТ_Счетчики.ПриборУчета = ПоказанияПриборовУчетаССайтаСрезПоследних.ПриборУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Счетчики.ПриборУчета,
	|	ПоказанияПриборовУчетаСрезПоследних.Период
	|ИЗ
	|	ВТ_Счетчики КАК ВТ_Счетчики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних КАК ПоказанияПриборовУчетаСрезПоследних
	|		ПО ВТ_Счетчики.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Счетчики.ПриборУчета,
	|	ПоказанияПУИзВнешнихИсточниковСрезПоследних.Период
	|ИЗ
	|	ВТ_Счетчики КАК ВТ_Счетчики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПУИзВнешнихИсточников.СрезПоследних КАК ПоказанияПУИзВнешнихИсточниковСрезПоследних
	|		ПО ВТ_Счетчики.ПриборУчета = ПоказанияПУИзВнешнихИсточниковСрезПоследних.ПриборУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Счетчики.ПриборУчета,
	|	СнятыеПоказанияПриборовУчетаСрезПоследних.Период
	|ИЗ
	|	ВТ_Счетчики КАК ВТ_Счетчики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СнятыеПоказанияПриборовУчета.СрезПоследних КАК СнятыеПоказанияПриборовУчетаСрезПоследних
	|		ПО ВТ_Счетчики.ПриборУчета = СнятыеПоказанияПриборовУчетаСрезПоследних.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыборПослПрибораИПериода.ПриборУчета,
	|	МАКСИМУМ(ВыборПослПрибораИПериода.Период) КАК Период,
	|	ПоказанияПриборовУчетаСрезПоследних.Значение КАК ПоказанияВключённыеВРасчет
	|ПОМЕСТИТЬ отборСамогоПослПУиПерида
	|ИЗ
	|	ВыборВсехПослПриборовИПериодов КАК ВыборПослПрибораИПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних КАК ПоказанияПриборовУчетаСрезПоследних
	|		ПО ВыборПослПрибораИПериода.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыборПослПрибораИПериода.ПриборУчета,
	|	ПоказанияПриборовУчетаСрезПоследних.Значение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	отборСамогоПослПУиПерида.ПриборУчета,
	|	отборСамогоПослПУиПерида.Период,
	|	ВЫБОР
	|		КОГДА НЕ ПоказанияПриборовУчетаИзТелеграмм.Значение ЕСТЬ NULL
	|			ТОГДА ПоказанияПриборовУчетаИзТелеграмм.Значение
	|		КОГДА НЕ ПоказанияПриборовУчета.Значение ЕСТЬ NULL
	|			ТОГДА ПоказанияПриборовУчета.Значение
	|		КОГДА НЕ ПоказанияПриборовУчетаССайта.Значение ЕСТЬ NULL
	|			ТОГДА ПоказанияПриборовУчетаССайта.Значение
	|		КОГДА НЕ ПоказанияПУИзВнешнихИсточников.Значение ЕСТЬ NULL
	|			ТОГДА ПоказанияПУИзВнешнихИсточников.Значение
	|		КОГДА НЕ СнятыеПоказанияПриборовУчета.Значение ЕСТЬ NULL
	|			ТОГДА СнятыеПоказанияПриборовУчета.Значение
	|	КОНЕЦ КАК ЗначениеПослПоказаний,
	|	ВЫБОР
	|		КОГДА НЕ ПоказанияПриборовУчетаИзТелеграмм.ВидТарифа ЕСТЬ NULL
	|			ТОГДА ПоказанияПриборовУчетаИзТелеграмм.ВидТарифа
	|		КОГДА НЕ ПоказанияПриборовУчета.ВидТарифа ЕСТЬ NULL
	|			ТОГДА ПоказанияПриборовУчета.ВидТарифа
	|		КОГДА НЕ ПоказанияПриборовУчетаССайта.ВидТарифа ЕСТЬ NULL
	|			ТОГДА ПоказанияПриборовУчетаССайта.ВидТарифа
	|		КОГДА НЕ ПоказанияПУИзВнешнихИсточников.ВидТарифа ЕСТЬ NULL
	|			ТОГДА ПоказанияПУИзВнешнихИсточников.ВидТарифа
	|		КОГДА НЕ СнятыеПоказанияПриборовУчета.ПриборУчета ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(перечисление.ВидыТарифов.Общий)
	|	КОНЕЦ КАК ВидТарифаПослПоказаний,
	|	ВЫБОР
	|		КОГДА НЕ ПоказанияПриборовУчетаИзТелеграмм.Значение ЕСТЬ NULL
	|			ТОГДА ""Телеграмм""
	|		КОГДА НЕ ПоказанияПриборовУчета.Значение ЕСТЬ NULL
	|			ТОГДА ""Программа""
	|		КОГДА НЕ ПоказанияПриборовУчетаССайта.Значение ЕСТЬ NULL
	|			ТОГДА ""Сайт""
	|		КОГДА НЕ ПоказанияПУИзВнешнихИсточников.Значение ЕСТЬ NULL
	|			ТОГДА ""Программа""
	|		КОГДА НЕ СнятыеПоказанияПриборовУчета.Значение ЕСТЬ NULL
	|			ТОГДА ""Контролер""
	|	КОНЕЦ КАК ИсточникВводаПоказаний,
	|	отборСамогоПослПУиПерида.ПриборУчета.ЕдиницаИзмерения,
	|	отборСамогоПослПУиПерида.ПоказанияВключённыеВРасчет
	|ИЗ
	|	отборСамогоПослПУиПерида КАК отборСамогоПослПУиПерида
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчетаИзТелеграмм КАК ПоказанияПриборовУчетаИзТелеграмм
	|		ПО отборСамогоПослПУиПерида.ПриборУчета = ПоказанияПриборовУчетаИзТелеграмм.ПриборУчета
	|			И отборСамогоПослПУиПерида.Период = ПоказанияПриборовУчетаИзТелеграмм.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета КАК ПоказанияПриборовУчета
	|		ПО отборСамогоПослПУиПерида.ПриборУчета = ПоказанияПриборовУчета.ПриборУчета
	|			И отборСамогоПослПУиПерида.Период = ПоказанияПриборовУчета.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчетаССайта КАК ПоказанияПриборовУчетаССайта
	|		ПО отборСамогоПослПУиПерида.ПриборУчета = ПоказанияПриборовУчетаССайта.ПриборУчета
	|			И отборСамогоПослПУиПерида.Период = ПоказанияПриборовУчетаССайта.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПУИзВнешнихИсточников КАК ПоказанияПУИзВнешнихИсточников
	|		ПО отборСамогоПослПУиПерида.ПриборУчета = ПоказанияПУИзВнешнихИсточников.ПриборУчета
	|			И отборСамогоПослПУиПерида.Период = ПоказанияПУИзВнешнихИсточников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СнятыеПоказанияПриборовУчета КАК СнятыеПоказанияПриборовУчета
	|		ПО отборСамогоПослПУиПерида.ПриборУчета = СнятыеПоказанияПриборовУчета.ПриборУчета
	|			И отборСамогоПослПУиПерида.Период = СнятыеПоказанияПриборовУчета.Период";
	
	
		
	Запрос.УстановитьПараметр("ЛС", ЛС);
	
	РезультатЗапроса = Запрос.Выполнить();
	Показания = ""; 
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Разделитель = Символы.ПС + "______________________________";
	ТекстВнутриСообщения1 =   НСтр("ru = 'Показання '; uk = 'Показання '", КодЯзыка);
	ТекстВнутриСообщения2 =   НСтр("ru = 'Показання по яким вже було проведене нарахування '; uk = 'Показання по яким вже було проведене нарахування '", КодЯзыка);
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Показания = Показания + Разделитель;		
		Показания = Показания + Символы.ПС + "N" + Строка(ВыборкаДетальныеЗаписи.ПриборУчета) + "/" + Строка(ВыборкаДетальныеЗаписи.ВидТарифаПослПоказаний);
		//ПоказанияВключённыеВРасчет
		Если ВыборкаДетальныеЗаписи.ЗначениеПослПоказаний <> Null Тогда
			Показания = Показания + Символы.ПС + ТекстВнутриСообщения2 + Строка(ВыборкаДетальныеЗаписи.ПоказанияВключённыеВРасчет)+" "+ Строка(ВыборкаДетальныеЗаписи.ПриборУчетаЕдиницаИзмерения);
		Иначе
			Показания = Показания + Символы.ПС +ТекстВнутриСообщения2 + "0"+" "+ Строка(ВыборкаДетальныеЗаписи.ПриборУчетаЕдиницаИзмерения);
		КонецЕсли;
		//ПоказанияВведенные
		Если ВыборкаДетальныеЗаписи.ЗначениеПослПоказаний <> Null Тогда
			Показания = Показания + Символы.ПС + ТекстВнутриСообщения1 + Строка(ВыборкаДетальныеЗаписи.ЗначениеПослПоказаний)+" "+ Строка(ВыборкаДетальныеЗаписи.ПриборУчетаЕдиницаИзмерения);
			Показания = Показания + Символы.ПС + Строка(ВыборкаДетальныеЗаписи.ИсточникВводаПоказаний) + " "+ Строка(Формат(ВыборкаДетальныеЗаписи.Период,"ДЛФ=Д"));
		Иначе
			Показания = Показания + Символы.ПС +ТекстВнутриСообщения1 + "0"+" "+ Строка(ВыборкаДетальныеЗаписи.ПриборУчетаЕдиницаИзмерения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Показания;
КонецФункции	

//Создал Петров В.А  Возвращает Массив,  Каждый элемент массива - структура которая описивает будущую кнопку 
			//Прибор.ПриборНомер            , Строка(ВыборкаДетальныеЗаписи.ПриборУчета)
			//Прибор.Услуга                 , Строка(ВыборкаДетальныеЗаписи.ПриборУчета.Услуга)
			//Прибор.СсылкаНаПрибор"        , Строка(ВыборкаДетальныеЗаписи.ПриборУчета.УникальныйИдентификатор()));
			//Прибор.ВидТарифа              , Строка(Перечисления.ВидыТарифов.Индекс(ВыборкаДетальныеЗаписи.ВидТарифа)));
Функция ПолучитьКнопкиВводаСчетчиков(ЛС);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета
		|ПОМЕСТИТЬ ВТ_Счетчики
		|ИЗ
		|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(, ОбъектУстановки = &ЛС) КАК УстановленныеПриборыУчетаСрезПоследних
		|ГДЕ
		|	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Счетчики.ПриборУчета,
		|	МАКСИМУМ(ПоказанияПриборовУчетаИзТелеграммСрезПоследних.Период) КАК Период
		|ПОМЕСТИТЬ ВыборВсехПослПриборовИПериодов
		|ИЗ
		|	ВТ_Счетчики КАК ВТ_Счетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчетаИзТелеграмм.СрезПоследних КАК ПоказанияПриборовУчетаИзТелеграммСрезПоследних
		|		ПО ВТ_Счетчики.ПриборУчета = ПоказанияПриборовУчетаИзТелеграммСрезПоследних.ПриборУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Счетчики.ПриборУчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Счетчики.ПриборУчета,
		|	ПоказанияПриборовУчетаССайтаСрезПоследних.Период
		|ИЗ
		|	ВТ_Счетчики КАК ВТ_Счетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчетаССайта.СрезПоследних КАК ПоказанияПриборовУчетаССайтаСрезПоследних
		|		ПО ВТ_Счетчики.ПриборУчета = ПоказанияПриборовУчетаССайтаСрезПоследних.ПриборУчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Счетчики.ПриборУчета,
		|	ПоказанияПриборовУчетаСрезПоследних.Период
		|ИЗ
		|	ВТ_Счетчики КАК ВТ_Счетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних КАК ПоказанияПриборовУчетаСрезПоследних
		|		ПО ВТ_Счетчики.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Счетчики.ПриборУчета,
		|	ПоказанияПУИзВнешнихИсточниковСрезПоследних.Период
		|ИЗ
		|	ВТ_Счетчики КАК ВТ_Счетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПУИзВнешнихИсточников.СрезПоследних КАК ПоказанияПУИзВнешнихИсточниковСрезПоследних
		|		ПО ВТ_Счетчики.ПриборУчета = ПоказанияПУИзВнешнихИсточниковСрезПоследних.ПриборУчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Счетчики.ПриборУчета,
		|	СнятыеПоказанияПриборовУчетаСрезПоследних.Период
		|ИЗ
		|	ВТ_Счетчики КАК ВТ_Счетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СнятыеПоказанияПриборовУчета.СрезПоследних КАК СнятыеПоказанияПриборовУчетаСрезПоследних
		|		ПО ВТ_Счетчики.ПриборУчета = СнятыеПоказанияПриборовУчетаСрезПоследних.ПриборУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыборПослПрибораИПериода.ПриборУчета,
		|	МАКСИМУМ(ВыборПослПрибораИПериода.Период) КАК Период
		|ПОМЕСТИТЬ отборСамогоПослПУиПерида
		|ИЗ
		|	ВыборВсехПослПриборовИПериодов КАК ВыборПослПрибораИПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыборПослПрибораИПериода.ПриборУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	отборСамогоПослПУиПерида.ПриборУчета,
		|	отборСамогоПослПУиПерида.Период,
		|	ВЫБОР
		|		КОГДА НЕ ПоказанияПриборовУчетаИзТелеграмм.Значение ЕСТЬ NULL
		|			ТОГДА ПоказанияПриборовУчетаИзТелеграмм.Значение
		|		КОГДА НЕ ПоказанияПриборовУчета.Значение ЕСТЬ NULL
		|			ТОГДА ПоказанияПриборовУчета.Значение
		|		КОГДА НЕ ПоказанияПриборовУчетаССайта.Значение ЕСТЬ NULL
		|			ТОГДА ПоказанияПриборовУчетаССайта.Значение
		|		КОГДА НЕ ПоказанияПУИзВнешнихИсточников.Значение ЕСТЬ NULL
		|			ТОГДА ПоказанияПУИзВнешнихИсточников.Значение
		|		КОГДА НЕ СнятыеПоказанияПриборовУчета.Значение ЕСТЬ NULL
		|			ТОГДА СнятыеПоказанияПриборовУчета.Значение
		|	КОНЕЦ КАК ЗначениеПослПоказаний,
		|	ВЫБОР
		|		КОГДА НЕ ПоказанияПриборовУчетаИзТелеграмм.ВидТарифа ЕСТЬ NULL
		|			ТОГДА ПоказанияПриборовУчетаИзТелеграмм.ВидТарифа
		|		КОГДА НЕ ПоказанияПриборовУчета.ВидТарифа ЕСТЬ NULL
		|			ТОГДА ПоказанияПриборовУчета.ВидТарифа
		|		КОГДА НЕ ПоказанияПриборовУчетаССайта.ВидТарифа ЕСТЬ NULL
		|			ТОГДА ПоказанияПриборовУчетаССайта.ВидТарифа
		|		КОГДА НЕ ПоказанияПУИзВнешнихИсточников.ВидТарифа ЕСТЬ NULL
		|			ТОГДА ПоказанияПУИзВнешнихИсточников.ВидТарифа
		|		КОГДА НЕ СнятыеПоказанияПриборовУчета.ПриборУчета ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(перечисление.ВидыТарифов.Общий)
		|	КОНЕЦ КАК ВидТарифаПослПоказаний,
		|	ВЫБОР
		|		КОГДА НЕ ПоказанияПриборовУчетаИзТелеграмм.Значение ЕСТЬ NULL
		|			ТОГДА ""Телеграмм""
		|		КОГДА НЕ ПоказанияПриборовУчета.Значение ЕСТЬ NULL
		|			ТОГДА ""Программа""
		|		КОГДА НЕ ПоказанияПриборовУчетаССайта.Значение ЕСТЬ NULL
		|			ТОГДА ""Сайт""
		|		КОГДА НЕ ПоказанияПУИзВнешнихИсточников.Значение ЕСТЬ NULL
		|			ТОГДА ""Программа""
		|		КОГДА НЕ СнятыеПоказанияПриборовУчета.Значение ЕСТЬ NULL
		|			ТОГДА ""Контролер""
		|	КОНЕЦ КАК ИсточникВводаПоказаний,
		|	отборСамогоПослПУиПерида.ПриборУчета.ЕдиницаИзмерения
		|ИЗ
		|	отборСамогоПослПУиПерида КАК отборСамогоПослПУиПерида
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчетаИзТелеграмм КАК ПоказанияПриборовУчетаИзТелеграмм
		|		ПО отборСамогоПослПУиПерида.ПриборУчета = ПоказанияПриборовУчетаИзТелеграмм.ПриборУчета
		|			И отборСамогоПослПУиПерида.Период = ПоказанияПриборовУчетаИзТелеграмм.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета КАК ПоказанияПриборовУчета
		|		ПО отборСамогоПослПУиПерида.ПриборУчета = ПоказанияПриборовУчета.ПриборУчета
		|			И отборСамогоПослПУиПерида.Период = ПоказанияПриборовУчета.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчетаССайта КАК ПоказанияПриборовУчетаССайта
		|		ПО отборСамогоПослПУиПерида.ПриборУчета = ПоказанияПриборовУчетаССайта.ПриборУчета
		|			И отборСамогоПослПУиПерида.Период = ПоказанияПриборовУчетаССайта.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПУИзВнешнихИсточников КАК ПоказанияПУИзВнешнихИсточников
		|		ПО отборСамогоПослПУиПерида.ПриборУчета = ПоказанияПУИзВнешнихИсточников.ПриборУчета
		|			И отборСамогоПослПУиПерида.Период = ПоказанияПУИзВнешнихИсточников.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СнятыеПоказанияПриборовУчета КАК СнятыеПоказанияПриборовУчета
		|		ПО отборСамогоПослПУиПерида.ПриборУчета = СнятыеПоказанияПриборовУчета.ПриборУчета
		|			И отборСамогоПослПУиПерида.Период = СнятыеПоказанияПриборовУчета.Период";

	
	Запрос.УстановитьПараметр("ЛС", ЛС);
	
	РезультатЗапроса = Запрос.Выполнить();
	 
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивПоказанияСчетчиков = Новый Массив;
			
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Прибор = Новый Структура;
		Прибор.Вставить("ПриборНомер", Строка(ВыборкаДетальныеЗаписи.ПриборУчета));
		//Прибор.Вставить("Услуга", Строка(ВыборкаДетальныеЗаписи.ПриборУчета.Услуга));
		Прибор.Вставить("СсылкаНаПрибор", Строка(ВыборкаДетальныеЗаписи.ПриборУчета.УникальныйИдентификатор()));
		Прибор.Вставить("ВидТарифа", Строка(Перечисления.ВидыТарифов.Индекс(ВыборкаДетальныеЗаписи.ВидТарифаПослПоказаний)));
		Если ВыборкаДетальныеЗаписи.ЗначениеПослПоказаний <> Null Тогда
			Прибор.Вставить("ПоказанияПрибора", Строка(ВыборкаДетальныеЗаписи.ЗначениеПослПоказаний));
			Прибор.Вставить("ЕдиницаИзмерения", Строка(ВыборкаДетальныеЗаписи.ПриборУчетаЕдиницаИзмерения));
		Иначе
			Прибор.Вставить("ПоказанияПрибора", "0");
			Прибор.Вставить("ЕдиницаИзмерения", Строка(ВыборкаДетальныеЗаписи.ПриборУчетаЕдиницаИзмерения));
		КонецЕсли;
		МассивПоказанияСчетчиков.Добавить(Прибор); 
	КонецЦикла;
	
	Возврат МассивПоказанияСчетчиков;
КонецФункции	
	
//Создал Петров В.А Эта функция нужна для индикации что пользователь прислал данные Прибора учета
// определение идет по предидущему запросу  , необработаный запрос перед текущим
//и проверяется на наличие содержимого в команде "/virt_button"
// Возвращает строку в которой есть ссылка на прибор, и Вид тарифа
Функция ЭтоДанныеПоПриборуУчетаДляВнесения(id,ЗП_update_id)
	Результат = Неопределено;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	update.id,
		|	МАКСИМУМ(update.update_id) КАК update_id
		|ИЗ
		|	РегистрСведений.update КАК update
		|ГДЕ
		|	update.id = &Id
		|	И update.Обработан = ИСТИНА
		|	И update.update_id < &update_id
		|
		|СГРУППИРОВАТЬ ПО
		|	update.id";
		
	Запрос.УстановитьПараметр("Id", id);
	Запрос.УстановитьПараметр("update_id", ЗП_update_id);
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 update_id=ВыборкаДетальныеЗаписи.update_id;		 
	КонецЦикла;
		
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
	     "ВЫБРАТЬ
	     |	update.text
	     |ИЗ
	     |	РегистрСведений.update КАК update
	     |ГДЕ
	     |	update.update_id = &update_id
	     |	И update.id = &id
	     |	И update.Обработан = ИСТИНА";
	
	Запрос2.УстановитьПараметр("id", id);
	Запрос2.УстановитьПараметр("update_id", update_id);
	
	РезультатЗапроса2 = Запрос2.Выполнить();
	
	ВыборкаДетальныеЗаписи2 = РезультатЗапроса2.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи2.Следующий() Цикл
		text = ВыборкаДетальныеЗаписи2.text;
	КонецЦикла;
	
	Если  СтрЧислоВхождений(text, "/virt_button")  Тогда
		Результат = text; 
	КонецЕсли;	
	
	Возврат Результат;	
КонецФункции

Функция ИзменитьРегПользователиТелеграммПроходящиеРегистрацию(id, КодЯзыка = Неопределено, НомерТелефона = Неопределено)

	ПользовательПроходящийРегистрацию = РегистрыСведений.ПользователиТелеграммПроходящиеРегистрацию.СоздатьМенеджерЗаписи();
	ПользовательПроходящийРегистрацию.idПользователя = id;
	ПользовательПроходящийРегистрацию.Прочитать();
	
	ПользовательПроходящийРегистрацию.idПользователя = id;
	
	Call_backПользователь = Новый Структура;
	Call_backПользователь.Вставить("КодЯзыка",ПользовательПроходящийРегистрацию.КодЯзыка );
	Call_backПользователь.Вставить("НомерТелефона", ПользовательПроходящийРегистрацию.НомерТелефона);
						
	Если КодЯзыка <> Неопределено Тогда
		ПользовательПроходящийРегистрацию.КодЯзыка = КодЯзыка;
	Иначе
		ПользовательПроходящийРегистрацию.КодЯзыка = Call_backПользователь.КодЯзыка;
	КонецЕсли;
	
	Если НомерТелефона <> Неопределено Тогда
		ПользовательПроходящийРегистрацию.НомерТелефона = НомерТелефона;
	Иначе
		ПользовательПроходящийРегистрацию.НомерТелефона = Call_backПользователь.НомерТелефона;
	КонецЕсли;
	
	ПользовательПроходящийРегистрацию.Записать(Истина);	
КонецФункции

Функция ПользователяЕщёНетВЗарегестрированных(idПользователя)
	ПризнакПользователяЕщёНетВЗарегестрированных = Истина;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиТелеграмм.idПользователя
		|ИЗ
		|	РегистрСведений.ПользователиТелеграмм КАК ПользователиТелеграмм
		|ГДЕ
		|	ПользователиТелеграмм.idПользователя = &idПользователя";
	
	Запрос.УстановитьПараметр("idПользователя", idПользователя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПризнакПользователяЕщёНетВЗарегестрированных = Ложь;
		Прервать;
	КонецЦикла;

	Возврат ПризнакПользователяЕщёНетВЗарегестрированных;
	
КонецФункции

Функция ОставитьТолькоЦифрыВСтроке(РазбираемаяСтрока) 

	Цифры = "1234567890";
	ЦифроваяЧасть = "";
	Для НомерСимвола = 1 По СтрДлина(РазбираемаяСтрока) Цикл
		ТекущийСимвол = Сред(РазбираемаяСтрока, НомерСимвола, 1);
		Если Найти(Цифры, ТекущийСимвол) Тогда
			ЦифроваяЧасть = ЦифроваяЧасть + ТекущийСимвол;
		КонецЕсли;
	КонецЦикла;
	Возврат ЦифроваяЧасть;
	
КонецФункции

Функция Найти1ЛСПоНомеруТелефона(ЗначениеПоиска) Экспорт
	
	ЛицевойСчет = Справочники.ЛицевыеСчета.ПустаяСсылка();
	НомерТелефона = СтрЗаменить(ЗначениеПоиска," ","");
	НомерТелефона = СтрЗаменить(НомерТелефона,"+","");
	НомерТелефона = Прав(НомерТелефона,7);		
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛицевыеСчета.Ссылка
	|ИЗ
	|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|ГДЕ
	|	ЛицевыеСчета.Телефон ПОДОБНО ""%"" + &НомерТелефона + ""%""";
		
	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
		
	ВыборкаЛС = Запрос.Выполнить().Выбрать();
		                                       
	Если ВыборкаЛС.Следующий() Тогда
		ЛицевойСчет = ВыборкаЛС.Ссылка;
	КонецЕсли;		
	
	Возврат ЛицевойСчет;
		
КонецФункции

#КонецОбласти

#КонецОбласти



Процедура ЗаполнитьСпособВЗ() Экспорт
	
	СпособВЗ = Константы.СпособВыполненияЗаданий.Получить();
	Если СпособВЗ.Пустая() Тогда
		СпособВЗ = Перечисления.СпособыВыполненияЗаданий.ФормаОбработки;
		Константы.СпособВыполненияЗаданий.Установить(СпособВЗ);		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗапускатьКлиент() Экспорт 
	
	
	Возврат Константы.СпособВыполненияЗаданий.Получить() = Перечисления.СпособыВыполненияЗаданий.ФормаОбработки 
		        И ЗначениеЗаполнено(Константы.КлючAPI.Получить()) 
	
	
КонецФункции

Функция ЗапускОбработкиЗапросов() Экспорт
	
	БазаФайловая = ОбщегоНазначения.ИнформационнаяБазаФайловая("");
	
	Если НЕ БазаФайловая  Тогда
		Возврат Ложь;
	КонецЕсли;  	
	
	АвторизированоПользователей = 0;
	
	МассивСеансов = ПолучитьСеансыИнформационнойБазы();
	Для Инд = 0 По МассивСеансов.ВГраница() Цикл
		Если МассивСеансов[Инд].ИмяПриложения = "1CV8C" Тогда
			АвторизированоПользователей  = АвторизированоПользователей + 1;
		КонецЕсли;
		Инд = Инд+1;
	КонецЦикла;	
	   
	
	Если АвторизированоПользователей <=1 и ЗапускатьКлиент() Тогда
		Возврат Истина;                                                               
	ИНаче
		Возврат Ложь;
	КонецЕсли;	
	                       
КонецФункции








