
//Проверяем, чтобы введенное число было не больше 100 
&НаКлиенте
Процедура ПроцентПрисутствующихДляПравомочностиГолосованияПриИзменении(Элемент)
	Если Запись.ПроцентПрисутствующихДляПравомочностиГолосования > 100 Тогда
	
		Предупреждение("Значение не может быть больше 100",10,"Введите новое значение!");
		Запись.ПроцентПрисутствующихДляПравомочностиГолосования = 0;
		
	КонецЕсли; 
КонецПроцедуры

//Проверяем, чтобы введенное число было не больше 100 
&НаКлиенте
Процедура ПроцентПроголосовавшихЗаПриИзменении(Элемент)
	Если Запись.ПроцентПроголосовавшихЗа > 100 Тогда
	
		Предупреждение("Значение не может быть больше 100",10,"Введите новое значение!");
		Запись.ПроцентПроголосовавшихЗа = 0;
	
	КонецЕсли; 
КонецПроцедуры
