////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаКлиенте
// Функция получает имя страницы для раздела учета документа.
//
// Параметры:
//	РазделУчета - ПеречислениеСсылка.РазделыУчета - Раздел учета
//
// Возвращаемое значение:
//	Строка - Имя страницы, соответствующая разделй учета
//
Функция ПолучитьИмяСтраницы(РазделУчета)

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Лицевые счета", "ГруппаЛицевыеСчета");
	Соответствие.Вставить("Запасы", "ГруппаЗапасы");
	Соответствие.Вставить("Взаиморасчеты с контрагентами", "ГруппаВзаиморасчетыСКонтрагентами");
	Соответствие.Вставить("Взаиморасчеты по субсидиям", "ГруппаВзаиморасчетыПоСубсидиям");
	Соответствие.Вставить("Взаиморасчеты по льготам", "ГруппаВзаиморасчетыПоЛьготам");
	Соответствие.Вставить("Денежные средства", "ГруппаДенежныеСредства");
	
	ИмяСтраницы = Соответствие.Получить(РазделУчета);
	
	Возврат ИмяСтраницы;

КонецФункции // ПолучитьИмяСтраницы()

&НаКлиенте
// Процедура устанавливает текущую страницу в зависимости от раздела учета.
//
Процедура УставитьТекущуюСтраницу()
	
	Элемент = Элементы.Найти(ПолучитьИмяСтраницы(Объект.РазделУчета));
	
	Если Элемент <> Неопределено Тогда
		ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = Элемент;
	КонецЕсли;
	
КонецПроцедуры // УставитьТекущуюСтраницу()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриОткрытии.
//
Процедура ПриОткрытии(Отказ)

	УставитьТекущуюСтраницу();
	
КонецПроцедуры // ПриОткрытии()


// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура - обработчик события ПриИзменении поля ввода РазделУчета.
//
&НаКлиенте
Процедура РазделУчетаПриИзменении(Элемент)
	
	// Установка текущей страницы формы.
	УставитьТекущуюСтраницу();
	
	Объект.ЛицевыеСчета.Очистить();
	Объект.Запасы.Очистить();
	Объект.ВзаиморасчетыСКонтрагентами.Очистить();
	Объект.ВзаиморасчетыПоЛьготам.Очистить();
	Объект.ВзаиморасчетыПоСубсидиям.Очистить();
	
КонецПроцедуры

// Процедура - обработчик команды Подбор.
//
&НаКлиенте
Процедура Подбор(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = НСтр("ru='Не заполнены реквизиты Организация.';uk='Не заповнені реквізити Організація.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
		
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ДатаНачала",	Объект.Дата);
	ПараметрыЗаполнения.Вставить("ДатаОкончания",	Объект.Дата);
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище);
	КонецЕсли;
	
	
КонецПроцедуры

// Функция получает список лицевых счетов из временного хранилища
//
&НаСервере
Процедура ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище)
	
	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НазначенныеУслугиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	НазначенныеУслугиСрезПоследних.Услуга,
	|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.Владелец КАК Здание,
	|	НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) КАК МесяцНачисления
	|ИЗ
	|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	|			,
	|			Действует
	|				И ЛицевойСчет В (&СписокЛицевыхСчетов)) КАК НазначенныеУслугиСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Здание,
	|	ЛицевойСчет,
	|	НазначенныеУслугиСрезПоследних.Услуга.Код";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("СписокЛицевыхСчетов", ТаблицаДляЗагрузки.ВыгрузитьКолонку("ЛицевойСчет"));
	
	ТаблицаУслугЛичевыхСчетов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицаУслугЛичевыхСчетов Из ТаблицаУслугЛичевыхСчетов Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ЛицевойСчет",	СтрокаТаблицаУслугЛичевыхСчетов.ЛицевойСчет);
		СтруктураОтбора.Вставить("Услуга",	СтрокаТаблицаУслугЛичевыхСчетов.Услуга);
		СтруктураОтбора.Вставить("МесяцНачисления",	СтрокаТаблицаУслугЛичевыхСчетов.МесяцНачисления);
		
		Строки = Объект.ЛицевыеСчета.НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(Строки[0], СтрокаТаблицаУслугЛичевыхСчетов);
		Иначе
			НоваяСтрока = Объект.ЛицевыеСчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицаУслугЛичевыхСчетов);
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЛицевыеСчетаИзХранилища()



