////////////////////////////////////////////////////////////////////////////////
// Подсистема "Базовая функциональность".
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает список имен объектов метаданных, данные которых могут содержать ссылки на различные объекты метаданных,
// но при этом эти ссылки не должны учитываться в бизнес-логике приложения.
//
// Пример:
// Для документ "Реализация товаров и услуг" настроена подсистема версионирования объектов,
// и подсистема свойств. При этом на экземпляр документа может быть множество ссылок 
// в информационной базе (из других документов, регистров). Часть ссылок имеют значение для бизнес-логики
// (например движения по регистрам). Другая часть ссылок - "техногенные" ссылки на объект из объектов ИБ,
// которые относятся к подсистеме версионирования объектов и подсистеме свойств. Такие "техногенные"
// ссылки должны быть отфильтрованы, например, в обработке удаления помеченных и при поиске ссылок на объект
// в подсистеме запрета редактирования ключевых реквизитов.
// Список таких "техногенных" объектов нужно перечислить в этой функции.
//
// Возвращаемое значение:
//  Массив       - массив строк, например, "РегистрСведений.ВерсииОбъектов".
//
Функция ПолучитьИсключенияПоискаСсылок() Экспорт
	
	Массив = Новый Массив;
	
	Возврат Массив;
	
КонецФункции 

// Обработчик события, возникающего при обновлении
// данных справочника ИдентификаторыОбъектовМетаданных
//
// Параметры:
//  ВидСобытия   - Строка - "Добавление", "Изменение", "Удаление"
//  Свойства     - Структура:
//                   Старые     - Структура - основные поля и значения старого элемента справочника
//                   Новые      - Структура - основные поля и значения нового  элемента справочника
//                   СтандартнаяЗаменаСсылок
//                              - Булево - если свойство задано Истина,
//                                тогда  в информационной базе будет произведена замена
//                                "Свойства.Старые.Ссылка" на "Свойства.Новые.Ссылка". Можно
//                                установить значение Ложь, тогда замена произведена не будет.
//                                 Замена происходит, когда вместо обычного элемента был
//                                добавлен предопределенный элемент или при замене одного
//                                объекта метаданных на другой для безошибочной реструктуризации.
//
Процедура ПриИзмененииИдентификатораОбъектаМетаданных(ВидСобытия, Свойства) Экспорт
	
	
	
КонецПроцедуры

// Возвращает соответствие имен параметров сеанса и обработчиков для их инициализации.
//
Функция ОбработчикиИнициализацииПараметровСеанса() Экспорт
	
	// Для задания обработчиков параметров сеанса следует использовать шаблон:
	// Обработчики.Вставить("<ИмяПараметраСеанса>|<НачалоИмениПараметраСеанса*>", "Обработчик");
	//
	// Примечание. Символ '*'используется в конце имени параметра сеанса и обозначает,
	//             что один обработчик будет вызван для инициализации всех параметров сеанса
	//             с именем, начинающимся на слово НачалоИмениПараметраСеанса
	//
	
	Обработчики = Новый Соответствие;
	
	//ПодключаемоеОборудование
	Обработчики.Вставить("РабочееМестоКлиента", "МенеджерОборудованияСервер.УстановитьПараметрыСеансаПодключаемогоОборудования");
	//Конец ПодключаемоеОборудование
	
	Возврат Обработчики;
	
КонецФункции

// Устанавливает текстовое описание предмета
//
// Параметры
//  СсылкаНаПредмет  – ЛюбаяСсылка – объект ссылочного типа.
//  Представление	 - Строка - сюда необходимо поместить текстовое описание.
Процедура УстановитьПредставлениеПредмета(СсылкаНаПредмет, Представление) Экспорт
	
КонецПроцедуры

// Заполняет идентификакторы тех объектов метаданных, которые невозможно
// автоматически найти по типу, но которые требуется сохранять в базе данных (например, подсистемы).
//
// Подробнее: см. ОбщегоНазначения.ДобавитьИдентификатор
// 
Процедура ЗаполнитьПредустановленныеИдентификаторыОбъектовМетаданных(Идентификаторы) Экспорт
	
	// Аварийно диспечерская служба
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "8e301ff7-13a0-4071-92b3-1f9efd04d815", Метаданные.Подсистемы.АварийноДиспечерскаяСлужба);
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "528c35ee-1714-4914-8478-ee787f3c78a1", Метаданные.Подсистемы.АварийноДиспечерскаяСлужба.Подсистемы.Ремонт);
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "13e3adb8-c6d1-40d6-9adf-38922b989a5e", Метаданные.Подсистемы.АварийноДиспечерскаяСлужба.Подсистемы.Справочники);
	
	// Голосования потребителей услуг
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "8aecc01a-4c60-4679-8715-f1f77234f6ca", Метаданные.Подсистемы.Голосование);
	
	// Запасы
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "a690919d-a224-40cd-87c9-438e6139b7d3", Метаданные.Подсистемы.Запасы);
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "29a48746-b961-4cbb-8c7b-cd0fe09f122e", Метаданные.Подсистемы.Запасы.Подсистемы.Закупки);
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "836afa1f-3ee0-48f4-8cf0-de396a994f45", Метаданные.Подсистемы.Запасы.Подсистемы.ЗапасыИСклад);
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "6e1f7c5d-83d0-4ebf-b15e-f25bb9b6a11e", Метаданные.Подсистемы.Запасы.Подсистемы.Справочники);
	
	// Лицевые счета
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "35c8fc2e-99a0-465d-b825-577814ba20bf", Метаданные.Подсистемы.ЛицевыеСчета);
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "4f81c247-b233-42a3-b04a-745f36e514a1", Метаданные.Подсистемы.ЛицевыеСчета.Подсистемы.ЛьготыИСубсидии);
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "59fe0dac-60b8-42bf-859c-c4df733e43e1", Метаданные.Подсистемы.ЛицевыеСчета.Подсистемы.Услуги);
	
	// Настройка и администрирование
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "b868cee1-7e3f-4a77-b8a3-46931864140b", Метаданные.Подсистемы.НастройкаИАдминистрирование);
	
	// Начисления и взаиморасчеты
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "1ba2c835-6a6b-46b0-bf7e-bdd81b48043a", Метаданные.Подсистемы.Начисления);
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "45a678bc-5dfc-40da-bdbe-f5e843d204dd", Метаданные.Подсистемы.Начисления.Подсистемы.Банк);
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "2bd6b282-c618-4081-8be6-365e012450dc", Метаданные.Подсистемы.Начисления.Подсистемы.Касса);
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "e2657da0-a874-472f-84fa-7d3f225d334d", Метаданные.Подсистемы.Начисления.Подсистемы.ЮридическийОтдел);
	
	// Паспортный стол
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "78b01025-6914-4f5b-81a8-f86585de9a1d", Метаданные.Подсистемы.ПаспортныйСтол);
	
	// Приборы учета
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "00ed90c3-23b8-4a39-ae5f-57d4eb2adea7", Метаданные.Подсистемы.ПриборыУчета);
	ОбщегоНазначения.ДобавитьИдентификатор(Идентификаторы, "dfac36be-3fad-459e-b0de-cddf456266d6", Метаданные.Подсистемы.ПриборыУчета.Подсистемы.Справочники);
	
КонецПроцедуры
