
// Процедура создает элемент справочника Валюты.
//
// Параметры:
//  Код - Число - Код валюты
//  ПараметрыПрописиНаРусском - строка - параметры прописи
//	КлассификаторТаблица - Классификатор валют
//
Процедура СоздатьВалюту(Код, ПараметрыПрописиНаРусском, ПараметрыПрописиНаУкраинском, КлассификаторТаблица)

	СтрокаТаблицы = КлассификаторТаблица.Найти(Код, "Code");
	Если СтрокаТаблицы <> Неопределено Тогда
		
		СправочникСсылка = Справочники.Валюты.НайтиПоКоду(Код);
		Если ЗначениеЗаполнено(СправочникСсылка) Тогда
			СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		Иначе
			СправочникОбъект = Справочники.Валюты.СоздатьЭлемент();
		КонецЕсли;
		
		СправочникОбъект.Код = Код;
		СправочникОбъект.Наименование = СтрокаТаблицы.CodeSymbol;
		СправочникОбъект.НаименованиеПолное = СтрокаТаблицы.Name;
		СправочникОбъект.ЗагружаетсяИзИнтернета = СтрокаТаблицы.RBCLoading;
		СправочникОбъект.ПараметрыПрописиНаРусском = ПараметрыПрописиНаРусском;
		СправочникОбъект.ПараметрыПрописиНаУкраинском = ПараметрыПрописиНаУкраинском;

		Попытка
			СправочникОбъект.Записать();
		Исключение
		КонецПопытки;

	КонецЕсли;

КонецПроцедуры // СоздатьВалюту()

// Процедура заполняет справочник валюты значениями по умолчанию.
//
Процедура ЗаполнитьВалютыПоУмолчанию() Экспорт
	
	КлассификаторXML = Справочники.Валюты.ПолучитьМакет("КлассификаторВалют").ПолучитьТекст();
	
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	СоздатьВалюту("980", "гривня, гривни, гривень, ж, копейка, копейки, копеек, ж, 2", "гривня, гривні, гривень, ж, копійка, копійки, копійок, ж, 2", КлассификаторТаблица);
	
КонецПроцедуры // ЗаполнитьВалютыПоУмолчанию()

