////////////////////////////////////////////////////////////////////////////////
// Обработчики событий объекта

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗагружаетсяИзИнтернета И ЗначениеЗаполнено(ОсновнаяВалюта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Зависимая валюта не может быть загружена с сайта РБК';uk='Залежна валюта не може бути завантажена із сайту РБК'"));
		Отказ = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОсновнаяВалюта.ОсновнаяВалюта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Основная валюта не может быть зависимой.';uk='Основна валюта не може бути залежної.'"),,,,Отказ);
	КонецЕсли;
	
	Если РаботаСКурсамиВалют.ПолучитьСписокЗависимыхВалют(Ссылка).Количество() > 0 
	   И ЗначениеЗаполнено(ОсновнаяВалюта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Валюта не может быть подчиненной, так как она является основной для других валют.';uk='Валюта не може бути підлеглої, тому що вона є основною для інших валют.'"),,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСКурсамиВалют.ПроверитьКорректностьКурсаНа01_01_1980(Ссылка);
	
	Если ЗначениеЗаполнено(ОсновнаяВалюта) Тогда
		РаботаСКурсамиВалют.ЗаписатьСведенияДляПодчиненногоРегистра(ОсновнаяВалюта, Ссылка);
	КонецЕсли;
	
КонецПроцедуры
