
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВариантКоттеджныйПоселок") Тогда
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = НСтр("ru='Улицы';uk='Вулиці'");
		
		Элементы.КоличествоЭтажей.Видимость = Ложь;
		
		Элементы.Наименование.Заголовок = НСтр("ru='Улица';uk='Вулиця'");
		Элементы.Владелец.Заголовок = НСтр("ru='Коттеджный поселок';uk='Котеджне селище'");
		Элементы.НомерПервойКвартиры.Заголовок = НСтр("ru='№ первого коттеджа';uk='№ першого котеджу'");
		Элементы.НомерПоследнейКвартиры.Заголовок = НСтр("ru='№ последнего коттеджа';uk='№ останнього котеджу'");
		
		Элементы.Наименование.Подсказка = НСтр("ru='Улица';uk='Вулиця'");
		Элементы.Владелец.Подсказка = НСтр("ru='Коттеджный поселок';uk='Котеджне селище'");
		Элементы.НомерПервойКвартиры.Подсказка = НСтр("ru='№ первого коттеджа';uk='№ першого котеджу'");
		Элементы.НомерПоследнейКвартиры.Подсказка = НСтр("ru='№ последнего коттеджа';uk='№ останнього котеджу'");
		
	ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьВариантГород") Тогда
		
		Если Параметры.Отбор.Свойство("Владелец") Тогда	
			Если Параметры.Отбор.Владелец.ТипСооружения = Перечисления.ТипыСооружений.ГруппаЗданий Тогда	
				ЭтаФорма.АвтоЗаголовок = Ложь;
				ЭтаФорма.Заголовок = НСтр("ru='Улицы';uk='Вулиці'");
				
				Элементы.КоличествоЭтажей.Видимость = Ложь;
				
				Элементы.Наименование.Заголовок = НСтр("ru='Улица';uk='Вулиця'");
				Элементы.Владелец.Заголовок = НСтр("ru='Группа зданий (поселок)';uk='Група будівель (селище)'");
				Элементы.НомерПервойКвартиры.Заголовок = НСтр("ru='№ первого коттеджа';uk='№ першого котеджу'");
				Элементы.НомерПоследнейКвартиры.Заголовок = НСтр("ru='№ последнего коттеджа';uk='№ останнього котеджу'");
				
				Элементы.Наименование.Подсказка = НСтр("ru='Улица';uk='Вулиця'");
				Элементы.Владелец.Подсказка = НСтр("ru='Группа зданий (поселок)';uk='Група будівель (селище)'");
				Элементы.НомерПервойКвартиры.Подсказка = НСтр("ru='№ первого коттеджа';uk='№ першого котеджу'");
				Элементы.НомерПоследнейКвартиры.Подсказка = НСтр("ru='№ последнего коттеджа';uk='№ останнього котеджу'");
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
