
&НаСервере
Процедура СформироватьОтчетНаСервере()
	Условие = "";
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(Отчет.ЛицевойСчет) Тогда
		Условие = "ЛицевойСчет = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", Отчет.ЛицевойСчет);
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.Здание) Тогда
		Условие = Условие + " И ЛицевойСчет.Владелец = &Здание";
		Запрос.УстановитьПараметр("Здание", Отчет.Здание);
	КонецЕсли;
	Если Отчет.ЧасныйСектор = Истина Тогда
		Условие = Условие + " И ЛицевойСчет.Владелец.ЧастныйСектор = ИСТИНА И ЛицевойСчет.Владелец.МногоКвартирный = ЛОЖЬ";
	Иначе
		Условие = Условие + " И ЛицевойСчет.Владелец.ЧастныйСектор = ЛОЖЬ И ЛицевойСчет.Владелец.МногоКвартирный = ИСТИНА";
	КонецЕсли;
	
	
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗЛИЧНЫЕ
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
	    |	НазначенныеУслугиСрезПоследних.ЛицевойСчет.Владелец,
	    |	НазначенныеУслугиСрезПоследних.Услуга
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(&НаДату, " + Условие + ") КАК НазначенныеУслугиСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Отчет.НаДату);
    Результат = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры
