  
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ДЛЯ СОЗДАНИЯ ОТБОРОВ

// Процедура создает отбор по организации.
//
&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Организация", Организация, ЗначениеЗаполнено(Организация));
	
КонецПроцедуры

// Процедура создает отбор по складу.
//
&НаКлиенте
Процедура ОтборСкладПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Склад", Склад, ЗначениеЗаполнено(Склад));
	
КонецПроцедуры

// Процедура создает отбор по контрагенту.
//
&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Контрагент", Контрагент, ЗначениеЗаполнено(Контрагент));
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы
// 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Строка Из Метаданные.ЖурналыДокументов.ДокументыПоЗапасам.РегистрируемыеДокументы Цикл
		Элементы.ТипДокумента.СписокВыбора.Добавить(Строка.Синоним, Строка.Синоним);
		ТипыДокументов.Добавить(Строка.Синоним, Строка.Имя);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита ТипДокумента.
// 
Процедура ТипДокументаПриИзменении(Элемент)
	
	ВыбранныйТипДокумента = ТипыДокументов.НайтиПоЗначению(ТипДокументаПредставление);
	Если ВыбранныйТипДокумента = Неопределено Тогда
		ТипДокумента = "";
	Иначе
		ТипДокумента = ВыбранныйТипДокумента.Представление;
	КонецЕсли;
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Тип", ?(ЗначениеЗаполнено(ТипДокумента), Тип("ДокументСсылка." + ТипДокумента), Неопределено), ЗначениеЗаполнено(ТипДокумента));
	
КонецПроцедуры


&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если ЗначениеЗаполнено(ТипДокумента) Тогда
		
		Отказ = Истина;
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("Контрагент", Контрагент);
		СтруктураПараметров.Вставить("Организация", Организация);
		СтруктураПараметров.Вставить("Склад", Склад);
		СтруктураПараметров.Вставить("ДоговорКонтрагента", ПолучитьОсновнойДоговор());
		
		ОткрытьФорму("Документ." + ТипДокумента + ".ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураПараметров));
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события формы "ПриЗагрузкеДанныхИзНастроекНаСервере".
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Организация					= Настройки.Получить("Организация");
	ТипДокументаПредставление 	= Настройки.Получить("ТипДокументаПредставление");
	Контрагент				 	= Настройки.Получить("Контрагент");
	Склад			 			= Настройки.Получить("Склад");
	
	ВыбранныйТипДокумента = ТипыДокументов.НайтиПоЗначению(ТипДокументаПредставление);
	Если ВыбранныйТипДокумента = Неопределено Тогда
		ТипДокумента = "";
	Иначе
		ТипДокумента = ВыбранныйТипДокумента.Представление;
	КонецЕсли;
	
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", Организация, ЗначениеЗаполнено(Организация));
    ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Тип", ?(ЗначениеЗаполнено(ТипДокумента), Тип("ДокументСсылка." + ТипДокумента), Неопределено), ЗначениеЗаполнено(ТипДокумента));
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", Контрагент, ЗначениеЗаполнено(Контрагент));
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Склад", Склад, ЗначениеЗаполнено(Склад));

КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаСервере
Функция ПолучитьОсновнойДоговор()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.ДоговорПоУмолчанию КАК Договор
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Контрагент);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Договор;
	КонецЦикла;
	
КонецФункции


