&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БольшеНеПоказывать = Ложь;
	
	ТекстНапоминания = 
	НСтр("ru='Сейчас Вам будет предложено выбрать файл для того, чтобы поместить его в информационную базу и закончить редактирование."
"Найдите нужный файл в том каталоге, который Вы указывали ранее при начале редактирования.';uk='Зараз Вам буде запропоновано вибрати файл для того, щоб помістити його в інформаційну базу й закінчити редагування. Знайдіть потрібний файл у тому каталозі, який Ви вказували раніше при початку редагування.'");
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(БольшеНеПоказывать);
КонецПроцедуры
