
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Картинка1 = БиблиотекаКартинок.НачальныйРабочийСтол;
	Картинка2 = БиблиотекаКартинок.РабочийСтолРассчетчика;
	Картинка3 = БиблиотекаКартинок.СтарыйСтол;
	Картинка4 = БиблиотекаКартинок.СтолДиспетчера;
	Картинка5 = БиблиотекаКартинок.УправлениеВзаимодействиями;
	Картинка6 = БиблиотекаКартинок.РСПаспортиста;
	Картинка7 = БиблиотекаКартинок.СтолСправок;
КонецПроцедуры

&НаСервере
 Процедура УстановитьрабочийСтолСервер(ТипСтола)
	 УстановитьПривилегированныйРежим(Истина);

	 Если ТипСтола = "НачальныйРабочийСтол" Тогда
		 ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.НачальныйРабочийСтол;
	 ИначеЕсли  ТипСтола = "ГоризонтальныйРабочийСтол" Тогда
		 ВидРабочегоСтола  = Перечисления.ВидыРабочихСтолов.ГоризонтальныйРабочийСтол;
	 ИначеЕсли ТипСтола =  "СтараяНачальнаяФорма" Тогда 
		 ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.СтараяНачальнаяФорма;
	 ИначеЕсли ТипСтола =  "РабочийСтолДиспетчера" Тогда
		 ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.РабочийСтолДиспетчера;
	 ИначеЕсли ТипСтола =  "УправлениеВзаимодействиями" Тогда
		 ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.УправлениеВзаимодействиями;
	 ИначеЕсли ТипСтола =  "СтолПаспортиста" Тогда
		 ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.РабочийСтлоПаспортиста;
	 ИначеЕсли ТипСтола = "СтолСправок" Тогда
		 ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.СтолСправок;
	 КонецЕсли;
	 		 
 	 РС_СменитьСтол.СменитьСтол(ВидРабочегоСтола);
     УстановитьПривилегированныйРежим(Ложь);

 КонецПроцедуры // УстановитьрабочийСтолСервер(ТипСтола)()

//Обработчики команд
&НаКлиенте
Процедура УстановитьНачальныйРабочийСтол(Команда)
	
	УстановитьрабочийСтолСервер("НачальныйРабочийСтол");
	ОСМДКлиент.ПолучитьПараметрыФункциональныхОпций();
	Форма = ЭтаФорма;
	Форма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРабочийСтолРасчетчика(Команда)
	УстановитьрабочийСтолСервер("ГоризонтальныйРабочийСтол");
	ОСМДКлиент.ПолучитьПараметрыФункциональныхОпций();
	Форма = ЭтаФорма;
	Форма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтарыйРабочийСтол(Команда)
	УстановитьрабочийСтолСервер("СтараяНачальнаяФорма");
	ОСМДКлиент.ПолучитьПараметрыФункциональныхОпций();
	Форма = ЭтаФорма;
	Форма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРабочийСтолДиспетчера(Команда)
	УстановитьрабочийСтолСервер("РабочийСтолДиспетчера");
	ОСМДКлиент.ПолучитьПараметрыФункциональныхОпций();
	Форма = ЭтаФорма;
	Форма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьУправлениеВзаимодействиями(Команда)
	
	УстановитьрабочийСтолСервер("УправлениеВзаимодействиями");
	ОСМДКлиент.ПолучитьПараметрыФункциональныхОпций();
	Форма = ЭтаФорма;
	Форма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтолСправок(Команда)
	УстановитьрабочийСтолСервер("СтолСправок");
	ОСМДКлиент.ПолучитьПараметрыФункциональныхОпций();
	Форма = ЭтаФорма;
	Форма.Закрыть();
КонецПроцедуры

&НаКлиенте
 Процедура УстановитьРабочийСтолПаспортиста(Команда)
	 
	УстановитьрабочийСтолСервер("СтолПаспортиста");
	ОСМДКлиент.ПолучитьПараметрыФункциональныхОпций();
	Форма = ЭтаФорма;
	Форма.Закрыть();
	
КонецПроцедуры



