
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	НайденныйВнешнийПользователь = Неопределено;
	ПараметрыФормы = Новый Структура;
	ЕстьПравоДобавленияВнешнегоПользователя = Ложь;
	
	Если ВнешниеПользователи.ОбъектАвторизацииИспользуется(ПараметрКоманды, , НайденныйВнешнийПользователь, ЕстьПравоДобавленияВнешнегоПользователя) Тогда
		ПараметрыФормы.Вставить("Ключ", НайденныйВнешнийПользователь);
	ИначеЕсли ЕстьПравоДобавленияВнешнегоПользователя Тогда
		ПараметрыФормы.Вставить("ОбъектАвторизацииНовогоВнешнегоПользователя", ПараметрКоманды);
	Иначе
		Предупреждение(НСтр("ru='Доступ к информационной базе запрещен и не предоставлялся.';uk='Доступ до інформаційної бази заборонений і не надавався.'"));
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ВнешниеПользователи.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
