
&НаСервере
Процедура СформироватьОКНаСервере()
	Макет = Отчеты.Оборотка.ПолучитьМакет("Макет");
	Результат.Очистить();
	Запрос = Новый Запрос;
	Если НЕ ЗначениеЗаполнено(Отчет.ЛицевойСчет) Тогда
		Условие = "";
		Условие1 = "";
		Условие2 = "";
	Иначе
		Условие = 
			" И ЛицевойСчет = &ЛицевойСчет";
		Условие1 = " И РасчетыПоЛицевымСчетам.ЛицевойСчет = &ЛицевойСчет";
		Условие2 = " РасчетыПоЛицевымСчетам.ЛицевойСчет = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", Отчет.ЛицевойСчет);
	КонецЕсли;
	Запрос.Текст =
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	ВложенныйЗапрос.PROVIDER_CODE,
	   |	ВложенныйЗапрос.ЛицевойСчет,
	   |	ВложенныйЗапрос.PERIOD_YEAR,
	   |	ВложенныйЗапрос.PERIOD_MONTH,
	   |	ВложенныйЗапрос.INDUSTRY_TYPE,
	   |	СУММА(ВложенныйЗапрос.CALC_BALANCE) КАК CALC_BALANCE,
	   |	СУММА(ВложенныйЗапрос.CALC_ACCRUAL) КАК CALC_ACCRUAL,
	   |	СУММА(ВложенныйЗапрос.CALC_PAYMENT) КАК CALC_PAYMENT,
	   |	СУММА(ВложенныйЗапрос.CALC_PRIVILEGE) КАК CALC_PRIVILEGE,
	   |	СУММА(ВложенныйЗапрос.CALC_SUBSIDY) КАК CALC_SUBSIDY
	   |ИЗ
	   |	(ВЫБРАТЬ
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация.КодПоЕДРПОУ КАК PROVIDER_CODE,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
	   |		ГОД(РасчетыПоЛицевымСчетамОстаткиИОбороты.ПериодМесяц) КАК PERIOD_YEAR,
	   |		МЕСЯЦ(РасчетыПоЛицевымСчетамОстаткиИОбороты.ПериодМесяц) КАК PERIOD_MONTH,
	   |		ВЫБОР
	   |			КОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация.КодПоЕДРПОУ = ""03362560""
	   |				ТОГДА ""water""
	   |			ИНАЧЕ """"
	   |		КОНЕЦ КАК INDUSTRY_TYPE,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаНачальныйОстаток КАК CALC_BALANCE,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход КАК CALC_ACCRUAL,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход КАК CALC_PAYMENT,
	   |		0 КАК CALC_PRIVILEGE,
	   |		0 КАК CALC_SUBSIDY
	   |	ИЗ
	   |		РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(, , Авто, , ЛицевойСчет.ПометкаУдаления = ЛОЖЬ" + Условие +") КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	   |	
	   |	СГРУППИРОВАТЬ ПО
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.ПериодГод,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация.КодПоЕДРПОУ,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	   |		ГОД(РасчетыПоЛицевымСчетамОстаткиИОбороты.ПериодМесяц),
	   |		МЕСЯЦ(РасчетыПоЛицевымСчетамОстаткиИОбороты.ПериодМесяц),
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаНачальныйОстаток,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход,
	   |		РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход
	   |	
	   |	ОБЪЕДИНИТЬ ВСЕ
	   |	
	   |	ВЫБРАТЬ
	   |		РасчетыПоЛицевымСчетам.Организация.КодПоЕДРПОУ,
	   |		РасчетыПоЛицевымСчетам.ЛицевойСчет,
	   |		ГОД(РасчетыПоЛицевымСчетам.Период),
	   |		МЕСЯЦ(РасчетыПоЛицевымСчетам.Период),
	   |		ВЫБОР
	   |			КОГДА РасчетыПоЛицевымСчетам.Организация.КодПоЕДРПОУ = ""03362560""
	   |				ТОГДА ""water""
	   |			ИНАЧЕ """"
	   |		КОНЕЦ,
	   |		0,
	   |		0,
	   |		0,
	   |		СУММА(ВЫБОР
	   |				КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	   |					ТОГДА РасчетыПоЛицевымСчетам.Сумма
	   |				ИНАЧЕ 0
	   |			КОНЕЦ),
	   |		ВЫБОР
	   |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	   |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	   |			ИНАЧЕ 0
	   |		КОНЕЦ
	   |	ИЗ
	   |		РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	   |	ГДЕ
	   |		РасчетыПоЛицевымСчетам.ЛицевойСчет.ПометкаУдаления = ЛОЖЬ" + Условие1 +"
	   |	
	   |	СГРУППИРОВАТЬ ПО
	   |		РасчетыПоЛицевымСчетам.Организация.КодПоЕДРПОУ,
	   |		РасчетыПоЛицевымСчетам.ЛицевойСчет,
	   |		ГОД(РасчетыПоЛицевымСчетам.Период),
	   |		МЕСЯЦ(РасчетыПоЛицевымСчетам.Период),
	   |		ВЫБОР
	   |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	   |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	   |			ИНАЧЕ 0
	   |		КОНЕЦ) КАК ВложенныйЗапрос
	   |
	   |СГРУППИРОВАТЬ ПО
	   |	ВложенныйЗапрос.PROVIDER_CODE,
	   |	ВложенныйЗапрос.ЛицевойСчет,
	   |	ВложенныйЗапрос.PERIOD_YEAR,
	   |	ВложенныйЗапрос.PERIOD_MONTH,
	   |	ВложенныйЗапрос.INDUSTRY_TYPE";
	//Запрос.УстановитьПараметр("ЛицевойСчет", Отчет.ЛицевойСчет);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	Результат.Вывести(ОбластьШапка);
	ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьДанные");
	Пока РезультатЗапроса.Следующий() Цикл
		ОбластьСтрока.Параметры.ЛицевойСчет = РезультатЗапроса.ЛицевойСчет;
		ОбластьСтрока.Параметры.Период = РезультатЗапроса.МесяцНачисления;
        ОбластьСтрока.Параметры.НачальныйОстаток = РезультатЗапроса.НачальныйОстаток;
		ОбластьСтрока.Параметры.Начислено = РезультатЗапроса.Начислено;
		ОбластьСтрока.Параметры.Оплачено = РезультатЗапроса.Оплата;
		ОбластьСтрока.Параметры.КонечныйОстаток = ОбластьСтрока.Параметры.НачальныйОстаток + ОбластьСтрока.Параметры.Начислено - ОбластьСтрока.Параметры.Оплачено;
		//КонОстатокПрошМес = КонОстатокПрошМес + РезультатЗапроса.КонечныйОстаток;
		Результат.Вывести(ОбластьСтрока);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОК(Команда)
	СформироватьОКНаСервере();
КонецПроцедуры
