
Процедура ОбработкаПроведения(Отказ, Режим)

	// регістр АктСнятияПоказанийХолоднойВоды
	Движения.АктСнятияПоказанийХолоднойВоды.Записывать = Истина;
	Для Каждого ТекСтрокаПоказанияПриборов Из ПоказанияПриборов Цикл
		Движение = Движения.АктСнятияПоказанийХолоднойВоды.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ЛицевойСчет = ЛицевойСчет;
		Движение.Здание = Здание;
		Движение.ПериодНачисления = ПериодНачисления;
		Движение.Исполнитель = Исполнитель;
		Движение.Ответственный = Ответственный;
		Движение.ПриборУчета = ТекСтрокаПоказанияПриборов.ПриборУчета;
		Движение.ПоказаниеПредыдущее = ТекСтрокаПоказанияПриборов.ПоказаниеПредыдущее;
		Движение.ПоказаниеТекущее = ТекСтрокаПоказанияПриборов.ПоказаниеТекущее;
		Движение.РазницаПоказания = ТекСтрокаПоказанияПриборов.РазницаПоказания;
		Движение.ОтветственныйВладелец = ТекСтрокаПоказанияПриборов.ОтветственныйВладелец;
		Движение.Квартира = ТекСтрокаПоказанияПриборов.Квартира;
		Движение.ЕдиницаИзмерения = ТекСтрокаПоказанияПриборов.ЕдиницаИзмерения;
		Движение.ВидТарифа = ТекСтрокаПоказанияПриборов.ВидТарифа;
		Движение.Коэффициент = ТекСтрокаПоказанияПриборов.Коэффициент;
	КонецЦикла;

КонецПроцедуры
