////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ЗаполнитьПлощадь(Справочники.ЗданияИСооружения.ПустаяСсылка());
		
	Иначе
		
		Элементы.ДатаВводаВЭксплуатацию.Доступность = Ложь;
		Элементы.ДатаНачалаУчета.Доступность = Ложь;
		
		ЗаполнитьПлощадь(Объект.Ссылка);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СопроводительныйТекстКвитанции) Тогда
		Объект.СопроводительныйТекстКвитанции = НСтр("ru = 'Прохання сплатити протягом___днів, але не пізніше 20 числа'; uk = 'Просьба оплатить в течение___дней, но не позже 20 числа'");
	КонецЕсли;	
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, Объект, "ГруппаКонтактнаяИнформация");
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Объект, "СтраницаДополнительныеРеквизиты");
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВариантГород") Тогда
		Элементы.ТипСооружения.СписокВыбора.Добавить(Перечисления.ТипыСооружений.ГруппаЗданий);	
	КонецЕсли;
	
	УстановитьВидимостьИДоступность();
	

	ПриборыУчета.Параметры.УстановитьЗначениеПараметра("ЛицевойСчет", Объект.ЛицевойСчетЗдания);
	ПриборыУчета.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Локализация.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	НаборВидыПлощадей = РегистрыСведений.ПлощадьЗданий.СоздатьНаборЗаписей();
	
	Для Каждого СтрокаВидыПлощадей Из ВидыПлощадей Цикл
		НаборВидыПлощадей.Отбор.Здание.Установить(ТекущийОбъект.Ссылка);
		НаборВидыПлощадей.Отбор.ВидПлощади.Установить(СтрокаВидыПлощадей.ВидПлощади);
		
		НаборВидыПлощадей.Прочитать();
		
		Если НаборВидыПлощадей.Количество() = 0 Тогда
			
			НоваяПлощадь = НаборВидыПлощадей.Добавить();
			НоваяПлощадь.Здание = ТекущийОбъект.Ссылка;
			НоваяПлощадь.ВидПлощади = СтрокаВидыПлощадей.ВидПлощади;
			
			НоваяПлощадь.Площадь =  СтрокаВидыПлощадей.Площадь;
			НаборВидыПлощадей.Записать();
			
		ИначеЕсли НаборВидыПлощадей.Количество() = 1 Тогда
			НоваяПлощадь = НаборВидыПлощадей[0];	
			Если НоваяПлощадь.Площадь <> СтрокаВидыПлощадей.Площадь Тогда
				НоваяПлощадь.Площадь =  СтрокаВидыПлощадей.Площадь;
				НаборВидыПлощадей.Записать();
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ТекстВопроса = НСтр("ru='Проверте дату ввода в эксплуатацию. ';uk='Перевiрте дату введення в експлуатацію. '");
		ТекстВопроса = ТекстВопроса +Символы.ПС + НСтр("ru='После записи дата ввода будет запрещена к изменению. Вы уверены?';uk='Після запису дата введення буде заборонена до зміни. Ви певен?'");
		
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Отказ = Истина;	
		КонецЕсли;

	КонецЕсли;
	
//{{MRG[ <-> ]
//	Если НЕ ЗначениеЗаполнено(Объект.ПрефиксЛицевыхСчетов) Тогда
//		Объект.ПрефиксЛицевыхСчетов = Объект.ЛицевойСчетЗдания;
//	КонецЕсли;
//}}MRG[ <-> ]
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
//{{MRG[ <-> ]
//	Если ИмяСобытия = "ОбновлениеКоординат" Тогда
//		ЭтаФорма.Прочитать();	
//	КонецЕсли;
//}}MRG[ <-> ]
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлощадь(Здание)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыПлощадей.Ссылка КАК ВидПлощади,
		|	ПлощадьЗданий.Площадь
		|ИЗ
		|	Справочник.ВидыПлощадей КАК ВидыПлощадей
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьЗданий КАК ПлощадьЗданий
		|		ПО ВидыПлощадей.Ссылка = ПлощадьЗданий.ВидПлощади
		|			И (ПлощадьЗданий.Здание = &Здание)
		|ГДЕ
		|	ВидыПлощадей.ПометкаУдаления = ЛОЖЬ";
		
	Запрос.УстановитьПараметр("Здание", Здание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВидыПлощадей.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВариантКоттеджныйПоселок") Тогда 
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ЭтаФорма.Заголовок = НСтр("ru='Коттеджный поселок (создание)';uk='Котеджне селище (створення)'");
		Иначе
			ЭтаФорма.Заголовок = Объект.Наименование + НСтр("ru=' (Коттеджный поселок)';uk=' (Котеджне селище)'");
		КонецЕсли;
		
		Элементы.ТипСооружения.Видимость = Ложь;
		Элементы.КоличествоЛифтов.Видимость = Ложь;
		Элементы.КоличествоПодъездов.Видимость = Ложь;
		Элементы.СтраницаПлощадиЗдания.Видимость = Ложь;
		
	ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьВариантГород") И Объект.ТипСооружения = Перечисления.ТипыСооружений.ГруппаЗданий Тогда
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ЭтаФорма.Заголовок = НСтр("ru='Группа зданий (создание)';uk='Група будівель (створення)'");
		Иначе
			ЭтаФорма.Заголовок = Объект.Наименование + НСтр("ru=' (Группа зданий)';uk=' (Група будівель)'");
		КонецЕсли;
		
		Элементы.ТипСооружения.Видимость = Истина;
		Элементы.КоличествоЛифтов.Видимость = Ложь;
		Элементы.КоличествоПодъездов.Видимость = Ложь;
		Элементы.СтраницаПлощадиЗдания.Видимость = Ложь;
		
	Иначе
		
		ЭтаФорма.АвтоЗаголовок = Истина;
		ЭтаФорма.Заголовок = "";
		
		Элементы.ТипСооружения.Видимость = Истина;
		Элементы.КоличествоЛифтов.Видимость = Истина;
		Элементы.КоличествоПодъездов.Видимость = Истина;
		Элементы.СтраницаПлощадиЗдания.Видимость = Истина;
		
	КонецЕсли;
	
	Если Объект.НаличиеПроектаНаЗБП Тогда
		Элементы.ГруппаДоговорМЗК.Доступность = Истина;
	Иначе
		Элементы.ГруппаДоговорМЗК.Доступность = Ложь;
		Объект.ДлиннаТрубопровода = 0;
		Объект.ПлощадьМЗК         = 0;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьИДоступность()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "КОНТАКТНАЯ ИНФОРМАЦИЯ"

// СтандартныеПодсистемы.КонтактнаяИнформация

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.КонтактнаяИнформация

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ СВОЙСТВ

&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры


&НаКлиенте
Процедура ТипСооруженияПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();	
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаУказатьНаКарте(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Сначала необходимо сохранить запись");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Партнер, Широта, Долгота, РежимРедактора", Объект.Ссылка, Объект.Широта, Объект.Долгота, "ДляЗаписи"); 
	ОткрытьФорму("ОбщаяФорма.РедакторМеток", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОпределитьКоординатыПоАдресу(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Сначала необходимо сохранить запись");
		Возврат;
	КонецЕсли;
	
	ТекЗдание = Объект.Ссылка;
	АдресЗдания = РаботаСКартамиСервер.ПолучитьАдресЗдания(ТекЗдание);
	
	Если ПустаяСтрока(АдресЗдания) Тогда
		Сообщить("Для здания не задан адрес в контактной информации, по которому можно определить координаты");
		Возврат;
	КонецЕсли;
	
	Попытка
		СтруктураОтвета = РаботаСКартамиКлиент.ПолучитьКоординатыПоЗапросу(АдресЗдания);
	Исключение
		Сообщить("Невозможно определить координаты для здания " + СокрЛП(ТекЗдание));
	КонецПопытки;
	
	Если Не СтруктураОтвета = Неопределено Тогда 					
		НайденныеКоординаты = СтруктураОтвета.Координаты;
						
		МассивКоординат = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НайденныеКоординаты, " ");		
			
		Объект.Широта  = МассивКоординат[1]; 
		Объект.Долгота = МассивКоординат[0];
			
		АвтопоискАдрес = СокрЛП(СтруктураОтвета.Область) + ", " + СокрЛП(СтруктураОтвета.НаселенныйПункт) + ", " + СокрЛП(СтруктураОтвета.Улица) + ", " + СокрЛП(СтруктураОтвета.Дом); 
		
		ТекстСообщения = "Адрес по справочнику: " + АдресЗдания + Символы.ПС +
						 "Адрес, для которого определены координаты: " + АвтопоискАдрес;		
		Сообщить(ТекстСообщения);
		
	Иначе
		
		ТекстСообщения = "Координаты по адресу: " + АдресЗдания + Символы.ПС +
						 "не найдены. Возможно ошибка в адресе.";		
		Сообщить(ТекстСообщения);	
		
	КонецЕсли; 	
КонецПроцедуры


&НаКлиенте
Процедура МногоКвартирныйПриИзменении(Элемент)
	Если Объект.МногоКвартирный Тогда
		Элементы.ОСББ.Видимость = Истина;
		Элементы.ЖЕК.Видимость = Истина;
		Элементы.ЧастныйСектор.Видимость = Ложь;
		Объект.ЧастныйСектор = Ложь;
	Иначе
		Элементы.ЧастныйСектор.Видимость = Истина;
		Элементы.ОСББ.Видимость = Ложь;
		Элементы.ЖЕК.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЧастныйСекторПриИзменении(Элемент)
	Если Объект.ЧастныйСектор Тогда
		Элементы.МногоКвартирный.Видимость = Ложь;
		Объект.МногоКвартирный = Ложь;
	Иначе
		Элементы.МногоКвартирный.Видимость = Истина;
		Элементы.ОСББ.Видимость = Ложь;
		Элементы.ЖЕК.Видимость = Ложь;
		Объект.ОСББ = Ложь;
		Объект.ЖЕК = Ложь;
	КонецЕсли;
КонецПроцедуры

// РАСЧЕТ ОБЪЕМА ТЕПЛОВОЙ ЕНЕРГИИ

&НаСервере
Функция ПолучитьПлощадьЗдания(Здание)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ПлощадьЗданий.Площадь
	    |ИЗ
	    |	РегистрСведений.ПлощадьЗданий КАК ПлощадьЗданий
	    |ГДЕ
	    |	ПлощадьЗданий.Здание = &Здание
	    |	И ПлощадьЗданий.ВидПлощади = &ВидПлощади";
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("ВидПлощади", Справочники.ВидыПлощадей.ОтапливаемаяПлощадь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Площадь = Выборка.Площадь;
	КонецЦикла;
	Возврат Площадь;
КонецФункции

&НаКлиенте
Процедура q0ПриИзменении(Элемент)
	Объект.УдельнаяПотеряТЕ = Объект.q0 * Объект.КубатурныйКоэфиц * Объект.КоєфициентПеречисления; 
КонецПроцедуры

&НаКлиенте
Процедура КубатурныйКоэфицПриИзменении(Элемент)
	Объект.УдельнаяПотеряТЕ = Объект.q0 * Объект.КубатурныйКоэфиц * Объект.КоєфициентПеречисления;
КонецПроцедуры

&НаКлиенте
Процедура КоєфициентПеречисленияПриИзменении(Элемент)
	Объект.УдельнаяПотеряТЕ = Объект.q0 * Объект.КубатурныйКоэфиц * Объект.КоєфициентПеречисления;
КонецПроцедуры

// ЯНВАРЬ
&НаКлиенте
Процедура ТемпСредЯнварьПриИзменении(Элемент)
	ОтапливаемаяПлощадь = ПолучитьПлощадьЗдания(Объект.Ссылка);
	Объект.ТепловаяНагрузкаЯнварь = ((Объект.ВнутренняяТемператураЗдания - Объект.ТемпСредЯнварь) * 24 * ОтапливаемаяПлощадь * Объект.КвоДнейЯнварь * Объект.УдельнаяПотеряТЕ) / 1000000;
КонецПроцедуры

&НаКлиенте
Процедура КвоДнейЯнварьПриИзменении(Элемент)
	ОтапливаемаяПлощадь = ПолучитьПлощадьЗдания(Объект.Ссылка);
	Объект.ТепловаяНагрузкаЯнварь = ((Объект.ВнутренняяТемператураЗдания - Объект.ТемпСредЯнварь) * 24 * ОтапливаемаяПлощадь * Объект.КвоДнейЯнварь * Объект.УдельнаяПотеряТЕ) / 1000000;
КонецПроцедуры

// ФЕВРАЛЬ
&НаКлиенте
Процедура ТемпСредФевральПриИзменении(Элемент)
	ОтапливаемаяПлощадь = ПолучитьПлощадьЗдания(Объект.Ссылка);
	Объект.ТепловаяНагрузкаФевраль = ((Объект.ВнутренняяТемператураЗдания - Объект.ТемпСредФевраль) * 24 * ОтапливаемаяПлощадь * Объект.КвоДнейФевраль * Объект.УдельнаяПотеряТЕ) / 1000000;
КонецПроцедуры

&НаКлиенте
Процедура КвоДнейФевральПриИзменении(Элемент)
	ОтапливаемаяПлощадь = ПолучитьПлощадьЗдания(Объект.Ссылка);
	Объект.ТепловаяНагрузкаФевраль = ((Объект.ВнутренняяТемператураЗдания - Объект.ТемпСредФевраль) * 24 * ОтапливаемаяПлощадь * Объект.КвоДнейФевраль * Объект.УдельнаяПотеряТЕ) / 1000000;
КонецПроцедуры

// МАРТ
&НаКлиенте
Процедура ТемпСредМартПриИзменении(Элемент)
	ОтапливаемаяПлощадь = ПолучитьПлощадьЗдания(Объект.Ссылка);
	Объект.ТепловаяНагрузкаМарт = ((Объект.ВнутренняяТемператураЗдания - Объект.ТемпСредМарт) * 24 * ОтапливаемаяПлощадь * Объект.КвоДнейМарт * Объект.УдельнаяПотеряТЕ) / 1000000;
КонецПроцедуры

&НаКлиенте
Процедура КвоДнейМартПриИзменении(Элемент)
	ОтапливаемаяПлощадь = ПолучитьПлощадьЗдания(Объект.Ссылка);
	Объект.ТепловаяНагрузкаМарт = ((Объект.ВнутренняяТемператураЗдания - Объект.ТемпСредМарт) * 24 * ОтапливаемаяПлощадь * Объект.КвоДнейМарт * Объект.УдельнаяПотеряТЕ) / 1000000;
КонецПроцедуры

// АПРЕЛЬ
&НаКлиенте
Процедура ТемпСредАпрельПриИзменении(Элемент)
	ОтапливаемаяПлощадь = ПолучитьПлощадьЗдания(Объект.Ссылка);
	Объект.ТепловаяНагрузкаАпрель = ((Объект.ВнутренняяТемператураЗдания - Объект.ТемпСредАпрель) * 24 * ОтапливаемаяПлощадь * Объект.КвоДнейАпрель * Объект.УдельнаяПотеряТЕ) / 1000000;
КонецПроцедуры

&НаКлиенте
Процедура КвоДнейАпрельПриИзменении(Элемент)
	ОтапливаемаяПлощадь = ПолучитьПлощадьЗдания(Объект.Ссылка);
	Объект.ТепловаяНагрузкаАпрель = ((Объект.ВнутренняяТемператураЗдания - Объект.ТемпСредАпрель) * 24 * ОтапливаемаяПлощадь * Объект.КвоДнейАпрель * Объект.УдельнаяПотеряТЕ) / 1000000;
КонецПроцедуры

// ОКТЯБРЬ
&НаКлиенте
Процедура ТемпСредОктябрьПриИзменении(Элемент)
	ОтапливаемаяПлощадь = ПолучитьПлощадьЗдания(Объект.Ссылка);
	Объект.ТепловаяНагрузкаОктябрь = ((Объект.ВнутренняяТемператураЗдания - Объект.ТемпСредОктябрь) * 24 * ОтапливаемаяПлощадь * Объект.КвоДнейОктябрь * Объект.УдельнаяПотеряТЕ) / 1000000;
КонецПроцедуры

&НаКлиенте
Процедура КвоДнейОктябрьПриИзменении(Элемент)
	ОтапливаемаяПлощадь = ПолучитьПлощадьЗдания(Объект.Ссылка);
	Объект.ТепловаяНагрузкаОктябрь = ((Объект.ВнутренняяТемператураЗдания - Объект.ТемпСредОктябрь) * 24 * ОтапливаемаяПлощадь * Объект.КвоДнейОктябрь * Объект.УдельнаяПотеряТЕ) / 1000000;
КонецПроцедуры

// НОЯБРЬ
&НаКлиенте
Процедура ТемпСредНоябрьПриИзменении(Элемент)
	ОтапливаемаяПлощадь = ПолучитьПлощадьЗдания(Объект.Ссылка);
	Объект.ТепловаяНагрузкаНоябрь = ((Объект.ВнутренняяТемператураЗдания - Объект.ТемпСредНоябрь) * 24 * ОтапливаемаяПлощадь * Объект.КвоДнейНоябрь * Объект.УдельнаяПотеряТЕ) / 1000000;
КонецПроцедуры

&НаКлиенте
Процедура КвоДнейНоябрьПриИзменении(Элемент)
	ОтапливаемаяПлощадь = ПолучитьПлощадьЗдания(Объект.Ссылка);
	Объект.ТепловаяНагрузкаНоябрь = ((Объект.ВнутренняяТемператураЗдания - Объект.ТемпСредНоябрь) * 24 * ОтапливаемаяПлощадь * Объект.КвоДнейНоябрь * Объект.УдельнаяПотеряТЕ) / 1000000;
КонецПроцедуры

// ДЕКАБРЬ
&НаКлиенте
Процедура ТемпСредДекабрьПриИзменении(Элемент)
	ОтапливаемаяПлощадь = ПолучитьПлощадьЗдания(Объект.Ссылка);
	Объект.ТепловаяНагрузкаДекабрь = ((Объект.ВнутренняяТемператураЗдания - Объект.ТемпСредДекабрь) * 24 * ОтапливаемаяПлощадь * Объект.КвоДнейДекабрь * Объект.УдельнаяПотеряТЕ) / 1000000; 
КонецПроцедуры

&НаКлиенте
Процедура КвоДнейДекабрьПриИзменении(Элемент)
	ОтапливаемаяПлощадь = ПолучитьПлощадьЗдания(Объект.Ссылка);
	Объект.ТепловаяНагрузкаДекабрь = ((Объект.ВнутренняяТемператураЗдания - Объект.ТемпСредДекабрь) * 24 * ОтапливаемаяПлощадь * Объект.КвоДнейДекабрь * Объект.УдельнаяПотеряТЕ) / 1000000;
КонецПроцедуры

&НаКлиенте
Процедура НаличиеПроектаНаЗБППриИзменении(Элемент)
	
	Если Объект.НаличиеПроектаНаЗБП Тогда
		Элементы.ГруппаДоговорМЗК.Доступность = Истина;
	Иначе
		Элементы.ГруппаДоговорМЗК.Доступность = Ложь;
		Объект.ДлиннаТрубопровода = 0;
		Объект.ПлощадьМЗК         = 0;
	КонецЕсли;
	
КонецПроцедуры

