
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
#Если ВебКлиент Тогда
	Текст = "ru = ""Система не поддерживает работу в Web-клиенте""; uk = ""Система не підтримує роботу в Web-клієнті""";
	Предупреждение(НСтр(Текст), 10);
#Иначе
	
	МассивФайлов = НайтиФайлы("C:\Program Files\AnyDesk\AnyDesk.exe");
	Если МассивФайлов.Количество() > 0  тогда
		ЗапуститьПриложение("C:\Program Files\AnyDesk\AnyDesk.exe");
	Иначе 
		
		МассивФайлов = НайтиФайлы("C:\","AnyDesk.exe", Истина);
		Если МассивФайлов.Количество() > 0  тогда
			ЗапуститьПриложение(МассивФайлов[0].ПолноеИмя);
		Иначе 
			
			Текст = НСтр("ru='Программа AnyDesk не установлена. Зайти на сайт AnyDesk?';uk=' Програма AnyDesk не встановлена. Зайти на сайт AnyDesk?'");
			
			Результат = Вопрос(Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
			Если Результат = КодВозвратаДиалога.Да Тогда
				ЗапуститьПриложение("https://anydesk.com/ru/");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
#КонецЕсли
	
КонецПроцедуры

