&НаСервере
Процедура ВыполнитьАрхивациюЧековНаСервере(ПараметрКоманды)

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КассоваяСмена.Ссылка
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Ссылка В(&ПараметрКоманды)
	|	И КассоваяСмена.Проведен
	|	И КассоваяСмена.СтатусКассовойСмены = &СтатусКассовойСмены";
	
	Запрос.УстановитьПараметр("ПараметрКоманды", ПараметрКоманды);
	Запрос.УстановитьПараметр("СтатусКассовойСмены", Перечисления.СтатусыКассовойСмены.Закрыта);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		КассоваяСменаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если КассоваяСменаОбъект.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Закрыта Тогда
			
			ОписаниеОшибки = "";
			Документы.КассоваяСмена.ВыполнитьАрхивациюЧековККМ(КассоваяСменаОбъект, ОписаниеОшибки);
			
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОписаниеОшибки;
				Сообщение.Сообщить();
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьАрхивациюЧековНаСервере()

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВыполнитьАрхивациюЧековНаСервере(ПараметрКоманды);
	
	Оповестить("ОбновитьФормыПослеЗакрытияКассовойСмены");
	
	ПоказатьОповещениеПользователя(НСтр("ru='Архивация чеков ККМ выполнена';uk='Архівація чеків ККМ виконана'"));
	
КонецПроцедуры // ОбработкаКоманды()
