////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Предмет") Тогда 
		Объект.Предмет = Параметры.Предмет;
		Объект.Пометка = УстановитьЦветовуюИндикацию(Параметры.Предмет);
	КонецЕсли;
	
	Элементы.Предмет.Заголовок = Объект.ПредставлениеПредмета;
	
	Элементы.Предмет.Гиперссылка = ЗначениеЗаполнено(Объект.Предмет);
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = Пользователи.ТекущийПользователь();
		ФорматированныйТекст = Параметры.ЗначениеКопирования.Содержание.Получить();
		
		Элементы.ДатаЗаметки.Заголовок = НСтр("ru='Не записано';uk='Не записано'")
	Иначе
		Элементы.ДатаЗаметки.Заголовок = НСтр("ru='Записано';uk='Записано'") + ": " + Формат(Объект.ДатаИзменения, "ДЛФ=DDT");
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ФорматированныйТекст = ТекущийОбъект.Содержание.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Содержание = Новый ХранилищеЗначения(ФорматированныйТекст, Новый СжатиеДанных(9));
	
	ТекстHTML = "";
	Вложения = Новый Структура;
	ФорматированныйТекст.ПолучитьHTML(ТекстHTML, Вложения);
	
	ТекущийОбъект.ТекстСодержания = СтроковыеФункцииКлиентСервер.ИзвлечьТекстИзHTML(ТекстHTML);
	
		  
 КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Элементы.ДатаЗаметки.Заголовок = НСтр("ru='Записано';uk='Записано'") + ": " + Формат(Объект.ДатаИзменения, "ДЛФ=DDT");
	
	Источник = Объект.Ссылка;
	НеУстановленоНапоминание = ИнициализироватьДействияПередЗаписью(Источник);
	
	Если НеУстановленоНапоминание Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
			Текст = "ru = 'Установить напоминание?'; uk = 'Встановити нагадування?'";
			Ответ = Вопрос(НСтр(Текст),Режим,0);
			Если Ответ = КодВозвратаДиалога.Да тогда
				ПараметрыФормы = Новый Структура("Источник", Источник);
				ОткрытьФормуМодально("РегистрСведений.НапоминанияПользователя.Форма.Напоминание", ПараметрыФормы);
			КонецЕсли;
    КонецЕсли;
	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ПредметНажатие(Элемент)
	ОткрытьЗначение(Объект.Предмет);
КонецПроцедуры

&НаКлиенте
Процедура АвторНажатие(Элемент)
	ОткрытьЗначение(Объект.Автор);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьВидимость()
	Элементы.Автор.Заголовок = Объект.Автор;
	ОткрытаАвтором = Объект.Автор = Пользователи.ТекущийПользователь();
	Элементы.ПараметрыОтображения.Видимость = ОткрытаАвтором;
	Элементы.ИнформацияОбАвторе.Видимость = Не ОткрытаАвтором;
	
	ТолькоПросмотр = Не ОткрытаАвтором;
	Элементы.Содержание.ТолькоПросмотр = Не ОткрытаАвтором;
	Элементы.КоманднаяПанельРедактирования.Видимость = ОткрытаАвтором;
КонецПроцедуры

&НаСервере
Функция ИнициализироватьДействияПередЗаписью(ЭтотОбъект)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НапоминанияПользователя.Пользователь,
	               |	НапоминанияПользователя.ВремяСобытия,
	               |	НапоминанияПользователя.Источник,
	               |	НапоминанияПользователя.СрокНапоминания,
	               |	НапоминанияПользователя.Описание,
	               |	НапоминанияПользователя.СпособУстановкиВремениНапоминания,
	               |	НапоминанияПользователя.ИнтервалВремениНапоминания,
	               |	НапоминанияПользователя.ИмяРеквизитаИсточника,
	               |	НапоминанияПользователя.Расписание,
	               |	НапоминанияПользователя.ПредставлениеИсточника
	               |ИЗ
	               |	РегистрСведений.НапоминанияПользователя КАК НапоминанияПользователя
	               |ГДЕ
	               |	НапоминанияПользователя.Источник = &Источник
	               |	И НапоминанияПользователя.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Источник", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	Результат = Запрос.Выполнить();
	
	Возврат  Результат.Пустой(); 
			
КонецФункции // ИнициализироватьДействияПередЗаписью()


&НаСервере
Функция УстановитьЦветовуюИндикацию(СсылкаНаОбъект)

	МетаданныеЭлемента = СсылкаНаОбъект.Ссылка.Метаданные();
    
	ЛС = Метаданные.Подсистемы.ЛицевыеСчета;
	Приборы = Метаданные.Подсистемы.ПриборыУчета;
	Начисления = Метаданные.Подсистемы.Начисления;
	Запасы = Метаданные.Подсистемы.Запасы;
	Аварийная = Метаданные.Подсистемы.АварийноДиспечерскаяСлужба;
	Голосование = Метаданные.Подсистемы.Голосование;
	ПаспортныйСтол = Метаданные.Подсистемы.ПаспортныйСтол;
	
	Если ЛС.Состав.Содержит(МетаданныеЭлемента) Тогда
		
		Возврат Перечисления.ЦветаЗаметок.Голубой;
		
	ИначеЕсли Приборы.Состав.Содержит(МетаданныеЭлемента) тогда
		
		Возврат Перечисления.ЦветаЗаметок.Оранжевый;
		
	ИначеЕсли Начисления.Состав.Содержит(МетаданныеЭлемента) Тогда
		
		Возврат Перечисления.ЦветаЗаметок.Желтый;
		
	ИначеЕсли Запасы.Состав.Содержит(МетаданныеЭлемента) Тогда
		
		Возврат Перечисления.ЦветаЗаметок.Зеленый;
		
	ИначеЕсли Аварийная.Состав.Содержит(МетаданныеЭлемента) Тогда
		
		Возврат Перечисления.ЦветаЗаметок.Красный;
		
	ИначеЕсли ПаспортныйСтол.Состав.Содержит(МетаданныеЭлемента) Тогда
		
		Возврат Перечисления.ЦветаЗаметок.Синий;
		
	ИначеЕсли Голосование.Состав.Содержит(МетаданныеЭлемента) тогда
		
		Возврат Перечисления.ЦветаЗаметок.Фиолетовый;	
		
	КонецЕсли;
		
				

КонецФункции // ()



