////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	Если Объект.ФормаГолосования = Справочники.ФормыГолосования.ОткрытоеСобрание Тогда
		Элементы.ОтветственныйЗаГолосование.Видимость = Истина;
	КонецЕсли;
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура - обработчик команды "Подбор".
//
&НаКлиенте
Процедура Подбор(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Или НЕ ЗначениеЗаполнено(Объект.Здание) Тогда
		ТекстСообщения = НСтр("ru='Не заполнены реквизиты Организация и Здание.';uk='Не заповнені реквізити Організація й Будинок.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
		
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ДатаНачала",		Объект.Дата);
	ПараметрыЗаполнения.Вставить("ДатаОкончания",	Объект.Дата);
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыЗаполнения.Вставить("ОтборЗдание",			Объект.Здание);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище);
	КонецЕсли;
	
КонецПроцедуры

// Функция получает список лицевых счетов из временного хранилища.
//
&НаСервере
Процедура ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище)
	
	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
	Для Каждого СтрокаТаблицаДляЗагрузки Из ТаблицаДляЗагрузки Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ЛицевойСчет",	СтрокаТаблицаДляЗагрузки.ЛицевойСчет);
		Строки = Объект.УчастникиГолосования.НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(Строки[0], СтрокаТаблицаДляЗагрузки);
			Строки[0].КонтактнаяИнформация = ПолучитьКонтактнуюИнформацию(СтрокаТаблицаДляЗагрузки);
		Иначе
			НоваяСтрока = Объект.УчастникиГолосования.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицаДляЗагрузки);
			НоваяСтрока.КонтактнаяИнформация = ПолучитьКонтактнуюИнформацию(СтрокаТаблицаДляЗагрузки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЛицевыеСчетаИзХранилища()

//Подбор Контактной информации при добавлении владельца.
//
&НаСервере
Функция ПолучитьКонтактнуюИнформацию(СтрокаТаблицаДляЗагрузки)
	
	Если СтрокаТаблицаДляЗагрузки.ОтветственныйВладелец  =Справочники.ПотребителиУслуг.ПустаяСсылка() тогда
		Возврат "";
	КонецЕсли;	

	Если СтрокаТаблицаДляЗагрузки.ОтветственныйВладелец.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		ТаблицаКИ = СтрокаТаблицаДляЗагрузки.ОтветственныйВладелец.ФизЛицо.КонтактнаяИнформация; 
	Иначе
		ТаблицаКИ = СтрокаТаблицаДляЗагрузки.ОтветственныйВладелец.ЮрЛицо.КонтактнаяИнформация;
	КонецЕсли;
	
	
	Для каждого СтрокаКонтактнойИнформации Из СтрокаТаблицаДляЗагрузки.ОтветственныйВладелец.ФизЛицо.КонтактнаяИнформация Цикл
		Если СтрокаКонтактнойИнформации.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица Тогда
			Возврат СтрокаКонтактнойИнформации.Представление;
			Прервать;
		Иначе
			Возврат "";
		КонецЕсли; 
	КонецЦикла; 
	
КонецФункции // ()

// Процедура - обработчик события ПриИзменении поля ввода "ФормаГолосования".
//
&НаКлиенте
Процедура ФормаГолосованияПриИзменении(Элемент)
	ПроверитьФормуГолосования();
КонецПроцедуры

// Процедура - регулирует видимость поля ввода "ОтветственныйЗаГолосование".
//
&НаСервере
Процедура ПроверитьФормуГолосования()
	Если Объект.ФормаГолосования = Справочники.ФормыГолосования.ОткрытоеСобрание Тогда
		Элементы.ОтветственныйЗаГолосование.Видимость = Истина;
	Иначе
		Элементы.ОтветственныйЗаГолосование.Видимость = Ложь;
		Объект.ОтветственныйЗаГолосование = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры // ПроверитьФормуГолосования()()

// Процедура - обработчик команды "Заполнить".
//
&НаКлиенте
Процедура Заполнить(Команда)
	ПолучитьУчетнуюПолитику();
КонецПроцедуры

// Процедура получает результат голосования.
//
&НаСервере
Процедура ПолучитьУчетнуюПолитику()
	НеобходимоеКоличествоЗА = РегистрыСведений.УчетнаяПолитикаОрганизации.ПолучитьПоследнее();
	КоличествоДляПравомочности = Окр(Объект.УчастникиГолосования.Количество() * НеобходимоеКоличествоЗА.ПроцентПрисутствующихДляПравомочностиГолосования / 100,0);
	Результат = Окр(КоличествоДляПравомочности * НеобходимоеКоличествоЗА.ПроцентПроголосовавшихЗа / 100,0);
	Объект.НеобходимоГолосовЗА = Результат;
КонецПроцедуры
