//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ   
//

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы
// 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Строка Из Метаданные.ЖурналыДокументов.ДокументыПоОплатам.РегистрируемыеДокументы Цикл
		Элементы.ТипДокумента.СписокВыбора.Добавить(Строка.Синоним, Строка.Синоним);
		ТипыДокументов.Добавить(Строка.Синоним, Строка.Имя);
	КонецЦикла;
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

// Процедура - обработчик события формы "ПриЗагрузкеДанныхИзНастроекНаСервере".
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОтборОрганизация		 		= Настройки.Получить("ОтборОрганизация");
	ТипДокументаПредставление 		= Настройки.Получить("ТипДокументаПредставление");
	ОтборЗдание						= Настройки.Получить("ОтборЗдание");
	ОтборЛицевойСчет				= Настройки.Получить("ОтборЛицевойСчет");
	
	ВыбранныйТипДокумента = ТипыДокументов.НайтиПоЗначению(ТипДокументаПредставление);
	Если ВыбранныйТипДокумента = Неопределено Тогда
		ТипДокумента = "";
	Иначе
		ТипДокумента = ВыбранныйТипДокумента.Представление;
	КонецЕсли;
	
	УстановитьСвязиПараметровВыбора();
	
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
    ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Тип", ?(ЗначениеЗаполнено(ТипДокумента), Тип("ДокументСсылка." + ТипДокумента), Неопределено), ЗначениеЗаполнено(ТипДокумента));
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет.Владелец", ОтборЗдание, ЗначениеЗаполнено(ОтборЗдание));
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет", ОтборЛицевойСчет, ЗначениеЗаполнено(ОтборЛицевойСчет));
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура УстановитьОтбор()
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Организация",	ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет.Владелец",		ОтборЗдание, ЗначениеЗаполнено(ОтборЗдание));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет",		ОтборЛицевойСчет, ЗначениеЗаполнено(ОтборЛицевойСчет));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита ТипДокумента.
// 
Процедура ТипДокументаПриИзменении(Элемент)
	
	ВыбранныйТипДокумента = ТипыДокументов.НайтиПоЗначению(ТипДокументаПредставление);
	Если ВыбранныйТипДокумента = Неопределено Тогда
		ТипДокумента = "";
	Иначе
		ТипДокумента = ВыбранныйТипДокумента.Представление;
	КонецЕсли;
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Тип", ?(ЗначениеЗаполнено(ТипДокумента), Тип("ДокументСсылка." + ТипДокумента), Неопределено), ЗначениеЗаполнено(ТипДокумента));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита Здание.
// 
Процедура ЗданиеПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборЛицевойСчетПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита Организация.
// 
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбора()
	
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Организация", "ОтборОрганизация", РежимИзмененияСвязанногоЗначения.НеИзменять);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		Элементы.ОтборЗдание.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
		Если ОтборЗдание.Организация <> ОтборОрганизация Тогда
			ОтборЗдание = Справочники.ЗданияИСооружения.ПустаяСсылка();
		КонецЕсли;
	Иначе		
		Элементы.ОтборЗдание.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборЗдание) Тогда
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "ОтборЗдание", РежимИзмененияСвязанногоЗначения.НеИзменять);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		Элементы.ОтборЛицевойСчет.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
		Если ОтборЛицевойСчет.Владелец <> ОтборЗдание Тогда
			ОтборЛицевойСчет = Справочники.ЛицевыеСчета.ПустаяСсылка();
		КонецЕсли;
	Иначе		
		Элементы.ОтборЛицевойСчет.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив());
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если ЗначениеЗаполнено(ТипДокумента) И НЕ Копирование Тогда
		
		Отказ = Истина;
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("Здание", ОтборЗдание);
		СтруктураПараметров.Вставить("Организация", ОтборОрганизация);
		СтруктураПараметров.Вставить("ЛицевойСчет", ОтборЛицевойСчет);
		
		ОткрытьФорму("Документ." + ТипДокумента + ".ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураПараметров));
	КонецЕсли; 
	
КонецПроцедуры


