
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаКорректировкаОплат, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	КорректировкаОплатЛицевыеСчета.Ссылка.Дата КАК Период,
		|	КорректировкаОплатЛицевыеСчета.Ссылка.Организация,
		|	КорректировкаОплатЛицевыеСчета.ЛицевойСчет,
		|	КорректировкаОплатЛицевыеСчета.СуммаКорректировки КАК Сумма
		|ИЗ
		|	Документ.КорректировкаОплат.ЛицевыеСчета КАК КорректировкаОплатЛицевыеСчета
		|ГДЕ
		|	КорректировкаОплатЛицевыеСчета.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаКорректировкаОплат);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЛицевымСчетам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
