

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРасчетПоказанийПриборовУчета(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Период,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ОбъектУстановки КАК ОбъектУстановки,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Услуга КАК Услуга,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ВидТарифа КАК ВидТарифа,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Коэффициент КАК Коэффициент,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Разница * ВременнаяТаблицаПоказанияПриборовУчета.Коэффициент КАК Значение
		|ИЗ
		|	ВременнаяТаблицаПоказанияПриборовУчета КАК ВременнаяТаблицаПоказанияПриборовУчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ВременнаяТаблицаПоказанияПриборовУчета.Период,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПриборУчета,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ОбъектУстановки,
		|	УслугиСоставныеУслуги.Услуга,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ВидТарифа,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Коэффициент,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Разница * ВременнаяТаблицаПоказанияПриборовУчета.Коэффициент * УслугиСоставныеУслуги.Коэффициент
		|ИЗ
		|	ВременнаяТаблицаПоказанияПриборовУчета КАК ВременнаяТаблицаПоказанияПриборовУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Услуги.СоставныеУслуги КАК УслугиСоставныеУслуги
		|		ПО ВременнаяТаблицаПоказанияПриборовУчета.Услуга = УслугиСоставныеУслуги.Ссылка
		|ГДЕ
		|	УслугиСоставныеУслуги.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетПоказанийПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетПоказанийПриборовУчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуПоказанияПриборовУчета(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаПоказанияПриборовУчета.Период КАК Период,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ВидТарифа КАК ВидТарифа,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Показание КАК Значение,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Отключен КАК Отключен
		|ИЗ
		|	ВременнаяТаблицаПоказанияПриборовУчета КАК ВременнаяТаблицаПоказанияПриборовУчета
		|ГДЕ
		|	ВременнаяТаблицаПоказанияПриборовУчета.Отключен = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПоказанияПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуДенежныеСредства()

Процедура СформироватьТаблицуЗаданийНаСнятиеПоказанийПриборовУчета(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
    Запрос.Текст = "ВЫБРАТЬ
				   //|	ВременнаяТаблицаПоказанияПриборовУчета.Исполнитель,
                   |	ВременнаяТаблицаПоказанияПриборовУчета.Здание,
                   |	ВременнаяТаблицаПоказанияПриборовУчета.ОбъектЛицевогоСчета,
                   |	ВременнаяТаблицаПоказанияПриборовУчета.ПриборУчета,
				   //|	ВременнаяТаблицаПоказанияПриборовУчета.ГраничнаяДатаСъема,
                   |	&Период
                   |ИЗ
                   |	ВременнаяТаблицаПоказанияПриборовУчета КАК ВременнаяТаблицаПоказанияПриборовУчета";
				   
	Запрос.УстановитьПараметр("Период",ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаданияНаСнятиеПоказаний", РезультатЗапроса.Выгрузить());

	
КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ВводПоказанийПриборовЗаМесяцПоказания.Услуга КАК Услуга,
		 |	ВводПоказанийПриборовЗаМесяцПоказания.ПриборУчета КАК ПриборУчета,
		 |	ВводПоказанийПриборовЗаМесяцПоказания.ЛицевойСчет КАК ОбъектУстановки,
		 |	ВводПоказанийПриборовЗаМесяцПоказания.ВидТарифа КАК ВидТарифа,
		 |	КОНЕЦПЕРИОДА(ВводПоказанийПриборовЗаМесяцПоказания.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Период,
		 |	ВводПоказанийПриборовЗаМесяцПоказания.Показание КАК Показание,
		 |	ВводПоказанийПриборовЗаМесяцПоказания.ПоказаниеПредыдущее КАК ПоказаниеПредыдущее,
		 |	ВводПоказанийПриборовЗаМесяцПоказания.Разница КАК Разница,
		 |	ВводПоказанийПриборовЗаМесяцПоказания.Коэффициент КАК Коэффициент,
		 |	ВводПоказанийПриборовЗаМесяцПоказания.Отключен КАК Отключен,
		 |	ВводПоказанийПриборовЗаМесяцПоказания.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
		 |	ВводПоказанийПриборовЗаМесяцПоказания.Здание КАК Здание,
		 |	ВводПоказанийПриборовЗаМесяцПоказания.Источник
		 |ПОМЕСТИТЬ ВременнаяТаблицаПоказанияПриборовУчета
		 |ИЗ
		 |	Документ.ВводПоказанийПриборовЗаМесяц.Показания КАК ВводПоказанийПриборовЗаМесяцПоказания
		 |ГДЕ
		 |	ВводПоказанийПриборовЗаМесяцПоказания.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводПоказанийПриборовУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицуРасчетПоказанийПриборовУчета(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицуПоказанияПриборовУчета(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицуЗаданийНаСнятиеПоказанийПриборовУчета(ДокументСсылкаВводПоказанийПриборовУчета, СтруктураДополнительныеСвойства);
КонецПроцедуры

// Выполняет контроль повторного начисления.
//
Процедура ВыполнитьКонтрольПовторногоНачисления(ДокументСсылкаВводПоказанийПриборовУчета, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Если СтруктураВременныеТаблицы.ДвиженияРасчетПоказанийПриборовУчетаИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасчетПоказанийПриборовУчетаОбороты.Регистратор КАК Регистратор
		|ИЗ
		|	ДвиженияРасчетПоказанийПриборовУчетаИзменение КАК ДвиженияРасчетПоказанийПриборовУчетаИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетПоказанийПриборовУчета.Обороты(
		|				&ДатаНачала,
		|				&ДатаОкончания,
		|				Регистратор,
		|				(ОбъектУстановки, ПриборУчета, Услуга, ВидТарифа) В
		|					(ВЫБРАТЬ
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение.ОбъектУстановки КАК ОбъектУстановки,
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение.ПриборУчета КАК ПриборУчета,
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение.Услуга КАК Услуга,
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение.ВидТарифа КАК ВидТарифа
		|					ИЗ
		|						ДвиженияРасчетПоказанийПриборовУчетаИзменение КАК ДвиженияРасчетПоказанийПриборовУчетаИзменение)) КАК РасчетПоказанийПриборовУчетаОбороты
		|		ПО ДвиженияРасчетПоказанийПриборовУчетаИзменение.ОбъектУстановки = РасчетПоказанийПриборовУчетаОбороты.ОбъектУстановки
		|			И ДвиженияРасчетПоказанийПриборовУчетаИзменение.ПриборУчета = РасчетПоказанийПриборовУчетаОбороты.ПриборУчета
		|			И ДвиженияРасчетПоказанийПриборовУчетаИзменение.Услуга = РасчетПоказанийПриборовУчетаОбороты.Услуга
		|			И ДвиженияРасчетПоказанийПриборовУчетаИзменение.ВидТарифа = РасчетПоказанийПриборовУчетаОбороты.ВидТарифа
		|ГДЕ
		|	РасчетПоказанийПриборовУчетаОбороты.Регистратор <> &Ссылка");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводПоказанийПриборовУчета);
		Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДокументСсылкаВводПоказанийПриборовУчета.ПериодНачисления));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДокументСсылкаВводПоказанийПриборовУчета.ПериодНачисления));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ДокументОбъектВводПоказанийПриборовУчета = ДокументСсылкаВводПоказанийПриборовУчета.ПолучитьОбъект();
			
			ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
			ОСМДСервер.СообщитьОбОшибкахПроведенияПоПовторномуНачислению(ДокументОбъектВводПоказанийПриборовУчета, ВыборкаИзРезультатаЗапроса, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
