////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ВводПоказанийПриборовЗаМесяц.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ПроведениеСервер.ОтразитьРасчетПоказанийПриборовУчета(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьПоказанияПриборовУчета(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.ВводПоказанийПриборовЗаМесяц.ВыполнитьКонтрольПовторногоНачисления(Ссылка, ДополнительныеСвойства, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
	// регістр ПоказанияПриборовЗаМесяц
	Движения.ПоказанияПриборовЗаМесяц.Записывать = Истина;
	Для Каждого ТекСтрокаПоказания Из Показания Цикл
		Движение = Движения.ПоказанияПриборовЗаМесяц.Добавить();
		Движение.Период = Дата;
		Движение.ПриборУчета = ТекСтрокаПоказания.ПриборУчета;
		Движение.ЛицевойСчет = ТекСтрокаПоказания.ЛицевойСчет;
		Движение.Здание = ТекСтрокаПоказания.Здание;
		Движение.ОбъектЛицевогоСчета = ТекСтрокаПоказания.ОбъектЛицевогоСчета;
		Движение.ОтветственныйВладелец = ТекСтрокаПоказания.ОтветственныйВладелец;
		Движение.ВидТарифа = ТекСтрокаПоказания.ВидТарифа;
		Движение.Услуга = ТекСтрокаПоказания.Услуга;
		Движение.ПоказаниеПредыдущее = ТекСтрокаПоказания.ПоказаниеПредыдущее;
		Движение.Показание = ТекСтрокаПоказания.Показание;
		Движение.Разница = ТекСтрокаПоказания.Разница;
		Движение.НачислениеПоСреднему = ТекСтрокаПоказания.НачислениеПоСреднему;
	КонецЦикла;
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения1(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!

	// регістр РасчетПоказанийПриборовУчета Приход
	Движения.РасчетПоказанийПриборовУчета.Записывать = Истина;
	Для Каждого ТекСтрокаПоказания Из Показания Цикл
		Движение = Движения.РасчетПоказанийПриборовУчета.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ОбъектУстановки = ТекСтрокаПоказания.ЛицевойСчет;
		Движение.ПриборУчета = ТекСтрокаПоказания.ПриборУчета;
		Движение.Услуга = ТекСтрокаПоказания.Услуга;
		Движение.ВидТарифа = ТекСтрокаПоказания.ВидТарифа;
		Движение.Значение = ТекСтрокаПоказания.Разница;
	КонецЦикла;

	// регістр ЗаданияНаСнятиеПоказанийПриборовУчета
	Движения.ЗаданияНаСнятиеПоказанийПриборовУчета.Записывать = Истина;
	Для Каждого ТекСтрокаПоказания Из Показания Цикл
		Движение = Движения.ЗаданияНаСнятиеПоказанийПриборовУчета.Добавить();
		Движение.Период = Дата;
		Движение.Исполнитель = ТекСтрокаПоказания.ОтветственныйВладелец;
		Движение.Здание = ТекСтрокаПоказания.Здание;
		Движение.ОбъектЛицевогоСчета = ТекСтрокаПоказания.ОбъектЛицевогоСчета;
		Движение.ПриборУчета = ТекСтрокаПоказания.ПриборУчета;
		Движение.ГраничнаяДатаСъема = Дата;
	КонецЦикла;

	// регістр ПоказанияПриборовУчета
	Движения.ПоказанияПриборовУчета.Записывать = Истина;
	Для Каждого ТекСтрокаПоказания Из Показания Цикл
		Движение = Движения.ПоказанияПриборовУчета.Добавить();
		Движение.Период = Дата;
		Движение.ПриборУчета = ТекСтрокаПоказания.ПриборУчета;
		Движение.ВидТарифа = ТекСтрокаПоказания.ВидТарифа;
		Движение.Значение = ТекСтрокаПоказания.Показание;
		Движение.Отключен = ТекСтрокаПоказания.Отключен;
		Движение.Источник = ТекСтрокаПоказания.Источник;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
