
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Обработчик события "ПриСозданииНаСервере" формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.ИнтеграцияССайтом"));
	
	ТекОбъект.ИнициализацияРеквизитов();
	
	ЗначениеВДанныеФормы(ТекОбъект, Объект);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Обработчик события "ПриСозданииНаСервере" формы.
//
Процедура ПриОткрытии(Отказ)
	
	ПодключитьсяКСтраницеСайта();
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
// Обработчик события "ПередЗакрытием" формы.
//
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СохранитьРеквизиты();
	
КонецПроцедуры // ПередЗакрытием()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

&НаКлиенте
// Обработчик события "Нажатие" гиперссылки "НадписьСтраницаРедактированияНовостей".
//
Процедура НадписьСтраницаРедактированияНовостейНажатие(Элемент)
	
	ПодключитьсяКСтраницеСайта();
	
КонецПроцедуры // НадписьСтраницаРедактированияНовостейНажатие()

&НаКлиенте
// Обработчик события "Нажатие" гиперссылки "НадписьГлавнаяСтраницаСайта".
//
Процедура НадписьГлавнаяСтраницаСайтаНажатие(Элемент)
	
	ПодключитьсяКСтраницеСайта(Ложь);
	
КонецПроцедуры // НадписьГлавнаяСтраницаСайтаНажатие()

&НаКлиенте
// Обработчик события "Нажатие" поля выбора "НастройкаДоступа".
//
Процедура НастройкаДоступаПриИзменении(Элемент)
	
	ПодключитьсяКСтраницеСайта();
	
КонецПроцедуры // НастройкаДоступаПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
// Сохраняет настройки пользователя в хранилище настроек.
//
Процедура СохранитьРеквизиты()
	
	СтруктураНастроек = Новый Структура;
	
	СтруктураНастроек.Вставить("НастройкаДоступа",          Объект.НастройкаДоступа);
	СтруктураНастроек.Вставить("ОбновлятьПараметрыДоступа", Объект.ОбновлятьПараметрыДоступа);
	
	ХранилищеОбщихНастроек.Сохранить("Обработка.ИнтеграцияССайтом", , СтруктураНастроек);
	
КонецПроцедуры // СохранитьРеквизиты()

&НаСервере
// Формирует структуру с параметрами подключения к сайту.
//
Процедура ЗаполнитьПараметрыПодключения()
	
	ПараметрыПодключения = Новый Структура;
	
	ПараметрыПодключения.Вставить("АдресСайта",    Объект.НастройкаДоступа.АдресСайта);
	ПараметрыПодключения.Вставить("Логин",         Объект.НастройкаДоступа.Логин);
	ПараметрыПодключения.Вставить("Пароль",        Объект.НастройкаДоступа.Пароль);
	ПараметрыПодключения.Вставить("ХранитьПароль", Объект.НастройкаДоступа.ХранитьПароль);
	
КонецПроцедуры // ЗаполнитьПараметрыПодключения()

&НаКлиенте
// Устанавливает в HTML-документ адрес необходимой страницы сайта.
//
// Параметры:
//  РедактироватьНовости - Булево - признак того, что требуется открыть страницу редактирования новостей.
//
Процедура ПодключитьсяКСтраницеСайта(РедактироватьНовости = Истина)
	
	Если Объект.НастройкаДоступа = ПредопределенноеЗначение("Справочник.НастройкиДоступаКСайту.ПустаяСсылка") Тогда
		АдресСтраницы = "";
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПараметрыПодключения();
	
	Если ПараметрыПодключения.ХранитьПароль Тогда
		Пароль = ПараметрыПодключения.Пароль;
	Иначе
		Пароль = ПолучитьПарольДоступа();
		Если ТипЗнч(Пароль) = Тип("КодВозвратаДиалога") Тогда
			Пароль = "";
		КонецЕсли;
	КонецЕсли;
	
	АдресСтраницы = ВебИнтеграцияОбщегоНазначения.ПолучитьАдресСтраницы(РедактироватьНовости,
																	   ПараметрыПодключения.АдресСайта,
																	   ПараметрыПодключения.Логин,
																	   Пароль);
	
КонецПроцедуры // ПодключитьсяКСтраницеСайта()

&НаКлиенте
// Открывает форму для ввода пароля.
Функция ПолучитьПарольДоступа()
	
	Возврат ОткрытьФормуМодально("ОбщаяФорма.ВебИнтеграцияВводПароля");
	
КонецФункции // ПолучитьПарольДоступа()
