
&НаСервере
Процедура ВыполнитьНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		    "ВЫБРАТЬ
		    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
		    |ИЗ
		    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	ЛицевойСчет
		    |АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
		Результат = Запрос.Выполнить().Выгрузить();
		Объект.ТабличнаяЧастьGUID.Очистить();
		Для Каждого стр Из Результат Цикл
			НовСтрока = Объект.ТабличнаяЧастьGUID.Добавить();
			НовСтрока.ЛицевойСчет = стр.ЛицевойСчет;
			НовСтрока.GUID = Строка(стр.ЛицевойСчет.УникальныйИдентификатор());
		КонецЦикла;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
		    "ВЫБРАТЬ
		    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
		    |ИЗ
		    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, Действует = ИСТИНА И ЛицевойСчет = &ЛицевойСчет) КАК ЛицевыеСчетаСрезПоследних
		    |
		    |УПОРЯДОЧИТЬ ПО
		    |	ЛицевойСчет
		    |АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
		Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
		Результат = Запрос.Выполнить().Выгрузить();
		Объект.ТабличнаяЧастьGUID.Очистить();
		Для Каждого стр Из Результат Цикл
			НовСтрока = Объект.ТабличнаяЧастьGUID.Добавить();
			НовСтрока.ЛицевойСчет = стр.ЛицевойСчет;
			НовСтрока.GUID = Строка(стр.ЛицевойСчет.УникальныйИдентификатор());
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры
