////////////////////////////////////////////////////////////////////////////////
// Подсистема "Напоминания пользователя".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает стандартные расписания для периодических напоминаний
Функция ПолучитьСтандартныеРасписанияДляНапоминания() Экспорт
	
	Результат = Новый Соответствие;
		
	// по понедельникам в 9:00
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ПериодПовтораДней = 1;
	Расписание.ПериодНедель = 1;
	Расписание.ВремяНачала = '00010101090000';
	ДниНедели = Новый Массив;
	ДниНедели.Добавить(1);
	Расписание.ДниНедели = ДниНедели;
	Результат.Вставить(НСтр("ru='по понедельникам, в 9:00';uk='Щопонеділка в 9:00'"), Расписание);
	
	// по пятницам в 15:00
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ПериодПовтораДней = 1;
	Расписание.ПериодНедель = 1;
	Расписание.ВремяНачала = '00010101150000';
	ДниНедели = Новый Массив;
	ДниНедели.Добавить(5);
	Расписание.ДниНедели = ДниНедели;
	Результат.Вставить(НСтр("ru='по пятницам, в 15:00';uk=""Щоп'ятниці, в 15:00"""), Расписание);
	
	// каждый день в 9:00
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ПериодПовтораДней = 1;
	Расписание.ПериодНедель = 1;
	Расписание.ВремяНачала = '00010101090000';
	Результат.Вставить(НСтр("ru='каждый день, в 9:00';uk='щодня, в 9: 00'"), Расписание);
	
	// для изменения списка
	НапоминанияПользователяКлиентСерверПереопределяемый.ПриПолученииСтандартныхРасписанийДляНапоминания(Результат);
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив текстовых представлений стандартных интервалов времени
Функция ПолучитьСтандартныеИнтервалыОповещения() Экспорт
	
	Результат = Новый Массив;
	
	ИнтервалыВремени = Новый Структура("_5м,_10м,_15м,_30м,_1ч,_2ч,_4ч,_8ч,_1д,_2д,_3д,_1н,_2н");
	Для Каждого Интервал Из ИнтервалыВремени Цикл
    	Результат.Добавить(ОформитьВремя(Интервал.Ключ));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает текстовое представление интервала времени, заданного в секундах
//
// Параметры
//
//  Время - Число - интервал времени в секундах.
//
//  ПолноеПредставление	- Булево - кратное или полное представление времени
//		Например, интервал 1 000 000 секунд:
//		- полное представление:  11 дней 13 часов 46 минут 40 секунд;
//		- краткое представление: 11 дней 13 часов.
//
// Возвращаемое значение:
//   Строка - представление интервала времени.
//
Функция ПредставлениеВремени(Знач Время, ПолноеПредставление = Истина, ВыводитьСекунды = Истина) Экспорт
	Результат = "";
	
	// представление единиц измерения времени в винительном падеже для количеств: 1, 2-4, 5-20
	ПредставлениеНедель	= НСтр("ru='неделю';uk='тиждень'")  + "," + НСтр("ru='недели';uk='тижня'")  + "," + НСтр("ru='недель';uk='тижнів'");
	ПредставлениеДней	= НСтр("ru='день';uk='день'")    + "," + НСтр("ru='дня';uk='дні'")     + "," + НСтр("ru='дней';uk='днів'");
	ПредставлениеЧасов	= НСтр("ru='час';uk='година'")     + "," + НСтр("ru='часа';uk='години'")    + "," + НСтр("ru = 'часов'; uk = 'годин'");
	ПредставлениеМинут	= НСтр("ru='минуту';uk='хвилину'")  + "," + НСтр("ru='минуты';uk='хвилини'")  + "," + НСтр("ru='минут';uk='хвилин'");
	ПредставлениеСекунд	= НСтр("ru='секунду';uk='секунду'") + "," + НСтр("ru='секунды';uk='секунди'") + "," + НСтр("ru='секунд';uk='секунд'");
	
	Время = Число(Время);
	
	Если Время < 0 Тогда
		Время = -Время;
	КонецЕсли;
	
	КоличествоНедель = Цел(Время / 60/60/24/7);
	КоличествоДней   = Цел(Время / 60/60/24);
	КоличествоЧасов  = Цел(Время / 60/60);
	КоличествоМинут  = Цел(Время / 60);
	КоличествоСекунд = Цел(Время);
	
	КоличествоСекунд = КоличествоСекунд - КоличествоМинут * 60;
	КоличествоМинут  = КоличествоМинут - КоличествоЧасов * 60;
	КоличествоЧасов  = КоличествоЧасов - КоличествоДней * 24;
	КоличествоДней   = КоличествоДней - КоличествоНедель * 7;
	
	Если Не ВыводитьСекунды Тогда
		КоличествоСекунд = 0;
	КонецЕсли;
	
	Если КоличествоНедель > 0 И КоличествоДней+КоличествоЧасов+КоличествоМинут+КоличествоСекунд=0 Тогда
		Результат = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(КоличествоНедель, ПредставлениеНедель);
	Иначе
		КоличествоДней = КоличествоДней + КоличествоНедель * 7;
		
		Счетчик = 0;
		Если КоличествоДней > 0 Тогда
			Результат = Результат + СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(КоличествоДней, ПредставлениеДней) + " ";
			Счетчик = Счетчик + 1;
		КонецЕсли;
		
		Если КоличествоЧасов > 0 Тогда
			Результат = Результат + СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(КоличествоЧасов, ПредставлениеЧасов) + " ";
			Счетчик = Счетчик + 1;
		КонецЕсли;
		
		Если (ПолноеПредставление или Счетчик < 2) и КоличествоМинут > 0 Тогда
			Результат = Результат + СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(КоличествоМинут, ПредставлениеМинут) + " ";
			Счетчик = Счетчик + 1;
		КонецЕсли;
		
		Если (ПолноеПредставление или Счетчик < 2) и (КоличествоСекунд > 0 или КоличествоНедель+КоличествоДней+КоличествоЧасов+КоличествоМинут = 0) Тогда
			Результат = Результат + СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(КоличествоСекунд, ПредставлениеСекунд);
		КонецЕсли;
		
	КонецЕсли;
			  
	Возврат СокрП(Результат);
	
КонецФункции // ПредставлениеВремени()

// Получает из текстового описания интервал времени в секундах.
//
// Параметры
//  СтрокаСоВременем - Строка - текстовое описание времени, где числа записаны цифрами,
//								а единицы измерения - строкой. 
//
// Возвращаемое значение
//  Число - интервал времени в секундах.
Функция ПолучитьИнтервалВремениИзСтроки(Знач СтрокаСоВременем) Экспорт
	
	Результат = 0;
	Если Не ПустаяСтрока(СтрокаСоВременем) Тогда
		СтрокаСоВременем = НРег(СтрокаСоВременем);
		
		СтрокаСоВременем = СтрЗаменить(СтрокаСоВременем, Символы.НПП," ");
		СтрокаСоВременем = СтрЗаменить(СтрокаСоВременем, ".",",");
		СтрокаСоВременем = СтрЗаменить(СтрокаСоВременем, "+","");
		
		ПодстрокаСЦифрами = "";
		ПодстрокаСБуквами = "";
		СтрокаДляВычисления = "0";
		
		ПредыдущийСимволЭтоЦифра = Ложь;
		ЕстьДробнаяЧасть = Ложь;
		ЕстьЕдиницаИзмерения = Ложь;
		
		Для Позиция = 1 По СтрДлина(СтрокаСоВременем) Цикл
			ТекущийКодСимвола = КодСимвола(СтрокаСоВременем,Позиция);
			Символ = Сред(СтрокаСоВременем,Позиция,1);
			Если (ТекущийКодСимвола >= КодСимвола("0") и ТекущийКодСимвола <= КодСимвола("9"))
				ИЛИ (Символ="," и ПредыдущийСимволЭтоЦифра и не ЕстьДробнаяЧасть) Тогда
				Если Не ПустаяСтрока(ПодстрокаСБуквами) Тогда
					СтрокаДляВычисления = СтрокаДляВычисления 
										+ "+"
										+ ?(ПустаяСтрока(ПодстрокаСЦифрами),"1",ПодстрокаСЦифрами)
										+ "*"
										+ ЗаменитьЕдиницуИзмеренияНаМножитель(ПодстрокаСБуквами);
					ПодстрокаСЦифрами = "";
					ПодстрокаСБуквами = "";
					
					ПредыдущийСимволЭтоЦифра = Ложь;
					ЕстьДробнаяЧасть = Ложь;
					ЕстьЕдиницаИзмерения = Ложь;
				КонецЕсли;
				
				ПодстрокаСЦифрами = ПодстрокаСЦифрами + Сред(СтрокаСоВременем,Позиция,1);
				
				ПредыдущийСимволЭтоЦифра = Истина;
				Если Символ = "," Тогда
					ЕстьДробнаяЧасть = Истина;
				КонецЕсли;
			Иначе
				Если Символ = " " и ЗаменитьЕдиницуИзмеренияНаМножитель(ПодстрокаСБуквами)="0" Тогда
					ПодстрокаСБуквами = "";
				КонецЕсли;
				
				ПодстрокаСБуквами = ПодстрокаСБуквами + Сред(СтрокаСоВременем,Позиция,1);
				ПредыдущийСимволЭтоЦифра = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ПустаяСтрока(ПодстрокаСБуквами) Тогда
				СтрокаДляВычисления = СтрокаДляВычисления 
									+ "+"
									+ ?(ПустаяСтрока(ПодстрокаСЦифрами),"1",ПодстрокаСЦифрами)
									+ "*"
									+ ЗаменитьЕдиницуИзмеренияНаМножитель(ПодстрокаСБуквами);
		КонецЕсли;

		СтрокаДляВычисления = СтрЗаменить(СтрокаДляВычисления,",",".");
		Результат = Вычислить(СтрокаДляВычисления);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьИнтервалВремениИзСтроки()

// Анализирует слово на предмет соответствия единице времени и, если соответствие установлено,
// возвращает количество секунд, содержащееся в единице времени.
//
// Параметры
//  Единица - Строка - анализируемое слово
//
// Возвращаемое значение
//  Число - количество секунд в Единице. Если единица не определена или пустая, то возвращается 0.
Функция ЗаменитьЕдиницуИзмеренияНаМножитель(Знач Единица)
	
	Результат = 0;
	
	Единица = СтрЗаменить(Единица, " ","");
	Единица = СтрЗаменить(Единица, ",","");
	Единица = СтрЗаменить(Единица, ".","");
	
	// единицу измерения времени будем определять по первым трём символам
	ПервыеТриСимвола = Лев(Единица,3);
	Если ПервыеТриСимвола = НСтр("ru='нед';uk='Тиж'") или ПервыеТриСимвола = НСтр("ru='н';uk='н'") Тогда
		Результат = 60*60*24*7;
	ИначеЕсли ПервыеТриСимвола = НСтр("ru='ден';uk='ден'") 
		  или ПервыеТриСимвола = НСтр("ru='дне';uk='дні'")
		  или ПервыеТриСимвола = НСтр("ru='дня';uk='дні'")
		  или ПервыеТриСимвола = НСтр("ru='дн';uk='дн'")
		  или ПервыеТриСимвола = НСтр("ru='д';uk='д'") Тогда
		Результат = 60*60*24;
	ИначеЕсли ПервыеТриСимвола = НСтр("ru='час';uk='година'") или ПервыеТриСимвола = НСтр("ru='г';uk='г'") Тогда
		Результат = 60*60;
	ИначеЕсли ПервыеТриСимвола = НСтр("ru='мин';uk='хв'") или ПервыеТриСимвола = НСтр("ru='м';uk='м'") Тогда
		Результат = 60;
	ИначеЕсли ПервыеТриСимвола = НСтр("ru='сек';uk='сек'") или ПервыеТриСимвола = НСтр("ru='с';uk='з'") Тогда
		Результат = 1;
	КонецЕсли;
	
	Возврат Формат(Результат,"ЧН=0; ЧГ=0");
	
КонецФункции

// Получает из строки интервал времени и возвращает его текстовое представление
//
// Параметры
//  ВремяСтрокой - Строка - текстовое описание времени, где числа записаны цифрами,
//							а единицы измерения - строкой
//
// Возвращаемое значение
//  Строка - оформленное представление времени
Функция ОформитьВремя(ВремяСтрокой) Экспорт
	Возврат ПредставлениеВремени(ПолучитьИнтервалВремениИзСтроки(ВремяСтрокой));
КонецФункции

// Возвращает структуру напоминания с заполненными значениями.
//
// Параметры
//  ДанныеДляЗаполнения - Структура - значения для заполнения параметров напоминания
//  ВсеРеквизиты - Булево - если истина, то возвращает также реквизиты, связанные с настройкой
//                          времени напоминания
Функция ПолучитьСтруктуруНапоминания(ДанныеДляЗаполнения = Неопределено, ВсеРеквизиты = Ложь) Экспорт
	Результат = Новый Структура("Пользователь,ВремяСобытия,Источник,СрокНапоминания,Описание");
	Если ВсеРеквизиты Тогда 
		Результат.Вставить("СпособУстановкиВремениНапоминания");
		Результат.Вставить("ИнтервалВремениНапоминания");
		Результат.Вставить("ИмяРеквизитаИсточника");
		Результат.Вставить("Расписание");
	КонецЕсли;
	Если ДанныеДляЗаполнения <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, ДанныеДляЗаполнения);
	КонецЕсли;
	Возврат Результат;
КонецФункции
