///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ, ВЫЗЫВАЕМЫЕ ПРИ ОБНОВЛЕНИИ ИНФОРМАЦИОННОЙ БАЗЫ.
Процедура ЗаполнитьПредопределенныеВидыУслуг() Экспорт
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Справочники.ВидыУслуг.СДПТ,
		Новый Структура("ЕдиницаИзмерения",
			Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("055")));

	Соответствие.Вставить(Справочники.ВидыУслуг.ГорячаяВода,
		Новый Структура("ЕдиницаИзмерения",
			Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("113")));
			
	Соответствие.Вставить(Справочники.ВидыУслуг.ХолоднаяВода,
		Новый Структура("ЕдиницаИзмерения",
			Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("113")));
			
	Соответствие.Вставить(Справочники.ВидыУслуг.Газ,
		Новый Структура("ЕдиницаИзмерения",
			Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("113")));
			
	Соответствие.Вставить(Справочники.ВидыУслуг.Газ,
		Новый Структура("ЕдиницаИзмерения",
			Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("113")));
			
	Соответствие.Вставить(Справочники.ВидыУслуг.Отопление,
		Новый Структура("ЕдиницаИзмерения",
			Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("055")));
			
	Соответствие.Вставить(Справочники.ВидыУслуг.Водоотведение,
		Новый Структура("ЕдиницаИзмерения",
			Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("113")));
			
	Соответствие.Вставить(Справочники.ВидыУслуг.ВывозТБО,
		Новый Структура("ЕдиницаИзмерения",
			Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("113")));
			
	Соответствие.Вставить(Справочники.ВидыУслуг.Паркинг,
		Новый Структура("ЕдиницаИзмерения",
			Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("055")));
			
	Для Каждого Элемент Из Соответствие Цикл
	
		ВидУслугиОбъект = Элемент.Ключ.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВидУслугиОбъект, Элемент.Значение);
		Попытка
			ВидУслугиОбъект.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
