
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	МАКСИМУМ(ЕСТЬNULL(ВидыУслуг.ПолеСортировки, 0)) КАК ПолеСортировки
			|ИЗ
			|	Справочник.ВидыУслуг КАК ВидыУслуг";
			
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезультатЗапроса.Следующий() Тогда
			
			ПолеСортировки = РезультатЗапроса.ПолеСортировки + 1;	
			
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры
