
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуЛицевыеСчета(ДокументСсылкаИзменениеЛицевогоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаИзменениеЛицевогоСчета.Период,
		|	ВременнаяТаблицаИзменениеЛицевогоСчета.Лицевойсчет,
		|	ВременнаяТаблицаИзменениеЛицевогоСчета.Действует,
		|	ВременнаяТаблицаИзменениеЛицевогоСчета.КоличествоПрописанных,
		|	ВременнаяТаблицаИзменениеЛицевогоСчета.КоличествоПроживающих
		|ИЗ
		|	ВременнаяТаблицаИзменениеЛицевогоСчета КАК ВременнаяТаблицаИзменениеЛицевогоСчета
		|ГДЕ
		|	(ВременнаяТаблицаИзменениеЛицевогоСчета.КоличествоПрописанных <> ВременнаяТаблицаИзменениеЛицевогоСчета.КоличествоПрописанныхПред
		|			ИЛИ ВременнаяТаблицаИзменениеЛицевогоСчета.КоличествоПроживающих <> ВременнаяТаблицаИзменениеЛицевогоСчета.КоличествоПроживающихПред)
		|	И ВременнаяТаблицаИзменениеЛицевогоСчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеДанныхОПотребителяхУслуг)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЛицевыеСчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуЛицевыеСчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуОтветственныйВладелецЛицевогоСчета(ДокументСсылкаИзменениеЛицевогоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаИзменениеЛицевогоСчета.Период,
		|	ВременнаяТаблицаИзменениеЛицевогоСчета.Лицевойсчет,
		|	ВременнаяТаблицаИзменениеЛицевогоСчета.ОтветственныйВладелец
		|ИЗ
		|	ВременнаяТаблицаИзменениеЛицевогоСчета КАК ВременнаяТаблицаИзменениеЛицевогоСчета
		|ГДЕ
		|	ВременнаяТаблицаИзменениеЛицевогоСчета.ОтветственныйВладелец <> ЗНАЧЕНИЕ(Справочник.ПотребителиУслуг.ПустаяСсылка)
		|	И ВременнаяТаблицаИзменениеЛицевогоСчета.ОтветственныйВладелец <> ВременнаяТаблицаИзменениеЛицевогоСчета.ОтветственныйВладелецПред
		|	И ВременнаяТаблицаИзменениеЛицевогоСчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеОтветственногоВладельца)";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтветственныйВладелецЛицевогоСчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуОтветственныйВладелецЛицевогоСчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуМашиноМеста(ДокументСсылкаИзменениеЛицевогоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаМашиноМеста.Период КАК Период,
		|	ВременнаяТаблицаМашиноМеста.Лицевойсчет,
		|	ВременнаяТаблицаМашиноМеста.ВидМашиноМеста,
		|	ВременнаяТаблицаМашиноМеста.НомерМашиноМеста,
		|	ВременнаяТаблицаМашиноМеста.КоличествоМашиноМест
		|ИЗ
		|	ВременнаяТаблицаМашиноМеста КАК ВременнаяТаблицаМашиноМеста
		|ГДЕ
		|	(ВременнаяТаблицаМашиноМеста.НомерМашиноМеста <> ВременнаяТаблицаМашиноМеста.НомерМашиноМестаПред
		|			ИЛИ ВременнаяТаблицаМашиноМеста.КоличествоМашиноМест <> ВременнаяТаблицаМашиноМеста.КоличествоМашиноМестПред)
		|	И ВременнаяТаблицаМашиноМеста.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеМашиноМест)";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаМашиноМеста", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуМашиноМеста()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуДополнительныеРеквизитыЛицевогоСчета(ДокументСсылкаИзменениеЛицевогоСчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаДопРеквизитов.Период КАК Период,
		|	ВременнаяТаблицаДопРеквизитов.Лицевойсчет КАК Лицевойсчет,
		|	СУММА(ВременнаяТаблицаДопРеквизитов.Значение) КАК Значение,
		|	СУММА(ВременнаяТаблицаДопРеквизитов.ЗначениеПред) КАК ЗначениеПред,
		|	ВременнаяТаблицаДопРеквизитов.ДополнительныйРеквизит КАК ДополнительныйРеквизит
		|ИЗ
		|	ВременнаяТаблицаДопРеквизитов КАК ВременнаяТаблицаДопРеквизитов
		|ГДЕ
		|	ВременнаяТаблицаДопРеквизитов.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеДополнительныхРеквизитов)
		|	И ВременнаяТаблицаДопРеквизитов.ЗначениеПред <> ВременнаяТаблицаДопРеквизитов.Значение
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаДопРеквизитов.Период,
		|	ВременнаяТаблицаДопРеквизитов.Лицевойсчет,
		|	ВременнаяТаблицаДопРеквизитов.ДополнительныйРеквизит";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДополнительныеРеквизитыЛицевогоСчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуМашиноМеста()


// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаИзменениеЛицевогоСчета, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец, ЗНАЧЕНИЕ(Справочник.ПотребителиУслуг.ПустаяСсылка)) КАК ОтветственныйВладелецПред,
		|	ЕСТЬNULL(ЛицевыеСчетаСрезПоследних.Действует, ЛОЖЬ) КАК Действует,
		|	ЕСТЬNULL(ЛицевыеСчетаСрезПоследних.КоличествоПрописанных, 0) КАК КоличествоПрописанныхПред,
		|	ЕСТЬNULL(ЛицевыеСчетаСрезПоследних.КоличествоПроживающих, 0) КАК КоличествоПроживающихПред,
		|	ИзменениеЛицевогоСчета.Дата КАК Период,
		|	ИзменениеЛицевогоСчета.ОтветственныйВладелец КАК ОтветственныйВладелец,
		|	ИзменениеЛицевогоСчета.КоличествоПрописанных КАК КоличествоПрописанных,
		|	ИзменениеЛицевогоСчета.КоличествоПроживающих КАК КоличествоПроживающих,
		|	ИзменениеЛицевогоСчета.ЛицевойСчет КАК ЛицевойСчет,
		|	ИзменениеЛицевогоСчета.ВидОперации КАК ВидОперации
		|ПОМЕСТИТЬ ВременнаяТаблицаИзменениеЛицевогоСчета
		|ИЗ
		|	Документ.ИзменениеЛицевогоСчета КАК ИзменениеЛицевогоСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&ПериодПред, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО ИзменениеЛицевогоСчета.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчета.СрезПоследних(&МоментВремени, ЛицевойСчет = &ЛицевойСчет) КАК ЛицевыеСчетаСрезПоследних
		|		ПО ИзменениеЛицевогоСчета.ЛицевойСчет = ЛицевыеСчетаСрезПоследних.ЛицевойСчет
		|ГДЕ
		|	ИзменениеЛицевогоСчета.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(МашиноМестаПред.ЛицевойСчет, ЗНАЧЕНИЕ(Справочник.ЛицевыеСчета.ПустаяСсылка)) КАК ЛицевойСчетПред,
		|	ЕСТЬNULL(МашиноМестаПред.ВидМашиноМеста, ЗНАЧЕНИЕ(Справочник.ВидыМашиноМест.ПустаяСсылка)) КАК ВидМашиноМестаПред,
		|	ЕСТЬNULL(МашиноМестаПред.НомерМашиноМеста, """") КАК НомерМашиноМестаПред,
		|	ЕСТЬNULL(МашиноМестаПред.КоличествоМашиноМест, 0) КАК КоличествоМашиноМестПред,
		|	ЕСТЬNULL(МашиноМеста.ЛицевойСчет, &ЛицевойСчет) КАК ЛицевойСчет,
		|	ЕСТЬNULL(МашиноМеста.Дата, &Период) КАК Период,
		|	ЕСТЬNULL(МашиноМеста.ВидОперации, &ВидОперации) КАК ВидОперации,
		|	ЕСТЬNULL(МашиноМеста.ВидМашиноМеста, МашиноМестаПред.ВидМашиноМеста) КАК ВидМашиноМеста,
		|	ЕСТЬNULL(МашиноМеста.НомерМашиноМеста, """") КАК НомерМашиноМеста,
		|	ЕСТЬNULL(МашиноМеста.КоличествоМашиноМест, 0) КАК КоличествоМашиноМест
		|ПОМЕСТИТЬ ВременнаяТаблицаМашиноМеста
		|ИЗ
		|	(ВЫБРАТЬ
		|		ИзменениеЛицевогоСчетаМашиноМеста.Ссылка.ЛицевойСчет КАК ЛицевойСчет,
		|		ИзменениеЛицевогоСчетаМашиноМеста.Ссылка.Дата КАК Дата,
		|		ИзменениеЛицевогоСчетаМашиноМеста.Ссылка.ВидОперации КАК ВидОперации,
		|		ИзменениеЛицевогоСчетаМашиноМеста.ВидМашиноМеста КАК ВидМашиноМеста,
		|		ИзменениеЛицевогоСчетаМашиноМеста.НомерМашиноМеста КАК НомерМашиноМеста,
		|		ИзменениеЛицевогоСчетаМашиноМеста.КоличествоМашиноМест КАК КоличествоМашиноМест
		|	ИЗ
		|		Документ.ИзменениеЛицевогоСчета.МашиноМеста КАК ИзменениеЛицевогоСчетаМашиноМеста
		|	ГДЕ
		|		ИзменениеЛицевогоСчетаМашиноМеста.Ссылка = &Ссылка) КАК МашиноМеста
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МашиноМестаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|			МашиноМестаСрезПоследних.ВидМашиноМеста КАК ВидМашиноМеста,
		|			МашиноМестаСрезПоследних.НомерМашиноМеста КАК НомерМашиноМеста,
		|			МашиноМестаСрезПоследних.КоличествоМашиноМест КАК КоличествоМашиноМест
		|		ИЗ
		|			РегистрСведений.МашиноМеста.СрезПоследних(&МоментВремени, ЛицевойСчет = &ЛицевойСчет) КАК МашиноМестаСрезПоследних
		|		ГДЕ
		|			ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеМашиноМест) = &ВидОперации) КАК МашиноМестаПред
		|		ПО МашиноМеста.ЛицевойСчет = МашиноМестаПред.ЛицевойСчет
		|			И МашиноМеста.ВидМашиноМеста = МашиноМестаПред.ВидМашиноМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ДополнительныеРеквизитыПред.ЛицевойСчет, ЗНАЧЕНИЕ(Справочник.ЛицевыеСчета.ПустаяСсылка)) КАК ЛицевойСчетПред,
		|	ЕСТЬNULL(ДополнительныеРеквизитыПред.ДополнительныйРеквизит, ЗНАЧЕНИЕ(Справочник.ДополнительныеРеквизитыЛицевыхСчетов.ПустаяСсылка)) КАК ДополнительныйРеквизитПред,
		|	ЕСТЬNULL(ДополнительныеРеквизитыПред.Значение, 0) КАК ЗначениеПред,
		|	ЕСТЬNULL(ДополнительныеРеквизиты.ЛицевойСчет, &ЛицевойСчет) КАК ЛицевойСчет,
		|	ЕСТЬNULL(ДополнительныеРеквизиты.Дата, &Период) КАК Период,
		|	ЕСТЬNULL(ДополнительныеРеквизиты.ВидОперации, &ВидОперации) КАК ВидОперации,
		|	ЕСТЬNULL(ДополнительныеРеквизиты.ДополнительныйРеквизит, ДополнительныеРеквизитыПред.ДополнительныйРеквизит) КАК ДополнительныйРеквизит,
		|	ЕСТЬNULL(ДополнительныеРеквизиты.Значение, 0) КАК Значение
		|ПОМЕСТИТЬ ВременнаяТаблицаДопРеквизитов
		|ИЗ
		|	(ВЫБРАТЬ
		|		ИзменениеЛицевогоСчетаДополнительныеРеквизиты.Ссылка.ЛицевойСчет КАК ЛицевойСчет,
		|		ИзменениеЛицевогоСчетаДополнительныеРеквизиты.Ссылка.Дата КАК Дата,
		|		ИзменениеЛицевогоСчетаДополнительныеРеквизиты.Ссылка.ВидОперации КАК ВидОперации,
		|		ИзменениеЛицевогоСчетаДополнительныеРеквизиты.ДополнительныйРеквизит КАК ДополнительныйРеквизит,
		|		ИзменениеЛицевогоСчетаДополнительныеРеквизиты.Значение КАК Значение
		|	ИЗ
		|		Документ.ИзменениеЛицевогоСчета.ДополнительныеРеквизиты КАК ИзменениеЛицевогоСчетаДополнительныеРеквизиты
		|	ГДЕ
		|		ИзменениеЛицевогоСчетаДополнительныеРеквизиты.Ссылка = &Ссылка) КАК ДополнительныеРеквизиты
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДополнительныеРеквизитыСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|			ДополнительныеРеквизитыСрезПоследних.ДополнительныйРеквизит КАК ДополнительныйРеквизит,
		|			ДополнительныеРеквизитыСрезПоследних.Значение КАК Значение
		|		ИЗ
		|			РегистрСведений.ДополнительныеРеквизитыЛицевогоСчета.СрезПоследних(&МоментВремени, ЛицевойСчет = &ЛицевойСчет) КАК ДополнительныеРеквизитыСрезПоследних
		|		ГДЕ
		|			ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеДополнительныхРеквизитов) = &ВидОперации) КАК ДополнительныеРеквизитыПред
		|		ПО ДополнительныеРеквизиты.ЛицевойСчет = ДополнительныеРеквизитыПред.ЛицевойСчет";
		
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаИзменениеЛицевогоСчета);
	Запрос.УстановитьПараметр("ПериодПред", ДокументСсылкаИзменениеЛицевогоСчета.Дата - (24*60*60));
	Запрос.УстановитьПараметр("ЛицевойСчет", ДокументСсылкаИзменениеЛицевогоСчета.ЛицевойСчет);
	Запрос.УстановитьПараметр("Период", ДокументСсылкаИзменениеЛицевогоСчета.Дата);
	Запрос.УстановитьПараметр("ВидОперации", ДокументСсылкаИзменениеЛицевогоСчета.ВидОперации);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ДокументСсылкаИзменениеЛицевогоСчета.МоментВремени(), ВидГраницы.Исключая));
	
	Результат = Запрос.ВыполнитьПакет();
	
	СформироватьТаблицуЛицевыеСчета(ДокументСсылкаИзменениеЛицевогоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицуОтветственныйВладелецЛицевогоСчета(ДокументСсылкаИзменениеЛицевогоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицуМашиноМеста(ДокументСсылкаИзменениеЛицевогоСчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицуДополнительныеРеквизитыЛицевогоСчета(ДокументСсылкаИзменениеЛицевогоСчета, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

