
Процедура ОбработкаПроведения(Отказ, Режим)
		
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.АктСверки.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ПроведениеСервер.ОтразитьРасчетыПоЛицевымСчетам(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьРасшифровкаНачисленияЛьгот(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьВзаиморасчетыПоСубсидиям(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьВзаиморасчетыПоЛьготам(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьГарантированныеНачисленияСубсидий(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
	// регістр ПоказанияПриборовУчета
	Движения.ПоказанияПриборовУчета.Записывать = Истина;
	Для Каждого ТекСтрокаКорректировки Из Корректировки Цикл
		Если ЗначениеЗаполнено(ТекСтрокаКорректировки.ПриборУчета) Тогда
			Движение = Движения.ПоказанияПриборовУчета.Добавить();
			Движение.Период = Дата;  // КонецМесяца(ПериодНачисления);
			Движение.ПриборУчета = ТекСтрокаКорректировки.ПриборУчета;
			Движение.ВидТарифа = ТекСтрокаКорректировки.ВидТарифа;
			Движение.Значение = ТекСтрокаКорректировки.ПоказаниеНовое;
		КонецЕсли;
	КонецЦикла;

	// регістр РасчетыПоЛицевымСчетам Приход
	//Движения.РасчетыПоЛицевымСчетам.Записывать = Истина;
	//Для Каждого ТекСтрокаКорректировки Из Корректировки Цикл
	//	Движение = Движения.РасчетыПоЛицевымСчетам.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Организация = Организация;
	//	Движение.ЛицевойСчет = ЛицевойСчет;
	//	Движение.Услуга = ТекСтрокаКорректировки.Услуга;
	//	Движение.МесяцНачисления = ПериодНачисления;
	//	Движение.Сумма = ТекСтрокаКорректировки.СуммаКорректировки;
	//	Движение.ВидНачисления = ТекСтрокаКорректировки.ВидНачисления;
	//	//Движение.ВидТарифа = ТекСтрокаКорректировки.ВидТарифа;
	//КонецЦикла;

	// регістр ПоказанияПриборовЗаМесяц
	Движения.ПоказанияПриборовЗаМесяц.Записывать = Истина;
	Для Каждого ТекСтрокаКорректировки Из Корректировки Цикл
		Если ЗначениеЗаполнено(ТекСтрокаКорректировки.ПриборУчета) Тогда
			Движение = Движения.ПоказанияПриборовЗаМесяц.Добавить();
			Движение.Период = Дата;
			Движение.ПриборУчета = ТекСтрокаКорректировки.ПриборУчета;
			Движение.ЛицевойСчет = ЛицевойСчет;
			Движение.Здание = Здание;
			Движение.ОбъектЛицевогоСчета = ОбъектЛицевогоСчета;
			Движение.ОтветственныйВладелец = Потребитель;
			Движение.ВидТарифа = ТекСтрокаКорректировки.ВидТарифа;
			Движение.Услуга = ТекСтрокаКорректировки.Услуга;
			Движение.ПоказаниеПредыдущее = ТекСтрокаКорректировки.Показание;
			Движение.Показание = ТекСтрокаКорректировки.ПоказаниеНовое;
			Движение.Разница = ТекСтрокаКорректировки.Разница;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДатыЗапретаИзменения.ДатаЗапрета
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Раздел = ЗНАЧЕНИЕ(ПланВидовХарактеристик.РазделыДатЗапретаИзменения.Здания)
	|	И ДатыЗапретаИзменения.Объект = &Здание";
	
	Запрос.УстановитьПараметр("Здание", Здание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаЗакрытия = Выборка.ДатаЗапрета;
	Иначе
		ДатаЗакрытия = КонецМесяца(ТекущаяДата());
	КонецЕсли;
	
	СуммаДокумента = Корректировки.Итог("СуммаКорректировки");
	
	Для каждого СтрокаЛицевыеСчета из Корректировки Цикл
		
		Если КонецМесяца(ПериодНачисления) > КонецМесяца(ДатаЗакрытия) Тогда
		
			Поле = "ЛицевыеСчета[" + (СтрокаЛицевыеСчета.НомерСтроки - 1) + "].ПериодКорректировки";
			ТекстСообщения = НСтр("ru='Невозможно внестие корректировки в незакрытом месяце';uk='Неможливо внести коригування в незакритому місяці'"); 
			
			ОСМДСервер.СообщитьОбОшибке(ТекстСообщения, ЭтотОбъект, Отказ, Поле);
		КонецЕсли;
			
	КонецЦикла;
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для каждого СтрокаЛицевыеСчета из Корректировки Цикл
		
		Если СтрокаЛицевыеСчета.ВидНачисления = Перечисления.ВидыНачислений.Льгота Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаЛицевыеСчета.Льгота) Тогда
			
				Поле = "ЛицевыеСчета[" + (СтрокаЛицевыеСчета.НомерСтроки - 1) + "].Льгота";
				ТекстСообщения = НСтр("ru='Не заполнен реквизит льгота.';uk='Не заповнен реквізит пільга.'");
				
				ОСМДСервер.СообщитьОбОшибке(ТекстСообщения, ЭтотОбъект, Отказ, Поле);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаЛицевыеСчета.Льготчик) Тогда
			
				Поле = "ЛицевыеСчета[" + (СтрокаЛицевыеСчета.НомерСтроки - 1) + "].Льготчик";
				ТекстСообщения = НСтр("ru='Не заполнен реквизит льготчик.';uk='Не заповнен реквізит пільговик.'");
				
				ОСМДСервер.СообщитьОбОшибке(ТекстСообщения, ЭтотОбъект, Отказ, Поле);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
КонецПроцедуры

