
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Справочники.Организации.НайтиПоКоду("000000001");
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЛицевойСчетПриИзмененииНаСервере(АдресЛицевыхСчетовВХранилище = Неопределено,ИндивидуальныйВвод = ложь)
	Объект.Здание = Объект.ЛицевойСчет.Владелец;
	Объект.Организация = Объект.Здание.Владелец;
	
	Объект.ПоказанияПриборов.Очистить();
	
	Запрос = Новый Запрос;
	Если АдресЛицевыхСчетовВХранилище <> Неопределено Тогда
		ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
		МассивОбъектовУстановки = ТаблицаДляЗагрузки.ВыгрузитьКолонку("ЛицевойСчет");
		
		ТекстЗапросаДоб = "	И УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки В(&МассивОбъектовУстановки)";
		Запрос.УстановитьПараметр("МассивОбъектовУстановки", МассивОбъектовУстановки);
	ИначеЕсли ИндивидуальныйВвод Тогда
		МассивОбъектовУстановки = Новый Массив;
		МассивОбъектовУстановки.Добавить(Объект.ЛицевойСчет);
		
		ТекстЗапросаДоб = "	И УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки В(&МассивОбъектовУстановки)";
		Запрос.УстановитьПараметр("МассивОбъектовУстановки", МассивОбъектовУстановки);
	Иначе
		ТекстЗапросаДоб = "";
	КонецЕсли;	

	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки КАК ЛицевойСчет,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета КАК Квартира,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета.Владелец КАК Здание,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Коэффициент КАК Коэффициент,
		|	ЕСТЬNULL(УслугиВидыТарифов.ВидТарифа, ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Общий)) КАК ВидТарифа,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	АктСнятияПоказанийХолоднойВодыСрезПоследних.ПоказаниеТекущее
		|ИЗ
		|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&ДатаСреза, ) КАК УстановленныеПриборыУчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Услуги.ВидыТарифов КАК УслугиВидыТарифов
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга = УслугиВидыТарифов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктСнятияПоказанийХолоднойВоды.СрезПоследних КАК АктСнятияПоказанийХолоднойВодыСрезПоследних
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = АктСнятияПоказанийХолоднойВодыСрезПоследних.ПриборУчета
		|ГДЕ
		|	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
		|	И УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга.ВидУслуги = &ВидУслуги" + ТекстЗапросаДоб + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	АктСнятияПоказанийХолоднойВодыСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаСреза", Новый Граница(Объект.ПериодНачисления, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВидУслуги", Справочники.ВидыУслуг.ХолоднаяВода);	

	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_Заполнения = Новый ТаблицаЗначений;
	ТЗ_Заполнения.Колонки.Добавить("ЛицевойСчет");
	ТЗ_Заполнения.Колонки.Добавить("ОтветственныйВладелец");
	ТЗ_Заполнения.Колонки.Добавить("Квартира");
	ТЗ_Заполнения.Колонки.Добавить("ПриборУчета");
	ТЗ_Заполнения.Колонки.Добавить("ЕдиницаИзмерения");
	ТЗ_Заполнения.Колонки.Добавить("ВидТарифа");
	ТЗ_Заполнения.Колонки.Добавить("Коэффициент");
	ТЗ_Заполнения.Колонки.Добавить("ПоказаниеПредыдущее");
	ТЗ_Заполнения.Колонки.Добавить("ПоказаниеТекущее");
	ТЗ_Заполнения.Колонки.Добавить("РазницаПоказания");
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока = ТЗ_Заполнения.Добавить();
		НовСтрока.ЛицевойСчет = Выборка.ЛицевойСчет;
		НовСтрока.ОтветственныйВладелец = Выборка.ОтветственныйВладелец;
		НовСтрока.Квартира = Выборка.Квартира;
		НовСтрока.ПриборУчета = Выборка.ПриборУчета;
		НовСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
		НовСтрока.ВидТарифа = Выборка.ВидТарифа;
		НовСтрока.Коэффициент = Выборка.Коэффициент;
		НовСтрока.ПоказаниеПредыдущее = Выборка.ПоказаниеТекущее;
	КонецЦикла;
	Объект.ПоказанияПриборов.Загрузить(ТЗ_Заполнения);
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	ЛицевойСчетПриИзмененииНаСервере(,?(ЗначениеЗаполнено(Объект.ЛицевойСчет),Истина,ЛОЖЬ));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовПоказаниеТекущееПриИзменении(Элемент)
	ТекДанные = Элементы.ПоказанияПриборов.ТекущиеДанные;
	ТекДанные.РазницаПоказания = ТекДанные.ПоказаниеТекущее - ТекДанные.ПоказаниеПредыдущее;
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовПриборУчетаПриИзменении(Элемент)
	ТекСтрока                     = Элементы.ПоказанияПриборов.ТекущиеДанные;
	ТекСтрока.ЕдиницаИзмерения    = ОбщийМодульМВК.ЕдиницаИзмПриборУчета(ТекСтрока.ПриборУчета);
	ТекСтрока.Коэффициент         = ОбщийМодульМВК.Коэффициент(ТекСтрока.ПриборУчета);
	ТекСтрока.ВидТарифа           = ОбщийМодульМВК.ВидТарифа();
	ДанныеПоСчетчику              = РасчетУслугПоТЕиГВ.ПолучитьПоказанияПрибораУчетаПоХВ(ТекСтрока.ПриборУчета, Объект.ПериодНачисления);
	Если ЗначениеЗаполнено(ДанныеПоСчетчику) Тогда
		ТекСтрока.ПоказаниеПредыдущее = ДанныеПоСчетчику.ПоказаниеПредыдущее;
	КонецЕсли;
КонецПроцедуры
