// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРасчетыПоЛицевымСчетам(ДокументСсылкаПерерасчетПоЛС, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Перерасчет.Организация КАК Организация,
		|	Перерасчет.ЛицевойСчет,
		|	Перерасчет.Услуга,
		|	Перерасчет.МесяцНачисления,
		|	Перерасчет.Сумма КАК Сумма,
		|	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток,
		|	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) + ЕСТЬNULL(Перерасчет.Сумма, 0) КАК СуммаАванс,
		|	Перерасчет.Период
		|ПОМЕСТИТЬ ВременнаяТаблицаАвансы
		|ИЗ
		|	ВременнаяТаблицаПерерасчет КАК Перерасчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(&Период, ) КАК РасчетыПоЛицевымСчетамОстатки
		|		ПО Перерасчет.Организация = РасчетыПоЛицевымСчетамОстатки.Организация
		|			И Перерасчет.ЛицевойСчет = РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет
		|			И Перерасчет.Услуга = РасчетыПоЛицевымСчетамОстатки.Услуга
		|			И Перерасчет.МесяцНачисления = РасчетыПоЛицевымСчетамОстатки.МесяцНачисления
		|ГДЕ
		|	Перерасчет.Сумма < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаАвансы.Организация КАК Организация,
		|	ВременнаяТаблицаАвансы.ЛицевойСчет КАК ЛицевойСчет,
		|	ВременнаяТаблицаАвансы.Услуга КАК Услуга,
		|	ВременнаяТаблицаАвансы.МесяцНачисления КАК МесяцНачисления,
		|	ВременнаяТаблицаАвансы.СуммаАванс КАК Сумма,
		|	ВременнаяТаблицаАвансы.Период КАК Период,
		|	NULL КАК ВидНачисления,
		|	NULL КАК ВидНачисленияПерерасчет
		|ИЗ
		|	ВременнаяТаблицаАвансы КАК ВременнаяТаблицаАвансы
		|ГДЕ
		|	ВременнаяТаблицаАвансы.СуммаАванс < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ВременнаяТаблицаАвансы.Организация,
		|	ВременнаяТаблицаАвансы.ЛицевойСчет,
		|	ВременнаяТаблицаАвансы.Услуга,
		|	NULL,
		|	-ВременнаяТаблицаАвансы.СуммаАванс,
		|	ВременнаяТаблицаАвансы.Период,
		|	NULL,
		|	NULL
		|ИЗ
		|	ВременнаяТаблицаАвансы КАК ВременнаяТаблицаАвансы
		|ГДЕ
		|	ВременнаяТаблицаАвансы.СуммаАванс < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ВременнаяТаблицаПерерасчет.Организация,
		|	ВременнаяТаблицаПерерасчет.ЛицевойСчет,
		|	ВременнаяТаблицаПерерасчет.Услуга,
		|	ВременнаяТаблицаПерерасчет.МесяцНачисления,
		|	ВременнаяТаблицаПерерасчет.Сумма,
		|	ВременнаяТаблицаПерерасчет.Период,
		|	ВременнаяТаблицаПерерасчет.ВидНачисления,
		|	ВременнаяТаблицаПерерасчет.ВидНачисленияПерерасчет
		|ИЗ
		|	ВременнаяТаблицаПерерасчет КАК ВременнаяТаблицаПерерасчет";
		
	Запрос.УстановитьПараметр("Период", ДокументСсылкаПерерасчетПоЛС.МоментВремени());
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЛицевымСчетам", РезультатЗапроса[1].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетыПоЛицевымСчетам()

Процедура СформироватьТаблицуРасчетыПоСубсидиям(ДокументСсылкаПерерасчетПоЛС, СтруктураДополнительныеСвойства)
	
	НазначенныеСубсидии = Новый ТаблицаЗначений;
	НазначенныеСубсидии.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("СправочникСсылка.ЛицевыеСчета"));
	НазначенныеСубсидии.Колонки.Добавить("Услуга",Новый ОписаниеТипов("СправочникСсылка.Услуги"));
	НазначенныеСубсидии.Колонки.Добавить("СуммаСубсидии",Новый ОписаниеТипов("Число"));
	НазначенныеСубсидии.Колонки.Добавить("МесяцНачисления",Новый ОписаниеТипов("Дата"));
	НазначенныеСубсидии.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));

	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Перерасчет.ЛицевойСчет,
	               |	НАЧАЛОПЕРИОДА(Перерасчет.МесяцНачисления, МЕСЯЦ) КАК МесяцНачисления
	               |ИЗ
	               |	ВременнаяТаблицаПерерасчет КАК Перерасчет
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(Перерасчет.МесяцНачисления, МЕСЯЦ),
	               |	Перерасчет.ЛицевойСчет";
		
	ТаблицаСубсидий = Запрос.Выполнить().Выгрузить();
	Для каждого СтрокаТаблицы Из ТаблицаСубсидий Цикл
	   	отбор = Новый Структура();
		Отбор.Вставить("ЛицевойСчет",СтрокаТаблицы.ЛицевойСчет);
		Субсидия = РегистрыСведений.НазначенныеСубсидии.СрезПоследних(СтрокаТаблицы.МесяцНачисления,отбор);
		Для каждого Стр  Из Субсидия Цикл
		    Если Стр.Действует Тогда
				НоваяСтр = НазначенныеСубсидии.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр,Стр);
				НоваяСтр.организация = ДокументСсылкаПерерасчетПоЛС.организация;
				НоваяСтр.месяцНачисления = СтрокаТаблицы.МесяцНачисления;
		    КонецЕсли;
		КонецЦикла; 
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Перерасчет.Организация КАК Организация,
		|	Перерасчет.ЛицевойСчет,
		|	Перерасчет.Услуга,
		|	Перерасчет.МесяцНачисления,
		|	Перерасчет.Сумма КАК Сумма,
		|	Перерасчет.Период,
		|	Перерасчет.СуммаТекущийРасчет,
		|	Перерасчет.СуммаНачислено КАК СуммаНачислено,
		|	Перерасчет.СуммаСубсидии,
		|	Перерасчет.Ссылка
		|ПОМЕСТИТЬ ВременнаяТаблицаДляСубсидий
		|ИЗ
		|	ВременнаяТаблицаПерерасчет КАК Перерасчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(РасчетыПоСубсидиямОстаткиИОбороты.СуммаПриход, 0) КАК Приход,
		|	ЕСТЬNULL(РасчетыПоСубсидиямОстаткиИОбороты.СуммаРасход, 0) КАК Расход,
		|	ЕСТЬNULL(РасчетыПоСубсидиямОстаткиИОбороты.СуммаКонечныйОстаток, 0) КАК Остаток,
		|	ВременнаяТаблицаАвансы.Организация,
		|	ВременнаяТаблицаАвансы.ЛицевойСчет,
		|	ВременнаяТаблицаАвансы.Услуга,
		|	ВременнаяТаблицаАвансы.МесяцНачисления,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаАвансы.Сумма < 0
		|			ТОГДА -ВременнаяТаблицаАвансы.Сумма
		|		ИНАЧЕ ВременнаяТаблицаАвансы.Сумма
		|	КОНЕЦ КАК Сумма,
		|	ВременнаяТаблицаАвансы.Период,
		|	ВременнаяТаблицаАвансы.СуммаТекущийРасчет,
		|	ВременнаяТаблицаАвансы.СуммаНачислено,
		|	ВременнаяТаблицаАвансы.СуммаСубсидии,
		|	РасчетыПоСубсидиямОстаткиИОбороты.Регистратор
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	ВременнаяТаблицаДляСубсидий КАК ВременнаяТаблицаАвансы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоСубсидиям.ОстаткиИОбороты(, , Регистратор, , ) КАК РасчетыПоСубсидиямОстаткиИОбороты
		|		ПО ВременнаяТаблицаАвансы.МесяцНачисления = РасчетыПоСубсидиямОстаткиИОбороты.МесяцНачисления
		|			И ВременнаяТаблицаАвансы.Услуга = РасчетыПоСубсидиямОстаткиИОбороты.Услуга
		|			И ВременнаяТаблицаАвансы.ЛицевойСчет = РасчетыПоСубсидиямОстаткиИОбороты.ЛицевойСчет
		|			И ВременнаяТаблицаАвансы.Ссылка <> РасчетыПоСубсидиямОстаткиИОбороты.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Организация,
		|	ВТ.ЛицевойСчет,
		|	ВТ.Услуга,
		|	ВТ.МесяцНачисления,
		|	ЕСТЬNULL(ВТ.Приход, 0) КАК КорректировкаПриход,
		|	ВТ.СуммаСубсидии КАК КорректировкаРасход,
		|	ВТ.Период,
		|	ВТ.Расход,
		|	ВТ.Регистратор
		|ПОМЕСТИТЬ ВТ_Субсидии
		|ИЗ
		|	ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСубсидий.Услуга,
		|	ТаблицаСубсидий.ЛицевойСчет,
		|	ТаблицаСубсидий.Организация,
		|	ТаблицаСубсидий.МесяцНачисления,
		|	ТаблицаСубсидий.СуммаСубсидии
		|ПОМЕСТИТЬ ВТ_Назначенныесубсидии
		|ИЗ
		|	&ТаблицаСубсидий КАК ТаблицаСубсидий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Субсидии.Организация,
		|	ВТ_Субсидии.ЛицевойСчет,
		|	ВТ_Субсидии.Услуга,
		|	ВТ_Субсидии.МесяцНачисления,
		|	ВТ_Субсидии.КорректировкаРасход - ВТ_Субсидии.Расход КАК Сумма,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВТ_Субсидии.Период,
		|	ВТ_Субсидии.Расход,
		|	ВТ_Субсидии.Регистратор
		|ИЗ
		|	ВТ_Субсидии КАК ВТ_Субсидии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Назначенныесубсидии.Услуга,
		|	ВТ_Назначенныесубсидии.ЛицевойСчет,
		|	ВТ_Назначенныесубсидии.Организация,
		|	ВТ_Назначенныесубсидии.МесяцНачисления,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	МАКСИМУМ(ВТ_Назначенныесубсидии.СуммаСубсидии - ЕСТЬNULL(ВложенныйЗапрос.СуммаПриход, 0)) КАК Сумма,
		|	ЕСТЬNULL(ВложенныйЗапрос.СуммаПриход, 0) КАК СуммаПриход,
		|	ВТ_Назначенныесубсидии.СуммаСубсидии,
		|	&ДатаДокумента КАК Период
		|ИЗ
		|	ВТ_Назначенныесубсидии КАК ВТ_Назначенныесубсидии
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РасчетыПоСубсидиямОстаткиИОбороты.Период КАК Период,
		|			РасчетыПоСубсидиямОстаткиИОбороты.Регистратор КАК Регистратор,
		|			РасчетыПоСубсидиямОстаткиИОбороты.Организация КАК Организация,
		|			РасчетыПоСубсидиямОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,
		|			РасчетыПоСубсидиямОстаткиИОбороты.МесяцНачисления КАК МесяцНачисления,
		|			РасчетыПоСубсидиямОстаткиИОбороты.Услуга КАК Услуга,
		|			РасчетыПоСубсидиямОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
		|			РасчетыПоСубсидиямОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
		|			РасчетыПоСубсидиямОстаткиИОбороты.СуммаОборот КАК СуммаОборот,
		|			РасчетыПоСубсидиямОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
		|			РасчетыПоСубсидиямОстаткиИОбороты.СуммаРасход КАК СуммаРасход
		|		ИЗ
		|			РегистрНакопления.РасчетыПоСубсидиям.ОстаткиИОбороты(, , Регистратор, , ) КАК РасчетыПоСубсидиямОстаткиИОбороты
		|		ГДЕ
		|			ТИПЗНАЧЕНИЯ(РасчетыПоСубсидиямОстаткиИОбороты.Регистратор) = ТИП(Документ.НачислениеПоЛС)) КАК ВложенныйЗапрос
		|		ПО ВТ_Назначенныесубсидии.ЛицевойСчет = ВложенныйЗапрос.ЛицевойСчет
		|			И ВТ_Назначенныесубсидии.Услуга = ВложенныйЗапрос.Услуга
		|			И ВТ_Назначенныесубсидии.МесяцНачисления = ВложенныйЗапрос.МесяцНачисления
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Назначенныесубсидии.ЛицевойСчет,
		|	ВТ_Назначенныесубсидии.Услуга,
		|	ВТ_Назначенныесубсидии.МесяцНачисления,
		|	ВТ_Назначенныесубсидии.Организация,
		|	ВТ_Назначенныесубсидии.СуммаСубсидии,
		|	ЕСТЬNULL(ВложенныйЗапрос.СуммаПриход, 0)";
		
	Запрос.УстановитьПараметр("Период", ДокументСсылкаПерерасчетПоЛС.МоментВремени());
	Запрос.УстановитьПараметр("ТаблицаСубсидий",НазначенныеСубсидии);
	Запрос.УстановитьПараметр("ДатаДокумента",ДокументСсылкаПерерасчетПоЛС.Дата);
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	
	ТаблицаДляИзменения = Новый ТаблицаЗначений();
	ТаблицаДляИзменения.Колонки.Добавить("Период",Новый ОписаниеТипов("Дата"));
	ТаблицаДляИзменения.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("СправочникСсылка.ЛицевыеСчета"));
	ТаблицаДляИзменения.Колонки.Добавить("Услуга", Новый ОписаниеТипов("СправочникСсылка.Услуги"));
    ТаблицаДляИзменения.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДляИзменения.Колонки.Добавить("МесяцНачисления", Новый ОписаниеТипов("Дата"));
	ТаблицаДляИзменения.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15,2)));
    ТаблицаДляИзменения.Колонки.Добавить("ВидДвижения", Новый ОписаниеТипов("ВидДвиженияНакопления"));
	
	ВыбркаПриход = РезультатЗапроса[5].Выбрать();
	
	
	Пока ВыбркаПриход.Следующий() Цикл
		
		Если ВыбркаПриход.Сумма <> 0 Тогда
			ДобСтрока = ТаблицаДляИзменения.Добавить();
			ЗаполнитьЗначенияСвойств(ДобСтрока,ВыбркаПриход);
		КонецЕсли; 
	КонецЦикла;	      
	
	ВыборкаРасход = РезультатЗапроса[4].Выбрать();

	Пока ВыборкаРасход.Следующий() Цикл
		
		Если ВыборкаРасход.Сумма <> 0 Тогда
			ДобСтрока = ТаблицаДляИзменения.Добавить();
			ЗаполнитьЗначенияСвойств(ДобСтрока,ВыборкаРасход);
		КонецЕсли;
	КонецЦикла;	

	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГарантированныеСубсидии",ТаблицаДляИзменения);

	

	
КонецПроцедуры // СформироватьТаблицуРасчетыПоЛицевымСчетам()

Процедура СформироватьТаблицуИнвентаризацияАвансов(ДокументСсылкаПерерасчетПоЛС, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст ="ВЫБРАТЬ
	              |	ВременнаяТаблицаИнвентаризацииАвансов.ЛицевойСчет,
	              |	ВременнаяТаблицаИнвентаризацииАвансов.ОбъектЛицевогоСчета,
	              |	ВременнаяТаблицаИнвентаризацииАвансов.Услуга,
	              |	-ВременнаяТаблицаИнвентаризацииАвансов.СуммаАванса КАК Сумма,
	              |	ВременнаяТаблицаИнвентаризацииАвансов.Организация,
	              |	&Период,
	              |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	              |	ВременнаяТаблицаИнвентаризацииАвансов.МесяцНачисления
	              |ИЗ
	              |	ВременнаяТаблицаИнвентаризацииАвансов КАК ВременнаяТаблицаИнвентаризацииАвансов
	              |
	              |ОБЪЕДИНИТЬ ВСЕ
	              |
	              |ВЫБРАТЬ
	              |	ВременнаяТаблицаИнвентаризацииАвансов.ЛицевойСчет,
	              |	ВременнаяТаблицаИнвентаризацииАвансов.ОбъектЛицевогоСчета,
	              |	ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка),
	              |	ВременнаяТаблицаИнвентаризацииАвансов.СуммаАванса,
	              |	ВременнаяТаблицаИнвентаризацииАвансов.Организация,
	              |	&Период,
	              |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	              |	ДАТАВРЕМЯ(1, 1, 1)
	              |ИЗ
	              |	ВременнаяТаблицаИнвентаризацииАвансов КАК ВременнаяТаблицаИнвентаризацииАвансов";
		
	Запрос.УстановитьПараметр("Период", ДокументСсылкаПерерасчетПоЛС.Дата);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЛицевымСчетам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетыПоЛицевымСчетам()

Процедура СформироватьТаблицуРасчетыПоЛьготам(ДокументСсылкаПерерасчетПоЛС, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст ="ВЫБРАТЬ
	              |	ВременнаяТаблицаЛьгот.ЛицевойСчет КАК ЛицевойСчет,
	              |	ВременнаяТаблицаЛьгот.ПотребительУслуг,
	              |	ВременнаяТаблицаЛьгот.Услуга,
	              |	-ВременнаяТаблицаЛьгот.Сумма КАК Сумма,
	              |	ВременнаяТаблицаЛьгот.Организация,
	              |	ВременнаяТаблицаЛьгот.МесяцНачисления,
	              |	ВременнаяТаблицаЛьгот.Льгота,
	              |	ВременнаяТаблицаЛьгот.ДатаОкончанияПериода,
	              |	ВременнаяТаблицаЛьгот.ДатаНачалаПериода,
	              |	ВременнаяТаблицаЛьгот.Период,
	              |	ИСТИНА КАК Корректировка
	              |ИЗ
	              |	ВременнаяТаблицаЛьгот КАК ВременнаяТаблицаЛьгот
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	СУММА(-ВременнаяТаблицаЛьгот.Сумма) КАК Сумма,
	              |	ВременнаяТаблицаЛьгот.Организация,
	              |	ВременнаяТаблицаЛьгот.Период,
	              |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	              |	ВременнаяТаблицаЛьгот.Контрагент,
	              |	ВременнаяТаблицаЛьгот.ДоговорКонтрагента,
	              |	ВременнаяТаблицаЛьгот.ВидУслуги КАК Услуга
	              |ИЗ
	              |	ВременнаяТаблицаЛьгот КАК ВременнаяТаблицаЛьгот
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ВременнаяТаблицаЛьгот.ДоговорКонтрагента,
	              |	ВременнаяТаблицаЛьгот.Организация,
	              |	ВременнаяТаблицаЛьгот.Контрагент,
	              |	ВременнаяТаблицаЛьгот.ВидУслуги,
	              |	ВременнаяТаблицаЛьгот.Период";
		
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасшифровкаНачисленияЛьгот", РезультатЗапроса[0].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыПоЛьготам", РезультатЗапроса[1].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетыПоЛицевымСчетам()


Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПерерасчетПоЛС, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПерерасчетПоЛСПерерасчет.Услуга,
	|	ПерерасчетПоЛСПерерасчет.ЛицевойСчет,
	|	ПерерасчетПоЛСПерерасчет.СуммаПерерасчета КАК Сумма,
	|	НАЧАЛОПЕРИОДА(ПерерасчетПоЛСПерерасчет.МесяцНачисления, МЕСЯЦ) КАК МесяцНачисления,
	|	ВЫБОР
	|		КОГДА НЕ ПерерасчетПоЛСПерерасчет.Услуга.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ПерерасчетПоЛСПерерасчет.Услуга.Организация
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ПерерасчетПоЛСПерерасчет.Ссылка.Здание.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|					ТОГДА ПерерасчетПоЛСПерерасчет.Ссылка.Здание.Организация
	|				ИНАЧЕ ПерерасчетПоЛСПерерасчет.Ссылка.Организация
	|			КОНЕЦ
	|	КОНЕЦ КАК Организация,
	|	ПерерасчетПоЛСПерерасчет.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет) КАК ВидНачисленияПерерасчет,
	|	ПерерасчетПоЛСПерерасчет.СуммаСубсидии,
	|	ПерерасчетПоЛСПерерасчет.СуммаТекущийРасчет,
	|	ПерерасчетПоЛСПерерасчет.СуммаПерерасчета,
	|	ПерерасчетПоЛСПерерасчет.СуммаНачислено,
	|	ПерерасчетПоЛСПерерасчет.Ссылка,
	|	ПерерасчетПоЛСПерерасчет.ВидНачисления,
	|	ПерерасчетПоЛСПерерасчет.ГраницаСубсидии
	|ПОМЕСТИТЬ ВременнаяТаблицаПерерасчет
	|ИЗ
	|	Документ.ПерерасчетПоЛС.Перерасчет КАК ПерерасчетПоЛСПерерасчет
	|ГДЕ
	|	ПерерасчетПоЛСПерерасчет.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПерерасчетПоЛСИнвентаризацияАвансов.ЛицевойСчет,
	|	ПерерасчетПоЛСИнвентаризацияАвансов.ОбъектЛицевогоСчета,
	|	ПерерасчетПоЛСИнвентаризацияАвансов.ОтветственныйВладелец,
	|	ПерерасчетПоЛСИнвентаризацияАвансов.Услуга,
	|	ПерерасчетПоЛСИнвентаризацияАвансов.СуммаАванса,
	|	ПерерасчетПоЛСИнвентаризацияАвансов.Ссылка.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА НЕ ПерерасчетПоЛСИнвентаризацияАвансов.Услуга.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ПерерасчетПоЛСИнвентаризацияАвансов.Услуга.Организация
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ПерерасчетПоЛСИнвентаризацияАвансов.Ссылка.Здание.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|					ТОГДА ПерерасчетПоЛСИнвентаризацияАвансов.Ссылка.Здание.Организация
	|				ИНАЧЕ ПерерасчетПоЛСИнвентаризацияАвансов.Ссылка.Организация
	|			КОНЕЦ
	|	КОНЕЦ КАК Организация,
	|	ПерерасчетПоЛСИнвентаризацияАвансов.МесяцНачисления
	|ПОМЕСТИТЬ ВременнаяТаблицаИнвентаризацииАвансов
	|ИЗ
	|	Документ.ПерерасчетПоЛС.ИнвентаризацияАвансов КАК ПерерасчетПоЛСИнвентаризацияАвансов
	|ГДЕ
	|	ПерерасчетПоЛСИнвентаризацияАвансов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПерерасчетПоЛСЛьготы.ЛицевойСчет,
	|	ПерерасчетПоЛСЛьготы.Услуга,
	|	ПерерасчетПоЛСЛьготы.МесяцНачисления,
	|	ПерерасчетПоЛСЛьготы.Льгота,
	|	ПерерасчетПоЛСЛьготы.ПотребительУслуг,
	|	ПерерасчетПоЛСЛьготы.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА НЕ ПерерасчетПоЛСЛьготы.Услуга.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ПерерасчетПоЛСЛьготы.Услуга.Организация
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ПерерасчетПоЛСЛьготы.Ссылка.Здание.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|					ТОГДА ПерерасчетПоЛСЛьготы.Ссылка.Здание.Организация
	|				ИНАЧЕ ПерерасчетПоЛСЛьготы.Ссылка.Организация
	|			КОНЕЦ
	|	КОНЕЦ КАК Организация,
	|	НАЧАЛОПЕРИОДА(ПерерасчетПоЛСЛьготы.МесяцНачисления, МЕСЯЦ) КАК ДатаНачалаПериода,
	|	КОНЕЦПЕРИОДА(ПерерасчетПоЛСЛьготы.МесяцНачисления, МЕСЯЦ) КАК ДатаОкончанияПериода,
	|	ПерерасчетПоЛСЛьготы.Ссылка.Дата КАК Период,
	|	ПерерасчетПоЛСЛьготы.Услуга.ВидУслуги.ДоговорДляРасчетаПоЛьготам КАК ДоговорКонтрагента,
	|	ПерерасчетПоЛСЛьготы.Услуга.ВидУслуги.КонтрагентДляРасчетаПоЛьготам КАК Контрагент,
	|	ПерерасчетПоЛСЛьготы.Услуга.ВидУслуги КАК ВидУслуги
	|ПОМЕСТИТЬ ВременнаяТаблицаЛьгот
	|ИЗ
	|	Документ.ПерерасчетПоЛС.Льготы КАК ПерерасчетПоЛСЛьготы
	|ГДЕ
	|	ПерерасчетПоЛСЛьготы.Ссылка = &Ссылка";

	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПерерасчетПоЛС);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	
	
	Если ДокументСсылкаПерерасчетПоЛС.ВидОперации = Перечисления.ВидыОперацийПерерасчетПоЛС.ПерерасчетПоЛС Тогда
		СформироватьТаблицуРасчетыПоЛицевымСчетам(ДокументСсылкаПерерасчетПоЛС, СтруктураДополнительныеСвойства);
		СформироватьТаблицуРасчетыПоСубсидиям(ДокументСсылкаПерерасчетПоЛС, СтруктураДополнительныеСвойства);
		СформироватьТаблицуРасчетыПоЛьготам(ДокументСсылкаПерерасчетПоЛС, СтруктураДополнительныеСвойства);
	Иначе
		СформироватьТаблицуИнвентаризацияАвансов(ДокументСсылкаПерерасчетПоЛС, СтруктураДополнительныеСвойства);
	КонецЕсли;
КонецПроцедуры

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаПерерасчетПоЛС, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если Не ПроведениеСервер.ВыполнитьКонтрольОстатков() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияРасчетыПоЛицевымСчетамИзменение"
	// содержат записи, необходимо выполнить контроль отрицательных остатков.
	
	Если СтруктураВременныеТаблицы.ДвиженияРасчетыПоЛицевымСчетамИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет) КАК ЛицевойСчетПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга) КАК УслугаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления) КАК МесяцНачисленияПредставление,
		|	ЕСТЬNULL(ДвиженияРасчетыПоЛицевымСчетамИзменение.СуммаИзменение, 0) + ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК ОстатокРасчетыПоЛицевымСчетам,
		|	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК СуммаОстатокРасчетыПоЛицевымСчетам
		|ИЗ
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение КАК ДвиженияРасчетыПоЛицевымСчетамИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
		|				&МоментКонтроля,
		|				(Организация, ЛицевойСчет, Услуга, МесяцНачисления) В
		|					(ВЫБРАТЬ
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация КАК Организация,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет КАК ЛицевойСчет,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга КАК Услуга,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления КАК МесяцНачисления
		|					ИЗ
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение КАК ДвиженияРасчетыПоЛицевымСчетамИзменение)) КАК РасчетыПоЛицевымСчетамОстатки
		|		ПО ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация = РасчетыПоЛицевымСчетамОстатки.Организация
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет = РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга = РасчетыПоЛицевымСчетамОстатки.Услуга
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления = РасчетыПоЛицевымСчетамОстатки.МесяцНачисления
		|ГДЕ
		|	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) < 0
		|	И РасчетыПоЛицевымСчетамОстатки.МесяцНачисления <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		
		РезультатЗапроса = Запрос.Выполнить();

		// Отрицательный остаток.
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ДокументОбъектПерерасчетПоЛС = ДокументСсылкаПерерасчетПоЛС.ПолучитьОбъект();
			
			ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
			ОСМДСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыПоЛицевымСчетамСписком(ДокументОбъектПерерасчетПоЛС, ВыборкаИзРезультатаЗапроса, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

