////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ПерерасчетПоЛС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	
	//ПроведениеСервер.ОтразитьРасчетыПоЛицевымСчетам(ДополнительныеСвойства, Движения, Отказ);
	//ПроведениеСервер.ОтразитьРасшифровкаНачисленияЛьгот(ДополнительныеСвойства, Движения, Отказ);
	//ПроведениеСервер.ОтразитьВзаиморасчетыПоЛьготам(ДополнительныеСвойства, Движения, Отказ);
	Если ВидОперации = Перечисления.ВидыОперацийПерерасчетПоЛС.ПерерасчетПоЛС Тогда
		ПроведениеСервер.ОтразитьГарантированныеНачисленияСубсидий(ДополнительныеСвойства, Движения, Отказ);
		ПроведениеСервер.ОтразитьРасчетыПоЛицевымСчетам(ДополнительныеСвойства, Движения, Отказ);
		ПроведениеСервер.ОтразитьРасшифровкаНачисленияЛьгот(ДополнительныеСвойства, Движения, Отказ);
		ПроведениеСервер.ОтразитьВзаиморасчетыПоЛьготам(ДополнительныеСвойства, Движения, Отказ);
	Иначе
		ПроведениеСервер.ОтразитьРасчетыПоЛицевымСчетам(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
		
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.ПерерасчетПоЛС.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.ПерерасчетПоЛС.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РаспределениеТепловойЕнергии") Тогда
		
		ЗаполнитьПоДокументуОсновние(ДанныеЗаполнения, ДанныеЗаполнения);
		
	Иначе
		
		ВызватьИсключение НСтр("ru='Чеки ККМ на возврат должны вводится на основании чеков ККМ';uk='Чеки ККМ на повернення повинні вводиться на підставі чеків ККМ'");
		
	КонецЕсли;
КонецПроцедуры

// Процедура заповнення документу на підставі документу РаспределениеТепловойЕнергии.
//
// Параметри:
//	ДокументОснование - ДокументСсылка.РаспределениеТепловойЕнергии - Розподіл теплової енергіїї
//	ДанныеЗаполнения - Структура - Дані заповнення документа
//
Процедура ЗаполнитьПоДокументуОсновние(Знач ДокументОснование, ДанныеЗаполнения)
	ВидОперации               = Перечисления.ВидыОперацийПерерасчетПоЛС.ПересчетОтопление;
	Здание                    = ДокументОснование.Здание;
	Услуга                    = ДокументОснование.Услуга;
	ПериодНачисленияНачало    = НачалоДня(ДокументОснование.ПериодНачисления);
	ПериодНачисленияОкончание = КонецДня(ДокументОснование.ПериодНачисления);
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	РаспределениеТепловойЕнергииОсновная.ЛицевойСчет,
	    |	РаспределениеТепловойЕнергииОсновная.Показание КАК ПоказаниеПредыдущее,
	    |	РаспределениеТепловойЕнергииОсновная.ВидТарифа,
	    |	РаспределениеТепловойЕнергииОсновная.ОтветственныйВладелец,
	    |	РаспределениеТепловойЕнергииОсновная.ОбъектЛицевогоСчета,
	    |	РаспределениеТепловойЕнергииОсновная.Энергоемкость,
	    |	РаспределениеТепловойЕнергииОсновная.ЗБП,
	    |	РаспределениеТепловойЕнергииОсновная.ТЕ,
	    |	РаспределениеТепловойЕнергииОсновная.ВРО,
	    |	РаспределениеТепловойЕнергииОсновная.Qдон
	    |ИЗ
	    |	Документ.РаспределениеТепловойЕнергии.Основная КАК РаспределениеТепловойЕнергииОсновная
	    |ГДЕ
	    |	РаспределениеТепловойЕнергииОсновная.Ссылка = &ДокументОснование
	    |	И РаспределениеТепловойЕнергииОсновная.Ссылка.ПометкаУдаления = ЛОЖЬ
	    |	И РаспределениеТепловойЕнергииОсновная.Ссылка.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	Если НЕ Результат = Неопределено Тогда
		Результат.Колонки.Добавить("СуммаНачислено", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
		Для Каждого стр Из Результат Цикл
			стр.СуммаНачислено = НачисленияПоЛицевомуСчету(стр.ЛицевойСчет, Услуга, ПериодНачисленияНачало, ПериодНачисленияОкончание,
			                                               Перечисления.ВидыТарифов.Общий);
		КонецЦикла;
		ПересчетОтопление.Загрузить(Результат);
		Для Каждого стрПерерасчет Из ПересчетОтопление Цикл
			стрПерерасчет.МесяцНачисления = ДокументОснование.ПериодНачисления;
			стрПерерасчет.ВидНачисления = Перечисления.ВидыНачислений.Перерасчет;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция НачисленияПоЛицевомуСчету(ЛицевойСчет, Услуга, ПериодНачисленияНачало, ПериодНачисленияОкончание, ВидТарифа)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	РасчетыПоЛицевымСчетам.Сумма
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	    |ГДЕ
	    |	РасчетыПоЛицевымСчетам.ЛицевойСчет = &ЛицевойСчет
	    |	И РасчетыПоЛицевымСчетам.Услуга = &Услуга
	    |	И РасчетыПоЛицевымСчетам.ВидДвижения = &ВидДвижения
	    |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ &ПериодНачало И &ПериодКонец";
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ПериодНачало", НачалоМесяца(ПериодНачисленияНачало));
	Запрос.УстановитьПараметр("ПериодКонец", КонецМесяца(ПериодНачисленияОкончание));
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		СуммаНачислено = 0;
		Возврат СуммаНачислено;
	Иначе
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СуммаНачислено = Выборка.Сумма;
		КонецЦикла;
		Возврат СуммаНачислено;
	КонецЕсли;
КонецФункции