////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	 ПараметрыФормы = Новый Структура("Предмет", ПараметрКоманды);
	 ЕстьЗаметки = ПроверитьНаличиеЗаметок(ПараметрКоманды);
	 Если ЕстьЗаметки Тогда
	 	ОткрытьФорму("Справочник.Заметки.Форма.ЗаметкиПоПредмету", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	Иначе
		ОткрытьФорму("Справочник.Заметки.Форма.ФормаЭлемента", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;
	
 КонецПроцедуры
 

 &НаСервере
 Функция  ПроверитьНаличиеЗаметок(ТекущийОбъект)
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	         |	Заметки.Ссылка
	         |ИЗ
	         |	Справочник.Заметки КАК Заметки
	         |ГДЕ
	         |	Заметки.Предмет = &Предмет";
	Запрос.УстановитьПараметр("Предмет",ТекущийОбъект);
	Результат = Запрос.Выполнить();
	Итог = НЕ Результат.Пустой();
 	Возврат Итог;      
 
 КонецФункции// ПроверитьНаличиеЗамен()
 
