
&НаСервере
Функция СформироватьОбъекты()
	
	Объект.Наименование = Объект.ЗаводскойНомер + "/" + Объект.Услуга.ВидУслуги.Наименование;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	НачатьТранзакцию();
	
	// Справочник приборы учета
	СправочникПриборыУчета = Справочники.ПриборыУчета.СоздатьЭлемент();
	СправочникПриборыУчета.Наименование = Объект.Наименование;
	СправочникПриборыУчета.Услуга = Объект.Услуга;
	СправочникПриборыУчета.ЗаводскойНомер = Объект.ЗаводскойНомер;
	СправочникПриборыУчета.Тарифность  = Объект.Тарифность;
	СправочникПриборыУчета.СпособРегистрацииПоказаний = Объект.СпособРегистрацииПоказаний;
	СправочникПриборыУчета.Коэффициент = Объект.Коэффициент;
	СправочникПриборыУчета.ЕдиницаИзмерения = Объект.ЕдиницаИзмерения;
	
	СправочникПриборыУчета.Записать();
	СсылкаСправочникПриборыУчета = СправочникПриборыУчета.Ссылка;
	
	// Документ управление приборами учета
	
	ДокументУправлениеПриборамиУчета = Документы.УправлениеПриборамиУчета.СоздатьДокумент();
	ДокументУправлениеПриборамиУчета.Автор = Пользователи.ТекущийПользователь();
	ДокументУправлениеПриборамиУчета.ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.УстановкаПрибораУчета;
	ДокументУправлениеПриборамиУчета.ОбъектУстановки = Объект.ОбъектУстановки;
	ДокументУправлениеПриборамиУчета.Организация = Объект.ОбъектУстановки.Владелец.Организация;
	ДокументУправлениеПриборамиУчета.Здание = Объект.ОбъектУстановки.Владелец;
	ДокументУправлениеПриборамиУчета.Дата = Объект.ДатаУстановки;
	
	НоваяСтрока = ДокументУправлениеПриборамиУчета.ПриборыУчета.Добавить();
	НоваяСтрока.ПриборУчета = СсылкаСправочникПриборыУчета;
	НоваяСтрока.ДатаВключения = Объект.ДатаУстановки;	
	НоваяСтрока.ДатаПоследнейПоверки = Объект.ДатаПоследнейПоверки;
	НоваяСтрока.ДатаСледующейПоверки = Объект.ДатаСледующейПоверки;
	НоваяСтрока.НачальноеПоказание = Объект.НачальноеПоказание;
	
	ДокументУправлениеПриборамиУчета.Записать(РежимЗаписиДокумента.Проведение);

	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции	

&НаКлиенте
Процедура КомандаГотово(Команда)
	
	Если СформироватьОбъекты() Тогда
		
		Оповестить("СозданПриборУчета", СсылкаСправочникПриборыУчета , ЭтаФорма);
	
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);

	Объект.Тарифность = Перечисления.ТарифностьСчетчиков.Однотарифный;
	Объект.СпособРегистрацииПоказаний = Перечисления.СпособыРегистрацииПоказанийСчетчиков.НарастающимИтогом;
	Объект.Коэффициент = 1;
	
	Если Параметры.Свойство("Основание") Тогда
		Объект.ОбъектУстановки = Параметры.Основание.ЛицевойСчет;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЕдиницуИзмеренияУслуги(Услуга)
	
	Возврат Услуга.ЕдиницаИзмерения;
	
КонецФункции

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	
	Объект.ЕдиницаИзмерения = ПолучитьЕдиницуИзмеренияУслуги(Объект.Услуга);
	
КонецПроцедуры
