Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
	
КонецФункции // глРазложить

Функция ПолучитьПредставлениеАдреса(Массив, Квартира, КодЯзыкаПечать) Экспорт 
	
	СтрокаАдрес = "";
	Сч = Массив.ВГраница();
	Пока НЕ(Сч < 0) Цикл
		Если Сч = Массив.ВГраница()  Тогда
			СтрокаАдрес = Массив[Сч];
		Иначе
			СтрокаАдрес = СтрокаАдрес+", "+Массив[Сч];
		КонецЕсли;
		Сч = Сч-1;
	КонецЦикла;
	СтрокаАдрес = СтрокаАдрес + ", " + ?(Квартира.Подъезд = Справочники.Подъезды.ПустаяСсылка()," ",", "+Квартира.Подъезд.Наименование)
			+ Квартира.Наименование;
			
			Если КодЯзыкаПечать = "uk" Тогда
//{{MRG[ <-> ]
				СтрокаАдрес = СтрЗаменить(СтрокаАдрес, "дом","буд");
//}}MRG[ <-> ]
				СтрокаАдрес = СтрЗаменить(СтрокаАдрес,"Подъезд","Під'їзд");
				СтрокаАдрес = СтрЗаменить(СтрокаАдрес,"Секция","Секція");
			Иначе
				СтрокаАдрес = СтрЗаменить(СтрокаАдрес,"Під'їз","Подъезд");
				СтрокаАдрес = СтрЗаменить(СтрокаАдрес,"Секція","Секция");
			КонецЕсли;
			
	Возврат СтрокаАдрес; 
	
КонецФункции // ПолучитьПредставлениеАдреса()

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


Функция ПечатьКвитанцииНаОплатуУпрощенная(ТекущийДокумент, ТабличныйДокумент, МесяцНачислений, БанковскиеСчетаОрганизации)Экспорт
	Макет =  ПолучитьОбщийМакет("МакетКвитанцииНаОплатуУпрощенная");
	
		
	ТаблицаДляРасчетаИтогов = Новый ТаблицаЗначений;
	ТаблицаДляРасчетаИтогов.Колонки.Добавить("КОплате");
	ТаблицаДляРасчетаИтогов.Очистить();
	
	ЗначениеРеструктуризацииДолга = 0;
	ЗадолженностьПоРеструктуризации = 0;
	МесячнаяПлатаПоРеструктуризации = 0;
	АвансовыйПлатежВсего = 0;
	Аванс = 0;
	Льгота = 0;
	
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;	
	
	//Создадим адрес в необходимои формате
	АдресМасс = РазложитьСтрокуВМассивПодстрок(ТекущийДокумент.Владелец.Наименование);
	
	МассивВыводимыхОбластей = Новый Массив;
	
	//Получим выборки данных
	ГлобальнаяВыборка = ПолучитьОбщуюСтруктуруКвитанции(ТекущийДокумент, МесяцНачислений);
	
	// Заполнение таблицы
	ЕстьРеструктуризация = НЕ ГлобальнаяВыборка[9].Пустой();
	ВыборкаОрганизация = ГлобальнаяВыборка[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПриборы = ГлобальнаяВыборка[4].Выбрать();
	Если ЕстьРеструктуризация Тогда;
		ВыборкаОстатков = ГлобальнаяВыборка[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Иначе
		ВыборкаОстатков = ГлобальнаяВыборка[8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	
	ВыборкаАвансовыхПлатежей = ГлобальнаяВыборка[6].Выбрать();
	ВыборкаРеструктуризация = ГлобальнаяВыборка[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОстатокПоУслугам = ГлобальнаяВыборка[8].Выгрузить();
	ВыборкаГраницаСубсидии = ГлобальнаяВыборка[10].Выбрать();
	/////////////////////////	
	
	Банки = "";
	Пока ВыборкаОрганизация.Следующий() Цикл
		ВыборкаЛицевойСчет = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЛицевойСчет.Следующий() Цикл
			//ШАПКА
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьШапка, ТекущийДокумент.Ссылка);
			ЕДРПОУ = ?(КодЯзыкаПечать="uk"," ЄДРПОУ ","ЕДРПОУ ");
			ОбластьШапка.Параметры.Получатель = "КП ""Тепловодсервіс""  ЕДРПОУ 45136285";//ВыборкаЛицевойСчет.ЛицевойСчет.Владелец.Организация.НаименованиеПолное +ЕДРПОУ+
			//ВыборкаЛицевойСчет.ЛицевойСчет.Владелец.Организация.КодПоЕДРПОУ;
			
			Выборка = Справочники.БанковскиеСчета.Выбрать(,ВыборкаОрганизация.Организация);
			
			Для Каждого Строка Из БанковскиеСчетаОрганизации Цикл
				Если Строка.Печать Тогда
					Если Строка.БанковскийСчет.Владелец = ВыборкаОрганизация.Организация тогда					
						Банки = "UA773077700000026003711158769, АТ ""А-БАНК""";//Банки + "Р/р № " + ПолучитьПредставлениеБанковскогоСчета(Строка.БанковскийСчет) +"; "+ Строка.БанковскийСчет.Банк.Наименование +"; МФО "+ Строка.БанковскийСчет.Банк.Код + Символы.ПС;
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;
			
			Попытка
				Если Константы.ВыводитьВКвитанцияхФИО.Получить() = Истина Тогда
					Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование;
				Иначе
					Плательщик = ВыборкаЛицевойСчет.ЛицевойСчет;
				КонецЕсли;
				
			Исключение
			КонецПопытки;
			
			НазначениеПлатежа = ВыборкаЛицевойСчет.ЛицевойСчет.Владелец.ТекстНазначенияПлатежа;
			ОбластьШапка.Параметры.рр = Банки;
			ОбластьШапка.Параметры.ЛицевойСчет = ВыборкаЛицевойСчет.ЛицевойСчет.Наименование;
			
			
			Квартира = ВыборкаЛицевойСчет.ЛицевойСчет.ОбъектЛицевогоСчета;
			Если Константы.ВыводитьАдресВКвитанциях.Получить() = Истина тогда
				Адрес = ПолучитьПредставлениеАдреса(АдресМасс, Квартира, КодЯзыкаПечать);
			Иначе 
				Адрес = "";
			КонецЕсли;
			
			ОбластьШапка.Параметры.ФИОПлатникАдрес = Строка(Плательщик)+Строка(Адрес);
			
			СтруктураПоиска = Новый Структура("ЛицевойСчет");
			СтруктураПоиска.ЛицевойСчет = ВыборкаЛицевойСчет.ЛицевойСчет;
			
			
			Пока ВыборкаОстатков.НайтиСледующий(СтруктураПоиска) Цикл
				ВыборкаОстатковОрганизация = ВыборкаОстатков.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаОстатковОрганизация.следующий() Цикл
					ОрганизацияОтбор = Неопределено;
					Если ВыборкаОстатковОрганизация.Организация = Справочники.Организации.ПустаяСсылка() Тогда
					    ОрганизацияОтбор = ВыборкаЛицевойСчет.ЛицевойСчет.Владелец.Организация;
					Иначе
						ОрганизацияОтбор = ВыборкаОстатковОрганизация.Организация;
					КонецЕсли;	
					Если  ОрганизацияОтбор = ВыборкаЛицевойСчет.Организация  Тогда
						ОстатокНаНачалоМесяца = ВыборкаОстатковОрганизация.СуммаОстаток;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			ВыборкаОстатков.Сбросить();
			
			
			//Заполним базовые значения для упрощения дальнейших расчетов
			Начисленно 		= ВыборкаЛицевойСчет.Начисление;
			Льгота 			= ВыборкаЛицевойСчет.Льгота;
			Субсидия 		= ВыборкаЛицевойСчет.Субсидия;
			Перерасчет 		= ВыборкаЛицевойСчет.Перерасчет;
			Оплачено 		= ВыборкаЛицевойСчет.Оплата;
			Корректировка 	= ВыборкаЛицевойСчет.Корректировка;
			
			
			НачисленноВсего = Начисленно+Перерасчет+Корректировка;
			ОбластьШапка.Параметры.Нараховано = НачисленноВсего;
			//ОбластьШапка.Параметры.СубсидииЛьготы = Льгота+Субсидия; 
			Если ОстатокНаНачалоМесяца = Неопределено Тогда
				ОстатокНаНачалоМесяца = 0;
			КонецЕсли;
			
			Если Оплачено < 0 Тогда
				Оплачено = - Оплачено;
			КонецЕсли;	
			
			
			Оплаты = ВыборкаЛицевойСчет.Оплата;
			Если ЕстьРеструктуризация Тогда
				Остаток =  ОстатокНаНачалоМесяца  - Корректировка - Перерасчет - ?(Субсидия<0,0,Субсидия) - ?(Льгота<0,0,Льгота);
			ИНаче
				Остаток = ОстатокНаНачалоМесяца;
				
			КонецЕсли;
			
			Если Остаток < 0 Тогда
				Аванс = Остаток;
				ОбластьШапка.Параметры.ДолгПереплата = "Переплата";
				ОбластьШапка.Параметры.Долг = Аванс;//Аванс-(Аванс+Аванс);
				Долг = 0;
			Иначе
				ОбластьШапка.Параметры.ДолгПереплата = "Борг минулих переодів";
				Долг = Остаток;
				ОбластьШапка.Параметры.Долг = Долг;
				Аванс = 0;
			КонецЕсли;
			
			//ОбластьШапка.Параметры.Долг = Долг;
			//ОбластьШапка.Параметры.Аванс = Аванс;
			ОбластьШапка.Параметры.Оплата = Оплаты;
			ОбластьШапка.Параметры.Период = Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
			МассивВыводимыхОбластей.Добавить(ОбластьШапка);
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			ВыборкаУслуга = ВыборкаЛицевойСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаУслуга.Следующий() Цикл 
				
				ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
				ОбластьСтрока.Параметры.Услуга = ВыборкаУслуга.Услуга.ПолноеНаименование;

				
				Если ВыборкаУслуга.Начисление = 0 И
					ВыборкаУслуга.Льгота = 0 И
					ВыборкаУслуга.Субсидия = 0 И
					ВыборкаУслуга.Перерасчет = 0 И
					ВыборкаУслуга.Корректировка = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ОбластьСтрока.Параметры.ЕдИзК = Строка(ВыборкаУслуга.ЕдиницаИзмерения);
				ОбластьСтрока.Параметры.Сумма = ВыборкаУслуга.Начисление;
				//ОбластьСтрока.Параметры.Льготы = ВыборкаУслуга.Льгота + ВыборкаУслуга.Субсидия;
				
				Если ВыборкаУслуга.Субсидия <> 0 Тогда
							
							СтруктараПоискаСубс = Новый Структура;
							СтруктараПоискаСубс.Вставить("ЛицевойСчет",ТекущийДокумент);
							СтруктараПоискаСубс.Вставить("Услуга",ВыборкаУслуга.Услуга);
							СтруктараПоискаСубс.Вставить("МесяцНачисления",НачалоМесяца(МесяцНачислений));
							
							
							Если ВыборкаГраницаСубсидии.НайтиСледующий(СтруктараПоискаСубс)  Тогда
								ОбластьСтрока.Параметры.ОбПлат = ВыборкаГраницаСубсидии.ГраницаСубсидии;
							КонецЕсли;
							ВыборкаГраницаСубсидии.Сбросить();
				КонецЕсли;
				
				ОбластьСтрока.Параметры.Корректировка = ВыборкаУслуга.Корректировка;
				ОбластьСтрока.Параметры.Пересчитано = ВыборкаУслуга.Перерасчет;
				ОбластьСтрока.Параметры.Насчитано = ВыборкаУслуга.Начисление + ВыборкаУслуга.Льгота + ВыборкаУслуга.Субсидия +ВыборкаУслуга.Корректировка+ВыборкаУслуга.Перерасчет;
				
				//В случае изменения тарифа в течение расчетного периода, отразим их все
				ВыборкаТариф = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Тариф = "";
				Маркер = Ложь;
				ОбщееКоличество = 0;
				Пока ВыборкаТариф.Следующий() Цикл
					
					Если Тариф = "" Тогда 
						
						Значение = ?(ВыборкаТариф.Тариф = 0 ,"",Строка(ВыборкаТариф.Тариф)) ;
						
					Иначе
						
						Значение = ?(ВыборкаТариф.Тариф = 0,"","\"+ Строка(ВыборкаТариф.Тариф));
						
					КонецЕсли;
					Тариф = Тариф+Значение;
					ОбластьСтрока.Параметры.Тариф = Тариф;
					
					Если НЕ Тариф ="" Тогда
						ОбластьСтрока.Параметры.ЕдИзТ = "грн./"+Строка(ВыборкаУслуга.ЕдиницаИзмерения);
					КонецЕсли;
					
					Если ВыборкаТариф.Порог  = Перечисления.ПорогиТарифовУслуг.ПустаяСсылка() и ОбщееКоличество = 0 Тогда
						Количество = ВыборкаТариф.КоличествоЕдИзм;
					ИначеЕсли  НЕ ВыборкаТариф.Порог  = Перечисления.ПорогиТарифовУслуг.ПустаяСсылка() Тогда
						ОбщееКоличество = ОбщееКоличество+ВыборкаТариф.КоличествоЕдИзм;
						Количество = ОбщееКоличество;
					КонецЕсли;
					
				КонецЦикла;	
				ОбластьСтрока.Параметры.Количество = ВыборкаУслуга.КоличествоЕдИзм;
				
				МассивВыводимыхОбластей.Добавить(ОбластьСтрока);
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
				СтруктураПоискаПриборов = Новый Структура("ОбъектУстановки, Услуга");
				СтруктураПоискаПриборов.ОбъектУстановки = ВыборкаУслуга.ЛицевойСчет;
				СтруктураПоискаПриборов.Услуга = ВыборкаУслуга.Услуга;
				
				НужнаПоверка = Ложь;
				
				Пока ВыборкаПриборы.НайтиСледующий(СтруктураПоискаПриборов) И Маркер = Ложь Цикл
					Если ВыборкаПриборы.ВидУслуги = "Холодна вода" Тогда
						Если ВыборкаПриборы.ТекущиеПоказания <> 0 Тогда // Если нет текущих показаний то и выводить нечего
							ОбластьПриборы = Макет.ПолучитьОбласть("Приборы");
							ОбластьПриборы.Параметры.Прибор = ВыборкаПриборы.ЗаводскойНомер+"/"+ВыборкаПриборы.ВидУслуги;
							ОбластьПриборы.Параметры.ПредыдущиеПоказания = ВыборкаПриборы.ПредыдущиеПоказания;
							ОбластьПриборы.Параметры.ТекущиеПоказания = ВыборкаПриборы.ТекущиеПоказания;
							ОбластьПриборы.Параметры.Разница = ВыборкаПриборы.ТекущиеПоказания - ВыборкаПриборы.ПредыдущиеПоказания; 
							МассивВыводимыхОбластей.Добавить(ОбластьПриборы);
							ТабличныйДокумент.Вывести(ОбластьПриборы);
							// Проверим нужна ли поверка прибора учета
							НужнаПоверка = ПроверитьПоверкуПрибораУчета(ВыборкаУслуга.ЛицевойСчет, ВыборкаПриборы.ПриборУчета);
							Если  НужнаПоверка <> Неопределено Тогда
								Если НужнаПоверка Тогда
									ОбластьПроверкаПрибораУчета = Макет.ПолучитьОбласть("ПроверкаПрибораУчета");
									//ДатаДляПроверки = ДобавитьМесяц(МесяцНачислений, 2);
									//ОбластьПроверкаПрибораУчета.Параметры.Дата = Формат(ДатаДляПроверки, "Л=uk_UA; ДФ=MMMM");
									ТабличныйДокумент.Вывести(ОбластьПроверкаПрибораУчета);
									МассивВыводимыхОбластей.Добавить(ОбластьПроверкаПрибораУчета);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Маркер = Истина;
				
			КонецЦикла;
			
			//РЕструкткризацияДолга
			ОбластьРеструкткризации = Макет.ПолучитьОбласть("РеструктуризацияДолга"); 
			Если ВыборкаОрганизация.Организация = ВыборкаЛицевойСчет.ЛицевойСчет.Владелец.Организация Тогда
				Пока ВыборкаРеструктуризация.НайтиСледующий(СтруктураПоиска) Цикл    ///////////////////////////////////
					СуммаОстатокПоРеструктуризации = ВыборкаРеструктуризация.ОстатокРеструктуризации;
					
					Если СуммаОстатокПоРеструктуризации <> 0 тогда
						
						//СтруктураПоиска.Вставить("Услуга",Справочники.Услуги.РеструктуризацияДолга);
						
						ОплаченоПлан = ПолучитьПредполагаемыеОплатыПоРеструктуризации(ТекущийДокумент, МесяцНачислений);
						ОплаченоФакт = ВыборкаРеструктуризация.Оплаты;
						
						ЗадолженностьПоРеструктуризации = ОплаченоПлан - ОплаченоФакт;
						ЗначениеРеструктуризацииДолга = ВыборкаРеструктуризация.СуммаПлатежа;
						Если ЗадолженностьПоРеструктуризации < 0 Тогда
							ЗадолженностьПоРеструктуризации = 0;
						КонецЕсли;
						ОстатокПоРеструктуризации =  СуммаОстатокПоРеструктуризации - ЗадолженностьПоРеструктуризации;
						
						Если ОстатокПоРеструктуризации >= ЗначениеРеструктуризацииДолга Тогда
							МесячнаяПлатаПоРеструктуризации = ЗначениеРеструктуризацииДолга;
						иначе
							МесячнаяПлатаПоРеструктуризации = ОстатокПоРеструктуризации;
						КонецЕсли;  
						
						ОбластьРеструкткризации.Параметры.СуммаРеструктуризации = МесячнаяПлатаПоРеструктуризации;
						ОбластьРеструкткризации.Параметры.ДолгРеструктуризации = ?(ОстатокПоРеструктуризации = 0,ВыборкаРеструктуризация.ОбщаяСумма,ОстатокПоРеструктуризации) ;
						ТабличныйДокумент.Вывести(ОбластьРеструкткризации);
						
						Если ЗадолженностьПоРеструктуризации <> 0 Тогда
							ОбластьЗадолженностиПореструктуризации = Макет.ПолучитьОбласть("ДолгПоРесруктуризации");
							ОбластьЗадолженностиПореструктуризации.Параметры.Задолженность = ЗадолженностьПоРеструктуризации;
							ТабличныйДокумент.Вывести(ОбластьЗадолженностиПореструктуризации);	
						КонецЕсли;
					КонецЕсли;
					Прервать;
				КонецЦикла;	 
			КонецЕсли;
			
			//Авансовые платежи
			АвансовыйПлатежВсего = 0;
			Если ПолучитьФункциональнуюОпцию("ИспользоватьАвансовыеПлатежи") Тогда
				
				Пока ВыборкаАвансовыхПлатежей.Следующий() Цикл
					ОбластьАвансовыхПлатежей = Макет.ПолучитьОбласть("АвансовыйПлатеж");
					ОбластьАвансовыхПлатежей.Параметры.РесурснаяУслуга = ВыборкаАвансовыхПлатежей.Услуга;
					ОбластьАвансовыхПлатежей.Параметры.СуммаАвансовогоПлатежа = ВыборкаАвансовыхПлатежей.СуммаАванса;
					АвансовыйПлатежВсего = АвансовыйПлатежВсего + ВыборкаАвансовыхПлатежей.СуммаАванса;
					Если ВыборкаАвансовыхПлатежей.СуммаАванса <> 0 Тогда
						ТабличныйДокумент.Вывести(ОбластьАвансовыхПлатежей);
					КонецЕсли;
					
				КонецЦикла;
				
				//ИтогиПоАвансам
				ОбластьАвансовыхПлатежейИтог = Макет.ПолучитьОбласть("АвансовыйПлатежИтого");
				ОбластьАвансовыхПлатежейИтог.Параметры.СуммаАвансовыхПлатежейВсего = АвансовыйПлатежВсего;
				Если АвансовыйПлатежВсего <> 0 Тогда
					ТабличныйДокумент.Вывести(ОбластьАвансовыхПлатежейИтог);
				КонецЕсли;	
			КонецЕсли;
			//ИТОГ
			ОбластьИтог = Макет.ПолучитьОбласть("Итог");
			ОбластьИтог.Параметры.СуммаИтого = НачисленноВсего+Долг+Аванс+Льгота+АвансовыйПлатежВсего+МесячнаяПлатаПоРеструктуризации+ЗадолженностьПоРеструктуризации-Оплаты;
			ОбластьИтог.Параметры.ЛицевойСчет 	= ВыборкаЛицевойСчет.ЛицевойСчет.Наименование;
			ОбластьИтог.Параметры.ФИО 			= Плательщик;
			ОбластьИтог.Параметры.НазанчениеПлатежа = НазначениеПлатежа;
			
			ТабличныйДокумент.Вывести(ОбластьИтог);	
			МассивВыводимыхОбластей.Добавить(ОбластьИтог);
			
			//Если НужнаПоверка Тогда
			//	ОбластьПроверкаПрибораУчета = Макет.ПолучитьОбласть("ПроверкаПрибораУчета");
			//	ОбластьПроверкаПрибораУчета.Параметры.Прибор = ОбластьПриборы.Параметры.Прибор;
			//	ТабличныйДокумент.Вывести(ОбластьПроверкаПрибораУчета);
			//	МассивВыводимыхОбластей.Добавить(ОбластьПроверкаПрибораУчета);
			//КонецЕсли;
			
			
			Если Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции

Функция ПроверитьПоверкуПрибораУчета(ОбъектУстановки, ПриборУчета)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ПоверкиПриборовУчетаСрезПоследних.Период,
	    |	ПоверкиПриборовУчетаСрезПоследних.ПоверкаВыполнена
	    |ИЗ
	    |	РегистрСведений.ПоверкиПриборовУчета.СрезПоследних(
	    |			&НаДату,
	    |			ОбъектУстановки = &ОбъектУстановки
	    |				И ПриборУчета = &ПриборУчета) КАК ПоверкиПриборовУчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("ОбъектУстановки", ОбъектУстановки);
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Период <= ТекущаяДата() И Выборка.ПоверкаВыполнена = Ложь Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
КонецФункции

Функция ПолучитьОбщуюСтруктуруКвитанции(ЛицевыеСчета, МесяцНачисления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РасчетПоказанийПриборовУчетаОстаткиИОбороты.ПриборУчета КАК ПриборУчета
	               |ПОМЕСТИТЬ ОПУ
	               |ИЗ
	               |	РегистрНакопления.РасчетПоказанийПриборовУчета.ОстаткиИОбороты(, , Авто, , ОбъектУстановки В (&ЛицевыеСчета)) КАК РасчетПоказанийПриборовУчетаОстаткиИОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПриборУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	               |	СУММА(ПоказанияПриборовУчетаСрезПоследних.Значение) КАК ТекущиеПоказания,
	               |	СУММА(0) КАК ПредыдущиеПоказания,
	               |	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа КАК ВидТарифа
	               |ПОМЕСТИТЬ ПУ
	               |ИЗ
	               |	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(
	               |			КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ),
	               |			ПриборУчета В
	               |				(ВЫБРАТЬ
	               |					ОПУ.ПриборУчета
	               |				ИЗ
	               |					ОПУ КАК ОПУ)) КАК ПоказанияПриборовУчетаСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	               |	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	               |	СУММА(0),
	               |	СУММА(ПоказанияПриборовУчетаСрезПоследних.Значение),
	               |	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа
	               |ИЗ
	               |	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(
	               |			ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ДЕНЬ, -1),
	               |			ПриборУчета В
	               |				(ВЫБРАТЬ
	               |					ОПУ.ПриборУчета
	               |				ИЗ
	               |					ОПУ КАК ОПУ)) КАК ПоказанияПриборовУчетаСрезПоследних
	               |ГДЕ
	               |	ПоказанияПриборовУчетаСрезПоследних.Период < КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	               |	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПриборУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПлатежиПоРеструктуризацииДолга.ЛицевойСчет КАК ЛицевойСчет,
	               |	ПлатежиПоРеструктуризацииДолга.СуммаПлатежа КАК СуммаПлатежа,
	               |	ПлатежиПоРеструктуризацииДолга.ОбщаяСумма КАК ОбщаяСумма,
	               |	ПлатежиПоРеструктуризацииДолга.Регистратор КАК ДокументРеструктуризации
	               |ПОМЕСТИТЬ ПРД
	               |ИЗ
	               |	РегистрСведений.ПлатежиПоРеструктуризацииДолга КАК ПлатежиПоРеструктуризацииДолга
	               |ГДЕ
	               |	ПлатежиПоРеструктуризацииДолга.Период >= КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |	И ПлатежиПоРеструктуризацииДолга.ЛицевойСчет В(&ЛицевыеСчета)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга КАК Услуга,
	               |	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация
	               |		ИНАЧЕ РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец.Организация
	               |	КОНЕЦ КАК Организация
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ЛицевойСчет В (&ЛицевыеСчета)) КАК РасчетыПоЛицевымСчетамОстатки
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга,
	               |	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток,
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация
	               |		ИНАЧЕ РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец.Организация
	               |	КОНЕЦ
	               |ИТОГИ
	               |	СУММА(СуммаОстаток)
	               |ПО
	               |	ЛицевойСчет,
	               |	Организация,
	               |	Услуга
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
	               |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
	               |	СУММА(ЕСТЬNULL(ПУ.ТекущиеПоказания, 0)) КАК ТекущиеПоказания,
	               |	СУММА(ЕСТЬNULL(ПУ.ПредыдущиеПоказания, 0)) КАК ПредыдущиеПоказания,
	               |	ПУ.ПриборУчета.Коэффициент,
	               |	КОЛИЧЕСТВО(УстановленныеПриборыУчетаСрезПоследних.ПриборУчета) КАК КоличествоПиборовНаУслуге,
	               |	ПУ.ПриборУчета.Услуга КАК Услуга,
	               |	ПУ.ПриборУчета.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ПУ.ВидТарифа КАК ВидТарифа,
	               |	ПУ.ПриборУчета.ЗаводскойНомер КАК ЗаводскойНомер,
	               |	ПУ.ПриборУчета.Услуга.ВидУслуги.Наименование КАК ВидУслуги
	               |ИЗ
	               |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ОбъектУстановки В (&ЛицевыеСчета)) КАК УстановленныеПриборыУчетаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПУ КАК ПУ
	               |		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПУ.ПриборУчета
	               |ГДЕ
	               |	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
	               |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
	               |	ПУ.ПриборУчета.Коэффициент,
	               |	ПУ.ПриборУчета.Услуга,
	               |	ПУ.ПриборУчета.ЕдиницаИзмерения,
	               |	ПУ.ВидТарифа,
	               |	ПУ.ПриборУчета.ЗаводскойНомер,
	               |	ПУ.ПриборУчета.Услуга.ВидУслуги.Наименование
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗаменыПриборовУчета.ОбъектУстановки,
	               |	ЗаменыПриборовУчета.ПриборУчета,
	               |	ЗаменыПриборовУчета.Показание,
	               |	ЗаменыПриборовУчета.ПоказаниеПредыдущее,
	               |	ЗаменыПриборовУчета.ПриборУчета.Коэффициент,
	               |	0,
	               |	ЗаменыПриборовУчета.Услуга,
	               |	ЗаменыПриборовУчета.ПриборУчета.ЕдиницаИзмерения,
	               |	ЗаменыПриборовУчета.ВидТарифа,
	               |	ЗаменыПриборовУчета.ПриборУчета.ЗаводскойНомер,
	               |	ЗаменыПриборовУчета.Услуга.ВидУслуги.Наименование
	               |ИЗ
	               |	РегистрНакопления.ЗаменыПриборовУчета КАК ЗаменыПриборовУчета
	               |ГДЕ
	               |	ЗаменыПриборовУчета.Период МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |	И ЗаменыПриборовУчета.ОбъектУстановки В(&ЛицевыеСчета)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Услуга УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец КАК Здание,
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетам.Услуга КАК Услуга,
	               |	РасчетыПоЛицевымСчетам.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	РасчетыПоЛицевымСчетам.Тариф КАК Тариф,
	               |	РасчетыПоЛицевымСчетам.ДнейНачислено КАК ДнейНачислено,
	               |	СУММА(ЕСТЬNULL(ВЫБОР
	               |				КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	               |						ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РазовоеНачисление)
	               |					ТОГДА РасчетыПоЛицевымСчетам.Количество
	               |			КОНЕЦ, 0)) КАК КоличествоЕдИзм,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	               |					ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РазовоеНачисление)
	               |					ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.КачествоУслуги)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Начисление,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	               |					И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |				ТОГДА -РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Субсидия,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	               |					И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |				ТОГДА -РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Льгота,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Перерасчет,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |					И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.ДоговорРеструктуризацииДолга)
	               |					И РасчетыПоЛицевымСчетам.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	               |					И РасчетыПоЛицевымСчетам.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Оплата,
	               |	СУММА(ВЫБОР
	               |			КОГДА НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РазовоеНачисление)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.КачествоУслуги)
	               |					И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |					И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.ДоговорРеструктуризацииДолга)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Корректировка,
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет.ОбъектЛицевогоСчета КАК Квартира,
	               |	ЕСТЬNULL(РасчетыПоЛицевымСчетам.Порог, """") КАК Порог,
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицевымСчетам.Услуга.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетам.Услуга.Организация
	               |		ИНАЧЕ РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец.Организация
	               |	КОНЕЦ КАК Организация,
	               |	РасчетыПоЛицевымСчетам.ВидТарифа КАК ВидТарифа
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет В(&ЛицевыеСчета)
	               |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |	И РасчетыПоЛицевымСчетам.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетам.Услуга,
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец,
	               |	РасчетыПоЛицевымСчетам.Услуга.ЕдиницаИзмерения,
	               |	РасчетыПоЛицевымСчетам.Тариф,
	               |	РасчетыПоЛицевымСчетам.ДнейНачислено,
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет.ОбъектЛицевогоСчета,
	               |	ЕСТЬNULL(РасчетыПоЛицевымСчетам.Порог, """"),
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицевымСчетам.Услуга.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетам.Услуга.Организация
	               |		ИНАЧЕ РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец.Организация
	               |	КОНЕЦ,
	               |	РасчетыПоЛицевымСчетам.ВидТарифа
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец,
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга.ЕдиницаИзмерения,
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.ОбъектЛицевогоСчета,
	               |	СУММА(0),
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация
	               |		ИНАЧЕ РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец.Организация
	               |	КОНЕЦ,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ЛицевойСчет В (&ЛицевыеСчета)) КАК РасчетыПоЛицевымСчетамОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга,
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация
	               |		ИНАЧЕ РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец.Организация
	               |	КОНЕЦ,
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга.ЕдиницаИзмерения,
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.ОбъектЛицевогоСчета
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Услуга УБЫВ
	               |ИТОГИ
	               |	СУММА(КоличествоЕдИзм),
	               |	СУММА(Начисление),
	               |	СУММА(Субсидия),
	               |	СУММА(Льгота),
	               |	СУММА(Перерасчет),
	               |	СУММА(Оплата),
	               |	СУММА(Корректировка)
	               |ПО
	               |	Организация,
	               |	ЛицевойСчет,
	               |	Услуга
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПланированиеАвансовЛицевыеСчета.ЛицевойСчет,
	               |	ПланированиеАвансовЛицевыеСчета.СуммаНачислено КАК СуммаАванса,
	               |	ПланированиеАвансовЛицевыеСчета.Ссылка.Услуга
	               |ИЗ
	               |	Документ.ПланированиеАвансов.ЛицевыеСчета КАК ПланированиеАвансовЛицевыеСчета
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ПланированиеАвансовЛицевыеСчета.Ссылка.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&МесяцНачисления, МЕСЯЦ, 1), МЕСЯЦ)
	               |	И ПланированиеАвансовЛицевыеСчета.ЛицевойСчет В(&ЛицевыеСчета)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПРД.ЛицевойСчет КАК ЛицевойСчет,
	               |	ПРД.СуммаПлатежа КАК СуммаПлатежа,
	               |	ПРД.ОбщаяСумма КАК ОбщаяСумма,
	               |	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход, 0) КАК Оплаты,
	               |	ПРД.ОбщаяСумма - ЕСТЬNULL(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход, 0) КАК ОстатокРеструктуризации,
	               |	ПРД.ДокументРеструктуризации
	               |ИЗ
	               |	ПРД КАК ПРД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(, КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), , , Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	               |		ПО ПРД.ЛицевойСчет = РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет
	               |ГДЕ
	               |	ПРД.ЛицевойСчет В(&ЛицевыеСчета)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга КАК Услуга,
	               |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток,
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация
	               |		ИНАЧЕ РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец.Организация
	               |	КОНЕЦ КАК Организация
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ЛицевойСчет В (&ЛицевыеСчета)) КАК РасчетыПоЛицевымСчетамОстатки
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга,
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация
	               |		ИНАЧЕ РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец.Организация
	               |	КОНЕЦ
	               |ИТОГИ
	               |	СУММА(СуммаОстаток)
	               |ПО
	               |	ЛицевойСчет,
	               |	Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДоговорРеструктуризацииДолга.Ссылка
	               |ИЗ
	               |	Документ.ДоговорРеструктуризацииДолга КАК ДоговорРеструктуризацииДолга
	               |ГДЕ
	               |	ДоговорРеструктуризацииДолга.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |	И ДоговорРеструктуризацииДолга.Проведен = ИСТИНА
	               |	И ДоговорРеструктуризацииДолга.ЛицевойСчет В(&ЛицевыеСчета)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоСубсидиям.ЛицевойСчет,
	               |	РасчетыПоСубсидиям.МесяцНачисления,
	               |	РасчетыПоСубсидиям.Услуга,
	               |	МАКСИМУМ(РасчетыПоСубсидиям.ГраницаСубсидии) КАК ГраницаСубсидии
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоСубсидиям КАК РасчетыПоСубсидиям
	               |ГДЕ
	               |	РасчетыПоСубсидиям.Период МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |	И РасчетыПоСубсидиям.ЛицевойСчет В(&ЛицевыеСчета)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоСубсидиям.ЛицевойСчет,
	               |	РасчетыПоСубсидиям.Услуга,
	               |	РасчетыПоСубсидиям.МесяцНачисления";
	
	Запрос.УстановитьПараметр("ЛицевыеСчета", ЛицевыеСчета);
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат Результат;
	
КонецФункции


Функция ПечатьКвитанцииНаОплатуИСХОДНАЯ(ТекущийДокумент, ТабличныйДокумент, МесяцНачислений, БанковскиеСчетаОрганизации) Экспорт 
	
	ГлобальнаяВыборка = ПолучитьОбщуюСтруктуруКвитанции(ТекущийДокумент, МесяцНачислений);
	// Заполнение таблицы
	ЕстьРеструктуризация = НЕ ГлобальнаяВыборка[9].Пустой();
	ВыборкаОрганизация = ГлобальнаяВыборка[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПриборыУчета = ГлобальнаяВыборка[4].Выбрать();
	Если ЕстьРеструктуризация Тогда;
		ВыборкаОбщийОстаток = ГлобальнаяВыборка[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Иначе
		ВыборкаОбщийОстаток = ГлобальнаяВыборка[8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	
	ВыборкаАвансовыхПлатежей = ГлобальнаяВыборка[6].Выбрать();
	ВыборкаПоРеструктуризацииДолга = ГлобальнаяВыборка[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОстатокПоУслугам = ГлобальнаяВыборка[8].Выгрузить();
	ВыборкаГраницаСубсидии = ГлобальнаяВыборка[10].Выбрать();

	
	Макет =  ПолучитьОбщийМакет("МакетКвитанцииНаОплату");
	
	ЕСЛИ НЕ ГлобальнаяВыборка[5].Пустой() Тогда
		Пока ВыборкаОрганизация.Следующий() Цикл
			
			
			
			ИспользуютсяАвансовыеПлатежи = ПолучитьФункциональнуюОпцию("ИспользоватьАвансовыеПлатежи");
			АвансовыйПлатежВсего = 0;
			ВыборкаПриборыУчета.Сбросить();
			ТаблицаДляРасчетаИтогов = Новый ТаблицаЗначений;
			ТаблицаДляРасчетаИтогов.Колонки.Добавить("КОплате");
			ТаблицаДляРасчетаИтогов.Очистить();
			
			
			ЗначениеРеструктуризацииДолга = 0;
			ЗадолженностьПоРеструктуризации = 0;
			МесячнаяПлатаПоРеструктуризации = 0;
			
			//Получаем настройки печати квитанции
			КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
			Макет.КодЯзыкаМакета = КодЯзыкаПечать;
			
			//Для удобства накапливаем переменные
			Квартира = ТекущийДокумент.ОбъектЛицевогоСчета;
			
			
			//Создадим адрес в необходимои формате
			АдресМасс = РазложитьСтрокуВМассивПодстрок(ТекущийДокумент.Владелец.Наименование);
			
			
			//ШАПКА
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
			ОбластьШапка.Параметры.МесяцНачисления = Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
			ОбластьШапка.Параметры.Получатель =ВыборкаОрганизация.Организация.НаименованиеПолное;
			ОбластьШапка.Параметры.ЄДРПОУ = ВыборкаОрганизация.Организация.КодПоЕДРПОУ;
			
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			//БанковскийСчет
			Для каждого Строка Из БанковскиеСчетаОрганизации Цикл
				Если Строка.Печать Тогда
					Если ВыборкаОрганизация.Организация = Строка.БанковскийСчет.Владелец Тогда
						ОбластьБанковскийСчет = Макет.ПолучитьОбласть("БанковскийСчет");
						ОбластьБанковскийСчет.Параметры.Рр = ПолучитьПредставлениеБанковскогоСчета(Строка.БанковскийСчет);
						ОбластьБанковскийСчет.Параметры.Банк = Строка.БанковскийСчет.Банк.Наименование;
//{{MRG[ <-> ]
						//ОбластьБанковскийСчет.Параметры.МФО = Строка.БанковскийСчет.Банк.Код;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//						ОбластьБанковскийСчет.Параметры.МФО = Строка.БанковскийСчет.Банк.Код;
//}}MRG[ <-> ]
						
						ТабличныйДокумент.Вывести(ОбластьБанковскийСчет);
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла; 
			
			//ШапкаОсновнойЧасти 
			ВыборкаПлощади = РегистрыСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(НачалоМесяца(МесяцНачислений),Новый Структура("Помещение", Квартира));
			
			ОбластьШапкаОсновнойЧасти = Макет.ПолучитьОбласть("ШапкаОсновнойЧасти");
			Для Каждого Строка Из ВыборкаПлощади Цикл
				Если Строка.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
					ОбластьШапкаОсновнойЧасти.Параметры.ПлощадьОтоп = Строка.Площадь;
				ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
					ОбластьШапкаОсновнойЧасти.Параметры.ПлощадьВся = Строка.Площадь;
				КонецЕсли;
			КонецЦикла;
			
			ВыборкаКолПроживающих = РегистрыСведений.ЛицевыеСчета.ПолучитьПоследнее(НачалоМесяца(МесяцНачислений),Новый Структура("ЛицевойСчет",ТекущийДокумент));
			ВыборкаМашиномест = РегистрыСведений.МашиноМеста.ПолучитьПоследнее(НачалоМесяца(МесяцНачислений),Новый Структура("ЛицевойСчет",ТекущийДокумент));
			Попытка
				Если Константы.ВыводитьВКвитанцияхФИО.Получить() = Истина Тогда
					Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование; 
				Иначе
					Плательщик = "";
				КонецЕсли;
				ОбластьШапкаОсновнойЧасти.Параметры.Плательщик = Плательщик;
			Исключение
			КонецПопытки;
			
			НазначениеПлатежа = ТекущийДокумент.Владелец.ТекстНазначенияПлатежа;
			ОбластьШапкаОсновнойЧасти.Параметры.КолЧеловек = ВыборкаКолПроживающих.КоличествоПроживающих;
			
//{{MRG[ <-> ]
			//ОбластьШапкаОсновнойЧасти.Параметры.КоличествоМестПаркинг = ВыборкаМашиномест.КоличествоМашиноМест;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//			ОбластьШапкаОсновнойЧасти.Параметры.КоличествоМестПаркинг = ВыборкаМашиномест.КоличествоМашиноМест;
//}}MRG[ <-> ]
			ОбластьШапкаОсновнойЧасти.Параметры.ЛицевойСчет = ТекущийДокумент;
			
			Если Константы.ВыводитьАдресВКвитанциях.Получить() = Истина Тогда
				ОбластьШапкаОсновнойЧасти.Параметры.Адрес = ПолучитьПредставлениеАдреса(АдресМасс, Квартира,КодЯзыкаПечать);
			Иначе
				ОбластьШапкаОсновнойЧасти.Параметры.Адрес = ТекущийДокумент;
			КонецЕсли;
			
			
			ТабличныйДокумент.Вывести(ОбластьШапкаОсновнойЧасти);
			
			//ШапкаТаблицыУслуг
			ОбластьШапкаТаблицыУслуг = Макет.ПолучитьОбласть("ШапкаТаблицыУслуг");
//{{MRG[ <-> ]
			//ОбластьШапкаТаблицыУслуг.Параметры.Оплата = ?(КодЯзыкаПечать="ru","Сплачено у ","Сплачено у ")+ Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//			ОбластьШапкаТаблицыУслуг.Параметры.Оплата = ?(КодЯзыкаПечать="ru","Зачислено в ","Зараховано в ")+ Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
//}}MRG[ <-> ]
			//ОбластьШапкаТаблицыУслуг.Параметры.ДатаДолга = Формат(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1), ?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" р.""'"));
			//
			//ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыУслуг);
			
//{{MRG[ <-> ]
//			ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыУслуг);
//}}MRG[ <-> ]
			ВыборкаЛицевойСчет = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
 			Пока ВыборкаЛицевойСчет.Следующий() Цикл
				
				ВыборкаУслуга = ВыборкаЛицевойСчет.выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Корректировка =  ВыборкаЛицевойСчет.Корректировка;
				Перерасчет = ВыборкаЛицевойСчет.Перерасчет;
				Субсидия = ВыборкаЛицевойСчет.Субсидия;
				Льгота = ВыборкаЛицевойСчет.Льгота;
				НачисленоГрнВсего = ВыборкаЛицевойСчет.Начисление;
				
				НачисленоВсего =  ВыборкаЛицевойСчет.Начисление + ВыборкаЛицевойСчет.Корректировка + ВыборкаЛицевойСчет.Перерасчет;
				СтруктураПоискаОбщегоОстатка = Новый Структура("ЛицевойСчет");
				СтруктураПоискаОбщегоОстатка.ЛицевойСчет  = ВыборкаЛицевойСчет.ЛицевойСчет;
				
				ПервыйСчетчик = истина;
				ОстатокНаКонецМесяца = Неопределено;
				Пока ВыборкаОбщийОстаток.НайтиСледующий(СтруктураПоискаОбщегоОстатка) Цикл
					ВыборкаОстатковОрганизация = ВыборкаОбщийОстаток.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаОстатковОрганизация.следующий() Цикл
						ОрганизацияОтбор = Неопределено;
						Если ВыборкаОстатковОрганизация.Организация = Справочники.Организации.ПустаяСсылка() Тогда
							ОрганизацияОтбор = ВыборкаЛицевойСчет.ЛицевойСчет.Владелец.Организация;
						Иначе
							ОрганизацияОтбор = ВыборкаОстатковОрганизация.Организация;
						КонецЕсли;	
						Если  ОрганизацияОтбор = ВыборкаЛицевойСчет.Организация  Тогда
							ОстатокНаКонецМесяца = ВыборкаОстатковОрганизация.СуммаОстаток;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				ВыборкаОбщийОстаток.Сбросить();
				
				
				
				Если ОстатокНаКонецМесяца = Неопределено Тогда
					ОстатокНаКонецМесяца = 0;
				КонецЕсли;
				
				
				Оплаты = ВыборкаЛицевойСчет.Оплата;
				Если ЕстьРеструктуризация Тогда
					Остаток =  ОстатокНаКонецМесяца  - Корректировка - Перерасчет - ?(Субсидия<0,0,Субсидия) - ?(Льгота<0,0,Льгота);
					Всего = НачисленоВсего+Остаток;
					//ОбластьШапкаТаблицыУслуг.Параметры.Оплата = ?(КодЯзыкаПечать="ru","Сплачено у ","Сплачено у ")+ Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
					ОбластьШапкаТаблицыУслуг.Параметры.ДатаДолга = ОбластьШапка.Параметры.МесяцНачисления;//Формат(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1), ?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" р.""'"));
					ОбластьШапкаТаблицыУслуг.Параметры.Долг = Остаток;
					ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыУслуг);
				ИНаче
					Остаток = ОстатокНаКонецМесяца;
					Всего = НачисленоВсего+Льгота+Субсидия + Остаток - Оплаты;
					//ОбластьШапкаТаблицыУслуг.Параметры.Оплата = ?(КодЯзыкаПечать="ru","Сплачено у ","Сплачено у ")+ Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
					ОбластьШапкаТаблицыУслуг.Параметры.ДатаДолга = ОбластьШапка.Параметры.МесяцНачисления;//Формат(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1), ?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" р.""'"));
					ОбластьШапкаТаблицыУслуг.Параметры.Долг = Остаток;
					ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыУслуг);
				КонецЕсли;
				
				Если Остаток > 0 тогда
					ПризнакАванса = Ложь;
					
				Иначе
					ПризнакАванса = ИСТИНА;
					остаток = остаток;
				КонецЕсли;
				
				
				
				Таблица = Новый ТаблицаЗначений;
				Таблица.Колонки.Добавить("Услуга",,"Услуга");
				Таблица.Колонки.Добавить("Счетчик",,"Счетчик");
				Таблица.Колонки.Добавить("Коэффициент",,"Коэффициент");
				Таблица.Колонки.Добавить("ЕдИзм",,"ЕдИзм");
				Таблица.Колонки.Добавить("Тариф",,"Тариф");
				Таблица.Колонки.Добавить("Норма",,"Норма");
				Таблица.Колонки.Добавить("Оплаты",,"Оплаты");
				Таблица.Колонки.Добавить("Долг",,"Долг");
				Таблица.Колонки.Добавить("ТекущиеПоказания",,"ТекущиеПоказания");
				Таблица.Колонки.Добавить("ПредыдущиеПоказания",,"ПредыдущиеПоказания");
				Таблица.Колонки.Добавить("Начисление",,"Начисление");
				Таблица.Колонки.Добавить("Льгота",,"Льгота");
				Таблица.Колонки.Добавить("Субсидия",,"Субсидия");
				Таблица.Колонки.Добавить("КоличествоЕдиниц",,"КоличествоЕдиниц");
				Таблица.Колонки.Добавить("Корректировка",,"Корректировка");
				Таблица.Колонки.Добавить("ГраницаСубсидии",,"ГраницаСубсидии");
				Таблица.Колонки.Добавить("Неустойка",, "Неустойка");
				Таблица.Колонки.Добавить("Пеня",, "Пеня");
				
				
				Пока ВыборкаУслуга.Следующий() Цикл
					
					СтруктураПоискаПриборов = Новый Структура("ОбъектУстановки, Услуга");
					СтруктураПоискаПриборов.ОбъектУстановки = ВыборкаУслуга.ЛицевойСчет;
					СтруктураПоискаПриборов.Услуга = ВыборкаУслуга.Услуга;
					Марк = Истина;
					НоваяУслуга = "";
					СтараяУслуга = "";
					ПОКА ВыборкаПриборыУчета.НайтиСледующий(СтруктураПоискаПриборов) Цикл
						
						КорректировкаПоПрибору = 0;
						ПерерасчетПоприбору = 0;
						
						
						НоваяУслуга = ВыборкаУслуга.Услуга;
						Строка = Таблица.Добавить();
//{{MRG[ <-> ]
						Строка.Услуга = ВыборкаУслуга.Услуга.ПолноеНаименование;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//						Строка.Услуга = ВыборкаУслуга.Услуга;
//}}MRG[ <-> ]
						Строка.Счетчик = ВыборкаПриборыУчета.ЗаводскойНомер+"/"+ВыборкаПриборыУчета.ВидУслуги;
						Строка.Коэффициент = ВыборкаПриборыУчета.ПриборУчетаКоэффициент;
						Строка.ЕдИзм = ВыборкаУслуга.ЕдиницаИзмерения;
						
						ВыборкаТариф = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Тариф = "";
						КоличествоЕдиниц = 0;
						Пока ВыборкаТариф.Следующий() Цикл
							Если Тариф = "" Тогда
								Значение = ?(ВыборкаТариф.Тариф = 0 ,"",Строка(ВыборкаТариф.Тариф)) ;
								
							Иначе
								Если ВыборкаТариф.Тариф = 0 Тогда
									Значение = "";
								Иначе
									Если ВыборкаТариф.Тариф = 0 Тогда
										Значение = "";
									Иначе	
										Значение = "\"+Строка(ВыборкаТариф.Тариф);
									КонецЕсли;
									
								КонецЕсли;	
							КонецЕсли;
							Тариф = Тариф+Значение;
							
							Если КоличествоЕдиниц <> ВыборкаТариф.КоличествоЕдИзм И ВыборкаТариф.КоличествоЕдИзм <> 0 Тогда
								Если ВыборкаТариф.Порог <> Неопределено Тогда
									КоличествоЕдиниц = КоличествоЕдиниц + ВыборкаТариф.КоличествоЕдИзм;
								Иначе	
									КоличествоЕдиниц = ВыборкаТариф.КоличествоЕдИзм;
								КонецЕсли;	
							КонецЕсли;
						КонецЦикла;
						
						
						Строка.КоличествоЕдиниц = КоличествоЕдиниц;
						Строка.Тариф = Тариф;		
						СтруктураПоискаДолгаПоУслуге = Новый Структура("ЛицевойСчет, Услуга");
						СтруктураПоискаДолгаПоУслуге.ЛицевойСчет = ВыборкаУслуга.ЛицевойСчет;
						СтруктураПоискаДолгаПоУслуге.Услуга = ВыборкаУслуга.Услуга;
						
						Строка.Долг = 0;
						Строка.Оплаты = 0;
						
						НайденныеСтроки = ВыборкаОстатокПоУслугам.НайтиСтроки(СтруктураПоискаДолгаПоУслуге);
						
						Если НайденныеСтроки.Количество() >  0 Тогда
							Строка.Долг = НайденныеСтроки[0].СуммаОстаток;
						Иначе
							Строка.Долг = 0;
						КонецЕсли;
						Строка.Оплаты = ВыборкаУслуга.Оплата;
						
						
						
						Строка.ТекущиеПоказания = ВыборкаПриборыУчета.ТекущиеПоказания;
						Строка.ПредыдущиеПоказания = ВыборкаПриборыУчета.ПредыдущиеПоказания;
						КорректировкаПоПрибору = ВыборкаУслуга.Корректировка;
						ПерерасчетПоприбору = ВыборкаУслуга.Перерасчет;
						Строка.Льгота = ВыборкаУслуга.Льгота;
						Строка.Субсидия = ВыборкаУслуга.Субсидия;
						Если ВыборкаУслуга.Субсидия <> 0 Тогда
							
							СтруктараПоискаСубс = Новый Структура;
							СтруктараПоискаСубс.Вставить("ЛицевойСчет",ТекущийДокумент);
							СтруктараПоискаСубс.Вставить("Услуга",ВыборкаУслуга.Услуга);
							СтруктараПоискаСубс.Вставить("МесяцНачисления",НачалоМесяца(МесяцНачислений));
							
							
							Если ВыборкаГраницаСубсидии.НайтиСледующий(СтруктараПоискаСубс)  Тогда
								Строка.ГраницаСубсидии = ВыборкаГраницаСубсидии.ГраницаСубсидии;
							КонецЕсли;
							ВыборкаГраницаСубсидии.Сбросить();
						КонецЕсли;
						
						
						Если СтараяУслуга <> НоваяУслуга  тогда
							Строка.Корректировка = ПерерасчетПоприбору + КорректировкаПоПрибору;
							Строка.Начисление = ВыборкаУслуга.Начисление;
						Иначе
							Строка.Начисление = ВыборкаУслуга.Начисление;
						КонецЕсли; 
						
						Марк = Ложь;
						СтараяУслуга = ВыборкаУслуга.Услуга;
					КонецЦикла;		
					
					Если Марк = Ложь тогда
						Продолжить;
					КонецЕсли;
					
					ОбластьСтрокаУслуг = Макет.ПолучитьОбласть("СтрокаУслуг");
					
					Если ВыборкаУслуга.Услуга = Справочники.Услуги.ПустаяСсылка() тогда
						Если ПризнакАванса = Истина тогда
							ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг =  "АВАНС";
							ОбластьСтрокаУслуг.Параметры.ЕдИзмер = "";
						Иначе
//{{MRG[ <-> ]
							ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг =  ?(КодЯзыкаПечать = "uk","+ БОРГ/ - ПЕРЕПЛАТА","+ БОРГ/ - ПЕРЕПЛАТА");
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//							ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг =  ?(КодЯзыкаПечать = "uk","БОРГ","ДОЛГ");
//}}MRG[ <-> ]
							ОбластьСтрокаУслуг.Параметры.ЕдИзмер = "";
						КонецЕсли;
					ИначеЕсли  ВыборкаУслуга.Услуга = Справочники.Услуги.РеструктуризацияДолга Тогда
						//ДанныеПоРеструктуризацииДолга = ВыборкаУслуга.Начисление;  //метка
						Продолжить;
					Иначе
//{{MRG[ <-> ]
						ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг =  ВыборкаУслуга.Услуга.ПолноеНаименование;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//						ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг =  ВыборкаУслуга.Услуга;
//}}MRG[ <-> ]
						ОбластьСтрокаУслуг.Параметры.ЕдИзмер = ВыборкаУслуга.ЕдиницаИзмерения;
					КонецЕсли;
					
					ВыборкаТариф = ВыборкаУслуга.Выбрать();
					Тариф = "";
					ДнейНачислено = 0;
					Пока ВыборкаТариф.Следующий() Цикл
						Если Тариф = "" Тогда
							Значение = ?(ВыборкаТариф.Тариф = 0 ,"",Строка(ВыборкаТариф.Тариф)) ;
						Иначе 
							Если ВыборкаТариф.Тариф = 0 Тогда
								Значение = "";
							Иначе	
								Значение = "\"+Строка(ВыборкаТариф.Тариф);
							КонецЕсли;	
						КонецЕсли;
						Тариф = Тариф+Значение;
						
						
						Если НЕ ВыборкаТариф.Начисление = 0 Тогда
							ДнейНачислено= ДнейНачислено + ВыборкаТариф.ДнейНачислено;
						КонецЕсли;
						
					КонецЦикла;
					Если ВыборкаУслуга.Услуга <> Справочники.Услуги.ПустаяСсылка() Тогда 
						ОбластьСтрокаУслуг.Параметры.Тариф = Тариф;
						ОбластьСтрокаУслуг.Параметры.КолДней = ВыборкаУслуга.КоличествоЕдИзм;
						ОбластьСтрокаУслуг.Параметры.НачисленоГрн = ВыборкаУслуга.Начисление;
						ОбластьСтрокаУслуг.Параметры.Оплаты = ВыборкаУслуга.Оплата;
						
						ОбластьСтрокаУслуг.Параметры.Льготы = ВыборкаУслуга.Льгота;
						ОбластьСтрокаУслуг.Параметры.Субсидии = ВыборкаУслуга.Субсидия;
						Если ВыборкаУслуга.Субсидия <> 0 Тогда
							
							СтруктараПоискаСубс = Новый Структура;
							СтруктараПоискаСубс.Вставить("ЛицевойСчет",ТекущийДокумент);
							СтруктараПоискаСубс.Вставить("Услуга",ВыборкаУслуга.Услуга);
							СтруктараПоискаСубс.Вставить("МесяцНачисления",НачалоМесяца(МесяцНачислений));
							
							
							Если ВыборкаГраницаСубсидии.НайтиСледующий(СтруктараПоискаСубс)  Тогда
								ОбластьСтрокаУслуг.Параметры.ОбПлат = ВыборкаГраницаСубсидии.ГраницаСубсидии;
							КонецЕсли;
							ВыборкаГраницаСубсидии.Сбросить();
						КонецЕсли;
						ОбластьСтрокаУслуг.Параметры.Пересчет = ВыборкаУслуга.Перерасчет+ВыборкаУслуга.корректировка;
						//ОбластьСтрокаУслуг.Параметры.Корректировка = ВыборкаУслуга.корректировка;
					Иначе
						ОбластьСтрокаУслуг.Параметры.Тариф = 0;
						ОбластьСтрокаУслуг.Параметры.КолДней = 0;
						ОбластьСтрокаУслуг.Параметры.НачисленоГрн = 0;
						ОбластьСтрокаУслуг.Параметры.Оплаты = 0;
						ОбластьСтрокаУслуг.Параметры.Льготы = 0;
						ОбластьСтрокаУслуг.Параметры.Субсидии = 0;
						ОбластьСтрокаУслуг.Параметры.Пересчет = 0;
						//ОбластьСтрокаУслуг.Параметры.Корректировка = 0;
					КонецЕсли;
					Начислено = ВыборкаУслуга.Начисление + ?(ВыборкаУслуга.Субсидия>0,-ВыборкаУслуга.Субсидия,ВыборкаУслуга.Субсидия) +?(ВыборкаУслуга.Льгота>0,-ВыборкаУслуга.Льгота,ВыборкаУслуга.Льгота)  + ВыборкаУслуга.Перерасчет + ВыборкаУслуга.Корректировка;
					//ОбластьСтрокаУслуг.Параметры.Начислено = Начислено;				
					СтруктураПоискаДолгаПоУслуге = Новый Структура("ЛицевойСчет, Услуга");
					СтруктураПоискаДолгаПоУслуге.ЛицевойСчет = ВыборкаУслуга.ЛицевойСчет;
					СтруктураПоискаДолгаПоУслуге.Услуга = ВыборкаУслуга.Услуга;
					
					НайденныеСтроки = ВыборкаОстатокПоУслугам.НайтиСтроки(СтруктураПоискаДолгаПоУслуге);
					Если НайденныеСтроки.Количество() >  0  Тогда
						Долгпериода = НайденныеСтроки[0].СуммаОстаток;
					Иначе
						Долгпериода = 0;
					КонецЕсли;
					
					Долг = Долгпериода-ВыборкаУслуга.Оплата;      //Метка
					
					ОбластьСтрокаУслуг.Параметры.Долг = Долгпериода;
					ОбластьСтрокаУслуг.Параметры.НачисленоКОплате = Начислено + Долг;
					НоваяСтрока = ТаблицаДляРасчетаИтогов.Добавить();
					НоваяСтрока.КОплате = ?((Начислено + Долг)<0,0,(Начислено + Долг));
					Если ОбластьСтрокаУслуг.Параметры.НачисленоГрн <> 0
						ИЛИ ОбластьСтрокаУслуг.Параметры.Долг <> 0 
						ИЛИ Начислено <> 0
						ИЛИ ОбластьСтрокаУслуг.Параметры.Оплаты <> 0 Тогда
						
						ТабличныйДокумент.Вывести(ОбластьСтрокаУслуг);
					КонецЕсли;
					
					Долгпериода = Неопределено;
					
				КонецЦикла;
				
				УслугаСчетчика = "";
				Для каждого Строка Из Таблица Цикл
					
					Если Строка.ТекущиеПоказания <> 0 Тогда // если нет текущих показаний тогда и выводить нечего	
						Если ПервыйСчетчик Тогда
							ОбластьШапкаСчетчика = Макет.ПолучитьОбласть("ШапкаОбщиеПоказателиСчетчика");
							
							ТабличныйДокумент.Вывести(ОбластьШапкаСчетчика);
							ПервыйСчетчик = Ложь;
						КонецЕсли;
						
						ОбластьПриборы = Макет.ПолучитьОбласть("СтрокаСчетчиков");
						ОбластьПриборы.Параметры.Услуга = Строка.Услуга;
						ОбластьПриборы.Параметры.Счетчик = Строка.Счетчик;
						ОбластьПриборы.Параметры.Коэффициент = Строка.Коэффициент;
						ОбластьПриборы.Параметры.ЕдИзмерения = Строка.ЕдИзм;
						ОбластьПриборы.Параметры.Тариф = Строка.Тариф;
						ОбластьПриборы.Параметры.Поточные = Строка.ТекущиеПоказания;
						ОбластьПриборы.Параметры.Предыдущие = Строка.ПредыдущиеПоказания;
						ОбластьПриборы.Параметры.Разница = Строка.ТекущиеПоказания - Строка.ПредыдущиеПоказания;	
						
						Если УслугаСчетчика  = "" Тогда
							УслугаСчетчика = Строка.Услуга;
//{{MRG[ <-> ]
							//ОбластьПриборы.Параметры.Льготы = Строка.Льгота;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//							ОбластьПриборы.Параметры.Льготы = Строка.Льгота;
//}}MRG[ <-> ]
							ОбластьПриборы.Параметры.Насчитано = Строка.Начисление;
							ОбластьПриборы.Параметры.Долг = Строка.Долг;
							ОбластьПриборы.Параметры.Оплаты = Строка.Оплаты;
//{{MRG[ <-> ]
							//ОбластьПриборы.Параметры.Субсидии = Строка.Субсидия;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//							ОбластьПриборы.Параметры.Субсидии = Строка.Субсидия;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//							ОбластьПриборы.Параметры.ОбПлат = Строка.ГраницаСубсидии;
//}}MRG[ <-> ]
							ОбластьПриборы.Параметры.Перерасчет = Строка.Корректировка;
							Если Строка.Корректировка = Неопределено Тогда
								Строка.Корректировка = 0;
							КонецЕсли;
							КОплатеПоПрибору = ОбластьПриборы.Параметры.Насчитано + ?(Строка.Субсидия>0,-Строка.Субсидия,Строка.Субсидия) +?(Строка.Льгота>0,-Строка.Льгота,Строка.Льгота) + Строка.Долг - Строка.Оплаты + Строка.Корректировка;
							ОбластьПриборы.Параметры.КОплате =  ?(КОплатеПоПрибору<0,0,КОплатеПоПрибору);
							НоваяСтрока = ТаблицаДляРасчетаИтогов.Добавить();
							НоваяСтрока.КОплате = ?(КОплатеПоПрибору<0,0,КОплатеПоПрибору);
						ИначеЕсли УслугаСчетчика <> Строка.Услуга Тогда 
							УслугаСчетчика = Строка.Услуга;
//{{MRG[ <-> ]
							//ОбластьПриборы.Параметры.Льготы = Строка.Льгота;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//							ОбластьПриборы.Параметры.Льготы = Строка.Льгота;
//}}MRG[ <-> ]
							ОбластьПриборы.Параметры.Насчитано = Строка.Начисление;
							ОбластьПриборы.Параметры.Долг = Строка.Долг;
							ОбластьПриборы.Параметры.Оплаты = Строка.Оплаты;
							ОбластьПриборы.Параметры.Перерасчет = Строка.Корректировка;
//{{MRG[ <-> ]
							//ОбластьПриборы.Параметры.Субсидии = Строка.Субсидия;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//							ОбластьПриборы.Параметры.Субсидии = Строка.Субсидия;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//							ОбластьПриборы.Параметры.ОбПлат = Строка.ГраницаСубсидии;
//}}MRG[ <-> ]
							КОплатеПоПрибору = ОбластьПриборы.Параметры.Насчитано + ?(Строка.Субсидия>0,-Строка.Субсидия,Строка.Субсидия) +?(Строка.Льгота>0,-Строка.Льгота,Строка.Льгота) + Строка.Долг - Строка.Оплаты+Строка.Корректировка;
							ОбластьПриборы.Параметры.КОплате =  ?(КОплатеПоПрибору<0,0,КОплатеПоПрибору);
							НоваяСтрока = ТаблицаДляРасчетаИтогов.Добавить();
							НоваяСтрока.КОплате = ?(КОплатеПоПрибору<0,0,КОплатеПоПрибору);
						КонецЕсли;
						
						ТабличныйДокумент.Вывести(ОбластьПриборы);
					КонецЕсли;	
					
				КонецЦикла;
				
				
				Если ЕстьРеструктуризация Тогда
					//РЕструкткризацияДолга
					ОбластьРеструкткризации = Макет.ПолучитьОбласть("ОбластьРеструктуризации");
					СтруктураПоиска = Новый Структура("ЛицевойСчет");
					СтруктураПоиска.ЛицевойСчет  = ВыборкаЛицевойСчет.ЛицевойСчет;
					
					Пока ВыборкаПоРеструктуризацииДолга.НайтиСледующий(СтруктураПоиска) Цикл
						
						
						СуммаОстатокПоРеструктуризации = ВыборкаПоРеструктуризацииДолга.ОстатокРеструктуризации;
						
						Если СуммаОстатокПоРеструктуризации <> 0 Тогда
							
							ОплаченоПлан = ПолучитьПредполагаемыеОплатыПоРеструктуризации(ТекущийДокумент, МесяцНачислений);
							ОплаченоФакт = ВыборкаПоРеструктуризацииДолга.Оплаты;
							
							ЗадолженностьПоРеструктуризации = ОплаченоПлан - ОплаченоФакт;
							ЗначениеРеструктуризацииДолга = ВыборкаПоРеструктуризацииДолга.СуммаПлатежа;
							
							Если ЗадолженностьПоРеструктуризации < 0 Тогда
								ЗадолженностьПоРеструктуризации = 0;
							КонецЕсли;	
							ОстатокПоРеструктуризации =  СуммаОстатокПоРеструктуризации - ЗадолженностьПоРеструктуризации;
							
							Если ОстатокПоРеструктуризации >= ЗначениеРеструктуризацииДолга Тогда
								МесячнаяПлатаПоРеструктуризации = ЗначениеРеструктуризацииДолга;
							иначе
								МесячнаяПлатаПоРеструктуризации = ОстатокПоРеструктуризации;
							КонецЕсли;  
							
							ОбластьРеструкткризации.Параметры.СуммаРеструктуризации = МесячнаяПлатаПоРеструктуризации;
							ОбластьРеструкткризации.Параметры.ОстатокРеструктуризации = ?(ОстатокПоРеструктуризации = 0,ВыборкаПоРеструктуризацииДолга.ОбщаяСумма,ОстатокПоРеструктуризации) ;
							
							ТабличныйДокумент.Вывести(ОбластьРеструкткризации);
							
							Если ЗадолженностьПоРеструктуризации <> 0 Тогда
								ОбластьЗадолженностиПореструктуризации = Макет.ПолучитьОбласть("ДолгПоРесруктуризации");
								ОбластьЗадолженностиПореструктуризации.Параметры.Задолженность = ЗадолженностьПоРеструктуризации;
								
								ТабличныйДокумент.Вывести(ОбластьЗадолженностиПореструктуризации);	
							КонецЕсли;	
							Прервать;
						КонецЕсли;
					КонецЦикла;
				Иначе
					МесячнаяПлатаПоРеструктуризации = 0;
					ЗадолженностьПоРеструктуризации = 0;
				КонецЕсли;
				
				
				Если ИспользуютсяАвансовыеПлатежи Тогда
					
					ОбластьАвансовыхПлатежейШапка = Макет.ПолучитьОбласть("ШапкаТаблицыАвансов");
					ТабличныйДокумент.Вывести(ОбластьАвансовыхПлатежейШапка);
					Пока ВыборкаАвансовыхПлатежей.Следующий() Цикл
						ОбластьАвансовыхПлатежей = Макет.ПолучитьОбласть("АвансовыйПлатеж");
						ОбластьАвансовыхПлатежей.Параметры.РесурснаяУслуга = ВыборкаАвансовыхПлатежей.Услуга;
						ОбластьАвансовыхПлатежей.Параметры.СуммаАвансовогоПлатежа = ВыборкаАвансовыхПлатежей.СуммаАванса;
						АвансовыйПлатежВсего = АвансовыйПлатежВсего + ВыборкаАвансовыхПлатежей.СуммаАванса;
						Если ВыборкаАвансовыхПлатежей.СуммаАванса <> 0 Тогда
							ТабличныйДокумент.Вывести(ОбластьАвансовыхПлатежей);
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;	
				
				
				Долг =?(НЕ ПризнакАванса,Остаток,0);
				Аванс =?(НЕ ПризнакАванса,0,Остаток); 
				
				Если ИспользуютсяАвансовыеПлатежи Тогда
					ОбластьПодвалОсновной = Макет.ПолучитьОбласть("ПодвалОсновнойЧастиАвансовый");
//{{MRG[ <-> ]
					//ОбластьПодвалОсновной.Параметры.АвансовыйПлатежВсего = АвансовыйПлатежВсего;
					//ОбластьПодвалОсновной.Параметры.Долг = Долг; 
					//ОбластьПодвалОсновной.Параметры.Аванс =Аванс;
					//ОбластьПодвалОсновной.Параметры.Начислено = НачисленоВсего;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//					ОбластьПодвалОсновной.Параметры.АвансовыйПлатежВсего = АвансовыйПлатежВсего;
//					ОбластьПодвалОсновной.Параметры.Долг = Долг; 
//					ОбластьПодвалОсновной.Параметры.Аванс =Аванс;
//					ОбластьПодвалОсновной.Параметры.Начислено = НачисленоВсего;
//}}MRG[ <-> ]
				Иначе	
					ОбластьПодвалОсновной = Макет.ПолучитьОбласть("ПодвалОсновнойЧасти");
//{{MRG[ <-> ]
					//ОбластьПодвалОсновной.Параметры.Долг = Остаток; 
					//ОбластьПодвалОсновной.Параметры.НачисленоГрнВсего =НачисленоГрнВсего;
					//ОбластьПодвалОсновной.Параметры.ЛьготаВсего = Льгота;
					//ОбластьПодвалОсновной.Параметры.СубсидияВсего = Субсидия;
					//ОбластьПодвалОсновной.Параметры.Перерасчеты = Корректировка+Перерасчет;
					//ОбластьПодвалОсновной.Параметры.Начислено = НачисленоВсего;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//					ОбластьПодвалОсновной.Параметры.Долг = Остаток; 
//					ОбластьПодвалОсновной.Параметры.НачисленоГрнВсего =НачисленоГрнВсего;
//					ОбластьПодвалОсновной.Параметры.ЛьготаВсего = Льгота;
//					ОбластьПодвалОсновной.Параметры.СубсидияВсего = Субсидия;
//					ОбластьПодвалОсновной.Параметры.Перерасчеты = Корректировка+Перерасчет;
//					ОбластьПодвалОсновной.Параметры.Начислено = НачисленоВсего;
//}}MRG[ <-> ]
				КонецЕсли;
				ОбластьПодвалОсновной.Параметры.НазанчениеПлатежа = НазначениеПлатежа;
				ОбластьПодвалОсновной.Параметры.ЛицевойСчет = ТекущийДокумент;;
				Попытка
					ОбластьПодвалОсновной.Параметры.Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование;
				Исключение
				КонецПопытки;
//{{MRG[ <-> ]
				//ОбластьПодвалОсновной.Параметры.ПараметрНадписиДляЗдания = ТекущийДокумент.Владелец.СопроводительныйТекстКвитанции;	
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//				ОбластьПодвалОсновной.Параметры.ПараметрНадписиДляЗдания = ТекущийДокумент.Владелец.СопроводительныйТекстКвитанции;
//}}MRG[ <-> ]
				ОбластьПодвалОсновной.Параметры.Оплата = Оплаты;
//{{MRG[ <-> ]
				ОбластьПодвалОсновной.Параметры.Всего = Всего + МесячнаяПлатаПоРеструктуризации + ЗадолженностьПоРеструктуризации;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//				ОбластьПодвалОсновной.Параметры.Всего = Всего + АвансовыйПлатежВсего + МесячнаяПлатаПоРеструктуризации+ЗадолженностьПоРеструктуризации;
//}}MRG[ <-> ]
				
				ТабличныйДокумент.Вывести(ОбластьПодвалОсновной);
			КонецЦикла;
		КонецЦикла;
		
		ПечататьСообщение = Константы.ПечататьОпевещениеВКвитанции.Получить();
		
		Если ПечататьСообщение Тогда
			
			//Подвал1
			ОбластьПодвал1 = Макет.ПолучитьОбласть("Подвал1");
			ОбластьПодвал1.Параметры.ЄДРПОУ = ТекущийДокумент.Владелец.Организация.КодПоЕДРПОУ;
			ОбластьПодвал1.Параметры.Получатель = ТекущийДокумент.Владелец.Организация.НаименованиеПолное;
			ОбластьПодвал1.Параметры.МесяцНачисления = Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
			ТабличныйДокумент.Вывести(ОбластьПодвал1);
			
			//Банковский Счет Подвал
			Для каждого Строка Из БанковскиеСчетаОрганизации Цикл
				
				Если Строка.Печать  Тогда
					ОбластьБанковскийСчет = Макет.ПолучитьОбласть("БанковскийСчетПодвал");
					ОбластьБанковскийСчет.Параметры.Рр = ПолучитьПредставлениеБанковскогоСчета(Строка.БанковскийСчет);
					ОбластьБанковскийСчет.Параметры.Банк = Строка.БанковскийСчет.Банк.Наименование;
					ОбластьБанковскийСчет.Параметры.МФО = Строка.БанковскийСчет.Банк.Код;
					
					ТабличныйДокумент.Вывести(ОбластьБанковскийСчет);
				КонецЕсли;
				
			КонецЦикла; 
			
			//ПОДВАЛ
			Если НЕ ИспользуютсяАвансовыеПлатежи Тогда
				
				ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
				ОбластьПодвал.Параметры.МесяцНачисления = Формат((МесяцНачислений),?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='ММММ гггг"" г.""'"));	
				ОбластьПодвал.Параметры.Начислено = НачисленоВсего;
				ОбластьПодвал.Параметры.Долг = Долг;
//{{MRG[ <-> ]
//{{MRG[ <-> ]
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//				ОбластьПодвал.Параметры.Аванс = Аванс;
//}}MRG[ <-> ]
				//ОбластьПодвал.Параметры.Аванс = Аванс;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//				ОбластьПодвал.Параметры.Аванс = Аванс;
//}}MRG[ <-> ]
				ОбластьПодвал.Параметры.Оплата = Оплаты;
				ОбластьПодвал.Параметры.Всего = Всего+МесячнаяПлатаПоРеструктуризации+ЗадолженностьПоРеструктуризации;
				ОбластьПодвал.Параметры.ЛицевойСчет = ТекущийДокумент;
				ОбластьПодвал.Параметры.МесяцНачисленияСлед = Формат((МесяцНачислений+500000),?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MM.yyyy р.'","ДФ='ММ.гг"" г.""'"));
				ОбластьПодвал.Параметры.Адрес = ПолучитьПредставлениеАдреса(АдресМасс, Квартира, КодЯзыкаПечать);
				ОбластьПодвал.Параметры.НазанчениеПлатежа = НазначениеПлатежа;

				Попытка
					ОбластьПодвал.Параметры.Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование;
				Исключение
				КонецПопытки;
				
				Для Каждого Строка Из ВыборкаПлощади Цикл
					Если Строка.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
						ОбластьПодвал.Параметры.ПлощадьОтоп = Строка.Площадь;
					ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
						ОбластьПодвал.Параметры.ПлощадьВся = Строка.Площадь;
					КонецЕсли;
				КонецЦикла;
				
				ОбластьПодвал.Параметры.КолЧеловек = ВыборкаКолПроживающих.КоличествоПроживающих;
				ОбластьПодвал.Параметры.КоличествоМестПаркинг = ВыборкаМашиномест.КоличествоМашиноМест;
				
				ТабличныйДокумент.Вывести(ОбластьПодвал);
			Иначе
				ОбластьПодвал = Макет.ПолучитьОбласть("Подвал2");
				ОбластьПодвал.Параметры.МесяцНачисления = Формат((МесяцНачислений),?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='ММММ гггг"" г.""'"));	
				ОбластьПодвал.Параметры.Начислено = НачисленоВсего;
				
				
				ОбластьПодвал.Параметры.Долг = Долг;
//{{MRG[ <-> ]
//{{MRG[ <-> ]
				//ОбластьПодвал.Параметры.Аванс = Аванс;
				//ОбластьПодвал.Параметры.АвансовыйПлатеж = АвансовыйПлатежВсего;  
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//				ОбластьПодвал.Параметры.Аванс = Аванс;
//				ОбластьПодвал.Параметры.АвансовыйПлатеж = АвансовыйПлатежВсего;  
//				ОбластьПодвал.Параметры.Всего = Всего+МесячнаяПлатаПоРеструктуризации+ЗадолженностьПоРеструктуризации+АвансовыйПлатежВсего;
//}}MRG[ <-> ]
				ОбластьПодвал.Параметры.Всего = Всего+МесячнаяПлатаПоРеструктуризации+ЗадолженностьПоРеструктуризации;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//				ОбластьПодвал.Параметры.Аванс = Аванс;
//				ОбластьПодвал.Параметры.АвансовыйПлатеж = АвансовыйПлатежВсего;  
//				ОбластьПодвал.Параметры.Всего = Всего+МесячнаяПлатаПоРеструктуризации+ЗадолженностьПоРеструктуризации+АвансовыйПлатежВсего;
//}}MRG[ <-> ]
				ОбластьПодвал.Параметры.ЛицевойСчет = ТекущийДокумент;
				ОбластьПодвал.Параметры.МесяцНачисленияСлед = Формат((МесяцНачислений+500000),?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MM.yyyy р.'","ДФ='ММ.гг"" г.""'"));
				ОбластьПодвал.Параметры.Адрес = ПолучитьПредставлениеАдреса(АдресМасс, Квартира, КодЯзыкаПечать);
				ОбластьПодвал.Параметры.НазанчениеПлатежа = НазначениеПлатежа;
				Попытка
					ОбластьПодвал.Параметры.Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование;
				Исключение
				КонецПопытки;
				
				Для Каждого Строка Из ВыборкаПлощади Цикл
					Если Строка.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
						ОбластьПодвал.Параметры.ПлощадьОтоп = Строка.Площадь;
					ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
						ОбластьПодвал.Параметры.ПлощадьВся = Строка.Площадь;
					КонецЕсли;
				КонецЦикла;
				
				ОбластьПодвал.Параметры.КолЧеловек = ВыборкаКолПроживающих.КоличествоПроживающих;
				ОбластьПодвал.Параметры.КоличествоМестПаркинг = ВыборкаМашиномест.КоличествоМашиноМест;
				
				ТабличныйДокумент.Вывести(ОбластьПодвал);
			КонецЕсли;
			
			
		КонецЕсли;
		
	ИНАЧЕ
		
		Всего = 0;
		Аванс = 0;
		Долг = 0;
		Оплаты = 0;
		
		СтруктураПоискаОбщегоОстатка = Новый Структура("ЛицевойСчет");
		СтруктураПоискаОбщегоОстатка.ЛицевойСчет  = ТекущийДокумент;
		
		ЕстьОстаток = Ложь;
		ОстатокНаКонецМесяца = Неопределено;
		ОбщийОстаток = 0;
		Пока ВыборкаОбщийОстаток.НайтиСледующий(СтруктураПоискаОбщегоОстатка) Цикл
			ВыборкаОстатковОрганизация = ВыборкаОбщийОстаток.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ЕстьОстаток = Истина;
			Пока ВыборкаОстатковОрганизация.следующий() Цикл
				ОрганизацияОтбор = Неопределено;
				Если ВыборкаОстатковОрганизация.Организация = Справочники.Организации.ПустаяСсылка() Тогда
					ОрганизацияОтбор = ВыборкаЛицевойСчет.ЛицевойСчет.Владелец.Организация;
				Иначе
					ОрганизацияОтбор = ВыборкаОстатковОрганизация.Организация;
				КонецЕсли;	
				Если  ОрганизацияОтбор = ВыборкаЛицевойСчет.Организация  Тогда
					ОстатокНаКонецМесяца = ВыборкаОстатковОрганизация.СуммаОстаток;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			
			
			
			
			
			ОбщийОстаток = ВыборкаОбщийОстаток.СуммаОстаток;
			Если ОбщийОстаток < 0 тогда
				ОстатокНаименование = "АВАНС";
				Аванс = ОбщийОстаток;
				Долг = 0;
			Иначе
				ОстатокНаименование = НСТР("ru = 'ДОЛГ'; uk = 'БОРГ'");
				Аванс = 0;
				Долг = ОбщийОстаток;
			КонецЕсли;
			
			Всего = ОбщийОстаток;
			
			ОбластьСтрокаУслуг = Макет.ПолучитьОбласть("СтрокаУслуг");
			ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг = ОстатокНаименование;
			ОбластьСтрокаУслуг.Параметры.Долг = ОбщийОстаток;
			ОбластьСтрокаУслуг.Параметры.НачисленоКОплате = ОбщийОстаток;
			НоваяСтрока = ТаблицаДляРасчетаИтогов.Добавить();
			НоваяСтрока.КОплате = ОбщийОстаток;
			
			ТабличныйДокумент.Вывести(ОбластьСтрокаУслуг);
			
		КонецЦикла;	
		ВыборкаОбщийОстаток.Сбросить();	
		Если ЕстьОстаток Тогда
			ОбластьПодвалОсновной = Макет.ПолучитьОбласть("ПодвалОсновнойЧасти");
			ОбластьПодвалОсновной.Параметры.ПараметрНадписиДляЗдания = ТекущийДокумент.Владелец.СопроводительныйТекстКвитанции;
			ОбластьПодвалОсновной.Параметры.Долг = Долг; 
//{{MRG[ <-> ]
//			ОбластьПодвалОсновной.Параметры.Аванс =Аванс;
//}}MRG[ <-> ]
			ОбластьПодвалОсновной.Параметры.Начислено = 0;
			ОбластьПодвалОсновной.Параметры.Оплата = 0;
			
			ОбластьПодвалОсновной.Параметры.Всего = ОбщийОстаток;
			
			ТабличныйДокумент.Вывести(ОбластьПодвалОсновной);
			
		КонецЕсли;
		
	КонецЕсли;
	//КонецЦикла;
	
	//ПечататьСообщение = Константы.ПечататьОпевещениеВКвитанции.Получить();
	//
	//Если ПечататьСообщение Тогда
	//	
	//	//Подвал1
	//	ОбластьПодвал1 = Макет.ПолучитьОбласть("Подвал1");
	//	ОбластьПодвал1.Параметры.ЄДРПОУ = ТекущийДокумент.Владелец.Организация.КодПоЕДРПОУ;
	//	ОбластьПодвал1.Параметры.Получатель = ТекущийДокумент.Владелец.Организация.НаименованиеПолное;
	//	ОбластьПодвал1.Параметры.МесяцНачисления = Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
	//	ТабличныйДокумент.Вывести(ОбластьПодвал1);
	//	
	//	//Банковский Счет Подвал
	//	Для каждого Строка Из БанковскиеСчетаОрганизации Цикл
	//		
	//		Если Строка.Печать  Тогда
	//			ОбластьБанковскийСчет = Макет.ПолучитьОбласть("БанковскийСчетПодвал");
	//			ОбластьБанковскийСчет.Параметры.Рр = ПолучитьПредставлениеБанковскогоСчета(Строка.БанковскийСчет);
	//			ОбластьБанковскийСчет.Параметры.Банк = Строка.БанковскийСчет.Банк.Наименование;
	//			ОбластьБанковскийСчет.Параметры.МФО = Строка.БанковскийСчет.Банк.Код;

	//			ТабличныйДокумент.Вывести(ОбластьБанковскийСчет);
	//		КонецЕсли;
	//		
	//	КонецЦикла; 
	//	
	//	//ПОДВАЛ
	//	Если НЕ ИспользуютсяАвансовыеПлатежи Тогда
	//		
	//		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	//		ОбластьПодвал.Параметры.МесяцНачисления = Формат((МесяцНачислений),?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='ММММ гггг"" г.""'"));	
	//		ОбластьПодвал.Параметры.Начислено = НачисленоВсего;
	//		ОбластьПодвал.Параметры.Долг = Долг;
	//		ОбластьПодвал.Параметры.Аванс = Аванс;
	//		ОбластьПодвал.Параметры.Оплата = Оплаты;
	//		ОбластьПодвал.Параметры.Всего = Всего+МесячнаяПлатаПоРеструктуризации+ЗадолженностьПоРеструктуризации;
	//		ОбластьПодвал.Параметры.ЛицевойСчет = ТекущийДокумент;
	//		ОбластьПодвал.Параметры.МесяцНачисленияСлед = Формат((МесяцНачислений+500000),?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MM.yyyy р.'","ДФ='ММ.гг"" г.""'"));
	//		ОбластьПодвал.Параметры.Адрес = ПолучитьПредставлениеАдреса(АдресМасс, Квартира);
	//		Попытка
	//			ОбластьПодвал.Параметры.Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование;
	//		Исключение
	//		КонецПопытки;
	//		
	//		Для Каждого Строка Из ВыборкаПлощади Цикл
	//			Если Строка.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
	//				ОбластьПодвал.Параметры.ПлощадьОтоп = Строка.Площадь;
	//			ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
	//				ОбластьПодвал.Параметры.ПлощадьВся = Строка.Площадь;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		ОбластьПодвал.Параметры.КолЧеловек = ВыборкаКолПроживающих.КоличествоПроживающих;
	//		ОбластьПодвал.Параметры.КоличествоМестПаркинг = ВыборкаМашиномест.КоличествоМашиноМест;
	//		
	//		ТабличныйДокумент.Вывести(ОбластьПодвал);
	//	Иначе
	//		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал2");
	//		ОбластьПодвал.Параметры.МесяцНачисления = Формат((МесяцНачислений),?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='ММММ гггг"" г.""'"));	
	//		ОбластьПодвал.Параметры.Начислено = НачисленоВсего;
	//		
	//		
	//		ОбластьПодвал.Параметры.Долг = Долг;
	//		ОбластьПодвал.Параметры.Аванс = Аванс;
	//		ОбластьПодвал.Параметры.АвансовыйПлатеж = АвансовыйПлатежВсего;  
	//		ОбластьПодвал.Параметры.Всего = Всего+МесячнаяПлатаПоРеструктуризации+ЗадолженностьПоРеструктуризации+АвансовыйПлатежВсего;
	//		ОбластьПодвал.Параметры.ЛицевойСчет = ТекущийДокумент;
	//		ОбластьПодвал.Параметры.МесяцНачисленияСлед = Формат((МесяцНачислений+500000),?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MM.yyyy р.'","ДФ='ММ.гг"" г.""'"));
	//		ОбластьПодвал.Параметры.Адрес = ПолучитьПредставлениеАдреса(АдресМасс, Квартира);
	//		Попытка
	//			ОбластьПодвал.Параметры.Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование;
	//		Исключение
	//		КонецПопытки;
	//		
	//		Для Каждого Строка Из ВыборкаПлощади Цикл
	//			Если Строка.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
	//				ОбластьПодвал.Параметры.ПлощадьОтоп = Строка.Площадь;
	//			ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
	//				ОбластьПодвал.Параметры.ПлощадьВся = Строка.Площадь;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		ОбластьПодвал.Параметры.КолЧеловек = ВыборкаКолПроживающих.КоличествоПроживающих;
	//		ОбластьПодвал.Параметры.КоличествоМестПаркинг = ВыборкаМашиномест.КоличествоМашиноМест;
	//		
	//		ТабличныйДокумент.Вывести(ОбластьПодвал);
	//	КонецЕсли;
	//	
	//	
	//КонецЕсли;

		
	Возврат ТабличныйДокумент;
	
	
КонецФункции

Функция ПечатьКвитанцииНаОплату(ТекущийДокумент, ТабличныйДокумент, МесяцНачислений, БанковскиеСчетаОрганизации) Экспорт 
	
	ГлобальнаяВыборка = ПолучитьОбщуюСтруктуруКвитанции(ТекущийДокумент, МесяцНачислений);
	// Заполнение таблицы
	ЕстьРеструктуризация = НЕ ГлобальнаяВыборка[9].Пустой();
	ВыборкаОрганизация = ГлобальнаяВыборка[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПриборыУчета = ГлобальнаяВыборка[4].Выбрать();
	Если ЕстьРеструктуризация Тогда;
		ВыборкаОбщийОстаток = ГлобальнаяВыборка[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Иначе
		ВыборкаОбщийОстаток = ГлобальнаяВыборка[8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	
	ВыборкаАвансовыхПлатежей = ГлобальнаяВыборка[6].Выбрать();
	ВыборкаПоРеструктуризацииДолга = ГлобальнаяВыборка[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОстатокПоУслугам = ГлобальнаяВыборка[8].Выгрузить();
	ВыборкаГраницаСубсидии = ГлобальнаяВыборка[10].Выбрать();

	
	Макет =  ПолучитьОбщийМакет("МакетКвитанцииНаОплату");
	
	ЕСЛИ НЕ ГлобальнаяВыборка[5].Пустой() Тогда
		Пока ВыборкаОрганизация.Следующий() Цикл
			
			
			
			ИспользуютсяАвансовыеПлатежи = ПолучитьФункциональнуюОпцию("ИспользоватьАвансовыеПлатежи");
			АвансовыйПлатежВсего = 0;
			ВыборкаПриборыУчета.Сбросить();
			ТаблицаДляРасчетаИтогов = Новый ТаблицаЗначений;
			ТаблицаДляРасчетаИтогов.Колонки.Добавить("КОплате");
			ТаблицаДляРасчетаИтогов.Очистить();
			
			
			ЗначениеРеструктуризацииДолга = 0;
			ЗадолженностьПоРеструктуризации = 0;
			МесячнаяПлатаПоРеструктуризации = 0;
			
			//Получаем настройки печати квитанции
			КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
			Макет.КодЯзыкаМакета = КодЯзыкаПечать;
			
			//Для удобства накапливаем переменные
			Квартира = ТекущийДокумент.ОбъектЛицевогоСчета;
			
			
			//Создадим адрес в необходимои формате
			АдресМасс = РазложитьСтрокуВМассивПодстрок(ТекущийДокумент.Владелец.Наименование);
			
			
			//ШАПКА
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
			ОбластьШапка.Параметры.МесяцНачисления = Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
			ОбластьШапка.Параметры.Получатель =ВыборкаОрганизация.Организация.НаименованиеПолное;
			ОбластьШапка.Параметры.ЄДРПОУ = ВыборкаОрганизация.Организация.КодПоЕДРПОУ;
			
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			//БанковскийСчет
			Для каждого Строка Из БанковскиеСчетаОрганизации Цикл
				Если Строка.Печать Тогда
					Если ВыборкаОрганизация.Организация = Строка.БанковскийСчет.Владелец Тогда
						ОбластьБанковскийСчет = Макет.ПолучитьОбласть("БанковскийСчет");
						ОбластьБанковскийСчет.Параметры.Рр = "UA773077700000026003711158769";//ПолучитьПредставлениеБанковскогоСчета(Строка.БанковскийСчет);
						ОбластьБанковскийСчет.Параметры.Банк = "А-БАНК";//Строка.БанковскийСчет.Банк.Наименование;
//{{MRG[ <-> ]
						//ОбластьБанковскийСчет.Параметры.МФО = Строка.БанковскийСчет.Банк.Код;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//						ОбластьБанковскийСчет.Параметры.МФО = Строка.БанковскийСчет.Банк.Код;
//}}MRG[ <-> ]
						
						ТабличныйДокумент.Вывести(ОбластьБанковскийСчет);
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла; 
			
			//ШапкаОсновнойЧасти 
			ВыборкаПлощади = РегистрыСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(НачалоМесяца(МесяцНачислений),Новый Структура("Помещение", Квартира));
			
			ОбластьШапкаОсновнойЧасти = Макет.ПолучитьОбласть("ШапкаОсновнойЧасти");
			Для Каждого Строка Из ВыборкаПлощади Цикл
				Если Строка.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
					ОбластьШапкаОсновнойЧасти.Параметры.ПлощадьОтоп = Строка.Площадь;
				ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
					ОбластьШапкаОсновнойЧасти.Параметры.ПлощадьВся = Строка.Площадь;
				КонецЕсли;
			КонецЦикла;
			
			ВыборкаКолПроживающих = РегистрыСведений.ЛицевыеСчета.ПолучитьПоследнее(НачалоМесяца(МесяцНачислений),Новый Структура("ЛицевойСчет",ТекущийДокумент));
			ВыборкаМашиномест = РегистрыСведений.МашиноМеста.ПолучитьПоследнее(НачалоМесяца(МесяцНачислений),Новый Структура("ЛицевойСчет",ТекущийДокумент));
			Попытка
				Если Константы.ВыводитьВКвитанцияхФИО.Получить() = Истина Тогда
					Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование; 
				Иначе
					Плательщик = "";
				КонецЕсли;
				ОбластьШапкаОсновнойЧасти.Параметры.Плательщик = Плательщик;
			Исключение
			КонецПопытки;
			
			НазначениеПлатежа = ТекущийДокумент.Владелец.ТекстНазначенияПлатежа;
			ОбластьШапкаОсновнойЧасти.Параметры.КолЧеловек = ВыборкаКолПроживающих.КоличествоПроживающих;
			
//{{MRG[ <-> ]
			//ОбластьШапкаОсновнойЧасти.Параметры.КоличествоМестПаркинг = ВыборкаМашиномест.КоличествоМашиноМест;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//			ОбластьШапкаОсновнойЧасти.Параметры.КоличествоМестПаркинг = ВыборкаМашиномест.КоличествоМашиноМест;
//}}MRG[ <-> ]
			ОбластьШапкаОсновнойЧасти.Параметры.ЛицевойСчет = ТекущийДокумент;
			
			Если Константы.ВыводитьАдресВКвитанциях.Получить() = Истина Тогда
				ОбластьШапкаОсновнойЧасти.Параметры.Адрес = ПолучитьПредставлениеАдреса(АдресМасс, Квартира,КодЯзыкаПечать);
			Иначе
				ОбластьШапкаОсновнойЧасти.Параметры.Адрес = ТекущийДокумент;
			КонецЕсли;
			
			
			ТабличныйДокумент.Вывести(ОбластьШапкаОсновнойЧасти);
			
			//ШапкаТаблицыУслуг
			ОбластьШапкаТаблицыУслуг = Макет.ПолучитьОбласть("ШапкаТаблицыУслуг");
//{{MRG[ <-> ]
			//ОбластьШапкаТаблицыУслуг.Параметры.Оплата = ?(КодЯзыкаПечать="ru","Сплачено у ","Сплачено у ")+ Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//			ОбластьШапкаТаблицыУслуг.Параметры.Оплата = ?(КодЯзыкаПечать="ru","Зачислено в ","Зараховано в ")+ Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
//}}MRG[ <-> ]
			//ОбластьШапкаТаблицыУслуг.Параметры.ДатаДолга = Формат(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1), ?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" р.""'"));
			//
			//ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыУслуг);
			
//{{MRG[ <-> ]
//			ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыУслуг);
//}}MRG[ <-> ]
			ВыборкаЛицевойСчет = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
 			Пока ВыборкаЛицевойСчет.Следующий() Цикл
				
				ВыборкаУслуга = ВыборкаЛицевойСчет.выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Корректировка =  ВыборкаЛицевойСчет.Корректировка;
				Перерасчет = ВыборкаЛицевойСчет.Перерасчет;
				Субсидия = ВыборкаЛицевойСчет.Субсидия;
				Льгота = ВыборкаЛицевойСчет.Льгота;
				НачисленоГрнВсего = ВыборкаЛицевойСчет.Начисление;
				
				НачисленоВсего =  ВыборкаЛицевойСчет.Начисление + ВыборкаЛицевойСчет.Корректировка + ВыборкаЛицевойСчет.Перерасчет;
				СтруктураПоискаОбщегоОстатка = Новый Структура("ЛицевойСчет");
				СтруктураПоискаОбщегоОстатка.ЛицевойСчет  = ВыборкаЛицевойСчет.ЛицевойСчет;
				
				ПервыйСчетчик = истина;
				ОстатокНаКонецМесяца = Неопределено;
				Пока ВыборкаОбщийОстаток.НайтиСледующий(СтруктураПоискаОбщегоОстатка) Цикл
					ВыборкаОстатковОрганизация = ВыборкаОбщийОстаток.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаОстатковОрганизация.следующий() Цикл
						ОрганизацияОтбор = Неопределено;
						Если ВыборкаОстатковОрганизация.Организация = Справочники.Организации.ПустаяСсылка() Тогда
							ОрганизацияОтбор = ВыборкаЛицевойСчет.ЛицевойСчет.Владелец.Организация;
						Иначе
							ОрганизацияОтбор = ВыборкаОстатковОрганизация.Организация;
						КонецЕсли;	
						Если  ОрганизацияОтбор = ВыборкаЛицевойСчет.Организация  Тогда
							ОстатокНаКонецМесяца = ВыборкаОстатковОрганизация.СуммаОстаток;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				ВыборкаОбщийОстаток.Сбросить();
				
				
				
				Если ОстатокНаКонецМесяца = Неопределено Тогда
					ОстатокНаКонецМесяца = 0;
				КонецЕсли;
				
				
				Оплаты = ВыборкаЛицевойСчет.Оплата;
				Если ЕстьРеструктуризация Тогда
					Остаток =  ОстатокНаКонецМесяца  - Корректировка - Перерасчет - ?(Субсидия<0,0,Субсидия) - ?(Льгота<0,0,Льгота);
					Всего = НачисленоВсего+Остаток;
					//ОбластьШапкаТаблицыУслуг.Параметры.Оплата = ?(КодЯзыкаПечать="ru","Сплачено у ","Сплачено у ")+ Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
					ОбластьШапкаТаблицыУслуг.Параметры.ДатаДолга = ОбластьШапка.Параметры.МесяцНачисления;//Формат(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1), ?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" р.""'"));
					ОбластьШапкаТаблицыУслуг.Параметры.Долг = Остаток;
					ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыУслуг);
				ИНаче
					Остаток = ОстатокНаКонецМесяца;
					Всего = НачисленоВсего+Льгота+Субсидия + Остаток - Оплаты;
					//ОбластьШапкаТаблицыУслуг.Параметры.Оплата = ?(КодЯзыкаПечать="ru","Сплачено у ","Сплачено у ")+ Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
					ОбластьШапкаТаблицыУслуг.Параметры.ДатаДолга = ОбластьШапка.Параметры.МесяцНачисления;//Формат(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1), ?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" р.""'"));
					ОбластьШапкаТаблицыУслуг.Параметры.Долг = Остаток;
					ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыУслуг);
				КонецЕсли;
				
				Если Остаток > 0 тогда
					ПризнакАванса = Ложь;
					
				Иначе
					ПризнакАванса = ИСТИНА;
					остаток = остаток;
				КонецЕсли;
				
				
				
				Таблица = Новый ТаблицаЗначений;
				Таблица.Колонки.Добавить("Услуга",,"Услуга");
				Таблица.Колонки.Добавить("Счетчик",,"Счетчик");
				Таблица.Колонки.Добавить("Коэффициент",,"Коэффициент");
				Таблица.Колонки.Добавить("ЕдИзм",,"ЕдИзм");
				Таблица.Колонки.Добавить("Тариф",,"Тариф");
				Таблица.Колонки.Добавить("Норма",,"Норма");
				Таблица.Колонки.Добавить("Оплаты",,"Оплаты");
				Таблица.Колонки.Добавить("Долг",,"Долг");
				Таблица.Колонки.Добавить("ТекущиеПоказания",,"ТекущиеПоказания");
				Таблица.Колонки.Добавить("ПредыдущиеПоказания",,"ПредыдущиеПоказания");
				Таблица.Колонки.Добавить("Начисление",,"Начисление");
				Таблица.Колонки.Добавить("Льгота",,"Льгота");
				Таблица.Колонки.Добавить("Субсидия",,"Субсидия");
				Таблица.Колонки.Добавить("КоличествоЕдиниц",,"КоличествоЕдиниц");
				Таблица.Колонки.Добавить("Корректировка",,"Корректировка");
				Таблица.Колонки.Добавить("ГраницаСубсидии",,"ГраницаСубсидии");
				Таблица.Колонки.Добавить("Неустойка",, "Неустойка");
				Таблица.Колонки.Добавить("Пеня",, "Пеня");
				
				
				Пока ВыборкаУслуга.Следующий() Цикл
					
					СтруктураПоискаПриборов = Новый Структура("ОбъектУстановки, Услуга");
					СтруктураПоискаПриборов.ОбъектУстановки = ВыборкаУслуга.ЛицевойСчет;
					СтруктураПоискаПриборов.Услуга = ВыборкаУслуга.Услуга;
					Марк = Истина;
					НоваяУслуга = "";
					СтараяУслуга = "";
					ПОКА ВыборкаПриборыУчета.НайтиСледующий(СтруктураПоискаПриборов) Цикл
						
						КорректировкаПоПрибору = 0;
						ПерерасчетПоприбору = 0;
						
						
						НоваяУслуга = ВыборкаУслуга.Услуга;
						Строка = Таблица.Добавить();
//{{MRG[ <-> ]
						Строка.Услуга = ВыборкаУслуга.Услуга.ПолноеНаименование;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//						Строка.Услуга = ВыборкаУслуга.Услуга;
//}}MRG[ <-> ]
						Строка.Счетчик = ВыборкаПриборыУчета.ЗаводскойНомер+"/"+ВыборкаПриборыУчета.ВидУслуги;
						Строка.Коэффициент = ВыборкаПриборыУчета.ПриборУчетаКоэффициент;
						Строка.ЕдИзм = ВыборкаУслуга.ЕдиницаИзмерения;
						
						ВыборкаТариф = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Тариф = "";
						КоличествоЕдиниц = 0;
						Пока ВыборкаТариф.Следующий() Цикл
							Если Тариф = "" Тогда
								Значение = ?(ВыборкаТариф.Тариф = 0 ,"",Строка(ВыборкаТариф.Тариф)) ;
								
							Иначе
								Если ВыборкаТариф.Тариф = 0 Тогда
									Значение = "";
								Иначе
									Если ВыборкаТариф.Тариф = 0 Тогда
										Значение = "";
									Иначе	
										Значение = "\"+Строка(ВыборкаТариф.Тариф);
									КонецЕсли;
									
								КонецЕсли;	
							КонецЕсли;
							Тариф = Тариф+Значение;
							
							Если КоличествоЕдиниц <> ВыборкаТариф.КоличествоЕдИзм И ВыборкаТариф.КоличествоЕдИзм <> 0 Тогда
								Если ВыборкаТариф.Порог <> Неопределено Тогда
									КоличествоЕдиниц = КоличествоЕдиниц + ВыборкаТариф.КоличествоЕдИзм;
								Иначе	
									КоличествоЕдиниц = ВыборкаТариф.КоличествоЕдИзм;
								КонецЕсли;	
							КонецЕсли;
						КонецЦикла;
						
						
						Строка.КоличествоЕдиниц = КоличествоЕдиниц;
						Строка.Тариф = Тариф;		
						СтруктураПоискаДолгаПоУслуге = Новый Структура("ЛицевойСчет, Услуга");
						СтруктураПоискаДолгаПоУслуге.ЛицевойСчет = ВыборкаУслуга.ЛицевойСчет;
						СтруктураПоискаДолгаПоУслуге.Услуга = ВыборкаУслуга.Услуга;
						
						Строка.Долг = 0;
						Строка.Оплаты = 0;
						
						НайденныеСтроки = ВыборкаОстатокПоУслугам.НайтиСтроки(СтруктураПоискаДолгаПоУслуге);
						
						Если НайденныеСтроки.Количество() >  0 Тогда
							Строка.Долг = НайденныеСтроки[0].СуммаОстаток;
						Иначе
							Строка.Долг = 0;
						КонецЕсли;
						Строка.Оплаты = ВыборкаУслуга.Оплата;
						
						
						
						Строка.ТекущиеПоказания = ВыборкаПриборыУчета.ТекущиеПоказания;
						Строка.ПредыдущиеПоказания = ВыборкаПриборыУчета.ПредыдущиеПоказания;
						КорректировкаПоПрибору = ВыборкаУслуга.Корректировка;
						ПерерасчетПоприбору = ВыборкаУслуга.Перерасчет;
						Строка.Льгота = ВыборкаУслуга.Льгота;
						Строка.Субсидия = ВыборкаУслуга.Субсидия;
						Если ВыборкаУслуга.Субсидия <> 0 Тогда
							
							СтруктараПоискаСубс = Новый Структура;
							СтруктараПоискаСубс.Вставить("ЛицевойСчет",ТекущийДокумент);
							СтруктараПоискаСубс.Вставить("Услуга",ВыборкаУслуга.Услуга);
							СтруктараПоискаСубс.Вставить("МесяцНачисления",НачалоМесяца(МесяцНачислений));
							
							
							Если ВыборкаГраницаСубсидии.НайтиСледующий(СтруктараПоискаСубс)  Тогда
								Строка.ГраницаСубсидии = ВыборкаГраницаСубсидии.ГраницаСубсидии;
							КонецЕсли;
							ВыборкаГраницаСубсидии.Сбросить();
						КонецЕсли;
						
						
						Если СтараяУслуга <> НоваяУслуга  тогда
							Строка.Корректировка = ПерерасчетПоприбору + КорректировкаПоПрибору;
							Строка.Начисление = ВыборкаУслуга.Начисление;
						Иначе
							Строка.Начисление = ВыборкаУслуга.Начисление;
						КонецЕсли; 
						
						Марк = Ложь;
						СтараяУслуга = ВыборкаУслуга.Услуга;
					КонецЦикла;		
					
					Если Марк = Ложь тогда
						Продолжить;
					КонецЕсли;
					
					ОбластьСтрокаУслуг = Макет.ПолучитьОбласть("СтрокаУслуг");
					
					Если ВыборкаУслуга.Услуга = Справочники.Услуги.ПустаяСсылка() тогда
						Если ПризнакАванса = Истина тогда
							//ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг =  "АВАНС";
							//ОбластьСтрокаУслуг.Параметры.ЕдИзмер = "";
						Иначе
							//ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг =  ?(КодЯзыкаПечать = "uk","+ БОРГ/ - ПЕРЕПЛАТА","+ БОРГ/ - ПЕРЕПЛАТА");
							//ОбластьСтрокаУслуг.Параметры.ЕдИзмер = "";
						КонецЕсли;
					ИначеЕсли  ВыборкаУслуга.Услуга = Справочники.Услуги.РеструктуризацияДолга Тогда
						//ДанныеПоРеструктуризацииДолга = ВыборкаУслуга.Начисление;  //метка
						Продолжить;
					Иначе
						ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг =  ВыборкаУслуга.Услуга.ПолноеНаименование;
						ОбластьСтрокаУслуг.Параметры.ЕдИзмер = ВыборкаУслуга.ЕдиницаИзмерения;
					КонецЕсли;
					
					ВыборкаТариф = ВыборкаУслуга.Выбрать();
					Тариф = "";
					ДнейНачислено = 0;
					Пока ВыборкаТариф.Следующий() Цикл
						Если Тариф = "" Тогда
							Значение = ?(ВыборкаТариф.Тариф = 0 ,"",Строка(ВыборкаТариф.Тариф)) ;
						Иначе 
							Если ВыборкаТариф.Тариф = 0 Тогда
								Значение = "";
							Иначе	
								Значение = "\"+Строка(ВыборкаТариф.Тариф);
							КонецЕсли;	
						КонецЕсли;
						Тариф = Тариф+Значение;
						
						
						Если НЕ ВыборкаТариф.Начисление = 0 Тогда
							ДнейНачислено= ДнейНачислено + ВыборкаТариф.ДнейНачислено;
						КонецЕсли;
						
					КонецЦикла;
					Если ВыборкаУслуга.Услуга <> Справочники.Услуги.ПустаяСсылка() Тогда 
						ОбластьСтрокаУслуг.Параметры.Тариф = Тариф;
						//ОбластьСтрокаУслуг.Параметры.КолДней = ВыборкаУслуга.КоличествоЕдИзм;
						ОбластьСтрокаУслуг.Параметры.НачисленоГрн = ВыборкаУслуга.Начисление;
						ОбластьСтрокаУслуг.Параметры.Оплаты = ВыборкаУслуга.Оплата;
						
						//ОбластьСтрокаУслуг.Параметры.Льготы = ВыборкаУслуга.Льгота;
						//ОбластьСтрокаУслуг.Параметры.Субсидии = ВыборкаУслуга.Субсидия;
						Если ВыборкаУслуга.Субсидия <> 0 Тогда
							
							СтруктараПоискаСубс = Новый Структура;
							СтруктараПоискаСубс.Вставить("ЛицевойСчет",ТекущийДокумент);
							СтруктараПоискаСубс.Вставить("Услуга",ВыборкаУслуга.Услуга);
							СтруктараПоискаСубс.Вставить("МесяцНачисления",НачалоМесяца(МесяцНачислений));
							
							
							Если ВыборкаГраницаСубсидии.НайтиСледующий(СтруктараПоискаСубс)  Тогда
								ОбластьСтрокаУслуг.Параметры.ОбПлат = ВыборкаГраницаСубсидии.ГраницаСубсидии;
							КонецЕсли;
							ВыборкаГраницаСубсидии.Сбросить();
						КонецЕсли;
						ОбластьСтрокаУслуг.Параметры.Пересчет = ВыборкаУслуга.Перерасчет+ВыборкаУслуга.корректировка;
						//ОбластьСтрокаУслуг.Параметры.Корректировка = ВыборкаУслуга.корректировка;
					Иначе
						ОбластьСтрокаУслуг.Параметры.Тариф = 0;
						//ОбластьСтрокаУслуг.Параметры.КолДней = 0;
						ОбластьСтрокаУслуг.Параметры.НачисленоГрн = 0;
						ОбластьСтрокаУслуг.Параметры.Оплаты = 0;
						//ОбластьСтрокаУслуг.Параметры.Льготы = 0;
						//ОбластьСтрокаУслуг.Параметры.Субсидии = 0;
						ОбластьСтрокаУслуг.Параметры.Пересчет = 0;
						//ОбластьСтрокаУслуг.Параметры.Корректировка = 0;
					КонецЕсли;
					Начислено = ВыборкаУслуга.Начисление + ?(ВыборкаУслуга.Субсидия>0,-ВыборкаУслуга.Субсидия,ВыборкаУслуга.Субсидия) +?(ВыборкаУслуга.Льгота>0,-ВыборкаУслуга.Льгота,ВыборкаУслуга.Льгота)  + ВыборкаУслуга.Перерасчет + ВыборкаУслуга.Корректировка;
					//ОбластьСтрокаУслуг.Параметры.Начислено = Начислено;				
					СтруктураПоискаДолгаПоУслуге = Новый Структура("ЛицевойСчет, Услуга");
					СтруктураПоискаДолгаПоУслуге.ЛицевойСчет = ВыборкаУслуга.ЛицевойСчет;
					СтруктураПоискаДолгаПоУслуге.Услуга = ВыборкаУслуга.Услуга;
					
					НайденныеСтроки = ВыборкаОстатокПоУслугам.НайтиСтроки(СтруктураПоискаДолгаПоУслуге);
					Если НайденныеСтроки.Количество() >  0  Тогда
						Долгпериода = НайденныеСтроки[0].СуммаОстаток;
					Иначе
						Долгпериода = 0;
					КонецЕсли;
					
					Долг = Долгпериода-ВыборкаУслуга.Оплата;      //Метка
					
					ОбластьСтрокаУслуг.Параметры.Долг = Долгпериода;
					ОбластьСтрокаУслуг.Параметры.НачисленоКОплате = Начислено + Долг;
					НоваяСтрока = ТаблицаДляРасчетаИтогов.Добавить();
					НоваяСтрока.КОплате = ?((Начислено + Долг)<0,0,(Начислено + Долг));
					Если ОбластьСтрокаУслуг.Параметры.НачисленоГрн <> 0
						ИЛИ ОбластьСтрокаУслуг.Параметры.Долг <> 0 
						ИЛИ Начислено <> 0
						ИЛИ ОбластьСтрокаУслуг.Параметры.Оплаты <> 0 Тогда
						
						ТабличныйДокумент.Вывести(ОбластьСтрокаУслуг);
					КонецЕсли;
					
					Долгпериода = Неопределено;
					
				КонецЦикла;
				
				УслугаСчетчика = "";
				Для каждого Строка Из Таблица Цикл
					ОбластьСтрокаУслуг = Макет.ПолучитьОбласть("СтрокаУслуг");
					Если Строка.ТекущиеПоказания <> 0 Тогда // если нет текущих показаний тогда и выводить нечего	
						//Если ПервыйСчетчик Тогда
						//	ОбластьШапкаСчетчика = Макет.ПолучитьОбласть("ШапкаОбщиеПоказателиСчетчика");
						//	
						//	ТабличныйДокумент.Вывести(ОбластьШапкаСчетчика);
						//	ПервыйСчетчик = Ложь;
						//КонецЕсли;
						
						//ОбластьПриборы = Макет.ПолучитьОбласть("СтрокаСчетчиков");
						ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг = Строка.Услуга;
						ОбластьСтрокаУслуг.Параметры.Счетчик = Строка.Счетчик;
						//ОбластьПриборы.Параметры.Коэффициент = Строка.Коэффициент;
						ОбластьСтрокаУслуг.Параметры.ЕдИзмер = Строка.ЕдИзм;
						ОбластьСтрокаУслуг.Параметры.Тариф = Строка.Тариф;
						ОбластьСтрокаУслуг.Параметры.Поточные = Строка.ТекущиеПоказания;
						ОбластьСтрокаУслуг.Параметры.Предыдущие = Строка.ПредыдущиеПоказания;
						ОбластьСтрокаУслуг.Параметры.Разница = Строка.ТекущиеПоказания - Строка.ПредыдущиеПоказания;	
						
						Если УслугаСчетчика  = "" Тогда
							УслугаСчетчика = Строка.Услуга;
							ОбластьСтрокаУслуг.Параметры.НачисленоГрн = Строка.Начисление;
							ОбластьСтрокаУслуг.Параметры.Долг = Строка.Долг;
							ОбластьСтрокаУслуг.Параметры.Оплаты = Строка.Оплаты;
							ОбластьСтрокаУслуг.Параметры.Пересчет = Строка.Корректировка;
							КОплатеПоПрибору = ОбластьСтрокаУслуг.Параметры.НачисленоГрн + Строка.Долг - Строка.Оплаты + Строка.Корректировка;
							ОбластьСтрокаУслуг.Параметры.НачисленоКОплате =  ?(КОплатеПоПрибору<0,0,КОплатеПоПрибору);
							НоваяСтрока = ТаблицаДляРасчетаИтогов.Добавить();
							НоваяСтрока.КОплате = ?(КОплатеПоПрибору<0,0,КОплатеПоПрибору);
						ИначеЕсли УслугаСчетчика <> Строка.Услуга Тогда 
							УслугаСчетчика = Строка.Услуга;
							ОбластьСтрокаУслуг.Параметры.НачисленоГрн = Строка.Начисление;
							ОбластьСтрокаУслуг.Параметры.Долг = Строка.Долг;
							ОбластьСтрокаУслуг.Параметры.Оплаты = Строка.Оплаты;
							ОбластьСтрокаУслуг.Параметры.Пересчет = Строка.Корректировка;
							КОплатеПоПрибору = ОбластьСтрокаУслуг.Параметры.НачисленоГрн + Строка.Долг - Строка.Оплаты+Строка.Корректировка;
							ОбластьСтрокаУслуг.Параметры.НачисленоГрн =  ?(КОплатеПоПрибору<0,0,КОплатеПоПрибору);
							НоваяСтрока = ТаблицаДляРасчетаИтогов.Добавить();
							НоваяСтрока.КОплате = ?(КОплатеПоПрибору<0,0,КОплатеПоПрибору);
						КонецЕсли;
						
						//ТабличныйДокумент.Вывести(ОбластьПриборы);
						ТабличныйДокумент.Вывести(ОбластьСтрокаУслуг);
					КонецЕсли;	
					
				КонецЦикла;
				
				
				Если ЕстьРеструктуризация Тогда
					//РЕструкткризацияДолга
					ОбластьРеструкткризации = Макет.ПолучитьОбласть("ОбластьРеструктуризации");
					СтруктураПоиска = Новый Структура("ЛицевойСчет");
					СтруктураПоиска.ЛицевойСчет  = ВыборкаЛицевойСчет.ЛицевойСчет;
					
					Пока ВыборкаПоРеструктуризацииДолга.НайтиСледующий(СтруктураПоиска) Цикл
						
						
						СуммаОстатокПоРеструктуризации = ВыборкаПоРеструктуризацииДолга.ОстатокРеструктуризации;
						
						Если СуммаОстатокПоРеструктуризации <> 0 Тогда
							
							ОплаченоПлан = ПолучитьПредполагаемыеОплатыПоРеструктуризации(ТекущийДокумент, МесяцНачислений);
							ОплаченоФакт = ВыборкаПоРеструктуризацииДолга.Оплаты;
							
							ЗадолженностьПоРеструктуризации = ОплаченоПлан - ОплаченоФакт;
							ЗначениеРеструктуризацииДолга = ВыборкаПоРеструктуризацииДолга.СуммаПлатежа;
							
							Если ЗадолженностьПоРеструктуризации < 0 Тогда
								ЗадолженностьПоРеструктуризации = 0;
							КонецЕсли;	
							ОстатокПоРеструктуризации =  СуммаОстатокПоРеструктуризации - ЗадолженностьПоРеструктуризации;
							
							Если ОстатокПоРеструктуризации >= ЗначениеРеструктуризацииДолга Тогда
								МесячнаяПлатаПоРеструктуризации = ЗначениеРеструктуризацииДолга;
							иначе
								МесячнаяПлатаПоРеструктуризации = ОстатокПоРеструктуризации;
							КонецЕсли;  
							
							ОбластьРеструкткризации.Параметры.СуммаРеструктуризации = МесячнаяПлатаПоРеструктуризации;
							ОбластьРеструкткризации.Параметры.ОстатокРеструктуризации = ?(ОстатокПоРеструктуризации = 0,ВыборкаПоРеструктуризацииДолга.ОбщаяСумма,ОстатокПоРеструктуризации) ;
							
							ТабличныйДокумент.Вывести(ОбластьРеструкткризации);
							
							Если ЗадолженностьПоРеструктуризации <> 0 Тогда
								ОбластьЗадолженностиПореструктуризации = Макет.ПолучитьОбласть("ДолгПоРесруктуризации");
								ОбластьЗадолженностиПореструктуризации.Параметры.Задолженность = ЗадолженностьПоРеструктуризации;
								
								ТабличныйДокумент.Вывести(ОбластьЗадолженностиПореструктуризации);	
							КонецЕсли;	
							Прервать;
						КонецЕсли;
					КонецЦикла;
				Иначе
					МесячнаяПлатаПоРеструктуризации = 0;
					ЗадолженностьПоРеструктуризации = 0;
				КонецЕсли;
				
				
				Если ИспользуютсяАвансовыеПлатежи Тогда
					
					ОбластьАвансовыхПлатежейШапка = Макет.ПолучитьОбласть("ШапкаТаблицыАвансов");
					ТабличныйДокумент.Вывести(ОбластьАвансовыхПлатежейШапка);
					Пока ВыборкаАвансовыхПлатежей.Следующий() Цикл
						ОбластьАвансовыхПлатежей = Макет.ПолучитьОбласть("АвансовыйПлатеж");
						ОбластьАвансовыхПлатежей.Параметры.РесурснаяУслуга = ВыборкаАвансовыхПлатежей.Услуга;
						ОбластьАвансовыхПлатежей.Параметры.СуммаАвансовогоПлатежа = ВыборкаАвансовыхПлатежей.СуммаАванса;
						АвансовыйПлатежВсего = АвансовыйПлатежВсего + ВыборкаАвансовыхПлатежей.СуммаАванса;
						Если ВыборкаАвансовыхПлатежей.СуммаАванса <> 0 Тогда
							ТабличныйДокумент.Вывести(ОбластьАвансовыхПлатежей);
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;	
				
				
				Долг =?(НЕ ПризнакАванса,Остаток,0);
				Аванс =?(НЕ ПризнакАванса,0,Остаток); 
				
				Если ИспользуютсяАвансовыеПлатежи Тогда
					ОбластьПодвалОсновной = Макет.ПолучитьОбласть("ПодвалОсновнойЧастиАвансовый");
					//ОбластьПодвалОсновной.Параметры.АвансовыйПлатежВсего = АвансовыйПлатежВсего;
					//ОбластьПодвалОсновной.Параметры.Долг = Долг; 
					//ОбластьПодвалОсновной.Параметры.Аванс =Аванс;
					//ОбластьПодвалОсновной.Параметры.Начислено = НачисленоВсего;
					//ОбластьПодвалОсновной.Параметры.АвансовыйПлатежВсего = АвансовыйПлатежВсего;
					//ОбластьПодвалОсновной.Параметры.Долг = Долг; 
					//ОбластьПодвалОсновной.Параметры.Аванс =Аванс;
					//ОбластьПодвалОсновной.Параметры.Начислено = НачисленоВсего;

				Иначе	
					ОбластьПодвалОсновной = Макет.ПолучитьОбласть("ПодвалОсновнойЧасти");
					//ОбластьПодвалОсновной.Параметры.Долг = Остаток; 
					//ОбластьПодвалОсновной.Параметры.НачисленоГрнВсего =НачисленоГрнВсего;
					//ОбластьПодвалОсновной.Параметры.ЛьготаВсего = Льгота;
					//ОбластьПодвалОсновной.Параметры.СубсидияВсего = Субсидия;
					//ОбластьПодвалОсновной.Параметры.Перерасчеты = Корректировка+Перерасчет;
					//ОбластьПодвалОсновной.Параметры.Начислено = НачисленоВсего;

					//ОбластьПодвалОсновной.Параметры.Долг = Остаток; 
					//ОбластьПодвалОсновной.Параметры.НачисленоГрнВсего =НачисленоГрнВсего;
					//ОбластьПодвалОсновной.Параметры.ЛьготаВсего = Льгота;
					//ОбластьПодвалОсновной.Параметры.СубсидияВсего = Субсидия;
					//ОбластьПодвалОсновной.Параметры.Перерасчеты = Корректировка+Перерасчет;
					//ОбластьПодвалОсновной.Параметры.Начислено = НачисленоВсего;
				КонецЕсли;
				ОбластьПодвалОсновной.Параметры.НазанчениеПлатежа = НазначениеПлатежа;
				ОбластьПодвалОсновной.Параметры.ЛицевойСчет = ТекущийДокумент;;
				Попытка
					
					ОбластьПодвалОсновной.Параметры.Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование;
				Исключение
				КонецПопытки;
				ОбластьПодвалОсновной.Параметры.Оплата = Оплаты;
				ОбластьПодвалОсновной.Параметры.Всего = Всего + МесячнаяПлатаПоРеструктуризации + ЗадолженностьПоРеструктуризации;				
				ТабличныйДокумент.Вывести(ОбластьПодвалОсновной);
			КонецЦикла;
		КонецЦикла;
		
		ПечататьСообщение = Константы.ПечататьОпевещениеВКвитанции.Получить();
		
		Если ПечататьСообщение Тогда
			
			//Подвал1
			ОбластьПодвал1 = Макет.ПолучитьОбласть("Подвал1");
			ОбластьПодвал1.Параметры.ЄДРПОУ = ТекущийДокумент.Владелец.Организация.КодПоЕДРПОУ;
			ОбластьПодвал1.Параметры.Получатель = ТекущийДокумент.Владелец.Организация.НаименованиеПолное;
			ОбластьПодвал1.Параметры.МесяцНачисления = Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
			ТабличныйДокумент.Вывести(ОбластьПодвал1);
			
			//Банковский Счет Подвал
			Для каждого Строка Из БанковскиеСчетаОрганизации Цикл
				
				Если Строка.Печать  Тогда
					ОбластьБанковскийСчет = Макет.ПолучитьОбласть("БанковскийСчетПодвал");
					ОбластьБанковскийСчет.Параметры.Рр = ПолучитьПредставлениеБанковскогоСчета(Строка.БанковскийСчет);
					ОбластьБанковскийСчет.Параметры.Банк = Строка.БанковскийСчет.Банк.Наименование;
					ОбластьБанковскийСчет.Параметры.МФО = Строка.БанковскийСчет.Банк.Код;
					
					ТабличныйДокумент.Вывести(ОбластьБанковскийСчет);
				КонецЕсли;
				
			КонецЦикла; 
			
			//ПОДВАЛ
			Если НЕ ИспользуютсяАвансовыеПлатежи Тогда
				
				ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
				ОбластьПодвал.Параметры.МесяцНачисления = Формат((МесяцНачислений),?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='ММММ гггг"" г.""'"));	
				ОбластьПодвал.Параметры.Начислено = НачисленоВсего;
				ОбластьПодвал.Параметры.Долг = Долг;
				ОбластьПодвал.Параметры.Оплата = Оплаты;
				ОбластьПодвал.Параметры.Всего = Всего+МесячнаяПлатаПоРеструктуризации+ЗадолженностьПоРеструктуризации;
				ОбластьПодвал.Параметры.ЛицевойСчет = ТекущийДокумент;
				ОбластьПодвал.Параметры.МесяцНачисленияСлед = Формат((МесяцНачислений+500000),?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MM.yyyy р.'","ДФ='ММ.гг"" г.""'"));
				ОбластьПодвал.Параметры.Адрес = ПолучитьПредставлениеАдреса(АдресМасс, Квартира, КодЯзыкаПечать);
				ОбластьПодвал.Параметры.НазанчениеПлатежа = НазначениеПлатежа;

				Попытка
					ОбластьПодвал.Параметры.Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование;
				Исключение
				КонецПопытки;
				
				Для Каждого Строка Из ВыборкаПлощади Цикл
					Если Строка.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
						ОбластьПодвал.Параметры.ПлощадьОтоп = Строка.Площадь;
					ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
						ОбластьПодвал.Параметры.ПлощадьВся = Строка.Площадь;
					КонецЕсли;
				КонецЦикла;
				
				ОбластьПодвал.Параметры.КолЧеловек = ВыборкаКолПроживающих.КоличествоПроживающих;
				ОбластьПодвал.Параметры.КоличествоМестПаркинг = ВыборкаМашиномест.КоличествоМашиноМест;
				
				ТабличныйДокумент.Вывести(ОбластьПодвал);
			Иначе
				ОбластьПодвал = Макет.ПолучитьОбласть("Подвал2");
				ОбластьПодвал.Параметры.МесяцНачисления = Формат((МесяцНачислений),?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='ММММ гггг"" г.""'"));	
				ОбластьПодвал.Параметры.Начислено = НачисленоВсего;
				
				
				ОбластьПодвал.Параметры.Долг = Долг;
//{{MRG[ <-> ]
//{{MRG[ <-> ]
				//ОбластьПодвал.Параметры.Аванс = Аванс;
				//ОбластьПодвал.Параметры.АвансовыйПлатеж = АвансовыйПлатежВсего;  
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//				ОбластьПодвал.Параметры.Аванс = Аванс;
//				ОбластьПодвал.Параметры.АвансовыйПлатеж = АвансовыйПлатежВсего;  
//				ОбластьПодвал.Параметры.Всего = Всего+МесячнаяПлатаПоРеструктуризации+ЗадолженностьПоРеструктуризации+АвансовыйПлатежВсего;
//}}MRG[ <-> ]
				ОбластьПодвал.Параметры.Всего = Всего+МесячнаяПлатаПоРеструктуризации+ЗадолженностьПоРеструктуризации;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//				ОбластьПодвал.Параметры.Аванс = Аванс;
//				ОбластьПодвал.Параметры.АвансовыйПлатеж = АвансовыйПлатежВсего;  
//				ОбластьПодвал.Параметры.Всего = Всего+МесячнаяПлатаПоРеструктуризации+ЗадолженностьПоРеструктуризации+АвансовыйПлатежВсего;
//}}MRG[ <-> ]
				ОбластьПодвал.Параметры.ЛицевойСчет = ТекущийДокумент;
				ОбластьПодвал.Параметры.МесяцНачисленияСлед = Формат((МесяцНачислений+500000),?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MM.yyyy р.'","ДФ='ММ.гг"" г.""'"));
				ОбластьПодвал.Параметры.Адрес = ПолучитьПредставлениеАдреса(АдресМасс, Квартира, КодЯзыкаПечать);
				ОбластьПодвал.Параметры.НазанчениеПлатежа = НазначениеПлатежа;
				Попытка
					ОбластьПодвал.Параметры.Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование;
				Исключение
				КонецПопытки;
				
				Для Каждого Строка Из ВыборкаПлощади Цикл
					Если Строка.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
						ОбластьПодвал.Параметры.ПлощадьОтоп = Строка.Площадь;
					ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
						ОбластьПодвал.Параметры.ПлощадьВся = Строка.Площадь;
					КонецЕсли;
				КонецЦикла;
				
				ОбластьПодвал.Параметры.КолЧеловек = ВыборкаКолПроживающих.КоличествоПроживающих;
				ОбластьПодвал.Параметры.КоличествоМестПаркинг = ВыборкаМашиномест.КоличествоМашиноМест;
				
				ТабличныйДокумент.Вывести(ОбластьПодвал);
			КонецЕсли;
			
			
		КонецЕсли;
		
	ИНАЧЕ
		
		Всего = 0;
		Аванс = 0;
		Долг = 0;
		Оплаты = 0;
		
		СтруктураПоискаОбщегоОстатка = Новый Структура("ЛицевойСчет");
		СтруктураПоискаОбщегоОстатка.ЛицевойСчет  = ТекущийДокумент;
		
		ЕстьОстаток = Ложь;
		ОстатокНаКонецМесяца = Неопределено;
		ОбщийОстаток = 0;
		Пока ВыборкаОбщийОстаток.НайтиСледующий(СтруктураПоискаОбщегоОстатка) Цикл
			ВыборкаОстатковОрганизация = ВыборкаОбщийОстаток.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ЕстьОстаток = Истина;
			Пока ВыборкаОстатковОрганизация.следующий() Цикл
				ОрганизацияОтбор = Неопределено;
				Если ВыборкаОстатковОрганизация.Организация = Справочники.Организации.ПустаяСсылка() Тогда
					ОрганизацияОтбор = ВыборкаЛицевойСчет.ЛицевойСчет.Владелец.Организация;
				Иначе
					ОрганизацияОтбор = ВыборкаОстатковОрганизация.Организация;
				КонецЕсли;	
				Если  ОрганизацияОтбор = ВыборкаЛицевойСчет.Организация  Тогда
					ОстатокНаКонецМесяца = ВыборкаОстатковОрганизация.СуммаОстаток;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			
			
			
			
			
			ОбщийОстаток = ВыборкаОбщийОстаток.СуммаОстаток;
			Если ОбщийОстаток < 0 тогда
				ОстатокНаименование = "АВАНС";
				Аванс = ОбщийОстаток;
				Долг = 0;
			Иначе
				ОстатокНаименование = НСТР("ru = 'ДОЛГ'; uk = 'БОРГ'");
				Аванс = 0;
				Долг = ОбщийОстаток;
			КонецЕсли;
			
			Всего = ОбщийОстаток;
			
			ОбластьСтрокаУслуг = Макет.ПолучитьОбласть("СтрокаУслуг");
			ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг = ОстатокНаименование;
			ОбластьСтрокаУслуг.Параметры.Долг = ОбщийОстаток;
			ОбластьСтрокаУслуг.Параметры.НачисленоКОплате = ОбщийОстаток;
			НоваяСтрока = ТаблицаДляРасчетаИтогов.Добавить();
			НоваяСтрока.КОплате = ОбщийОстаток;
			
			ТабличныйДокумент.Вывести(ОбластьСтрокаУслуг);
			
		КонецЦикла;	
		ВыборкаОбщийОстаток.Сбросить();	
		Если ЕстьОстаток Тогда
			ОбластьПодвалОсновной = Макет.ПолучитьОбласть("ПодвалОсновнойЧасти");
			ОбластьПодвалОсновной.Параметры.ПараметрНадписиДляЗдания = ТекущийДокумент.Владелец.СопроводительныйТекстКвитанции;
			ОбластьПодвалОсновной.Параметры.Долг = Долг; 
//{{MRG[ <-> ]
//			ОбластьПодвалОсновной.Параметры.Аванс =Аванс;
//}}MRG[ <-> ]
			ОбластьПодвалОсновной.Параметры.Начислено = 0;
			ОбластьПодвалОсновной.Параметры.Оплата = 0;
			
			ОбластьПодвалОсновной.Параметры.Всего = ОбщийОстаток;
			
			ТабличныйДокумент.Вывести(ОбластьПодвалОсновной);
			
		КонецЕсли;
		
	КонецЕсли;
	//КонецЦикла;
	
	//ПечататьСообщение = Константы.ПечататьОпевещениеВКвитанции.Получить();
	//
	//Если ПечататьСообщение Тогда
	//	
	//	//Подвал1
	//	ОбластьПодвал1 = Макет.ПолучитьОбласть("Подвал1");
	//	ОбластьПодвал1.Параметры.ЄДРПОУ = ТекущийДокумент.Владелец.Организация.КодПоЕДРПОУ;
	//	ОбластьПодвал1.Параметры.Получатель = ТекущийДокумент.Владелец.Организация.НаименованиеПолное;
	//	ОбластьПодвал1.Параметры.МесяцНачисления = Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
	//	ТабличныйДокумент.Вывести(ОбластьПодвал1);
	//	
	//	//Банковский Счет Подвал
	//	Для каждого Строка Из БанковскиеСчетаОрганизации Цикл
	//		
	//		Если Строка.Печать  Тогда
	//			ОбластьБанковскийСчет = Макет.ПолучитьОбласть("БанковскийСчетПодвал");
	//			ОбластьБанковскийСчет.Параметры.Рр = ПолучитьПредставлениеБанковскогоСчета(Строка.БанковскийСчет);
	//			ОбластьБанковскийСчет.Параметры.Банк = Строка.БанковскийСчет.Банк.Наименование;
	//			ОбластьБанковскийСчет.Параметры.МФО = Строка.БанковскийСчет.Банк.Код;

	//			ТабличныйДокумент.Вывести(ОбластьБанковскийСчет);
	//		КонецЕсли;
	//		
	//	КонецЦикла; 
	//	
	//	//ПОДВАЛ
	//	Если НЕ ИспользуютсяАвансовыеПлатежи Тогда
	//		
	//		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	//		ОбластьПодвал.Параметры.МесяцНачисления = Формат((МесяцНачислений),?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='ММММ гггг"" г.""'"));	
	//		ОбластьПодвал.Параметры.Начислено = НачисленоВсего;
	//		ОбластьПодвал.Параметры.Долг = Долг;
	//		ОбластьПодвал.Параметры.Аванс = Аванс;
	//		ОбластьПодвал.Параметры.Оплата = Оплаты;
	//		ОбластьПодвал.Параметры.Всего = Всего+МесячнаяПлатаПоРеструктуризации+ЗадолженностьПоРеструктуризации;
	//		ОбластьПодвал.Параметры.ЛицевойСчет = ТекущийДокумент;
	//		ОбластьПодвал.Параметры.МесяцНачисленияСлед = Формат((МесяцНачислений+500000),?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MM.yyyy р.'","ДФ='ММ.гг"" г.""'"));
	//		ОбластьПодвал.Параметры.Адрес = ПолучитьПредставлениеАдреса(АдресМасс, Квартира);
	//		Попытка
	//			ОбластьПодвал.Параметры.Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование;
	//		Исключение
	//		КонецПопытки;
	//		
	//		Для Каждого Строка Из ВыборкаПлощади Цикл
	//			Если Строка.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
	//				ОбластьПодвал.Параметры.ПлощадьОтоп = Строка.Площадь;
	//			ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
	//				ОбластьПодвал.Параметры.ПлощадьВся = Строка.Площадь;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		ОбластьПодвал.Параметры.КолЧеловек = ВыборкаКолПроживающих.КоличествоПроживающих;
	//		ОбластьПодвал.Параметры.КоличествоМестПаркинг = ВыборкаМашиномест.КоличествоМашиноМест;
	//		
	//		ТабличныйДокумент.Вывести(ОбластьПодвал);
	//	Иначе
	//		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал2");
	//		ОбластьПодвал.Параметры.МесяцНачисления = Формат((МесяцНачислений),?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='ММММ гггг"" г.""'"));	
	//		ОбластьПодвал.Параметры.Начислено = НачисленоВсего;
	//		
	//		
	//		ОбластьПодвал.Параметры.Долг = Долг;
	//		ОбластьПодвал.Параметры.Аванс = Аванс;
	//		ОбластьПодвал.Параметры.АвансовыйПлатеж = АвансовыйПлатежВсего;  
	//		ОбластьПодвал.Параметры.Всего = Всего+МесячнаяПлатаПоРеструктуризации+ЗадолженностьПоРеструктуризации+АвансовыйПлатежВсего;
	//		ОбластьПодвал.Параметры.ЛицевойСчет = ТекущийДокумент;
	//		ОбластьПодвал.Параметры.МесяцНачисленияСлед = Формат((МесяцНачислений+500000),?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MM.yyyy р.'","ДФ='ММ.гг"" г.""'"));
	//		ОбластьПодвал.Параметры.Адрес = ПолучитьПредставлениеАдреса(АдресМасс, Квартира);
	//		Попытка
	//			ОбластьПодвал.Параметры.Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование;
	//		Исключение
	//		КонецПопытки;
	//		
	//		Для Каждого Строка Из ВыборкаПлощади Цикл
	//			Если Строка.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
	//				ОбластьПодвал.Параметры.ПлощадьОтоп = Строка.Площадь;
	//			ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
	//				ОбластьПодвал.Параметры.ПлощадьВся = Строка.Площадь;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		ОбластьПодвал.Параметры.КолЧеловек = ВыборкаКолПроживающих.КоличествоПроживающих;
	//		ОбластьПодвал.Параметры.КоличествоМестПаркинг = ВыборкаМашиномест.КоличествоМашиноМест;
	//		
	//		ТабличныйДокумент.Вывести(ОбластьПодвал);
	//	КонецЕсли;
	//	
	//	
	//КонецЕсли;

		
	Возврат ТабличныйДокумент;
	
	
КонецФункции

Функция ПечатьКвитанцииНаОплатуМарина(ТекущийДокумент, ТабличныйДокумент, МесяцНачислений, БанковскиеСчетаОрганизации) Экспорт 
	
	ГлобальнаяВыборка = ПолучитьОбщуюСтруктуруКвитанции(ТекущийДокумент, МесяцНачислений);
	// Заполнение таблицы
	ЕстьРеструктуризация = НЕ ГлобальнаяВыборка[9].Пустой();
	ВыборкаОрганизация = ГлобальнаяВыборка[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПриборыУчета = ГлобальнаяВыборка[4].Выбрать();
	Если ЕстьРеструктуризация Тогда;
		ВыборкаОбщийОстаток = ГлобальнаяВыборка[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Иначе
		ВыборкаОбщийОстаток = ГлобальнаяВыборка[8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	
	ВыборкаАвансовыхПлатежей = ГлобальнаяВыборка[6].Выбрать();
	ВыборкаПоРеструктуризацииДолга = ГлобальнаяВыборка[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОстатокПоУслугам = ГлобальнаяВыборка[8].Выгрузить();
	ВыборкаГраницаСубсидии = ГлобальнаяВыборка[10].Выбрать();

	
	Макет =  ПолучитьОбщийМакет("МакетКвитанцииНаОплатуМаклак");
	
	ЕСЛИ НЕ ГлобальнаяВыборка[5].Пустой() Тогда
		Пока ВыборкаОрганизация.Следующий() Цикл
			
			
			
			ИспользуютсяАвансовыеПлатежи = ПолучитьФункциональнуюОпцию("ИспользоватьАвансовыеПлатежи");
			АвансовыйПлатежВсего = 0;
			ВыборкаПриборыУчета.Сбросить();
			ТаблицаДляРасчетаИтогов = Новый ТаблицаЗначений;
			ТаблицаДляРасчетаИтогов.Колонки.Добавить("КОплате");
			ТаблицаДляРасчетаИтогов.Очистить();
			
			
			ЗначениеРеструктуризацииДолга = 0;
			ЗадолженностьПоРеструктуризации = 0;
			МесячнаяПлатаПоРеструктуризации = 0;
			
			//Получаем настройки печати квитанции
			КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
			Макет.КодЯзыкаМакета = КодЯзыкаПечать;
			
			//Для удобства накапливаем переменные
			Квартира = ТекущийДокумент.ОбъектЛицевогоСчета;
			
			
			//Создадим адрес в необходимои формате
			АдресМасс = РазложитьСтрокуВМассивПодстрок(ТекущийДокумент.Владелец.Наименование);
			
			
			//ШАПКА
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
			ОбластьШапка.Параметры.МесяцНачисления = Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
			ОбластьШапка.Параметры.Получатель =ВыборкаОрганизация.Организация.НаименованиеПолное;
			ОбластьШапка.Параметры.ЄДРПОУ = ВыборкаОрганизация.Организация.КодПоЕДРПОУ;
			
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			//БанковскийСчет
			Для каждого Строка Из БанковскиеСчетаОрганизации Цикл
				Если Строка.Печать Тогда
					Если ВыборкаОрганизация.Организация = Строка.БанковскийСчет.Владелец Тогда
						ОбластьБанковскийСчет = Макет.ПолучитьОбласть("БанковскийСчет");
						ОбластьБанковскийСчет.Параметры.Рр = ПолучитьПредставлениеБанковскогоСчета(Строка.БанковскийСчет);
						ОбластьБанковскийСчет.Параметры.Банк = Строка.БанковскийСчет.Банк.Наименование;
						
						ТабличныйДокумент.Вывести(ОбластьБанковскийСчет);
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла; 
			
			//ШапкаОсновнойЧасти 
			ВыборкаПлощади = РегистрыСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(НачалоМесяца(МесяцНачислений),Новый Структура("Помещение", Квартира));
			
			ОбластьШапкаОсновнойЧасти = Макет.ПолучитьОбласть("ШапкаОсновнойЧасти");
			Для Каждого Строка Из ВыборкаПлощади Цикл
				Если Строка.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
					ОбластьШапкаОсновнойЧасти.Параметры.ПлощадьОтоп = Строка.Площадь;
				ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
					ОбластьШапкаОсновнойЧасти.Параметры.ПлощадьВся = Строка.Площадь;
				КонецЕсли;
			КонецЦикла;
			
			ВыборкаКолПроживающих = РегистрыСведений.ЛицевыеСчета.ПолучитьПоследнее(НачалоМесяца(МесяцНачислений),Новый Структура("ЛицевойСчет",ТекущийДокумент));
			ВыборкаМашиномест = РегистрыСведений.МашиноМеста.ПолучитьПоследнее(НачалоМесяца(МесяцНачислений),Новый Структура("ЛицевойСчет",ТекущийДокумент));
			Попытка
				Если Константы.ВыводитьВКвитанцияхФИО.Получить() = Истина Тогда
					Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование; 
				Иначе
					Плательщик = "";
				КонецЕсли;
				ОбластьШапкаОсновнойЧасти.Параметры.Плательщик = Плательщик;
			Исключение
			КонецПопытки;
			
			НазначениеПлатежа = ТекущийДокумент.Владелец.ТекстНазначенияПлатежа;
			ОбластьШапкаОсновнойЧасти.Параметры.КолЧеловек = ВыборкаКолПроживающих.КоличествоПроживающих;
			
			ОбластьШапкаОсновнойЧасти.Параметры.ЛицевойСчет = ТекущийДокумент;
			
			Если Константы.ВыводитьАдресВКвитанциях.Получить() = Истина Тогда
				ОбластьШапкаОсновнойЧасти.Параметры.Адрес = ПолучитьПредставлениеАдреса(АдресМасс, Квартира,КодЯзыкаПечать);
			Иначе
				ОбластьШапкаОсновнойЧасти.Параметры.Адрес = ТекущийДокумент;
			КонецЕсли;
			
			
			ТабличныйДокумент.Вывести(ОбластьШапкаОсновнойЧасти);
			
			//ШапкаТаблицыУслуг
			ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
			
			ВыборкаЛицевойСчет = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			
			Пока ВыборкаЛицевойСчет.Следующий() Цикл
				
				ВыборкаУслуга = ВыборкаЛицевойСчет.выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Корректировка =  ВыборкаЛицевойСчет.Корректировка;
				Перерасчет = ВыборкаЛицевойСчет.Перерасчет;
				Субсидия = ВыборкаЛицевойСчет.Субсидия;
				Льгота = ВыборкаЛицевойСчет.Льгота;
				НачисленоГрнВсего = ВыборкаЛицевойСчет.Начисление;
				
				НачисленоВсего =  ВыборкаЛицевойСчет.Начисление + ВыборкаЛицевойСчет.Корректировка + ВыборкаЛицевойСчет.Перерасчет;
				СтруктураПоискаОбщегоОстатка = Новый Структура("ЛицевойСчет");
				СтруктураПоискаОбщегоОстатка.ЛицевойСчет  = ВыборкаЛицевойСчет.ЛицевойСчет;
				
				ПервыйСчетчик = истина;
				ОстатокНаКонецМесяца = Неопределено;
				Пока ВыборкаОбщийОстаток.НайтиСледующий(СтруктураПоискаОбщегоОстатка) Цикл
					ВыборкаОстатковОрганизация = ВыборкаОбщийОстаток.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаОстатковОрганизация.следующий() Цикл
						ОрганизацияОтбор = Неопределено;
						Если ВыборкаОстатковОрганизация.Организация = Справочники.Организации.ПустаяСсылка() Тогда
							ОрганизацияОтбор = ВыборкаЛицевойСчет.ЛицевойСчет.Владелец.Организация;
						Иначе
							ОрганизацияОтбор = ВыборкаОстатковОрганизация.Организация;
						КонецЕсли;	
						Если  ОрганизацияОтбор = ВыборкаЛицевойСчет.Организация  Тогда
							ОстатокНаКонецМесяца = ВыборкаОстатковОрганизация.СуммаОстаток;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				ВыборкаОбщийОстаток.Сбросить();
				
				
				
				Если ОстатокНаКонецМесяца = Неопределено Тогда
					ОстатокНаКонецМесяца = 0;
				КонецЕсли;
				
				
				Оплаты = ВыборкаЛицевойСчет.Оплата;
				
				
				
				Если ЕстьРеструктуризация Тогда
					Остаток =  ОстатокНаКонецМесяца  - Корректировка - Перерасчет - ?(Субсидия<0,0,Субсидия) - ?(Льгота<0,0,Льгота);
					Всего = НачисленоВсего+Остаток;
					//ОбластьШапкаТаблицыУслуг.Параметры.Оплата = ?(КодЯзыкаПечать="ru","Сплачено у ","Сплачено у ")+ Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
					ОбластьШапкаТаблицы.Параметры.ДатаДолга = ОбластьШапка.Параметры.МесяцНачисления;//Формат(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1), ?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" р.""'"));
					ОбластьШапкаТаблицы.Параметры.Долг = Остаток;
					ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
				ИНаче
					Остаток = ОстатокНаКонецМесяца;
					Всего = НачисленоВсего+Льгота+Субсидия + Остаток - Оплаты;
					//ОбластьШапкаТаблицыУслуг.Параметры.Оплата = ?(КодЯзыкаПечать="ru","Сплачено у ","Сплачено у ")+ Формат(МесяцНачислений,?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" г.""'"));
					ОбластьШапкаТаблицы.Параметры.ДатаДолга = ОбластьШапка.Параметры.МесяцНачисления;//Формат(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1), ?(КодЯзыкаПечать="uk","Л=uk_UA; ДФ='MMMM yyyy р.'","ДФ='MMMM yyyy"" р.""'"));
					ОбластьШапкаТаблицы.Параметры.Долг = Остаток;
					ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
				КонецЕсли;
				
				Если Остаток > 0 тогда
					ПризнакАванса = Ложь;
					
				Иначе
					ПризнакАванса = ИСТИНА;
					остаток = остаток;
				КонецЕсли;
				
				
				
				Таблица = Новый ТаблицаЗначений;
				Таблица.Колонки.Добавить("Услуга",,"Услуга");
				Таблица.Колонки.Добавить("Счетчик",,"Счетчик");
				Таблица.Колонки.Добавить("Коэффициент",,"Коэффициент");
				Таблица.Колонки.Добавить("ЕдИзм",,"ЕдИзм");
				Таблица.Колонки.Добавить("Тариф",,"Тариф");
				Таблица.Колонки.Добавить("Норма",,"Норма");
				Таблица.Колонки.Добавить("Оплаты",,"Оплаты");
				Таблица.Колонки.Добавить("Долг",,"Долг");
				Таблица.Колонки.Добавить("ТекущиеПоказания",,"ТекущиеПоказания");
				Таблица.Колонки.Добавить("ПредыдущиеПоказания",,"ПредыдущиеПоказания");
				Таблица.Колонки.Добавить("Начисление",,"Начисление");
				Таблица.Колонки.Добавить("Льгота",,"Льгота");
				Таблица.Колонки.Добавить("Субсидия",,"Субсидия");
				Таблица.Колонки.Добавить("КоличествоЕдиниц",,"КоличествоЕдиниц");
				Таблица.Колонки.Добавить("Корректировка",,"Корректировка");
				Таблица.Колонки.Добавить("ГраницаСубсидии",,"ГраницаСубсидии");
				Таблица.Колонки.Добавить("Неустойка",, "Неустойка");
				Таблица.Колонки.Добавить("Пеня",, "Пеня");
				
				
				Пока ВыборкаУслуга.Следующий() Цикл
					
					СтруктураПоискаПриборов = Новый Структура("ОбъектУстановки, Услуга");
					СтруктураПоискаПриборов.ОбъектУстановки = ВыборкаУслуга.ЛицевойСчет;
					СтруктураПоискаПриборов.Услуга = ВыборкаУслуга.Услуга;
					Марк = Истина;
					НоваяУслуга = "";
					СтараяУслуга = "";
					ПОКА ВыборкаПриборыУчета.НайтиСледующий(СтруктураПоискаПриборов) Цикл
						
						КорректировкаПоПрибору = 0;
						ПерерасчетПоприбору = 0;
						
						
						НоваяУслуга = ВыборкаУслуга.Услуга;
						Строка = Таблица.Добавить();
//{{MRG[ <-> ]
						Строка.Услуга = ВыборкаУслуга.Услуга.ПолноеНаименование;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//						Строка.Услуга = ВыборкаУслуга.Услуга;
//}}MRG[ <-> ]
						Строка.Счетчик = ВыборкаПриборыУчета.ЗаводскойНомер+"/"+ВыборкаПриборыУчета.ВидУслуги;
						Строка.Коэффициент = ВыборкаПриборыУчета.ПриборУчетаКоэффициент;
						Строка.ЕдИзм = ВыборкаУслуга.ЕдиницаИзмерения;
						
						ВыборкаТариф = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Тариф = "";
						КоличествоЕдиниц = 0;
						Пока ВыборкаТариф.Следующий() Цикл
							Если Тариф = "" Тогда
								Значение = ?(ВыборкаТариф.Тариф = 0 ,"",Строка(ВыборкаТариф.Тариф)) ;
								
							Иначе
								Если ВыборкаТариф.Тариф = 0 Тогда
									Значение = "";
								Иначе
									Если ВыборкаТариф.Тариф = 0 Тогда
										Значение = "";
									Иначе	
										Значение = "\"+Строка(ВыборкаТариф.Тариф);
									КонецЕсли;
									
								КонецЕсли;	
							КонецЕсли;
							Тариф = Тариф+Значение;
							
							Если КоличествоЕдиниц <> ВыборкаТариф.КоличествоЕдИзм И ВыборкаТариф.КоличествоЕдИзм <> 0 Тогда
								Если ВыборкаТариф.Порог <> Неопределено Тогда
									КоличествоЕдиниц = КоличествоЕдиниц + ВыборкаТариф.КоличествоЕдИзм;
								Иначе	
									КоличествоЕдиниц = ВыборкаТариф.КоличествоЕдИзм;
								КонецЕсли;	
							КонецЕсли;
						КонецЦикла;
						
						
						Строка.КоличествоЕдиниц = КоличествоЕдиниц;
						Строка.Тариф = Тариф;		
						СтруктураПоискаДолгаПоУслуге = Новый Структура("ЛицевойСчет, Услуга");
						СтруктураПоискаДолгаПоУслуге.ЛицевойСчет = ВыборкаУслуга.ЛицевойСчет;
						СтруктураПоискаДолгаПоУслуге.Услуга = ВыборкаУслуга.Услуга;
						
						Строка.Долг = 0;
						Строка.Оплаты = 0;
						
						НайденныеСтроки = ВыборкаОстатокПоУслугам.НайтиСтроки(СтруктураПоискаДолгаПоУслуге);
						
						Если НайденныеСтроки.Количество() >  0 Тогда
							Строка.Долг = НайденныеСтроки[0].СуммаОстаток;
						Иначе
							Строка.Долг = 0;
						КонецЕсли;
						Строка.Оплаты = ВыборкаУслуга.Оплата;
						
						
						
						Строка.ТекущиеПоказания = ВыборкаПриборыУчета.ТекущиеПоказания;
						Строка.ПредыдущиеПоказания = ВыборкаПриборыУчета.ПредыдущиеПоказания;
						КорректировкаПоПрибору = ВыборкаУслуга.Корректировка;
						ПерерасчетПоприбору = ВыборкаУслуга.Перерасчет;
						Строка.Льгота = ВыборкаУслуга.Льгота;
						Строка.Субсидия = ВыборкаУслуга.Субсидия;
						Если ВыборкаУслуга.Субсидия <> 0 Тогда
							
							СтруктараПоискаСубс = Новый Структура;
							СтруктараПоискаСубс.Вставить("ЛицевойСчет",ТекущийДокумент);
							СтруктараПоискаСубс.Вставить("Услуга",ВыборкаУслуга.Услуга);
							СтруктараПоискаСубс.Вставить("МесяцНачисления",НачалоМесяца(МесяцНачислений));
							
							
							Если ВыборкаГраницаСубсидии.НайтиСледующий(СтруктараПоискаСубс)  Тогда
								Строка.ГраницаСубсидии = ВыборкаГраницаСубсидии.ГраницаСубсидии;
							КонецЕсли;
							ВыборкаГраницаСубсидии.Сбросить();
						КонецЕсли;
						
						
						Если СтараяУслуга <> НоваяУслуга  тогда
							Строка.Корректировка = ПерерасчетПоприбору + КорректировкаПоПрибору;
							Строка.Начисление = ВыборкаУслуга.Начисление;
						Иначе
							Строка.Начисление = ВыборкаУслуга.Начисление;
						КонецЕсли; 
						
						Марк = Ложь;
						СтараяУслуга = ВыборкаУслуга.Услуга;
					КонецЦикла;		
					
					Если Марк = Ложь тогда
						Продолжить;
					КонецЕсли;
								
					ОбластьСтрокаУслуг = Макет.ПолучитьОбласть("СтрокаТаблицыУслуги");
					Если ВыборкаУслуга.Услуга = Справочники.Услуги.ПустаяСсылка() тогда
						Если ПризнакАванса = Истина тогда
							//ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг =  "АВАНС";
							//ОбластьСтрокаУслуг.Параметры.ЕдИзмер = "";
						Иначе
							//ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг =  ?(КодЯзыкаПечать = "uk","+ БОРГ/ - ПЕРЕПЛАТА","+ БОРГ/ - ПЕРЕПЛАТА");
							//ОбластьСтрокаУслуг.Параметры.ЕдИзмер = "";
						КонецЕсли;
					ИначеЕсли ВыборкаУслуга.Услуга = Справочники.Услуги.РеструктуризацияДолга Тогда
						//ДанныеПоРеструктуризацииДолга = ВыборкаУслуга.Начисление;  //метка
					    Продолжить;
					Иначе
						ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг =  ВыборкаУслуга.Услуга.ПолноеНаименование;
						ОбластьСтрокаУслуг.Параметры.ЕдИзмер = ВыборкаУслуга.ЕдиницаИзмерения;
					КонецЕсли;
					ВыборкаТариф = ВыборкаУслуга.Выбрать();
					Тариф = "";
					ДнейНачислено = 0;
					Пока ВыборкаТариф.Следующий() Цикл
						Если Тариф = "" Тогда
							Значение = ?(ВыборкаТариф.Тариф = 0 ,"",Строка(ВыборкаТариф.Тариф)) ;
						Иначе 
							Если ВыборкаТариф.Тариф = 0 Тогда
								Значение = "";
							Иначе	
								Значение = "\"+Строка(ВыборкаТариф.Тариф);
							КонецЕсли;	
						КонецЕсли;
						Тариф = Тариф+Значение;
						
						
						Если НЕ ВыборкаТариф.Начисление = 0 Тогда
							ДнейНачислено= ДнейНачислено + ВыборкаТариф.ДнейНачислено;
						КонецЕсли;	
					КонецЦикла;
					Если ВыборкаУслуга.Услуга <> Справочники.Услуги.ПустаяСсылка() Тогда 
						ОбластьСтрокаУслуг.Параметры.Тариф = Тариф;
						ОбластьСтрокаУслуг.Параметры.Начислено = ВыборкаУслуга.Начисление;
						//ОбластьСтрокаУслуг.Параметры.Оплата = ВыборкаУслуга.Оплата;

						Если ВыборкаУслуга.Субсидия <> 0 Тогда
							
							СтруктараПоискаСубс = Новый Структура;
							СтруктараПоискаСубс.Вставить("ЛицевойСчет",ТекущийДокумент);
							СтруктараПоискаСубс.Вставить("Услуга",ВыборкаУслуга.Услуга);
							СтруктараПоискаСубс.Вставить("МесяцНачисления",НачалоМесяца(МесяцНачислений));
							
							
							Если ВыборкаГраницаСубсидии.НайтиСледующий(СтруктараПоискаСубс)  Тогда
								ОбластьСтрокаУслуг.Параметры.ОбПлат = ВыборкаГраницаСубсидии.ГраницаСубсидии;
							КонецЕсли;
							ВыборкаГраницаСубсидии.Сбросить();
						КонецЕсли;
						//ОбластьСтрокаУслуг.Параметры.Пересчет = ВыборкаУслуга.Перерасчет+ВыборкаУслуга.корректировка;
						//ОбластьСтрокаУслуг.Параметры.Корректировка = ВыборкаУслуга.корректировка;
					Иначе
						ОбластьСтрокаУслуг.Параметры.Тариф = 0;
						ОбластьСтрокаУслуг.Параметры.Начислено = 0;
						//ОбластьСтрокаУслуг.Параметры.Оплата = 0;
						
					КонецЕсли;
					Начислено = ВыборкаУслуга.Начисление + ?(ВыборкаУслуга.Субсидия>0,-ВыборкаУслуга.Субсидия,ВыборкаУслуга.Субсидия) +?(ВыборкаУслуга.Льгота>0,-ВыборкаУслуга.Льгота,ВыборкаУслуга.Льгота)  + ВыборкаУслуга.Перерасчет + ВыборкаУслуга.Корректировка;
					ОбластьСтрокаУслуг.Параметры.Начислено = Начислено;				
					СтруктураПоискаДолгаПоУслуге = Новый Структура("ЛицевойСчет, Услуга");
					СтруктураПоискаДолгаПоУслуге.ЛицевойСчет = ВыборкаУслуга.ЛицевойСчет;
					СтруктураПоискаДолгаПоУслуге.Услуга = ВыборкаУслуга.Услуга;
					
					НайденныеСтроки = ВыборкаОстатокПоУслугам.НайтиСтроки(СтруктураПоискаДолгаПоУслуге);
					Если НайденныеСтроки.Количество() >  0  Тогда
						Долгпериода = НайденныеСтроки[0].СуммаОстаток;
					Иначе
						Долгпериода = 0;
					КонецЕсли;
					
					Долг = Долгпериода-ВыборкаУслуга.Оплата;      //Метка
					
					ОбластьСтрокаУслуг.Параметры.Долг = Долгпериода;
					ОбластьСтрокаУслуг.Параметры.НачисленоКОплате = Начислено + Долг;
					НоваяСтрока = ТаблицаДляРасчетаИтогов.Добавить();
					НоваяСтрока.КОплате = ?((Начислено + Долг)<0,0,(Начислено + Долг));
					Если ОбластьСтрокаУслуг.Параметры.Начислено <> 0
						ИЛИ ОбластьСтрокаУслуг.Параметры.Долг <> 0 
						ИЛИ Начислено <> 0
						Тогда
						
						ТабличныйДокумент.Вывести(ОбластьСтрокаУслуг);
					КонецЕсли;
					
					Долгпериода = Неопределено;					
				КонецЦикла;
				
				УслугаСчетчика = "";
				Для каждого Строка Из Таблица Цикл
					ОбластьСтрокаУслуг = Макет.ПолучитьОбласть("СтрокаТаблицыСчетчики");
					Если Строка.ТекущиеПоказания <> 0 Тогда // если нет текущих показаний тогда и выводить нечего	
						ОбластьСтрокаУслуг.Параметры.Счетчик = Строка.Счетчик;
						ОбластьСтрокаУслуг.Параметры.ЕдИзмер = Строка.ЕдИзм;
						ОбластьСтрокаУслуг.Параметры.Тариф = Строка.Тариф;
						ОбластьСтрокаУслуг.Параметры.Поточные = Строка.ТекущиеПоказания;
						ОбластьСтрокаУслуг.Параметры.Предыдущие = Строка.ПредыдущиеПоказания;
						ОбластьСтрокаУслуг.Параметры.Разница = Строка.ТекущиеПоказания - Строка.ПредыдущиеПоказания;	
						
						Если УслугаСчетчика  = "" Тогда
							УслугаСчетчика = Строка.Услуга;
							ОбластьСтрокаУслуг.Параметры.Начислено = Строка.Начисление;
							//ОбластьСтрокаУслуг.Параметры.Долг = Строка.Долг;
							//ОбластьСтрокаУслуг.Параметры.Оплата = Строка.Оплаты;
							//ОбластьСтрокаУслуг.Параметры.Пересчет = Строка.Корректировка;
							КОплатеПоПрибору = ОбластьСтрокаУслуг.Параметры.Начислено + Строка.Долг - Строка.Оплаты + Строка.Корректировка;
							ОбластьСтрокаУслуг.Параметры.Начислено =  ?(КОплатеПоПрибору<0,0,КОплатеПоПрибору);
							НоваяСтрока = ТаблицаДляРасчетаИтогов.Добавить();
							НоваяСтрока.КОплате = ?(КОплатеПоПрибору<0,0,КОплатеПоПрибору);
						ИначеЕсли УслугаСчетчика <> Строка.Услуга Тогда 
							УслугаСчетчика = Строка.Услуга;
							ОбластьСтрокаУслуг.Параметры.Начислено = Строка.Начисление;
							//ОбластьСтрокаУслуг.Параметры.Долг = Строка.Долг;
							//ОбластьСтрокаУслуг.Параметры.Оплата = Строка.Оплаты;
							//ОбластьСтрокаУслуг.Параметры.Пересчет = Строка.Корректировка;
							КОплатеПоПрибору = ОбластьСтрокаУслуг.Параметры.Начислено + Строка.Долг - Строка.Оплаты+Строка.Корректировка;
							ОбластьСтрокаУслуг.Параметры.Начислено =  ?(КОплатеПоПрибору<0,0,КОплатеПоПрибору);
							НоваяСтрока = ТаблицаДляРасчетаИтогов.Добавить();
							НоваяСтрока.КОплате = ?(КОплатеПоПрибору<0,0,КОплатеПоПрибору);
						КонецЕсли;
						
						//ТабличныйДокумент.Вывести(ОбластьПриборы);
						ТабличныйДокумент.Вывести(ОбластьСтрокаУслуг);
					КонецЕсли;	
					
				КонецЦикла;
				
				ОбластьПодвалОсновной = Макет.ПолучитьОбласть("ПодвалОсновнойЧастиАвансовый");
				ОбластьПодвалОсновной.Параметры.НазанчениеПлатежа = НазначениеПлатежа;
				ОбластьПодвалОсновной.Параметры.ЛицевойСчет = ТекущийДокумент;;
				Попытка
					
					ОбластьПодвалОсновной.Параметры.Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование;
				Исключение
				КонецПопытки;
				ОбластьПодвалОсновной.Параметры.Всего = Всего + МесячнаяПлатаПоРеструктуризации + ЗадолженностьПоРеструктуризации;
				ОбластьПодвалОсновной.Параметры.Оплата = Оплаты;
				ТабличныйДокумент.Вывести(ОбластьПодвалОсновной);
			КонецЦикла;
		КонецЦикла;
		
		
		
	ИНАЧЕ
		
		Всего = 0;
		Аванс = 0;
		Долг = 0;
		Оплаты = 0;
		
		СтруктураПоискаОбщегоОстатка = Новый Структура("ЛицевойСчет");
		СтруктураПоискаОбщегоОстатка.ЛицевойСчет  = ТекущийДокумент;
		
		ЕстьОстаток = Ложь;
		ОстатокНаКонецМесяца = Неопределено;
		ОбщийОстаток = 0;
		Пока ВыборкаОбщийОстаток.НайтиСледующий(СтруктураПоискаОбщегоОстатка) Цикл
			ВыборкаОстатковОрганизация = ВыборкаОбщийОстаток.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ЕстьОстаток = Истина;
			Пока ВыборкаОстатковОрганизация.следующий() Цикл
				ОрганизацияОтбор = Неопределено;
				Если ВыборкаОстатковОрганизация.Организация = Справочники.Организации.ПустаяСсылка() Тогда
					ОрганизацияОтбор = ВыборкаЛицевойСчет.ЛицевойСчет.Владелец.Организация;
				Иначе
					ОрганизацияОтбор = ВыборкаОстатковОрганизация.Организация;
				КонецЕсли;	
				Если  ОрганизацияОтбор = ВыборкаЛицевойСчет.Организация  Тогда
					ОстатокНаКонецМесяца = ВыборкаОстатковОрганизация.СуммаОстаток;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ОбщийОстаток = ВыборкаОбщийОстаток.СуммаОстаток;
			Если ОбщийОстаток < 0 тогда
				ОстатокНаименование = "АВАНС";
				Аванс = ОбщийОстаток;
				Долг = 0;
			Иначе
				ОстатокНаименование = НСТР("ru = 'ДОЛГ'; uk = 'БОРГ'");
				Аванс = 0;
				Долг = ОбщийОстаток;
			КонецЕсли;
			
			Всего = ОбщийОстаток;
			
			ОбластьСтрокаУслуг = Макет.ПолучитьОбласть("СтрокаТаблицыУслуги");
			ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг = ОстатокНаименование;
			ОбластьСтрокаУслуг.Параметры.Долг = ОбщийОстаток;
			ОбластьСтрокаУслуг.Параметры.НачисленоКОплате = ОбщийОстаток;
			НоваяСтрока = ТаблицаДляРасчетаИтогов.Добавить();
			НоваяСтрока.КОплате = ОбщийОстаток;
			
			ТабличныйДокумент.Вывести(ОбластьСтрокаУслуг);
			
		КонецЦикла;	
		ВыборкаОбщийОстаток.Сбросить();	
		Если ЕстьОстаток Тогда
			ОбластьПодвалОсновной = Макет.ПолучитьОбласть("ПодвалОсновнойЧастиАвансовый");
			ОбластьПодвалОсновной.Параметры.ПараметрНадписиДляЗдания = ТекущийДокумент.Владелец.СопроводительныйТекстКвитанции;
			ОбластьПодвалОсновной.Параметры.Долг = Долг; 
			ОбластьПодвалОсновной.Параметры.Начислено = 0;
			ОбластьПодвалОсновной.Параметры.Оплата = 0;
			
			ОбластьПодвалОсновной.Параметры.Всего = ОбщийОстаток;
			
			ТабличныйДокумент.Вывести(ОбластьПодвалОсновной);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
	
КонецФункции


Функция ПолучитьПредполагаемыеОплатыПоРеструктуризации(ЛицевыеСчета,МесяцНачисления)

	ЗАпрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПлатежиПоРеструктуризацииДолга.ЛицевойСчет КАК ЛицевойСчет,
	                |	ПлатежиПоРеструктуризацииДолга.СуммаПлатежа КАК СуммаПлатежа
	                |ИЗ
	                |	РегистрСведений.ПлатежиПоРеструктуризацииДолга КАК ПлатежиПоРеструктуризацииДолга
	                |ГДЕ
	                |	ПлатежиПоРеструктуризацииДолга.Период <= НачалоПериода(&МесяцНачисления, МЕСЯЦ)
	                |	И ПлатежиПоРеструктуризацииДолга.ЛицевойСчет В(&ЛицевыеСчета)
	                |ИТОГИ
	                |	СУММА(СуммаПлатежа)
	                |ПО
	                |	ЛицевойСчет";
	Запрос.УстановитьПараметр("ЛицевыеСчета", ЛицевыеСчета);
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	
	Результат  = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() тогда
		
	   Возврат Результат.СуммаПлатежа;
   Иначе
	   Возврат 0;
	КонецЕсли;   
	
	
КонецФункции // ПолучитьПредполагаемыеОплатыПоРеструктуризации()
 
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция НомерБанковскогоСчетаСоответствуетСтандартуIBAN(НомерСчета) Экспорт
	
	Результат = Ложь;
	
	ДлинаНомера = СтрДлина(НомерСчета);
	КодСтраны = Лев(НомерСчета, 2);
	
	Если КодСтраны = "UA" И ДлинаНомера = 29 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьБанкПоНомеруСчетаIBAN(НомерСчета) Экспорт
	
	БанкПоСчету = Неопределено;
	
	КодБанка = ПолучитьКодБанкаПоНомеруСчетаIBAN(НомерСчета);
	
	Если ЗначениеЗаполнено(КодБанка) Тогда
		
		БанкПоСчету = Справочники.Банки.НайтиПоКоду(КодБанка);
		Если БанкПоСчету.Пустая() или БанкПоСчету.ЭтоГруппа Тогда
			БанкПоСчету = "";			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат БанкПоСчету;
	
КонецФункции

Функция ПолучитьКодБанкаПоНомеруСчетаIBAN(НомерСчета) Экспорт
	
	КодБанка = "";
	
	Если НомерБанковскогоСчетаСоответствуетСтандартуIBAN(НомерСчета) Тогда
		КодБанка = Сред(НомерСчета, 5, 6);
	КонецЕсли;
	
	Возврат КодБанка;
	
КонецФункции

Функция ПолучитьПредставлениеБанковскогоСчета(БанковскийСчет) Экспорт
	
		ДатаПериода = ТекущаяДата();
		
		НачалоПереходногоПериода = ОбщегоНазначенияПовтИсп.ПолучитьДатуНачалаПереходаНаСтандартIBAN();
		КонецПереходногоПериода = ОбщегоНазначенияПовтИсп.ПолучитьДатуОкончанияПереходаНаСтандартIBAN();
		ПервыйНомерСчета = "";
		ВторойНомерСчета = "";
		Если ДатаПериода > КонецПереходногоПериода Тогда
			ПервыйНомерСчета = БанковскийСчет.НомерСчета;
		ИначеЕсли ДатаПериода >= НачалоПереходногоПериода И ДатаПериода <= КонецПереходногоПериода Тогда
			ПервыйНомерСчета = БанковскийСчет.НомерСчета;
			Если ЗначениеЗаполнено(БанковскийСчет.НомерСчетаУстаревший) И БанковскийСчет.НомерСчетаУстаревший <> БанковскийСчет.НомерСчета Тогда
				ВторойНомерСчета = БанковскийСчет.НомерСчетаУстаревший;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(БанковскийСчет.НомерСчетаУстаревший) Тогда
				ПервыйНомерСчета = БанковскийСчет.НомерСчетаУстаревший;
			Иначе
				ПервыйНомерСчета = БанковскийСчет.НомерСчета;
			КонецЕсли;
		КонецЕсли;
		
		ПредставлениеСчета = "";
		Если ЗначениеЗаполнено(ПервыйНомерСчета) Тогда
			
			ПредставлениеСчета = ПервыйНомерСчета 
				+ ?(ЗначениеЗаполнено(ВторойНомерСчета), 
					" (" + НСтр("ru='устар. ';uk='застар. '") + ВторойНомерСчета + ")", "");
 
		КонецЕсли;
			
		Возврат ПредставлениеСчета;

	КонецФункции


Процедура ПечатьПоВнешнемуИсточнику(Ссылка, МассивОбъектов, ИменаМакетов, ПараметрыПечати,
			КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(ИменаМакетов);
	
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	
	ОбъектыПечати = Новый СписокЗначений;
	
	ВнешняяОбработкаОбъект = ДополнительныеОтчетыИОбработки.ПолучитьОбъектВнешнейОбработки(Ссылка);
	
	ВнешняяОбработкаОбъект.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
	// Проверим, все ли макеты были сформированы
	Для Каждого Стр Из КоллекцияПечатныхФорм Цикл
		Если Стр.ТабличныйДокумент = Неопределено Тогда
			ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
										НСтр("ru='В обработчике печати не был сформирован табличный документ для: %1';uk='В оброблювачі печатки не був сформований табличний документ для: %1'"),
										Стр.ИмяМакета);
			ВызватьИсключение(ТекстСообщенияОбОшибке);
		КонецЕсли;
		
		Стр.ТабличныйДокумент.КоличествоЭкземпляров = Стр.Экземпляров;
	КонецЦикла;

КонецПроцедуры

Функция ВнешняяПечатьКвитанцииНаОплатуУпрощенная(Ссылка, ТекущийДокумент, ТабличныйДокумент, МесяцНачислений, БанковскиеСчетаОрганизации) Экспорт
	
	ВнешняяОбработкаОбъект = ДополнительныеОтчетыИОбработки.ПолучитьОбъектВнешнейОбработки(Ссылка);
	
	Возврат ВнешняяОбработкаОбъект.ПечатьКвитанцииНаОплатуУпрощенная(ТекущийДокумент, ТабличныйДокумент, МесяцНачислений, БанковскиеСчетаОрганизации);

КонецФункции

Функция ВнешняяПечатьКвитанцииНаОплату(Ссылка, ТекущийДокумент, ТабличныйДокумент, МесяцНачислений, БанковскиеСчетаОрганизации) Экспорт
	
	ВнешняяОбработкаОбъект = ДополнительныеОтчетыИОбработки.ПолучитьОбъектВнешнейОбработки(Ссылка);
	
	Возврат ВнешняяОбработкаОбъект.ПечатьКвитанцииНаОплату(ТекущийДокумент, ТабличныйДокумент, МесяцНачислений, БанковскиеСчетаОрганизации);

КонецФункции

Функция ПолучитьСсылкуДопПечатнойФормы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеОтчетыИОбработки.Ссылка
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	|ГДЕ
	|	ДополнительныеОтчетыИОбработки.ИмяОбъекта = ""ПечатьКвитанцииНаОплату""
	|	И НЕ ДополнительныеОтчетыИОбработки.ПометкаУдаления";
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка();	
	КонецЕсли;
	
КонецФункции
