
&НаКлиенте
Процедура ЗадатьURL(Команда)
	ok = Ложь;
	TelegramApi.setWebhook(ok);
	Сообщить( "URL "+?(ok,"","не ")+"задан");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СпособВыполненияЗаданий) тогда
		Если ОбщегоНазначения.ИнформационнаяБазаФайловая("") Тогда
			Константы.СпособВыполненияЗаданий.Установить(Перечисления.СпособыВыполненияЗаданий.ФормаОбработки);
		Иначе
			Константы.СпособВыполненияЗаданий.Установить(Перечисления.СпособыВыполненияЗаданий.ФоновыеЗадания);
		КонецЕсли;
		
	КонецЕсли;	
	
	
КонецПроцедуры

&НаСервере
Функция  ПроверкаДанныхДляПодключения(Текст, ПараметрыЗаписи)
	Попытка
		Менеджер = Слк.МенеджерОбъектов();
		Объект = Менеджер.СоздатьОбъект("УчетКоммунальныхУслугЗащищенный");
		Возврат Объект.ПроверкаДанныхДляПодключения(Текст,ПараметрыЗаписи);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Сокрлп(ТекстКонстанты) <> "" Тогда
		ТекстКонстанты =  ПроверкаДанныхДляПодключения(ТекстКонстанты,ПараметрыЗаписи);
		
	КонецЕсли; 
	// +ХВОЯ 2020-01-03 Петров
	Если Сокрлп(НаборКонстант.КлючAPI) <> "" Тогда
		ОчиститьРегистрupdateТелеграммПользователи();
	КонецЕсли;
	// -ХВОЯ Петров
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	#Если ВебКлиент Тогда
	Текст = "ru = ""Система не поддерживает работу в Web-клиенте""; uk = ""Система не підтримує роботу в Web-клієнті""";
	Предупреждение(НСтр(Текст), 10);
#Иначе
	
	ВременныйКаталог = КаталогВременныхФайлов();
	ИмяФайла = ВременныйКаталог + "video_2017-05-13_11-56-20.mov";
	
	// Получение макета с сервера
	Состояние("Выполняется получение программы TeamViewer
			  |Пожалуйста, подождите завершения выполнения операции...");
	
	Файл = Новый Файл(ИмяФайла);
	Если Файл.Существует() Тогда
		ЗапуститьПриложение(ИмяФайла, ВременныйКаталог, Ложь);
	Иначе	
		СсылкаНаФайл = ПолучитьМакетДистрибутиваССервера();

		Результат = ПолучитьФайл(СсылкаНаФайл, ИмяФайла, Ложь);
		
		Если Результат Тогда
			ЗапуститьПриложение(ИмяФайла, ВременныйКаталог, Ложь);
		КонецЕсли;
	КонецЕсли;
	
#КонецЕсли

КонецПроцедуры

&НаСервере
Функция ПолучитьМакетДистрибутиваССервера()

	// Получаем макет с дистрибутивом установки
	Ссылка = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет("TelegramВидео"));
	Возврат Ссылка;

КонецФункции

// +ХВОЯ 2020-01-03 Петров
&НаСервере
Функция ОчиститьРегистрupdateТелеграммПользователи()
	НаборЗаписей  = РегистрыСведений.update.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
КонецФункции
// -ХВОЯ Петров