
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаАктСнятияПоказанийПоГВПоказанияПриборов, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	КОНЕЦПЕРИОДА(АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Период,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.ПриборУчета,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.ЕдиницаИзмерения,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.ВидТарифа,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.Коэффициент,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.ПоказаниеПредыдущее,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.ПоказаниеТекущее,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.РазницаПоказания,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.ЛицевойСчет,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.Организация,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.Здание,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.Исполнитель,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.Автор КАК Ответственный,
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.ПериодНачисления
		 |ИЗ
		 |	Документ.АктСнятияПоказанийПоГВ.ПоказанияПриборов КАК АктСнятияПоказанийПоГВПоказанияПриборов
		 |ГДЕ
		 |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАктСнятияПоказанийПоГВПоказанияПриборов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПоказанияПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура Печать(МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктГВС") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктГВС", "АктГВС", ПечатьДокумента(МассивОбъектов, ОбъектыПечати, "АктГВС"));
	КонецЕсли;	
	
КонецПроцедуры

Функция ПечатьДокумента(ТекущийДокумент, ОбъектыПечати, ИмяМакета)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктГВС";
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.ПриборУчета,
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.ПоказаниеПредыдущее,
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.ПоказаниеТекущее,
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.РазницаПоказания,
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.Организация КАК Организация,
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.Здание КАК Здание,
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.ПериодНачисления,
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.Исполнитель,
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.Дата
	    |ИЗ
	    |	Документ.АктСнятияПоказанийПоГВ.ПоказанияПриборов КАК АктСнятияПоказанийПоГВПоказанияПриборов
	    |ГДЕ
	    |	АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка = &Ссылка
	    |	И АктСнятияПоказанийПоГВПоказанияПриборов.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
	Макет = ПолучитьМакет("АктГВС");
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ОбластьДокумента = Макет.ПолучитьОбласть("ОбластьШапка");
    Выборка.Следующий();
	
	ОбластьДокумента.Параметры.Адрес = Выборка.Здание;
	ОбластьДокумента.Параметры.Дата = Выборка.Дата;
	ОбластьДокумента.Параметры.НомерСчетчика = Выборка.ПриборУчета;
	ОбластьДокумента.Параметры.ВодомерПосл = Выборка.ПоказаниеПредыдущее;
	ОбластьДокумента.Параметры.Водомер = Выборка.ПоказаниеТекущее;
	ОбластьДокумента.Параметры.ВодомерРазница = Выборка.РазницаПоказания;
	ОбластьДокумента.Параметры.ПредставительОрганизации = Выборка.Исполнитель;
	ОбластьДокумента.Параметры.Организация = Выборка.Организация;
	ТабличныйДокумент.Вывести(ОбластьДокумента);
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
КонецФункции