
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    // Ініціалізація додаткових властивостей щодо документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Ініціалізація даних документа.
	Документы.АктСнятияПоказанийТеплосчетчика.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Підготовка наборів записів.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Відображення у розділах обліку.
	ПроведениеСервер.ОтразитьАктСнятияПоказанийГорячейВоды(ДополнительныеСвойства, Движения, Отказ);
	
	// Запис Наборів записів.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
КонецПроцедуры

