// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРасчетыПоЛицевымСчетам(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Перерасчет.Организация КАК Организация,
		|	Перерасчет.ЛицевойСчет,
		|	Перерасчет.Услуга,
		|	Перерасчет.МесяцНачисления,
		|	Перерасчет.Сумма КАК Сумма,
		|	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток,
		|	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) + ЕСТЬNULL(Перерасчет.Сумма, 0) КАК СуммаАванс,
		|	Перерасчет.Период
		|ПОМЕСТИТЬ ВременнаяТаблицаАвансы
		|ИЗ
		|	ВременнаяТаблицаПерерасчет КАК Перерасчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(&Период, ) КАК РасчетыПоЛицевымСчетамОстатки
		|		ПО Перерасчет.Организация = РасчетыПоЛицевымСчетамОстатки.Организация
		|			И Перерасчет.ЛицевойСчет = РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет
		|			И Перерасчет.Услуга = РасчетыПоЛицевымСчетамОстатки.Услуга
		|			И Перерасчет.МесяцНачисления = РасчетыПоЛицевымСчетамОстатки.МесяцНачисления
		|ГДЕ
		|	Перерасчет.Сумма < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаАвансы.Организация КАК Организация,
		|	ВременнаяТаблицаАвансы.ЛицевойСчет КАК ЛицевойСчет,
		|	ВременнаяТаблицаАвансы.Услуга КАК Услуга,
		|	ВременнаяТаблицаАвансы.МесяцНачисления КАК МесяцНачисления,
		|	ВременнаяТаблицаАвансы.СуммаАванс КАК Сумма,
		|	ВременнаяТаблицаАвансы.Период КАК Период,
		|	NULL КАК ВидНачисления
		|ИЗ
		|	ВременнаяТаблицаАвансы КАК ВременнаяТаблицаАвансы
		|ГДЕ
		|	ВременнаяТаблицаАвансы.СуммаАванс < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ВременнаяТаблицаАвансы.Организация,
		|	ВременнаяТаблицаАвансы.ЛицевойСчет,
		|	ВременнаяТаблицаАвансы.Услуга,
		|	NULL,
		|	-ВременнаяТаблицаАвансы.СуммаАванс,
		|	ВременнаяТаблицаАвансы.Период,
		|	NULL
		|ИЗ
		|	ВременнаяТаблицаАвансы КАК ВременнаяТаблицаАвансы
		|ГДЕ
		|	ВременнаяТаблицаАвансы.СуммаАванс < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ВременнаяТаблицаПерерасчет.Организация,
		|	ВременнаяТаблицаПерерасчет.ЛицевойСчет,
		|	ВременнаяТаблицаПерерасчет.Услуга,
		|	ВременнаяТаблицаПерерасчет.МесяцНачисления,
		|	ВременнаяТаблицаПерерасчет.Сумма,
		|	ВременнаяТаблицаПерерасчет.Период,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаПерерасчет.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Корректировка)
		|		ИНАЧЕ ВременнаяТаблицаПерерасчет.ВидНачисления
		|	КОНЕЦ
		|ИЗ
		|	ВременнаяТаблицаПерерасчет КАК ВременнаяТаблицаПерерасчет";
		
	Запрос.УстановитьПараметр("Период", ДокументСсылкаКорректировкаНачислений.МоментВремени());
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЛицевымСчетам", РезультатЗапроса[1].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетыПоЛицевымСчетам()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРасшифровкаЛьгот(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаПерерасчет.Организация КАК Организация,
	|	ВременнаяТаблицаПерерасчет.ВидНачисления,
	|	ВременнаяТаблицаПерерасчет.Сумма КАК Сумма,
	|	ВременнаяТаблицаПерерасчет.Услуга КАК Услуга,
	|	ВременнаяТаблицаПерерасчет.ПериодКорректировки КАК Период,
	|	ВременнаяТаблицаПерерасчет.Льгота,
	|	ВременнаяТаблицаПерерасчет.Льготчик КАК ПотребительУслуг,
	|	ВременнаяТаблицаПерерасчет.ЛицевойСчет,
	|	ВременнаяТаблицаПерерасчет.МесяцНачисления,
	|	НАЧАЛОПЕРИОДА(ВременнаяТаблицаПерерасчет.ПериодКорректировки, МЕСЯЦ) КАК ДатаНачалаПериода,
	|	КОНЕЦПЕРИОДА(ВременнаяТаблицаПерерасчет.ПериодКорректировки, МЕСЯЦ) КАК ДатаОкончанияПериода,
	|	ВременнаяТаблицаПерерасчет.Корректировка
	|ИЗ
	|	ВременнаяТаблицаПерерасчет КАК ВременнаяТаблицаПерерасчет
	|ГДЕ
	|	ВременнаяТаблицаПерерасчет.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасшифровкаНачисленияЛьгот", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасшифровкаЛьгот()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыПоЛьготам(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаПерерасчет.Организация КАК Организация,
	|	ВременнаяТаблицаПерерасчет.ВидНачисления,
	|	СУММА(ВременнаяТаблицаПерерасчет.Сумма) КАК Сумма,
	|	ВременнаяТаблицаПерерасчет.ВидУслуги КАК Услуга,
	|	ВременнаяТаблицаПерерасчет.ПериодКорректировки КАК Период,
	|	ВременнаяТаблицаПерерасчет.КонтрагентДляРасчетаПоЛьготам КАК Контрагент,
	|	ВременнаяТаблицаПерерасчет.ДоговорДляРасчетаПоЛьготам КАК ДоговорКонтрагента
	|ИЗ
	|	ВременнаяТаблицаПерерасчет КАК ВременнаяТаблицаПерерасчет
	|ГДЕ
	|	ВременнаяТаблицаПерерасчет.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПерерасчет.Период,
	|	ВременнаяТаблицаПерерасчет.Организация,
	|	ВременнаяТаблицаПерерасчет.ВидНачисления,
	|	ВременнаяТаблицаПерерасчет.ВидУслуги,
	|	ВременнаяТаблицаПерерасчет.ПериодКорректировки,
	|	ВременнаяТаблицаПерерасчет.КонтрагентДляРасчетаПоЛьготам,
	|	ВременнаяТаблицаПерерасчет.ДоговорДляРасчетаПоЛьготам";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыПоЛьготам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыПоЛьготам()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыПоСубсидиям(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаПерерасчет.Организация КАК Организация,
	|	ВременнаяТаблицаПерерасчет.ВидНачисления,
	|	СУММА(ВременнаяТаблицаПерерасчет.Сумма) КАК Сумма,
	|	ВременнаяТаблицаПерерасчет.ВидУслуги КАК Услуга,
	|	ВременнаяТаблицаПерерасчет.ПериодКорректировки КАК Период,
	|	ВременнаяТаблицаПерерасчет.КонтрагентДляРасчетаПоСубсидиям КАК Контрагент,
	|	ВременнаяТаблицаПерерасчет.ДоговорДляРасчетаПоСубсидиям КАК ДоговорКонтрагента
	|ИЗ
	|	ВременнаяТаблицаПерерасчет КАК ВременнаяТаблицаПерерасчет
	|ГДЕ
	|	ВременнаяТаблицаПерерасчет.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПерерасчет.Период,
	|	ВременнаяТаблицаПерерасчет.Организация,
	|	ВременнаяТаблицаПерерасчет.ВидНачисления,
	|	ВременнаяТаблицаПерерасчет.ВидУслуги,
	|	ВременнаяТаблицаПерерасчет.ПериодКорректировки,
	|	ВременнаяТаблицаПерерасчет.КонтрагентДляРасчетаПоСубсидиям,
	|	ВременнаяТаблицаПерерасчет.ДоговорДляРасчетаПоСубсидиям";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыПоСубсидиям", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыПоСубсидиям()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыПоСубсидиям(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВременнаяТаблицаПерерасчет.Организация КАК Организация,
	|	ВременнаяТаблицаПерерасчет.ВидНачисления,
	|	СУММА(ВременнаяТаблицаПерерасчет.Сумма) КАК Сумма,
	|	ВременнаяТаблицаПерерасчет.ПериодКорректировки КАК МесяцНачисления,
	|	ВременнаяТаблицаПерерасчет.ЛицевойСчет,
	|	ВременнаяТаблицаПерерасчет.Услуга,
	|	ВременнаяТаблицаПерерасчет.Период
	|ИЗ
	|	ВременнаяТаблицаПерерасчет КАК ВременнаяТаблицаПерерасчет
	|ГДЕ
	|	ВременнаяТаблицаПерерасчет.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПерерасчет.Организация,
	|	ВременнаяТаблицаПерерасчет.ВидНачисления,
	|	ВременнаяТаблицаПерерасчет.ПериодКорректировки,
	|	ВременнаяТаблицаПерерасчет.Период,
	|	ВременнаяТаблицаПерерасчет.ЛицевойСчет,
	|	ВременнаяТаблицаПерерасчет.Услуга";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГарантированныеСубсидии", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыПоСубсидиям()


Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КорректировкаНачисленийЛицевыеСчета.Услуга,
		|	КорректировкаНачисленийЛицевыеСчета.ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА КорректировкаНачисленийЛицевыеСчета.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
		|			ТОГДА КорректировкаНачисленийЛицевыеСчета.СуммаКорректировки
		|		ИНАЧЕ -КорректировкаНачисленийЛицевыеСчета.СуммаКорректировки
		|	КОНЕЦ КАК Сумма,
		|	НАЧАЛОПЕРИОДА(КорректировкаНачисленийЛицевыеСчета.ПериодКорректировки, МЕСЯЦ) КАК МесяцНачисления,
		|	КорректировкаНачисленийЛицевыеСчета.Ссылка.Дата КАК ПериодКорректировки,
		|	ВЫБОР
		|		КОГДА НЕ КорректировкаНачисленийЛицевыеСчета.Услуга.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
		|			ТОГДА КорректировкаНачисленийЛицевыеСчета.Услуга.Организация
		|		ИНАЧЕ КорректировкаНачисленийЛицевыеСчета.Ссылка.Организация
		|	КОНЕЦ КАК Организация,
		|	КорректировкаНачисленийЛицевыеСчета.Ссылка.Дата КАК Период,
		|	КорректировкаНачисленийЛицевыеСчета.ВидНачисления КАК ВидНачисления,
		|	КорректировкаНачисленийЛицевыеСчета.Услуга.ВидУслуги КАК ВидУслуги,
		|	КорректировкаНачисленийЛицевыеСчета.Услуга.ВидУслуги.КонтрагентДляРасчетаПоЛьготам КАК КонтрагентДляРасчетаПоЛьготам,
		|	КорректировкаНачисленийЛицевыеСчета.Услуга.ВидУслуги.ДоговорДляРасчетаПоЛьготам КАК ДоговорДляРасчетаПоЛьготам,
		|	КорректировкаНачисленийЛицевыеСчета.Услуга.ВидУслуги.КонтрагентДляРасчетаПоСубсидиям КАК КонтрагентДляРасчетаПоСубсидиям,
		|	КорректировкаНачисленийЛицевыеСчета.Услуга.ВидУслуги.ДоговорДляРасчетаПоСубсидиям КАК ДоговорДляРасчетаПоСубсидиям,
		|	КорректировкаНачисленийЛицевыеСчета.Льгота,
		|	КорректировкаНачисленийЛицевыеСчета.Льготчик,
		|	ИСТИНА КАК Корректировка
		|ПОМЕСТИТЬ ВременнаяТаблицаПерерасчет
		|ИЗ
		|	Документ.КорректировкаНачислений.ЛицевыеСчета КАК КорректировкаНачисленийЛицевыеСчета
		|ГДЕ
		|	КорректировкаНачисленийЛицевыеСчета.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаКорректировкаНачислений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицуРасчетыПоЛицевымСчетам(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыПоЛьготам(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства);
	СформироватьТаблицуРасшифровкаЛьгот(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыПоСубсидиям(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоСубсидиям(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства);
	
КонецПроцедуры

