////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.КорректировкаНачислений.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ПроведениеСервер.ОтразитьРасчетыПоЛицевымСчетам(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьРасшифровкаНачисленияЛьгот(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьВзаиморасчетыПоСубсидиям(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьВзаиморасчетыПоЛьготам(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьГарантированныеНачисленияСубсидий(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДатыЗапретаИзменения.ДатаЗапрета
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Раздел = ЗНАЧЕНИЕ(ПланВидовХарактеристик.РазделыДатЗапретаИзменения.Здания)
	|	И ДатыЗапретаИзменения.Объект = &Здание";
	
	Запрос.УстановитьПараметр("Здание", Здание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаЗакрытия = Выборка.ДатаЗапрета;
	Иначе
		ДатаЗакрытия = КонецМесяца(ТекущаяДата());
	КонецЕсли;
	
	СуммаДокумента = ЛицевыеСчета.Итог("СуммаКорректировки");
	
	Для каждого СтрокаЛицевыеСчета из ЛицевыеСчета Цикл
		
		Если КонецМесяца(СтрокаЛицевыеСчета.ПериодКорректировки) > КонецМесяца(ДатаЗакрытия) Тогда
		
			Поле = "ЛицевыеСчета[" + (СтрокаЛицевыеСчета.НомерСтроки - 1) + "].ПериодКорректировки";
			ТекстСообщения = НСтр("ru='Невозможно внестие корректировки в незакрытом месяце';uk='Неможливо внести коригування в незакритому місяці'"); 
			
			ОСМДСервер.СообщитьОбОшибке(ТекстСообщения, ЭтотОбъект, Отказ, Поле);
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого СтрокаЛицевыеСчета из ЛицевыеСчета Цикл
		
		Если СтрокаЛицевыеСчета.ВидНачисления = Перечисления.ВидыНачислений.Льгота Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаЛицевыеСчета.Льгота) Тогда
			
				Поле = "ЛицевыеСчета[" + (СтрокаЛицевыеСчета.НомерСтроки - 1) + "].Льгота";
				ТекстСообщения = НСтр("ru='Не заполнен реквизит льгота.';uk='Не заповнен реквізит пільга.'");
				
				ОСМДСервер.СообщитьОбОшибке(ТекстСообщения, ЭтотОбъект, Отказ, Поле);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаЛицевыеСчета.Льготчик) Тогда
			
				Поле = "ЛицевыеСчета[" + (СтрокаЛицевыеСчета.НомерСтроки - 1) + "].Льготчик";
				ТекстСообщения = НСтр("ru='Не заполнен реквизит льготчик.';uk='Не заповнен реквізит пільговик.'");
				
				ОСМДСервер.СообщитьОбОшибке(ТекстСообщения, ЭтотОбъект, Отказ, Поле);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры
