
&НаКлиенте
Процедура Адрес_ЛСПриИзменении(Элемент)
	Если Объект.Адрес_ЛС = Истина Тогда
		Элементы.Адрес.Видимость = Ложь;
		Элементы.ЛицевойСчет.Видимость = Истина;
	Иначе
		Элементы.Адрес.Видимость = Истина;
		Элементы.ЛицевойСчет.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.Файл;
	Фильтр = "Электронная таблица Excel(*.csv)|*.csv";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.Файл = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьФайл(Текст)
	Кодировка = КодировкаТекста.ANSI;
	ТекФайлЗапись = Новый ЗаписьТекста(Объект.Файл, Кодировка);
	ТекФайлЗапись.Записать(Текст);
	ТекФайлЗапись.Закрыть();
КонецПроцедуры

&НаСервере
Функция СформироватьВыгрузкуНаСервере(Текст)
	Запрос = Новый Запрос;
	Если Объект.Адрес_ЛС = Истина Тогда
		ТекстЗапроса = "ЛицевыеСчета.ЛицевойСчет = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	Иначе
		ТекстЗапроса = "ЛицевыеСчета.ЛицевойСчет.Владелец = &Здание";
		Запрос.УстановитьПараметр("Здание", Объект.Адрес);
	КонецЕсли;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	    |	ЛицевыеСчета.ЛицевойСчет.Владелец.Наименование КАК Здание,
	    |	ЛицевыеСчета.ЛицевойСчет.ОбъектЛицевогоСчета.Наименование КАК Квартира
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета КАК ЛицевыеСчета
	    |ГДЕ
	    |	" + ТекстЗапроса + "";
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("УИД");
	Разделитель = "|";
	Текст = "";
	Для Каждого стр Из Результат Цикл
		стр.УИД = стр.ЛицевойСчет.УникальныйИдентификатор();
		Если Текст = "" Тогда
			СтрокаКол = "";
			КолонкиТЗ = Результат.Колонки;
			СтрокаКол = СтрокаКол + "ID" + Разделитель + "Act" + Разделитель + "Reyestr" + Разделитель + "Priority" + Разделитель + "Info1" + 
	                    Разделитель + "Info2" + Разделитель + "Info3";
			Текст = СтрокаКол + Символы.ПС;
		КонецЕсли;
		Текст = Текст + Строка(стр.УИД) + Разделитель + Разделитель + Разделитель + Разделитель + стр.ЛицевойСчет.Наименование + Разделитель + стр.Здание + Разделитель +
		         стр.Квартира + Символы.ПС;
	КонецЦикла;
	Возврат Текст;		 
		
КонецФункции

&НаКлиенте
Процедура СформироватьВыгрузку()
	Текст = "";
	СформироватьВыгрузкуНаСервере(Текст);
	ЗаписатьФайл(Текст);
КонецПроцедуры

