
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Обработка события "ПриСозданииНаСервере" формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаОбмена = ТекущаяДата();
	
	ТекОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.ИнтеграцияССайтом"));
	
	ТекОбъект.ИнициализацияРеквизитов();
	
	ЗначениеВДанныеФормы(ТекОбъект, Объект);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Обработка события "ПриОткрытии" формы.
//
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборСпискаВариантовОбмена();
	
	УстановитьОтборВЖурналеОбмена();
	
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ОтображениеДатаОбмена = Формат(ДатаОбмена, НСтр(ФорматнаяСтрока));
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
// Обработка события "ПередЗакрытием" формы.
//
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СохранитьРеквизиты();
	
КонецПроцедуры // ПередЗакрытием()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ввода настройки доступа.
//
Процедура НастройкаДоступаПриИзменении(Элемент)
	
	УстановитьОтборСпискаВариантовОбмена();
	
	УстановитьОтборВЖурналеОбмена();
	
КонецПроцедуры // НастройкаДоступаПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
// Процедура - обработчик команды "КомандаВыполнитьОбменСейчас".
//
Процедура КомандаВыполнитьОбменСейчас(Команда)
	
	ТекущийВариантОбмена = Элементы.ВариантыОбмена.ТекущаяСтрока;
	
	Если ТекущийВариантОбмена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПараметрыПодключения();
	
	Если ПараметрыПодключения.ХранитьПароль Тогда
		Пароль = ПараметрыПодключения.Пароль;
	Иначе
		Пароль = ОткрытьФормуМодально("ОбщаяФорма.ВебИнтеграцияВводПароля");
	КонецЕсли;
	
	КлючВозврата = ВебИнтеграцияОбщегоНазначения.ВыполнитьОбменДаннымиССайтом(ТекущийВариантОбмена, Пароль, ДатаОбмена);
	Если КлючВозврата <> Неопределено Тогда
		ФайлВыгрузки = ПолучитьИзВременногоХранилища(КлючВозврата);
		КопироватьФайл(ФайлВыгрузки, ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.НастройкаДоступа,"ФайловыйРесурс")+"\ВыгрузкуДанныхПоЛС.xml");
	КонецЕсли;	
	
КонецПроцедуры // КомандаВыполнитьОбменСейчас()

&НаКлиенте
// Процедура - обработчик команды "КомандаОбновитьЖурналОбмена".
//
Процедура КомандаОбновитьЖурналОбмена(Команда)
	
	ОбновитьЖурналОбмена();
	
КонецПроцедуры // КомандаОбновитьЖурналОбмена()

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
// Сохраняет настройки пользователя в хранилище настроек.
//
Процедура СохранитьРеквизиты()
	
	СтруктураНастроек = Новый Структура;
	
	СтруктураНастроек.Вставить("НастройкаДоступа", Объект.НастройкаДоступа);
	
	ХранилищеОбщихНастроек.Сохранить("Обработка.ИнтеграцияССайтом", , СтруктураНастроек);
	
КонецПроцедуры // СохранитьРеквизиты()

&НаСервере
// Формирует структуру с параметрами подключения к сайту.
//
Процедура ЗаполнитьПараметрыПодключения()
	
	ПараметрыПодключения = Новый Структура;
	
	ПараметрыПодключения.Вставить("Пароль",        Объект.НастройкаДоступа.Пароль);
	ПараметрыПодключения.Вставить("ХранитьПароль", Объект.НастройкаДоступа.ХранитьПароль);
	
КонецПроцедуры // ЗаполнитьПараметрыПодключения()

&НаКлиенте
// Обновляет данные в журнале обмена.
//
Процедура ОбновитьЖурналОбмена()
	
	Элементы.ЖурналОбмена.Обновить();
	
КонецПроцедуры // ОбновитьЖурналОбмена()

&НаКлиенте
// Устанавливает отбор в таблице с вариантами обмена.
//
Процедура УстановитьОтборСпискаВариантовОбмена()
	
	ВариантыОбмена.Отбор.Элементы.Очистить();
	
	НовыйОтбор = ВариантыОбмена.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	НовыйОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("НастройкаДоступа");
	НовыйОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	НовыйОтбор.ПравоеЗначение = Объект.НастройкаДоступа;
	
КонецПроцедуры // УстановитьОтборСпискаВариантовОбмена()

&НаКлиенте
// Устанавливает отбор в журнале обмена.
//
Процедура УстановитьОтборВЖурналеОбмена()
	
	ЖурналОбмена.Отбор.Элементы.Очистить();
	
	НовыйОтбор = ЖурналОбмена.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	НовыйОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("НастройкаДоступа");
	НовыйОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	НовыйОтбор.ПравоеЗначение = Объект.НастройкаДоступа;
	
КонецПроцедуры // УстановитьОтборВЖурналеОбмена()

&НаКлиенте
Процедура ОтображениеДатаОбменаПриИзменении(Элемент)
	
	ДатаОбмена	= КонецМесяца(ДатаОбмена);
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ОтображениеДатаОбмена = Формат(ДатаОбмена, НСтр(ФорматнаяСтрока));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеДатаОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ДатаОбмена= Дата('00010101'), ТекущаяДата(), ДатаОбмена));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ДатаОбмена = КонецДня(ДатаКалендаряНачало);
	
	ОтображениеДатаОбменаПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеДатаОбменаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ДатаОбмена = ?(ЗначениеЗаполнено(ДатаОбмена), 
						ДобавитьМесяц(ДатаОбмена, Направление),
						ДобавитьМесяц(КонецМесяца(ТекущаяДата()), Направление));
						
	ОтображениеДатаОбменаПриИзменении(Элемент);
	
КонецПроцедуры
