
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаОтчетБанкаПоОперациямЭквайринга, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Платежи.НомерСтроки КАК НомерСтроки,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредствПоЭквайрингу.ПоступлениеПоПлатежнойКарте) КАК ТипДенежныхСредств,
		|	Платежи.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
		|	Платежи.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
		|	Платежи.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
		|	Платежи.ДатаПлатежа КАК ДатаПлатежа,
		|	Платежи.Сумма КАК Сумма,
		|	Платежи.Ссылка.Организация,
		|	Платежи.Ссылка.Валюта,
		|	Платежи.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.ОтчетБанкаПоОперациямЭквайринга.Покупки КАК Платежи
		|ГДЕ
		|	Платежи.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Платежи.НомерСтроки,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредствПоЭквайрингу.СписаниеПоПлатежнойКарте),
		|	Платежи.ЭквайринговыйТерминал,
		|	Платежи.ВидПлатежнойКарты,
		|	Платежи.НомерПлатежнойКарты,
		|	Платежи.ДатаПлатежа,
		|	Платежи.Сумма,
		|	Платежи.Ссылка.Организация,
		|	Платежи.Ссылка.Валюта,
		|	Платежи.Ссылка.Дата
		|ИЗ
		|	Документ.ОтчетБанкаПоОперациямЭквайринга.Возвраты КАК Платежи
		|ГДЕ
		|	Платежи.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаОтчетБанкаПоОперациямЭквайринга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЭквайрингу", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры


