////////////////////////////////////////////////////////////////////////////////
// Подсистема "Дополнительные отчеты и обработки"
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Определяет разделы, в которых доступна команда вызова дополнительных обработок
//
// Параметры:
//   Разделы (Массив) из (ОбъектМетаданных)
//
// Описание:
//   В Разделы необходимо добавить метаданные тех разделов, 
//   в которых размещены команды вызова.
//
//   Для рабочего стола вместо Метаданных необходимо добавлять 
//   ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола()
//
Процедура ОпределитьРазделыСДополнительнымиОбработками(Разделы) Экспорт
	
	Разделы.Добавить(ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола());
	Разделы.Добавить(Метаданные.Подсистемы.АварийноДиспечерскаяСлужба);
	Разделы.Добавить(Метаданные.Подсистемы.Голосование);
	Разделы.Добавить(Метаданные.Подсистемы.Запасы);
	Разделы.Добавить(Метаданные.Подсистемы.ЛицевыеСчета);
	Разделы.Добавить(Метаданные.Подсистемы.Начисления);
	Разделы.Добавить(Метаданные.Подсистемы.ПаспортныйСтол);
	
КонецПроцедуры

// Определяет разделы, в которых доступна команда вызова дополнительных отчетов
//
// Параметры:
//   Разделы (Массив) из (ОбъектМетаданных)
//
// Описание:
//   В Разделы необходимо добавить метаданные тех разделов, 
//   в которых размещены команды вызова.
//
//   Для рабочего стола вместо Метаданных необходимо добавлять 
//   ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола()
//
Процедура ОпределитьРазделыСДополнительнымиОтчетами(Разделы) Экспорт
	
	Разделы.Добавить(ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола());
	Разделы.Добавить(Метаданные.Подсистемы.АварийноДиспечерскаяСлужба);
	Разделы.Добавить(Метаданные.Подсистемы.Голосование);
	Разделы.Добавить(Метаданные.Подсистемы.Запасы);
	Разделы.Добавить(Метаданные.Подсистемы.ЛицевыеСчета);
	Разделы.Добавить(Метаданные.Подсистемы.Начисления);
	Разделы.Добавить(Метаданные.Подсистемы.ПаспортныйСтол);
	
КонецПроцедуры

