Функция МассивВСтрокуCSV(Массив, Разделитель = ",")
	Результат = ""; Кавычка = """";
	Для каждого Элемент из Массив Цикл
		Если Элемент = Null Или Элемент = Неопределено Тогда
 			Строка = "";
		ИначеЕсли ТипЗнч(Элемент) = Тип("Число") Тогда 
			Строка = Формат(Элемент, "ЧРД=.; ЧГ=0; ЧН=");
		ИначеЕсли ТипЗнч(Элемент) = Тип("Дата") Тогда 
			Строка = Формат(Элемент, "ДФ=yyyy-MM-dd");
		Иначе
			Строка = Элемент;
			Если ПустаяСтрока(Строка) Или Найти(Строка, Разделитель) > 0 Или Найти(Строка, Кавычка) > 0 Или Найти(Строка, Символы.ПС) > 0 Тогда
				Строка = Кавычка + СтрЗаменить(Элемент, Кавычка, Кавычка + Кавычка) + Кавычка;
			КонецЕсли; 
		КонецЕсли;
		Результат = Результат + Строка + Разделитель;
	КонецЦикла;
    Возврат Результат; 
КонецФункции

Функция ПолеCSVОбработка(Строка)
	Кавычка = """";
	Если Лев(Строка, 1) = Кавычка И Прав(Строка, 1) = Кавычка Тогда
		Строка = СтрЗаменить(Сред(Строка, 2, СтрДлина(Строка) - 2), Кавычка + Кавычка, Кавычка);
	КонецЕсли; 
	Возврат Строка;
КонецФункции

Функция СтрокаCSVВМассив(Строка, Разделитель = ",")
	РазделительДлина = СтрДлина(Разделитель);
    Результат = Новый Массив();
    Позиция = Найти(Строка, Разделитель);
    Пока Позиция > 0 Цикл
        Результат.Добавить(ПолеCSVОбработка(СокрЛП(Лев(Строка, Позиция - 1))));
        Строка = Сред(Строка, Позиция + РазделительДлина);
        Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
    Результат.Добавить(ПолеCSVОбработка(СокрЛП(Строка)));
    Возврат Результат; 
КонецФункции

Функция ТаблицаЗначенийВПотокCSV(Данные, Поток)
	Заголовки = Новый Массив();
	Для каждого Колонка из Данные.Колонки Цикл
		Заголовки.Добавить(Колонка.Имя);
	КонецЦикла;
	Если ЗначениеЗаполнено(Заголовки) Тогда
		Поток.ЗаписатьСтроку(МассивВСтрокуCSV(Заголовки));
	КонецЕсли; 
	Для каждого Запись из Данные Цикл
		Поток.ЗаписатьСтроку(МассивВСтрокуCSV(Запись));
	КонецЦикла;
КонецФункции

Функция ПотокCSVВТаблицуЗначений(Поток)
	Заголовки = Поток.ПрочитатьСтроку();
	Если ЗначениеЗаполнено(Заголовки) Тогда
		Заголовки = СтрокаCSVВМассив(Заголовки);
		Результат = Новый ТаблицаЗначений();
		Для каждого Колонка Из Заголовки Цикл
		    Результат.Колонки.Добавить(Колонка);
		КонецЦикла;
		Строка = Поток.ПрочитатьСтроку();
		Пока ЗначениеЗаполнено(Строка) Цикл
			Массив = СтрокаCSVВМассив(Строка);
			Запись = Результат.Добавить();
			Для Сч = 0 По Заголовки.Количество() - 1 Цикл
			    Запись[Сч] = Массив[Сч];
			КонецЦикла; 
			Строка = Поток.ПрочитатьСтроку();
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция getData(Запрос)	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/plain; charset=utf-8");    	
	
	КодЛС = Запрос.ПараметрыЗапроса.Получить("CODE");
	
	Класс = НРег(Запрос.ПараметрыURL.Получить("class"));
	Если Класс = "hbt" Тогда
		Сущность = НРег(Запрос.ПараметрыURL.Получить("entity"));
		Если 	  Сущность = "state" Тогда
			ВыходныеДанные = GkhInUaHbt.getState();
		ИначеЕсли Сущность = "accounts" Тогда
			ВыходныеДанные = GkhInUaHbt.getAccounts(КодЛС);
		ИначеЕсли Сущность = "contacts" Тогда
			ВыходныеДанные = GkhInUaHbt.getContacts(КодЛС);
		ИначеЕсли Сущность = "services" Тогда
			ВыходныеДанные = GkhInUaHbt.getServices(КодЛС);
		ИначеЕсли Сущность = "features" Тогда
			ВыходныеДанные = GkhInUaHbt.getFeatures(КодЛС);
		ИначеЕсли Сущность = "norms" Тогда
			ВыходныеДанные = GkhInUaHbt.getNorms(КодЛС);
		ИначеЕсли Сущность = "rates" Тогда
			ВыходныеДанные = GkhInUaHbt.getRates(КодЛС);
		ИначеЕсли Сущность = "balances" Тогда
			ВыходныеДанные = GkhInUaHbt.getBalances(КодЛС);
		ИначеЕсли Сущность = "consumpts" Тогда
			ВыходныеДанные = GkhInUaHbt.getConsumpts(КодЛС);
		ИначеЕсли Сущность = "payments" Тогда
			ВыходныеДанные = GkhInUaHbt.getPayments(КодЛС);
		ИначеЕсли Сущность = "finances" Тогда
			ВыходныеДанные = GkhInUaHbt.getFinances(КодЛС);
		ИначеЕсли Сущность = "meters" Тогда
			ВыходныеДанные = GkhInUaHbt.getMeters(КодЛС);
		ИначеЕсли Сущность = "seals" Тогда
			ВыходныеДанные = GkhInUaHbt.getSeals(КодЛС);
		ИначеЕсли Сущность = "indications" Тогда
			ВыходныеДанные = GkhInUaHbt.getIndications(КодЛС);
		ИначеЕсли Сущность = "isrels" Тогда
			ВыходныеДанные = GkhInUaHbt.getISRels(КодЛС);
		Иначе
			Ответ.КодСостояния = 400;
		КонецЕсли; 
	Иначе
		Ответ.КодСостояния = 400;
	КонецЕсли; 	
	
	Если Ответ.КодСостояния = 200 Тогда
		Поток = Новый ЗаписьДанных(Ответ.ПолучитьТелоКакПоток());	
		ТаблицаЗначенийВПотокCSV(ВыходныеДанные, Поток);
		Поток.СброситьБуферы();
	КонецЕсли; 	
	
	Возврат Ответ;
КонецФункции

Функция postData(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/csv; charset=utf-8");    
	
	Поток = Новый ЧтениеДанных(Запрос.ПолучитьТелоКакПоток());
	ВходныеДанные = ПотокCSVВТаблицуЗначений(Поток);
	Если НЕ ЗначениеЗаполнено(ВходныеДанные) Тогда
		Ответ.КодСостояния = 400;
	КонецЕсли;
	
	Если Ответ.КодСостояния = 200 Тогда
		Класс = НРег(Запрос.ПараметрыURL.Получить("class"));
		Если Класс = "hbt" Тогда
			Сущность = НРег(Запрос.ПараметрыURL.Получить("entity"));
			Если 	  Сущность = "cces" Тогда
				ВыходныеДанные = GkhInUaHbt.putCCEs(ВходныеДанные);
			ИначеЕсли Сущность = "ipes" Тогда
				ВыходныеДанные = GkhInUaHbt.putIPEs(ВходныеДанные);
			ИначеЕсли Сущность = "ndes" Тогда
				ВыходныеДанные = GkhInUaHbt.putNDEs(ВходныеДанные);
			ИначеЕсли Сущность = "mdfs" Тогда
				ВыходныеДанные = GkhInUaHbt.putMDFs(ВходныеДанные);
			Иначе
				Ответ.КодСостояния = 400;
			КонецЕсли; 
		Иначе
			Ответ.КодСостояния = 400;
		КонецЕсли;
	КонецЕсли;

	Если Ответ.КодСостояния = 200 Тогда
		Поток = Новый ЗаписьДанных(Ответ.ПолучитьТелоКакПоток());	
		ТаблицаЗначенийВПотокCSV(ВыходныеДанные, Поток);
		Поток.СброситьБуферы();
	КонецЕсли; 
		
	Возврат Ответ;
КонецФункции
