
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура заполняет табличную часть "Запасы" по остаткам
// 
&НаСервере
Процедура ЗаполнитьПоОстаткамНаСкладе()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ЗапасыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоУчет,
	|	СУММА(ЗапасыНаСкладахОстатки.КоличествоОстаток) КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Склад = &Склад) КАК ЗапасыНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыНаСкладахОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("Период", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	
	Объект.Запасы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ЗаполнитьПоОстаткамНаСкладе()

// Процедура заполняет табличную часть "Запасы" учетными данными.
// 
&НаСервере
Процедура ЗаполнитьТолькоУчетныеДанные()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
		|	ТаблицаЗапасы.Количество КАК Количество
		|ПОМЕСТИТЬ ИнвентаризацияТаблицаЗапасы
		|ИЗ
		|	&ТаблицаЗапасы КАК ТаблицаЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура,
		|	ИнвентаризацияТаблицаЗапасы.Количество - ЕСТЬNULL(ВложенныйЗапрос.КоличествоОстаток, 0) КАК Отклонение,
		|	ИнвентаризацияТаблицаЗапасы.Количество,
		|	ВложенныйЗапрос.КоличествоОстаток КАК КоличествоУчет
		|ИЗ
		|	ИнвентаризацияТаблицаЗапасы КАК ИнвентаризацияТаблицаЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|			ЗапасыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|		ИЗ
		|			РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|					&Период,
		|					Организация = &Организация
		|						И Склад = &Склад) КАК ЗапасыНаСкладахОстатки) КАК ВложенныйЗапрос
		|		ПО ИнвентаризацияТаблицаЗапасы.Номенклатура = ВложенныйЗапрос.Номенклатура";
	
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("Период", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("ТаблицаЗапасы", Объект.Запасы.Выгрузить());
	
	Объект.Запасы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ЗаполнитьТолькоУчетныеДанные()

// Процедура заполняет табличную часть "Запасы" по остаткам группы номенклатуры.
//
&НаСервере
Процедура ЗаполнитьПоГруппеНоменклатуры(ГруппаНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ЗапасыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоУчет,
	|	СУММА(ЗапасыНаСкладахОстатки.КоличествоОстаток) КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Склад = &Склад) КАК ЗапасыНаСкладахОстатки
	|ГДЕ
	|	ЗапасыНаСкладахОстатки.Номенклатура.Родитель В ИЕРАРХИИ(&Родитель)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыНаСкладахОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("Период", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("Родитель", ГруппаНоменклатуры);

	
	Объект.Запасы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ЗаполнитьПоОстаткамНаСкладе()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки

КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ТАБЛИЧНЫХ ЧАСТЕЙ ФОРМЫ

// Процедура - обработчик нажатия на кнопку ЗаполнитьПоОстаткамНаСкладе.
// 
&НаКлиенте
Процедура КомандаЗаполнитьПоОстаткамНаСкладе(Команда)
	
	Если Объект.Запасы.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції?'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;

	ЗаполнитьПоОстаткамНаСкладе();
	
КонецПроцедуры

// Процедура - обработчик нажатия на кнопку ЗаполнитьТолькоУчетныеДанные.
//
&НаКлиенте
Процедура КомандаЗаполнитьТолькоУчетныеДанные(Команда)
	
	Если Объект.Запасы.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Учетные данные будут очищены! Продолжить выполнение операции?';uk='Облікові дані будуть очищені! Продовжити виконання операції?'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТолькоУчетныеДанные();
	
КонецПроцедуры

// Процедура - обработчик нажатия на кнопку ЗаполнитьПоГруппеНоменклатуры.
//
&НаКлиенте
Процедура КомандаЗаполнитьПоГруппеНоменклатуры(Команда)
	
	Если Объект.Запасы.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції?'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
    ГруппаНоменклатуры = ОткрытьФормуМодально("Справочник.Номенклатура.Форма.ФормаВыбораГруппы");
	
	Если ЗначениеЗаполнено(ГруппаНоменклатуры) Тогда
		ЗаполнитьПоГруппеНоменклатуры(ГруппаНоменклатуры);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ

// Процедура - обработчик события ПриИзменении поля ввода Количество
// в строке табличной части Запасы.
//
&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	// Рассчет отклонения.
	СтрокаТабличнойЧасти.Отклонение = СтрокаТабличнойЧасти.Количество - СтрокаТабличнойЧасти.КоличествоУчет;
	
КонецПроцедуры



