&НаКлиенте
Перем ИдентификаторУстройстваНаКлиенте;

// Процедура - обработчик события "ПриЗагрузкеДанныхИзНастроекНаСервере" формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	КассаККМ = Настройки.Получить("КассаККМ");
	ТолькоТекущаяСмена = Настройки.Получить("ТолькоТекущаяСмена");
	
	ОбновитьСостояниеКассовойСменыНаСервере(КассаККМ);
	
	УстановитьОтборДинамическихСписков();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ФОРМЫ

//Удаляет элемент отбора динамического списка
//
//Параметры:
//Список  - обрабатываемый динамический список,
//ИмяПоля - имя поля компоновки, отбор по которому нужно удалить
//
Процедура УдалитьЭлементОтбораСписка(Список, ИмяПоля)
	
	ЭлементыОтбора = Список.Отбор.Элементы;
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			ЭлементыОтбора.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // УдалитьЭлементОтбораСписка()

//Устанавливает элемент отбор динамического списка
//
//Параметры:
//Список			- обрабатываемый динамический список,
//ИмяПоля			- имя поля компоновки, отбор по которому нужно установить,
//ВидСравнения		- вид сравнения отбора, по умолчанию - Равно,
//ПравоеЗначение 	- значение отбора
//
Процедура УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено)
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения     = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	ЭлементОтбора.Использование    = Истина;
	ЭлементОтбора.ПравоеЗначение   = ПравоеЗначение;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры // УстановитьЭлементОтбораСписка()

//Изменяет элемент отбора динамического списка
//
//Параметры:
//Список         - обрабатываемый динамический список,
//ИмяПоля        - имя поля компоновки, отбор по которому нужно установить,
//ВидСравнения   - вид сравнения отбора, по умолчанию - Равно,
//ПравоеЗначение - значение отбора,
//Установить     - признак необходимости установить отбор
//
Процедура ИзменитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение = Неопределено, Установить = Ложь, ВидСравнения = Неопределено)
	
	УдалитьЭлементОтбораСписка(Список, ИмяПоля);
	
	Если Установить Тогда
		УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения);
	КонецЕсли;
	
КонецПроцедуры // ИзменитьЭлементОтбораСписка()

// Функция возвращает массив динамических списков, для которых требуется установка отбора.
//
&НаСервере
Функция ПолучитьМассивДинамическихСписковНаСервере()

	МассивСписков = Новый Массив;
	МассивСписков.Добавить(ЧекиККМ);
	
	Возврат МассивСписков;

КонецФункции // ПолучитьМассивДинамическихСписковНаСервере()

// Процедура устанавливает отбор динамических списков формы.
//
&НаСервере
Процедура УстановитьОтборДинамическихСписков()
	
	Для каждого ДинамическийСписок Из ПолучитьМассивДинамическихСписковНаСервере() Цикл
		ИзменитьЭлементОтбораСписка(ДинамическийСписок, "КассаККМ", КассаККМ, ЗначениеЗаполнено(КассаККМ), ВидСравненияКомпоновкиДанных.Равно);
		ИзменитьЭлементОтбораСписка(ДинамическийСписок, "КассоваяСмена", ТекущаяКассоваяСмена, ТолькоТекущаяСмена, ВидСравненияКомпоновкиДанных.Равно);
	КонецЦикла;
	
КонецПроцедуры // УстановитьОтборДинамическихСписков()

// Функция выполняет получение идентификатора устойства на сервере.
//
&НаСервереБезКонтекста
Функция ПолучитьИдентификаторУстройстваПоКассеНаСервере(КассаККМ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КассыККМ.ПодключаемоеОборудование КАК ИдентификаторУстройства
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	КассыККМ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", КассаККМ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.ИдентификаторУстройства;
		
	Иначе
		
		Возврат Справочники.ПодключаемоеОборудование.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции // ПолучитьИдентификаторУстройстваПоКассеНаСервере()

// Функция выполняет получение идентификатора устойства на клиенте.
//
&НаКлиенте
Функция ПолучитьИдентификаторУстройстваПоКассеНаКлиенте(КассаККМ)
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторУстройстваНаКлиенте) Тогда
		ИдентификаторУстройстваНаКлиенте = ПолучитьИдентификаторУстройстваПоКассеНаСервере(КассаККМ);
	КонецЕсли;
	
	Возврат ИдентификаторУстройстваНаКлиенте;
	
КонецФункции // ПолучитьИдентификаторУстройстваПоКассеНаКлиенте()

// Процедура - обработчик события "ПриИзменении" поля "КассаККМ".
//
&НаСервере
Процедура КассаККМОтборПриИзмененииНаСервере(ИдентификаторУстройства)
	
	ОбновитьСостояниеКассовойСменыНаСервере(КассаККМ);
	
	УстановитьОтборДинамическихСписков();
	
КонецПроцедуры // КассаОтборПриИзмененииНаСервере()

// Процедура - обработчик события "ПриИзменении" поля "КассаККМ" на сервере.
//
&НаКлиенте
Процедура КассаККМОтборПриИзменении(Элемент)
	
	ИдентификаторУстройстваНаКлиенте = Неопределено;
	ИдентификаторУстройства = ПолучитьИдентификаторУстройстваПоКассеНаКлиенте(КассаККМ);
	КассаККМОтборПриИзмененииНаСервере(ИдентификаторУстройства);
	
КонецПроцедуры // КассаОтборПриИзменении()

// Функция выполняет открытие кассовой смены на сервере.
//
&НаСервере
Функция ОткрытьКассовуюСменуНаСервере(КассаККМ, ОписаниеОшибки = "")
	
	Возврат Документы.КассоваяСмена.ОткрытьКассовуюСмену(КассаККМ, ОписаниеОшибки);
	
КонецФункции // ОткрытьКассовуюСменуНаСервере()

// Процедура выполняет закрытие кассовой смены на сервере.
//
&НаСервере
Функция ЗакрытьКассовуюСменуНаСервере(КассаККМ, Касса, ОписаниеОшибки = "")
	
	Возврат Документы.КассоваяСмена.ЗакрытьКассовуюСменуВыполнитьАрхивацию(КассаККМ, Касса, ОписаниеОшибки);
	
КонецФункции // ЗакрытьКассовуюСменуНаСервере()

// Процедуру необходимо вызывать с клиента при открытии кассовой смены
&НаСервере
Процедура ОбновитьСостояниеКассовойСменыИУстановитьОтборДинамическихСписков(КассаККМ)
	
	ОбновитьСостояниеКассовойСменыНаСервере(КассаККМ);
	
	УстановитьОтборДинамическихСписков();
	
КонецПроцедуры // ОбновитьСостояниеКассовойСменыНаСервере()

// Процедура - обработчик команды "ОткрытьКассовуюСмену".
//
&НаКлиенте
Процедура ОткрытьКассовуюСмену(Команда)

	Если НЕ ЗначениеЗаполнено(КассаККМ) Тогда
		Возврат;
	КонецЕсли;

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		// Подключение устройства
		ИдентификаторУстройства = ПолучитьИдентификаторУстройстваПоКассеНаКлиенте(КассаККМ);
		Если НЕ ЗначениеЗаполнено(ИдентификаторУстройства) Тогда
			ИдентификаторУстройства = МенеджерОборудованияКлиент.ВыбратьУстройство("ФискальныйРегистратор",
			    НСтр("ru='Выберите фискальный регистратор';uk='Виберіть фіскальний реєстратор'"), НСтр("ru='Фискальный регистратор не подключен';uk='Фіскальний реєстратор не підключений'"));
		КонецЕсли;
		
		Если ИдентификаторУстройства <> Неопределено Тогда
			ОписаниеОшибки = "";

			Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
			                                                                              ИдентификаторУстройства,
			                                                                              ОписаниеОшибки);
			
			Если Результат Тогда
				
				Результат = ОткрытьКассовуюСменуНаСервере(КассаККМ, ОписаниеОшибки);

				Если Результат Тогда
				
					ВходныеПараметры  = Неопределено;
					ВыходныеПараметры = Неопределено;

					//Открыть смену на фискальном регистраторе
					Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройства,
																					"OpenDay",
																					ВходныеПараметры,
																					ВыходныеПараметры);
					
					Если Результат Тогда
						
					Иначе
						ТекстСообщения = НСтр("ru='При открытии смены произошла ошибка."
"Смена не открыта на фискальном регистраторе."
"Дополнительное описание:"
"%ДополнительноеОписание%';uk='При відкритті зміни сталася помилка."
"Зміна не відчинені на фіскальному реєстраторі."
"Додатковий опис:"
"%ДополнительноеОписание%'");
						ТекстСообщения = СтрЗаменить(ТекстСообщения,
													 "%ДополнительноеОписание%",
													 ВыходныеПараметры[1]);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					КонецЕсли;
					
					МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
					                                                                 ИдентификаторУстройства);
				Иначе
					
					ТекстСообщения = НСтр("ru='При открытии смены произошла ошибка."
"Смена не открыта."
"Дополнительное описание:"
"%ДополнительноеОписание%';uk='При відкритті зміни сталася помилка."
"Зміна не відкрита."
"Додатковий опис:"
"%ДополнительноеОписание%'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения,
												 "%ДополнительноеОписание%",
												 ОписаниеОшибки);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					
				КонецЕсли;
				
			Иначе
				ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка."
"Смена не открыта на фискальном регистраторе."
"Дополнительное описание:"
"%ДополнительноеОписание%';uk='При підключенні пристрою сталася помилка."
"Зміна не відчинені на фіскальному реєстраторі."
"Додатковий опис:"
"%ДополнительноеОписание%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьСостояниеКассовойСменыИУстановитьОтборДинамическихСписков(КассаККМ);
	
КонецПроцедуры // ОткрытьКассовуюСмену()

// Процедура - обработчик команды "ЗакрытьКассовуюСмену".
//
&НаКлиенте
Процедура ЗакрытьКассовуюСмену(Команда)

	ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(КассаККМ) Тогда
		Возврат;
	КонецЕсли;
	
    ЗаголовокВыбора = НСтр("ru='Выберите кассу приема денег';uk='Виберіть касу прийому грошей'");
	Если Не ВвестиЗначение(Касса, ЗаголовокВыбора) Тогда
		Возврат;	
	КонецЕсли;
	
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		// Подключение устройства
		ИдентификаторУстройства = ПолучитьИдентификаторУстройстваПоКассеНаКлиенте(КассаККМ);
		Если НЕ ЗначениеЗаполнено(ИдентификаторУстройства) Тогда
			ИдентификаторУстройства = МенеджерОборудованияКлиент.ВыбратьУстройство("ФискальныйРегистратор",
			    НСтр("ru='Выберите фискальный регистратор';uk='Виберіть фіскальний реєстратор'"), НСтр("ru='Фискальный регистратор не подключен';uk='Фіскальний реєстратор не підключений'"));
		КонецЕсли;
		
		Если ИдентификаторУстройства <> Неопределено Тогда
			ОписаниеОшибки = "";

			Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
			                                                                              ИдентификаторУстройства,
			                                                                              ОписаниеОшибки);
			
			Если Результат Тогда
				ВходныеПараметры  = Неопределено;
				ВыходныеПараметры = Неопределено;
				
				Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройства,
				                                                        "PrintZReport",
				                                                        ВходныеПараметры,
				                                                        ВыходныеПараметры);
				
				Если Не Результат Тогда
					ТекстСообщения = НСтр("ru='При снятии отчета на фискальном регистраторе произошла ошибка."
"""%ОписаниеОшибки%"""
"Отчет на фискальном регистраторе не сформирован.';uk='При знятті звіту на фіскальному реєстраторі сталася помилка."
"""%ОписаниеОшибки%""."
"Звіт на фіскальному реєстраторі не сформований.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					
				Иначе
					
					МассивДокументов = ЗакрытьКассовуюСменуНаСервере(КассаККМ, Касса, ОписаниеОшибки);
					
					Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
						ТекстСообщения = НСтр("ru='Смена закрыта на фискальном регистраторе."
"Дополнительное описание:"
"%ДополнительноеОписание%';uk='Зміна закрита на фіскальному реєстраторі."
"Додатковий опис: %ДополнительноеОписание%'");
						ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					КонецЕсли;
					
					// Все результирующие документы выводим пользователю.
					Для Каждого Документ Из МассивДокументов Цикл
						ОткрытьЗначение(Документ);
					КонецЦикла;
					
				КонецЕсли;
				
				МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
				                                                                 ИдентификаторУстройства);
			Иначе
				ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка."
"Отчет не напечатан и смена не закрыта на фискальном регистраторе."
"Дополнительное описание:"
"%ДополнительноеОписание%';uk='При підключенні пристрою сталася помилка."
"Звіт не надрукований і зміна не зачинені на фіскальному реєстраторі."
"Додатковий опис:"
"%ДополнительноеОписание%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьСостояниеКассовойСменыИУстановитьОтборДинамическихСписков(КассаККМ);
	
	Оповестить("ОбновитьФормыПослеСнятияZОтчета");
	
КонецПроцедуры // ЗакрытьКассовуюСмену()

// Процедура - обработчик команды "ВнесениеДенег".
//
&НаКлиенте
Процедура ВнесениеДенег(Команда)

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ВносимаяСумма = 0;
		
		ЗаголовокОкна = НСтр("ru='Сумма внесения, %Валюта%';uk='Сума внесення, %Валюта%'");
		ЗаголовокОкна = СтрЗаменить(ЗаголовокОкна,
									"%Валюта%",
									 СтруктураСостояниеКассовойСмены.ВалютаДокументаПредставление);
		
		Если ВвестиЧисло(ВносимаяСумма, ЗаголовокОкна, 15, 2) Тогда
			
			ОписаниеОшибки = "";

			ИдентификаторУстройства = ПолучитьИдентификаторУстройстваПоКассеНаКлиенте(КассаККМ);
			Если НЕ ЗначениеЗаполнено(ИдентификаторУстройства) Тогда
				ИдентификаторУстройства = МенеджерОборудованияКлиент.ВыбратьУстройство("ФискальныйРегистратор",
				    НСтр("ru='Выберите фискальный регистратор';uk='Виберіть фіскальний реєстратор'"), НСтр("ru='Фискальный регистратор не подключен';uk='Фіскальний реєстратор не підключений'"));
			КонецЕсли;

			Если ИдентификаторУстройства <> Неопределено Тогда
				// Подключаем ФР
				Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
																							  ИдентификаторУстройства,
																							  ОписаниеОшибки);
				Если Результат Тогда
					//Готовим данные
					ВходныеПараметры  = Новый Массив();
					ВыходныеПараметры = Неопределено;

					ВходныеПараметры.Добавить(1);
					ВходныеПараметры.Добавить(ВносимаяСумма);

					// Печатаем чек.
					Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройства,
																			"Encash",
																			ВходныеПараметры,
																			ВыходныеПараметры);

					Если Результат Тогда
						// Итоговое действие.
					Иначе
						ТекстСообщения = НСтр("ru='При печати чека произошла ошибка."
"Чек не напечатан на фискальном регистраторе."
"Дополнительное описание:"
"%ДополнительноеОписание%';uk='При друку чека сталася помилка."
"Чек не надрукований на фіскальному реєстраторі."
"Додатковий опис:"
"%ДополнительноеОписание%'");
						ТекстСообщения = СтрЗаменить(ТекстСообщения,
													 "%ДополнительноеОписание%",
													 ВыходныеПараметры[1]);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					КонецЕсли;

					// Отключаем ФР
					МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор, ИдентификаторУстройства);
				Иначе
					ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка."
"Чек не напечатан на фискальном регистраторе."
"Дополнительное описание:"
"%ДополнительноеОписание%';uk='При підключенні пристрою сталася помилка."
"Чек не надрукований на фіскальному реєстраторі."
"Додатковий опис:"
"%ДополнительноеОписание%'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;

			КонецЕсли;

		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("ru='Предварительно необходимо выбрать рабочее место внешнего оборудования текущего сеанса.';uk='Попередньо необхідно вибрати робоче місце зовнішнього обладнання поточного сеансу.'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры // ВнесениеДенег()

// Процедура - обработчик команды "ИзъятиеДенег".
//
&НаКлиенте
Процедура ВыемкаДенег(Команда)

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ИзымаемаяСумма = 0;
		
		ЗаголовокОкна = НСтр("ru='Сумма выемки, %Валюта%';uk='Сума виїмки, %Валюта%'");
		ЗаголовокОкна = СтрЗаменить(ЗаголовокОкна,
									"%Валюта%",
									 СтруктураСостояниеКассовойСмены.ВалютаДокументаПредставление);
		
		Если ВвестиЧисло(ИзымаемаяСумма, ЗаголовокОкна, 15, 2) Тогда
			
			ОписаниеОшибки = "";

			ИдентификаторУстройства = ПолучитьИдентификаторУстройстваПоКассеНаКлиенте(КассаККМ);
			Если НЕ ЗначениеЗаполнено(ИдентификаторУстройства) Тогда
				ИдентификаторУстройства = МенеджерОборудованияКлиент.ВыбратьУстройство("ФискальныйРегистратор",
				    НСтр("ru='Выберите фискальный регистратор';uk='Виберіть фіскальний реєстратор'"), НСтр("ru='Фискальный регистратор не подключен';uk='Фіскальний реєстратор не підключений'"));
			КонецЕсли;

			Если ИдентификаторУстройства <> Неопределено Тогда
				// Подключаем ФР
				Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
																							  ИдентификаторУстройства,
																							  ОписаниеОшибки);
				Если Результат Тогда
					//Готовим данные
					ВходныеПараметры  = Новый Массив();
					ВыходныеПараметры = Неопределено;

					ВходныеПараметры.Добавить(0);
					ВходныеПараметры.Добавить(ИзымаемаяСумма);

					// Печатаем чек.
					Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройства,
																			"Encash",
																			ВходныеПараметры,
																			ВыходныеПараметры);

					Если Результат Тогда
						// Итоговое действие.
					Иначе
						ТекстСообщения = НСтр("ru='При печати чека произошла ошибка."
"Чек не напечатан на фискальном регистраторе."
"Дополнительное описание:"
"%ДополнительноеОписание%';uk='При друку чека сталася помилка."
"Чек не надрукований на фіскальному реєстраторі."
"Додатковий опис:"
"%ДополнительноеОписание%'");
						ТекстСообщения = СтрЗаменить(ТекстСообщения,
													 "%ДополнительноеОписание%",
													 ВыходныеПараметры[1]);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					КонецЕсли;

					// Отключаем ФР
					МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор, ИдентификаторУстройства);
				Иначе
					ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка."
"Чек не напечатан на фискальном регистраторе."
"Дополнительное описание:"
"%ДополнительноеОписание%';uk='При підключенні пристрою сталася помилка."
"Чек не надрукований на фіскальному реєстраторі."
"Додатковий опис:"
"%ДополнительноеОписание%'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;

			КонецЕсли;

		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("ru='Предварительно необходимо выбрать рабочее место внешнего оборудования текущего сеанса.';uk='Попередньо необхідно вибрати робоче місце зовнішнього обладнання поточного сеансу.'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры // ИзъятиеДенег()

// Функция выполняет получение состояния кассовой смены на сервере.
//
&НаСервереБезКонтекста
Функция ПолучитьСостояниеКассовойСменыНаСервере(КассаККМ)
	
	Возврат Документы.КассоваяСмена.ПолучитьСостояниеКассовойСмены(КассаККМ);
	
КонецФункции // ПолучитьСостояниеКассовойСменыНаСервере()

// Процедура выполняет обновление состояния кассовой смены на клиенте.
//
&НаСервере
Процедура ОбновитьСостояниеКассовойСменыНаСервере(КассаККМ)
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСменыНаСервере(КассаККМ);
	Если ЗначениеЗаполнено(СтруктураСостояниеКассовойСмены.СтатусКассовойСмены) Тогда
		
		ТекстСообщения = НСтр("ru='Смена № %НомерСмены%, Статус: %СтатусСмены% %ВремяИзменения%, В кассе %НаличностьВКассе% %Валюта%';uk='Зміна № %НомерСмены%, Статус: %СтатусСмены% %ВремяИзменения%, У касі %НаличностьВКассе% %Валюта%'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСмены%", СокрЛП(СтруктураСостояниеКассовойСмены.НомерКассовойСмены));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СтатусСмены%", СтруктураСостояниеКассовойСмены.СтатусКассовойСмены);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НаличностьВКассе%", СтруктураСостояниеКассовойСмены.НаличностьВКассе);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Валюта%", СтруктураСостояниеКассовойСмены.ВалютаДокументаПредставление);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВремяИзменения%", Формат(СтруктураСостояниеКассовойСмены.ДатаИзмененияСтатуса,"ДФ='dd.MM.yy ЧЧ:мм'"));
		
		СостояниеКассовойСмены = ТекстСообщения;
		
	Иначе
		
		СостояниеКассовойСмены = НСтр("ru='Смена не открыта.';uk='Зміна не відкрита.'");
		
	КонецЕсли;
	
	// Переменная формы
	СменаОткрыта = СтруктураСостояниеКассовойСмены.СменаОткрыта;
	ТекущаяКассоваяСмена = СтруктураСостояниеКассовойСмены.КассоваяСмена;
	
	// Управление доступностью.
	Элементы.СнятьZОтчет.Доступность          = СменаОткрыта;
	Элементы.ОткрытьКассовуюСмену.Доступность = НЕ СменаОткрыта И ЗначениеЗаполнено(КассаККМ);
	
	Элементы.ЧекиККМСоздать.Доступность                    = СменаОткрыта;
	Элементы.ЧекиККМСкопировать.Доступность                = СменаОткрыта;
	Элементы.КонтекстноеМенюЧекиККМСоздать.Доступность     = СменаОткрыта;
	Элементы.КонтекстноеМенюЧекиККМСкопировать.Доступность = СменаОткрыта;
	
	Элементы.ВнесениеДенег.Доступность = ЗначениеЗаполнено(КассаККМ);
	Элементы.ВыемкаДенег.Доступность   = ЗначениеЗаполнено(КассаККМ);
	
КонецПроцедуры // ОбновитьСостояниеКассовойСменыИУстановитьОтборДинамическихСписков()

// Процедура - обработчик команды "ОбновитьСостояниеКассовойСмены".
//
&НаКлиенте
Процедура ОбновитьСостояниеКассовойСмены(Команда)
	
	Если НЕ ЗначениеЗаполнено(КассаККМ) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСостояниеКассовойСменыИУстановитьОтборДинамическихСписков(КассаККМ);
	
КонецПроцедуры // ОбновитьСостояниеКассовойСмены()

// Процедура - обработчик команды "ОткрытьУправлениеФискальнымРегистратором".
//
&НаКлиенте
Процедура ОткрытьУправлениеФискальнымРегистратором(Команда)
	
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.УправлениеФискальнымРегистратором");

КонецПроцедуры // ОткрытьУправлениеФискальнымРегистратором)()

// Процедура - обработчик команды "ОткрытьУправлениеЭквайринговымТерминалом".
//
&НаКлиенте
Процедура ОткрытьУправлениеЭквайринговымТерминалом(Команда)
	
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.УправлениеЭквайринговымТерминалом");

КонецПроцедуры // ОткрытьУправлениеЭквайринговымТерминалом()

// Процедура - обработчик события "ОбработкаОповещения" формы.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия  = "ОбновитьФормыПослеСнятияZОтчета" Тогда
		Элементы.ЧекиККМ.Обновить();
		ОбновитьСостояниеКассовойСменыИУстановитьОтборДинамическихСписков(КассаККМ);
		ЧекиККМПриАктивизацииСтрокиНаКлиенте();
	ИначеЕсли ИмяСобытия = "ОбновитьФормуСпискаДокументовЧекККМ" Тогда
		Элементы.ЧекиККМ.Обновить();
		ОбновитьСостояниеКассовойСменыИУстановитьОтборДинамическихСписков(КассаККМ);
		ЧекиККМПриАктивизацииСтрокиНаКлиенте();
	ИначеЕсли ИмяСобытия = "ОбновитьФормыПослеЗакрытияКассовойСмены" Тогда
		Элементы.ЧекиККМ.Обновить();
		ОбновитьСостояниеКассовойСменыИУстановитьОтборДинамическихСписков(КассаККМ);
		ЧекиККМПриАктивизацииСтрокиНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещения()

// Процедура предназначается для обработки события "ПриАктивизацииСтроки" списка ЧекиККМ
//
&НаКлиенте
Процедура ЧекиККМПриАктивизацииСтрокиНаКлиенте()
	
	Если СтруктураСостояниеКассовойСмены = Неопределено Тогда
		ОбновитьСостояниеКассовойСменыИУстановитьОтборДинамическихСписков(КассаККМ);
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ЧекиККМ.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если НЕ ТекущиеДанные.Свойство("ГруппировкаСтроки") И ЗначениеЗаполнено(ТекущиеДанные.НомерЧекаККМ)
			И ЗначениеЗаполнено(СтруктураСостояниеКассовойСмены)
			И ТекущиеДанные.КассоваяСмена = СтруктураСостояниеКассовойСмены.КассоваяСмена
			И НЕ ТекущиеДанные.ЕстьЧекНаВозврат
			И СменаОткрыта
			И ТекущиеДанные.Тип <> Тип("ДокументСсылка.ЧекККМВозврат") Тогда
			
			Элементы.ЧекиККМДокументЧекККМВозвратСоздатьНаОсновании.Доступность = Истина;
			Элементы.КонтекстноеМенюЧекиККМДокументЧекККМВозвратСоздатьНаОсновании.Доступность = Истина;
			
		Иначе
			
			Элементы.ЧекиККМДокументЧекККМВозвратСоздатьНаОсновании.Доступность = Ложь;
			Элементы.КонтекстноеМенюЧекиККМДокументЧекККМВозвратСоздатьНаОсновании.Доступность = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ЧекиККМПриАктивизацииСтрокиНаКлиенте()

// Процедура - обработчик события "ПриАктивизацииСтроки" списка ЧекиККМ.
//
&НаКлиенте
Процедура ЧекиККМПриАктивизацииСтроки(Элемент)
	
	ЧекиККМПриАктивизацииСтрокиНаКлиенте();
	
КонецПроцедуры // ЧекиККМПриАктивизацииСтроки()

// Процедура - обработчик события "ПередНачаломДобавления" списка ЧекиККМ.
//
&НаКлиенте
Процедура ЧекиККМПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если СменаОткрыта Тогда
		Если НЕ Копирование Тогда
			ПараметрыОткрытия = Новый Структура("Основание", Новый Структура("КассаККМ", КассаККМ));
			ОткрытьФорму("Документ.ЧекККМ.Форма.ФормаДокумента", ПараметрыОткрытия);
			Отказ = Истина;
		КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры // ЧекиККМПередНачаломДобавления()

// Процедура предназначается для обработки события "ПриИзмененииНаСервере" флага ТолькоТекущаяСменаОтбор на сервере
//
&НаСервере
Процедура ТолькоТекущаяСменаОтборПриИзмененииНаСервере()
	
	УстановитьОтборДинамическихСписков();
	
КонецПроцедуры // ТолькоТекущаяСменаОтборПриИзмененииНаСервере()

// Процедура - обработчик события "ПриИзменении" флага ТолькоТекущаяСменаОтбор.
//
&НаКлиенте
Процедура ТолькоТекущаяСменаОтборПриИзменении(Элемент)

	ТолькоТекущаяСменаОтборПриИзмененииНаСервере();

КонецПроцедуры // ТолькоТекущаяСменаОтбор()
