#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбновитьОстаткиВзаиморасчетов(знач ЛицевыеСчета = Неопределено) Экспорт
	
	Если ТипЗнч(ЛицевыеСчета) = Тип("Массив") Тогда
		ТаблицаЛицевыеСчета = Новый ТаблицаЗначений;
		ТаблицаЛицевыеСчета.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("СправочникСсылка.ЛицевыеСчета"));
		Для Каждого ЛицевойСчет Из ЛицевыеСчета Цикл
			НоваяСтрока = ТаблицаЛицевыеСчета.Добавить();
			НоваяСтрока.ЛицевойСчет = ЛицевойСчет;
		КонецЦикла;
		ЛицевыеСчета = ТаблицаЛицевыеСчета;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ЛицевыеСчета = Неопределено Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВложенныйЗапрос.ЛицевойСчет,
			|	СУММА(ВложенныйЗапрос.СуммаОстаток) КАК СуммаОстаток
			|ПОМЕСТИТЬ втВзаиморасчеты
			|ИЗ
			|	(ВЫБРАТЬ
			|		РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет,
			|		РасчетыПоЛицевымСчетамОстатки.СуммаОстаток КАК СуммаОстаток
			|	ИЗ
			|		РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки КАК РасчетыПоЛицевымСчетамОстатки) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.ЛицевойСчет
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(ОстаткиВзаиморасчетов.ЛицевойСчет, втВзаиморасчеты.ЛицевойСчет) КАК ЛицевойСчет,
			|	ЕСТЬNULL(втВзаиморасчеты.СуммаОстаток, 0) КАК СуммаОстаток
			|ИЗ
			|	РегистрСведений.ЛицевыеСчетаВзаиморасчеты КАК ОстаткиВзаиморасчетов
			|		ПОЛНОЕ СОЕДИНЕНИЕ втВзаиморасчеты КАК втВзаиморасчеты
			|		ПО ОстаткиВзаиморасчетов.ЛицевойСчет = втВзаиморасчеты.ЛицевойСчет";
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЛицевыеСчета.ЛицевойСчет
			|ПОМЕСТИТЬ втЛицевыеСчета
			|ИЗ
			|	&ЛицевыеСчета КАК ЛицевыеСчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВложенныйЗапрос.ЛицевойСчет,
			|	СУММА(ВложенныйЗапрос.СуммаОстаток) КАК СуммаОстаток
			|ПОМЕСТИТЬ втВзаиморасчеты
			|ИЗ
			|	(ВЫБРАТЬ
			|		РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет,
			|		РасчетыПоЛицевымСчетамОстатки.СуммаОстаток КАК СуммаОстаток
			|	ИЗ
			|		РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(, ЛицевойСчет В (&ЛицевыеСчета)) КАК РасчетыПоЛицевымСчетамОстатки) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.ЛицевойСчет
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
			|	ЕСТЬNULL(втВзаиморасчеты.СуммаОстаток, 0) КАК СуммаОстаток
			|ИЗ
			|	втЛицевыеСчета КАК втЛицевыеСчета
			|		ЛЕВОЕ СОЕДИНЕНИЕ втВзаиморасчеты КАК втВзаиморасчеты
			|		ПО втЛицевыеСчета.ЛицевойСчет = втВзаиморасчеты.ЛицевойСчет";
		
		Запрос.УстановитьПараметр("ЛицевыеСчета", ЛицевыеСчета);
	
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ЛицевыеСчетаВзаиморасчеты.СоздатьНаборЗаписей();
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей.Отбор.ЛицевойСчет.Установить(Выборка.ЛицевойСчет);
		
		Если Выборка.СуммаОстаток = 0 Тогда
			НаборЗаписей.Записать(Истина);
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			ЗаписьНабора = НаборЗаписей[0];
		Иначе
			ЗаписьНабора = НаборЗаписей.Добавить();
		КонецЕсли;
		ЗаписьНабора.ЛицевойСчет = Выборка.ЛицевойСчет;
		ЗаписьНабора.Сумма = Выборка.СуммаОстаток;
		
		НаборЗаписей.Записать(Истина);
		НаборЗаписей.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли