////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура устанавливает видимость и доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПерерасчетПоЛС.ПерерасчетПоЛС Тогда
		Элементы.Перерасчет.Видимость = Истина;
		Элементы.ИнвентаризацияАвансов.Видимость = Ложь;
		Элементы.ПересчетОтопление.Видимость = Ложь;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПерерасчетПоЛС.ИнвентаризацияАвансов Тогда
		Элементы.Перерасчет.Видимость = Ложь;
		Элементы.ИнвентаризацияАвансов.Видимость = Истина;
		Элементы.ПересчетОтопление.Видимость = Ложь;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПерерасчетПоЛС.ПересчетОтопление Тогда
		Элементы.Перерасчет.Видимость = Ложь;
		Элементы.ИнвентаризацияАвансов.Видимость = Ложь;
		Элементы.ПересчетОтопление.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьИДоступность()

// Функция получает список лицевых счетов из временного хранилища
//
&НаСервере
Процедура ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище)
	
	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	МассивЛицевыеСчета = ТаблицаДляЗагрузки.ВыгрузитьКолонку("ЛицевойСчет");
	
	РассчитатьСуммыПерерасчета(МассивЛицевыеСчета);
	
КонецПроцедуры // ПолучитьЛицевыеСчетаИзХранилища()

// Процедура - рассчитывает суммы перерасчета.
//
&НаСервере
Процедура РассчитатьСуммыПерерасчета(МассивЛицевыхСчетов)
	
	СтруктураДляРасчета = Новый Структура;
	
	СтруктураДляРасчета.Вставить("ЛицевыеСчета", МассивЛицевыхСчетов); 
	
	СтруктураДляРасчета.Вставить("ПериодНачисленияНачало", Объект.ПериодНачисленияНачало);
	СтруктураДляРасчета.Вставить("ПериодНачисленияОкончание", Объект.ПериодНачисленияОкончание);
	СтруктураДляРасчета.Вставить("ДатаДокумента"			, Объект.Дата);
	
	СтруктураДляРасчета.Вставить("Услуга", Объект.Услуга); 
	СтруктураДляРасчета.Вставить("Ссылка", Объект.Ссылка);
	СтруктураДляРасчета.Вставить("Здание", Объект.Здание);
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПерерасчетПоЛС.ПерерасчетПоЛС Тогда
		ТаблицаПерерасчета = УчетКоммунальныхУслуг.РассчитатьСуммыПерерасчета(СтруктураДляРасчета);
	Иначе
		ТаблицаПерерасчета = ПолучитьАвансыНаИнвентаризацию(СтруктураДляРасчета);
	КонецЕсли;	
	
	Если ТаблицаПерерасчета = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПерерасчетПоЛС.ПерерасчетПоЛС Тогда

	
		МассивСтрокДляУдаления = ТаблицаПерерасчета.НайтиСтроки(Новый Структура("СуммаПерерасчета", 0));
		Для каждого НайденнаяСтрока Из МассивСтрокДляУдаления Цикл
			ТаблицаПерерасчета.Удалить(НайденнаяСтрока);
		КонецЦикла;
		
		Объект.Перерасчет.Загрузить(ТаблицаПерерасчета);
		
	Иначе
		
		Объект.ИнвентаризацияАвансов.Загрузить(ТаблицаПерерасчета);
		
		
	КонецЕсли;
	
	ТаблицаПерерасчетаЛьгот = УчетКоммунальныхУслуг.РассчтитатьСуммыПерерасчетаЛьгот(СтруктураДляРасчета);
	
	МассивСтрокДляУдаления = ТаблицаПерерасчетаЛьгот.НайтиСтроки(Новый Структура("Сумма", 0));
	Для каждого НайденнаяСтрока Из МассивСтрокДляУдаления Цикл
		ТаблицаПерерасчетаЛьгот.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
	Если ТаблицаПерерасчетаЛьгот <> Ложь тогда
		Объект.Льготы.Загрузить(ТаблицаПерерасчетаЛьгот);
	КонецЕсли;	
		
		
   
КонецПроцедуры // РассчитатьСуммыПерерасчета()

// Процедура - обработчик команды Заполнить.
//
&НаКлиенте
Процедура Заполнить(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ДатаНачала",		НачалоМесяца(Объект.ПериодНачисленияНачало));
	ПараметрыЗаполнения.Вставить("ДатаОкончания",	КонецМесяца(Объект.ПериодНачисленияОкончание));
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыЗаполнения.Вставить("ОтборЗдание",			Объект.Здание);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		
		Состояние(НСтр("ru='Идет перерасчет начислений ..."
"Пожалуйста, подождите.';uk='Йде перерахунок нарахувань ..."
"Будь ласка, зачекайте.'"));
		
		ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище);
		
		Состояние(НСтр("ru='Перерасчет начислений завершен.';uk='Перерахунок нарахувань завершений.'"));
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоматически(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Здание) Тогда
	
		ТекстПредупреждения = НСтр("ru='Реквизит ""Здание"" не заполнен.';uk='Реквізит ""Будівля"" не заповнено.'"); 
		Предупреждение(ТекстПредупреждения);
		Возврат;
	КонецЕсли; 
	
	Если Объект.Услуги.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(НСтр("ru='Таблица перерасчета начислений будет перезаполнена, продолжить?';uk='Таблиця перерахунку нарахувань буде перенаповнений, продовжити?'"), Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Состояние(НСтр("ru='Идет перерасчет начислений ..."
"Пожалуйста, подождите.';uk='Йде перерахунок нарахувань ..."
"Будь ласка, зачекайте.'"));
	
	Объект.Услуги.Очистить();
	
	ЗаполнитьАвтоматическиНаСервере();
	
	Состояние(НСтр("ru='Перерасчет начислений завершен.';uk='Перерахунок нарахувань завершений.'"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтоматическиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛицевыеСчета.ЛицевойСчет,
		|	ЛицевыеСчета.ЛицевойСчет.ОбъектЛицевогоСчета.Код КАК ЛицевойСчетОбъектЛицевогоСчетаКод
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета КАК ЛицевыеСчета
		|ГДЕ
		|	ЛицевыеСчета.Период >= &ДатаНач
		|	И ЛицевыеСчета.Период <= &ДатаКон
		|	И ЛицевыеСчета.ЛицевойСчет.Владелец = &Здание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет,
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета.Код
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета.СрезПоследних(
		|			&ДатаНач,
		|			ЛицевойСчет.Владелец = &Здание
		|				И Действует) КАК ЛицевыеСчетаСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчетОбъектЛицевогоСчетаКод";
		
		
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Объект.ПериодНачисленияНачало));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Объект.ПериодНачисленияОкончание));
	Запрос.УстановитьПараметр("Здание", Объект.Здание);
	
	ТаблицаДляЗагрузки	= Запрос.Выполнить().Выгрузить();
	МассивЛицевыеСчета = ТаблицаДляЗагрузки.ВыгрузитьКолонку("ЛицевойСчет");
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПерерасчетПоЛС.ПерерасчетПоЛС ИЛИ 
		 Объект.ВидОперации = Перечисления.ВидыОперацийПерерасчетПоЛС.ИнвентаризацияАвансов Тогда
	    РассчитатьСуммыПерерасчета(МассивЛицевыеСчета);
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры


// Процедура - устанавливает период.
//
&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	
	Диалог.Период.ДатаНачала    = Объект.ПериодНачисленияНачало;
	Диалог.Период.ДатаОкончания = Объект.ПериодНачисленияОкончание;
	
	Если Диалог.Редактировать() Тогда
		
		Объект.ПериодНачисленияНачало    = Диалог.Период.ДатаНачала;
		Объект.ПериодНачисленияОкончание = Диалог.Период.ДатаОкончания;
	
	КонецЕсли;
	
КонецПроцедуры // УстановитьИнтервал()

// Процедура возвращает таблицу авансов к инвентаризации
//
// Параметры
//  <Параметр1>  - <Струтура> - Струтура параметров запроса
//
// Возвращаемое значение:
//   <Тип.ТаблицаЗначений>   - Таблица для загрузки в ТЧ документа
//
&НаСервереБезКонтекста
Функция ПолучитьАвансыНаИнвентаризацию(СтруктураДляРасчета)
 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
		|	РасчетыПоЛицевымСчетамОстатки.Услуга,
		|	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаАванса,
		|	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
		|	ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец, ЗНАЧЕНИЕ(Справочник.ПотребителиУслуг.ПустаяСсылка)) КАК ОтветственныйВладелец,
		|	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
		|			&Период,
		|			ЛицевойСчет В (&ЛицевыеСчета)
		|				И ВЫБОР
		|					КОГДА &Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
		|						ТОГДА Услуга = &Услуга
		|					ИНАЧЕ Услуга В
		|								(ВЫБРАТЬ
		|									Услуги.Ссылка КАК Услуга
		|								ИЗ
		|									Справочник.Услуги КАК Услуги
		|								ГДЕ
		|									Услуги.ЭтоГруппа = ЛОЖЬ)
		|							И Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
		|				КОНЕЦ) КАК РасчетыПоЛицевымСчетамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ЛицевойСчет В (&ЛицевыеСчета)) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|ГДЕ
		|	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток < 0
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
		|	РасчетыПоЛицевымСчетамОстатки.Услуга,
		|	ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец, ЗНАЧЕНИЕ(Справочник.ПотребителиУслуг.ПустаяСсылка)),
		|	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.ОбъектЛицевогоСчета,
		|	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления";

	Запрос.УстановитьПараметр("ЛицевыеСчета", СтруктураДляРасчета.ЛицевыеСчета);
	Запрос.УстановитьПараметр("МесяцНачисления", Дата('00010101'));
	Запрос.УстановитьПараметр("Период", СтруктураДляРасчета.ДатаДокумента);
	Запрос.УстановитьПараметр("Услуга", СтруктураДляРасчета.Услуга);

	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
	
		ТаблицаВозврата = Результат.Выгрузить();

	Иначе	
		
		ТаблицаВозврата = Ложь;
		
	КонецЕсли;

	Возврат ТаблицаВозврата;
	
КонецФункции // ПолучитьАвансыНаИнвентаризацию()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.Перерасчет.Очистить();
		Объект.Услуги.Очистить();	
		Объект.ЛицевыеСчета.Очистить();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Объект.ВидОперации = Перечисления.ВидыОперацийПерерасчетПоЛС.ПерерасчетПоЛС;
	КонецЕсли;
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки

	УстановитьВидимостьИДоступность();
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьНаСервере()
	тзПерерасчета = РасчетУслугПоТЕиГВ.ПерерасчетОтопление(Объект.Ссылка, Объект.ПересчетОтопление.Выгрузить());
	Объект.ПересчетОтопление.Загрузить(тзПерерасчета);
КонецПроцедуры

&НаКлиенте
Процедура Пересчитать(Команда)
	ПересчитатьНаСервере();
КонецПроцедуры

