
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРИ - ОБРОБНИКИ ПОДІЙ ФОРМИ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
		
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПериодНачисления = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	КонецЕсли;
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ОтображениеПериодаНачисления = Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
	
	// Додаткові Звіти І Обробки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Кінець Додаткові Звіти І Обробки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРИ ТА ФУНКЦІЇ ЗАГАЛЬНОГО ПРИЗНАЧЕННЯ

// Процедура - обробник події Під час зміни поля введення "ПеріодНарахування".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияПриИзменении(Элемент)
	ЭтаФорма.Объект.ПериодНачисления = КонецМесяца(ЭтаФорма.Объект.ПериодНачисления);
	ФорматнаяСтрока = "uk = ""Л=uk_UA;ДФ='MMMM yyyy'""; uk = ""Л=uk_UA;ДФ='MMMM yyyy'""";
	ЭтаФорма.ОтображениеПериодаНачисления 	= Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
КонецПроцедуры

// Процедура - обробник події Початок вибору поля введення "ПеріодНарахування".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ПоказанияПриборов.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед зміною періоду таблична частина буде очищена. Продовжити?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.ПоказанияПриборов.Очистить();
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.Объект.ПериодНачисления= Дата('00010101'), ТекущаяДата(), ЭтаФорма.Объект.ПериодНачисления));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ЭтаФорма.Объект.ПериодНачисления = КонецДня(ДатаКалендаряНачало);
	
	ОтображениеПериодаНачисленияПриИзменении(Элемент);
КонецПроцедуры

// Процедура - обробник події Регулювання поля "ПеріодНарахування".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ПоказанияПриборов.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед зміною періоду таблична частина буде очищена. Продовжити?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.ПоказанияПриборов.Очистить();
	КонецЕсли;
	

	ЭтаФорма.Объект.ПериодНачисления = ?(ЗначениеЗаполнено(ЭтаФорма.Объект.ПериодНачисления), 
						ДобавитьМесяц(ЭтаФорма.Объект.ПериодНачисления, Направление),
						ДобавитьМесяц(КонецМесяца(ТекущаяДата()), Направление));
						
	ОтображениеПериодаНачисленияПриИзменении(Элемент);
КонецПроцедуры

// Процедура - обробник події зміни поля Особового рахунку
//
&НаСервере
Процедура ЛицевойСчетПриИзмененииНаСервере()
	Объект.Здание = Объект.ЛицевойСчет.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ПоказанияПриборов.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед зміною періоду таблична частина буде очищена. Продовжити?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.ПоказанияПриборов.Очистить();
	КонецЕсли;
	ЛицевойСчетПриИзмененииНаСервере();
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРИ ТА ФУНКЦІЇ ТАБЛИЧНОЇ ЧАСТИНИ ФОРМИ

// Процедура - обробник події зміни поля табличної частини Прилади обліку
//
&НаКлиенте
Процедура ПоказанияПриборовПриборУчетаПриИзменении(Элемент)
	ТекСтрока                     = Элементы.ПоказанияПриборов.ТекущиеДанные;
	ТекСтрока.ЕдиницаИзмерения    = ОбщийМодульМВК.ЕдиницаИзмПриборУчета(ТекСтрока.ПриборУчета);
	ТекСтрока.Коэффициент         = ОбщийМодульМВК.Коэффициент(ТекСтрока.ПриборУчета);
	ТекСтрока.ВидТарифа           = ОбщийМодульМВК.ВидТарифа();
	ДанныеПоСчетчику              = РасчетУслугПоТЕиГВ.ПолучитьПоказанияПрибораУчетаПоТЕ(ТекСтрока.ПриборУчета, Объект.ПериодНачисления);
	Если ЗначениеЗаполнено(ДанныеПоСчетчику) Тогда
		ТекСтрока.ПоказаниеПредыдущее = ДанныеПоСчетчику.ПоказаниеПредыдущее;
		ТекСтрока.НаработкаТеплосчетчикаПредыдущее = ДанныеПоСчетчику.ЧасыНаработкиПредыдущие;
		ТекСтрока.ОбъемВодыПоТеплоСчетчикуПредыдущее = ДанныеПоСчетчику.ОбъемВодыПоТеплоСчетчикуПредыдущие;
		ТекСтрока.ЧасыПростояПредыдущие = ДанныеПоСчетчику.ЧасыПростоя;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовПоказаниеТекущееПриИзменении(Элемент)
	ТекСтрока                  = Элементы.ПоказанияПриборов.ТекущиеДанные;
	ТекСтрока.РазницаПоказания = ТекСтрока.ПоказаниеТекущее - ТекСтрока.ПоказаниеПредыдущее;
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовОбъемВодыПоТеплоСчетчикуТекущееПриИзменении(Элемент)
	ТекСтрока                  = Элементы.ПоказанияПриборов.ТекущиеДанные;
	ТекСтрока.РазницаВода      = ТекСтрока.ОбъемВодыПоТеплоСчетчикуТекущее - ТекСтрока.ОбъемВодыПоТеплоСчетчикуПредыдущее;
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовНаработкаТеплосчетчикаТекущееПриИзменении(Элемент)
	ТекСтрока                  = Элементы.ПоказанияПриборов.ТекущиеДанные;
	ТекСтрока.РазницаЧасы      = ТекСтрока.НаработкаТеплосчетчикаТекущее - ТекСтрока.НаработкаТеплосчетчикаПредыдущее;
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовЧасыПростояТекущиеПриИзменении(Элемент)
	ТекСтрока                    = Элементы.ПоказанияПриборов.ТекущиеДанные;
	ТекСтрока.ЧасыПростояРазница = ТекСтрока.ЧасыПростояТекущие - ТекСтрока.ЧасыПростояПредыдущие;
КонецПроцедуры

