
&НаКлиенте
Процедура ФайлЕксельНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ФайлЕксель;
	Фильтр = "Электронная таблица Excel(*.xls)|*.xls";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ФайлЕксель = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	Путь = Объект.ФайлЕксель;
	Объект.ТабличнаяЧастьОбъем.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.ActiveSheet.UsedRange.Rows.Count();//Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик = 4 По КоличествоСтрок Цикл
		НоваяСтрока                  = Объект.ТабличнаяЧастьОбъем.Добавить();
		НоваяСтрока.ЛСТеплосеть      = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.Адрес            = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.Улица            = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.Дом              = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.Квартира         = Excel.Cells(Счетчик, 5).Value;
		НоваяСтрока.Объем            = Excel.Cells(Счетчик, 6).Value;
	КонецЦикла;
	Excel.Workbooks.Close();
	Excel.Quit();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиВодоканалаНаСервере()
	
	Для Каждого стр Из Объект.ТабличнаяЧастьОбъем Цикл
		// Поищем по абонномеру теплосети
	    ЛСПоТеплосети = АбонномерТеплосеть(СтрЗаменить(Строка(стр.ЛСТеплосеть), Символы.НПП, ""));
		Если ЛСПоТеплосети <> Неопределено Тогда
			стр.ЛицевойСчет = ЛСПоТеплосети;
		    ПриборУчета = НайтиПриборУчета(ЛСПоТеплосети);
		    Если ПриборУчета <> Неопределено Тогда		    
				стр.ПриборУчета = ПриборУчета;
			КонецЕсли;
		Иначе
			// Поищем абонента по адресу
			ЛС_Адрес = АбонномерПоАдресу(стр.Адрес, стр.Квартира);
			Если ЛС_Адрес <> Неопределено Тогда
				стр.ЛицевойСчет = ЛС_Адрес;
				ПриборУчета = НайтиПриборУчета(ЛСПоТеплосети);
			    Если ПриборУчета <> Неопределено Тогда				    
					стр.ПриборУчета = ПриборУчета;
				КонецЕсли;
				// Добавим лицевой счет теплосети
				СправочникЛС = ЛС_Адрес.Ссылка.ПолучитьОбъект();
				СправочникЛС.ЛицевойСчетТеплосеть = СтрЗаменить(Строка(стр.ЛСТеплосеть), Символы.НПП, "");
				СправочникЛС.Записать();
			КонецЕсли;
	    КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДаннымиВодоканала(Команда)
	ЗаполнитьДаннымиВодоканалаНаСервере();
КонецПроцедуры


//////////////////////////////////// ДОПОЛНИТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ /////////////////////

&НаСервере
Функция АбонномерТеплосеть(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(
	    |			&НаДату,
	    |			Действует = ИСТИНА
	    |				И ЛицевойСчет.ЛицевойСчетТеплосеть = &ЛицевойСчетТеплосеть) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ЛицевойСчетТеплосеть", ЛицевойСчет);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий()Цикл
			ЛС = Выборка.ЛицевойСчет;
		КонецЦикла;
		Возврат ЛС;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Функция НайтиПриборУчета(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета
	    |ИЗ
	    |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
	    |			&НаДату,
	    |			ОбъектУстановки = &ОбъектУстановки
	    |				И Действует = ИСТИНА
	    |				И ПриборУчета.Услуга.ВидУслуги = &ВидУслуги) КАК УстановленныеПриборыУчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОбъектУстановки", ЛицевойСчет);
	Запрос.УстановитьПараметр("ВидУслуги", Справочники.ВидыУслуг.Водоотведение);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий()Цикл
			ПУ = Выборка.ПриборУчета;
		КонецЦикла;
		Возврат ПУ;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
КонецФункции

&НаСервере
Функция АбонномерПоАдресу(Адрес, Квартира)
	Здание = Справочники.ЗданияИСооружения.НайтиПоНаименованию(Адрес);
	_Квартира = Справочники.ОбъектыЛицевыхСчетов.НайтиПоКоду(Квартира);
	
	ЗапросКв = Новый Запрос;
	ЗапросКв.Текст =
	    "ВЫБРАТЬ
	    |	ОбъектыЛицевыхСчетов.Ссылка
	    |ИЗ
	    |	Справочник.ОбъектыЛицевыхСчетов КАК ОбъектыЛицевыхСчетов
	    |ГДЕ
	    |	ОбъектыЛицевыхСчетов.Владелец = &Владелец
	    |	И ОбъектыЛицевыхСчетов.Код = &Код
	    |	И ОбъектыЛицевыхСчетов.ПометкаУдаления = ЛОЖЬ";
	ЗапросКв.УстановитьПараметр("Владелец", Здание);
	ЗапросКв.УстановитьПараметр("Код", Число(Квартира));
	Результат = ЗапросКв.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектЛС = Выборка.Ссылка;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(
	    |			&НаДату,
	    |			Действует = ИСТИНА
	    |				И ЛицевойСчет.Владелец = &Владелец
	    |				И ЛицевойСчет.ОбъектЛицевогоСчета = &Квартира) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Владелец", Здание);
	Запрос.УстановитьПараметр("Квартира", ОбъектЛС);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий()Цикл
			ЛС = Выборка.ЛицевойСчет;
		КонецЦикла;
		Возврат ЛС;
	Иначе
	    Сообщить("Адресу не знайдено: " + Адрес + " кв." + Квартира);
		Возврат Неопределено;
	КонецЕсли;
КонецФункции