&НаКлиенте
Процедура ПечатьОтчетаБезГашенияВыполнить()

	ОписаниеОшибки = "";

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		// Подключение устройства
		ИдентификаторУстройства = МенеджерОборудованияКлиент.ВыбратьУстройство("ФискальныйРегистратор",
		    НСтр("ru='Выберите фискальный регистратор';uk='Виберіть фіскальний реєстратор'"), НСтр("ru='Фискальный регистратор не подключен';uk='Фіскальний реєстратор не підключений'"));

		Если ИдентификаторУстройства <> Неопределено Тогда
			Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
			                                                                              ИдентификаторУстройства, ОписаниеОшибки);

			Если Результат Тогда
				ВходныеПараметры  = Неопределено;
				ВыходныеПараметры = Неопределено;

				Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройства,
				                                                        "PrintXReport",
				                                                        ВходныеПараметры,
				                                                        ВыходныеПараметры);

				Если Не Результат Тогда
					ТекстСообщения = НСтр("ru='При снятии отчета на фискальном регистраторе произошла ошибка."
"%ОписаниеОшибки%"
"Отчет на фискальном регистраторе не сформирован.';uk='При знятті звіту на фіскальному реєстраторі сталася помилка."
"%ОписаниеОшибки%"
"Звіт на фіскальному реєстраторі не сформований.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;

				МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
				                                                                 ИдентификаторУстройства);
			Иначе
				ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка.';uk='При підключенні пристрою сталася помилка.'") + Символы.ПС + ОписаниеОшибки;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.';uk='Заздалегідь необхідно вибрати робоче місце устаткування поточного сеансу, що підключається.'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтчетаСГашениемВыполнить()

	ОписаниеОшибки = "";

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		// Подключение устройства
		ИдентификаторУстройства = МенеджерОборудованияКлиент.ВыбратьУстройство("ФискальныйРегистратор",
		    НСтр("ru='Выберите фискальный регистратор';uk='Виберіть фіскальний реєстратор'"), НСтр("ru='Фискальный регистратор не подключен';uk='Фіскальний реєстратор не підключений'"));

		Если ИдентификаторУстройства <> Неопределено Тогда
			Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
			                                                                              ИдентификаторУстройства, ОписаниеОшибки);

			Если Результат Тогда
				ВходныеПараметры  = Неопределено;
				ВыходныеПараметры = Неопределено;

				Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройства,
				                                                        "PrintZReport",
				                                                        ВходныеПараметры,
				                                                        ВыходныеПараметры);

				Если Не Результат Тогда
					ТекстСообщения = НСтр("ru='При снятии отчета на фискальном регистраторе произошла ошибка."
"""%ОписаниеОшибки%"""
"Отчет на фискальном регистраторе не сформирован.';uk='При знятті звіту на фіскальному реєстраторі сталася помилка."
"""%ОписаниеОшибки%""."
"Звіт на фіскальному реєстраторі не сформований.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;

				МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
				                                                                 ИдентификаторУстройства);
			Иначе
				ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка.';uk='При підключенні пристрою сталася помилка.'") + Символы.ПС + ОписаниеОшибки;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.';uk='Заздалегідь необхідно вибрати робоче місце устаткування поточного сеансу, що підключається.'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтчетаОПроданныхТоварахВыполнить(Команда)
	
	ОписаниеОшибки = "";

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		// Подключение устройства
		ИдентификаторУстройства = МенеджерОборудованияКлиент.ВыбратьУстройство("ФискальныйРегистратор",
		    НСтр("ru='Выберите фискальный регистратор';uk='Виберіть фіскальний реєстратор'"), НСтр("ru='Фискальный регистратор не подключен';uk='Фіскальний реєстратор не підключений'"));

		Если ИдентификаторУстройства <> Неопределено Тогда
			Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
			                                                                              ИдентификаторУстройства, ОписаниеОшибки);

			Если Результат Тогда
				ВходныеПараметры  = Неопределено;
				ВыходныеПараметры = Неопределено;

				Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройства,
				                                                        "PrintSoldReport",
				                                                        ВходныеПараметры,
				                                                        ВыходныеПараметры);

				Если Не Результат Тогда
					ТекстСообщения = НСтр("ru='При снятии отчета на фискальном регистраторе произошла ошибка."
"""%ОписаниеОшибки%"""
"Отчет на фискальном регистраторе не сформирован.';uk='При знятті звіту на фіскальному реєстраторі сталася помилка."
"""%ОписаниеОшибки%""."
"Звіт на фіскальному реєстраторі не сформований.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;

				МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
				                                                                 ИдентификаторУстройства);
			Иначе
				ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка.';uk='При підключенні пристрою сталася помилка.'") + Символы.ПС + ОписаниеОшибки;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.';uk='Заздалегідь необхідно вибрати робоче місце устаткування поточного сеансу, що підключається.'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПериодическогоОтчетаПоДатамВыполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПериодПериодическогоОтчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Заполните период за который хотите сформировать отчет.';uk='Заповніть період за який хочете сформувати звіт.'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОшибки = "";

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		// Подключение устройства
		ИдентификаторУстройства = МенеджерОборудованияКлиент.ВыбратьУстройство("ФискальныйРегистратор",
		    НСтр("ru='Выберите фискальный регистратор';uk='Виберіть фіскальний реєстратор'"), НСтр("ru='Фискальный регистратор не подключен';uk='Фіскальний реєстратор не підключений'"));

		Если ИдентификаторУстройства <> Неопределено Тогда
			Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
			                                                                              ИдентификаторУстройства, ОписаниеОшибки);

			Если Результат Тогда
				ВходныеПараметры  = Новый Массив;
				ВыходныеПараметры = Неопределено;
				
				ВходныеПараметры.Добавить(ПериодПериодическогоОтчета.ДатаНачала);
				ВходныеПараметры.Добавить(ПериодПериодическогоОтчета.ДатаОкончания);

				Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройства,
				                                                        "PrintPReportDate",
				                                                        ВходныеПараметры,
				                                                        ВыходныеПараметры);

				Если Не Результат Тогда
					ТекстСообщения = НСтр("ru='При снятии отчета на фискальном регистраторе произошла ошибка."
"""%ОписаниеОшибки%"""
"Отчет на фискальном регистраторе не сформирован.';uk='При знятті звіту на фіскальному реєстраторі сталася помилка."
"""%ОписаниеОшибки%""."
"Звіт на фіскальному реєстраторі не сформований.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;

				МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
				                                                                 ИдентификаторУстройства);
			Иначе
				ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка.';uk='При підключенні пристрою сталася помилка.'") + Символы.ПС + ОписаниеОшибки;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.';uk='Заздалегідь необхідно вибрати робоче місце устаткування поточного сеансу, що підключається.'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПериодическогоОтчетаПоНомерамВыполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(НачальныйНомерПериодическогоОтчета) ИЛИ НЕ ЗначениеЗаполнено(КонечныйНомерПериодическогоОтчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Заполните номера дневных отчетов для формирования отчета.';uk='Заповніть номера денних звітів для формування звіту.'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОшибки = "";

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		// Подключение устройства
		ИдентификаторУстройства = МенеджерОборудованияКлиент.ВыбратьУстройство("ФискальныйРегистратор",
		    НСтр("ru='Выберите фискальный регистратор';uk='Виберіть фіскальний реєстратор'"), НСтр("ru='Фискальный регистратор не подключен';uk='Фіскальний реєстратор не підключений'"));

		Если ИдентификаторУстройства <> Неопределено Тогда
			Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
			                                                                              ИдентификаторУстройства, ОписаниеОшибки);

			Если Результат Тогда
				ВходныеПараметры  = Новый Массив;
				ВыходныеПараметры = Неопределено;
				
				ВходныеПараметры.Добавить(НачальныйНомерПериодическогоОтчета);
				ВходныеПараметры.Добавить(КонечныйНомерПериодическогоОтчета);

				Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройства,
				                                                        "PrintPReportNumber",
				                                                        ВходныеПараметры,
				                                                        ВыходныеПараметры);

				Если Не Результат Тогда
					ТекстСообщения = НСтр("ru='При снятии отчета на фискальном регистраторе произошла ошибка."
"""%ОписаниеОшибки%"""
"Отчет на фискальном регистраторе не сформирован.';uk='При знятті звіту на фіскальному реєстраторі сталася помилка."
"""%ОписаниеОшибки%""."
"Звіт на фіскальному реєстраторі не сформований.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;

				МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
				                                                                 ИдентификаторУстройства);
			Иначе
				ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка.';uk='При підключенні пристрою сталася помилка.'") + Символы.ПС + ОписаниеОшибки;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.';uk='Заздалегідь необхідно вибрати робоче місце устаткування поточного сеансу, що підключається.'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры
