
/////////////////////////////////ПРИ ОТКРЫТИИ ДОКУМЕНТА///////////////////////////
//

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Справочники.Организации.НайтиПоКоду("000000001");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////
//

&НаСервере
Процедура ЛицевойСчетПриИзмененииНаСервере()
	//Объект.ПриборыУчета.Очистить();
	////Получим установленные приборы по данному лицевому счету
	//ПриборыУчета = ПолучитьСписокПриборов(Объект.ЛицевойСчет);
	Объект.Здание = Объект.ЛицевойСчет.Владелец;
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Объект.ПериодНачисления = ТекущаяДата();
	//Для Каждого стр Из ПриборыУчета Цикл
	//    НовСтрока = Объект.ПриборыУчета.Добавить();
	//	НовСтрока.ПриборУчета          = стр.ПриборУчета;
	//	ПоказанияПрибора               = ПоказанияПриборовУчета(стр.ПриборУчета, Объект.ЛицевойСчет);
	//	Если ПоказанияПрибора = Неопределено Тогда
	//		НовСтрока.ПредыдущиеПоказания = стр.Значение;
	//	Иначе
	//	    НовСтрока.ПредыдущиеПоказания = стр.Значение;
	//	КонецЕсли;
	//	НовСтрока.Услуга               = стр.Услуга;
	//	НовСтрока.ВидТарифа            = Перечисления.ВидыТарифов.Общий;
	//	НовСтрока.Источник             = Перечисления.ИсточникиПоказаний.РучнаяОперация;
	//КонецЦикла;
	
	Объект.ПриборыУчета.Очистить();
	
	АдресЛицевыхСчетовВХранилище = Неопределено; ИндивидуальныйВвод = Истина;
	
	Запрос = Новый Запрос;
	Если АдресЛицевыхСчетовВХранилище <> Неопределено Тогда
		ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
		МассивОбъектовУстановки = ТаблицаДляЗагрузки.ВыгрузитьКолонку("ЛицевойСчет");
		
		ТекстЗапросаДоб = "	И УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки В(&МассивОбъектовУстановки)";
		Запрос.УстановитьПараметр("МассивОбъектовУстановки", МассивОбъектовУстановки);
	ИначеЕсли ИндивидуальныйВвод Тогда
		МассивОбъектовУстановки = Новый Массив;
		МассивОбъектовУстановки.Добавить(Объект.ЛицевойСчет);
		
		ТекстЗапросаДоб = "	И УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки В(&МассивОбъектовУстановки)";
		Запрос.УстановитьПараметр("МассивОбъектовУстановки", МассивОбъектовУстановки);
	Иначе
		ТекстЗапросаДоб = "";
	КонецЕсли;	

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки КАК ЛицевойСчет,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета КАК Квартира,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета.Владелец КАК Здание,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Коэффициент КАК Коэффициент,
		|	ЕСТЬNULL(УслугиВидыТарифов.ВидТарифа, ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Общий)) КАК ВидТарифа,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец
		|ИЗ
		|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&ДатаСреза, ПриборУчета.Услуга = &Услуга) КАК УстановленныеПриборыУчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Услуги.ВидыТарифов КАК УслугиВидыТарифов
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга = УслугиВидыТарифов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|ГДЕ
		|	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА"+ТекстЗапросаДоб;
	
	Запрос.УстановитьПараметр("ДатаСреза", НачалоДня(Объект.Дата));
	Если ЗначениеЗаполнено(Объект.Услуга) Тогда
		Запрос.УстановитьПараметр("Услуга", Объект.Услуга);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПриборУчета.Услуга = &Услуга","");
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_Заполнения = РезультатЗапроса.Выгрузить();
	ТЗ_Заполнения.Колонки.Добавить("Услуга");
	ТЗ_Заполнения.Колонки.Добавить("ПредыдущиеПоказания");
	ТЗ_Заполнения.Колонки.Добавить("Источник");
	Для Каждого стрТЗ Из ТЗ_Заполнения Цикл
		стрТЗ.Услуга = стрТЗ.ПриборУчета.Услуга;
		стрТЗ.Источник = Перечисления.ИсточникиПоказаний.РучнаяОперация;
		стрТЗ.ПредыдущиеПоказания = ПоказанияПриборовУчета(стрТЗ.ПриборУчета, Объект.ЛицевойСчет);
	КонецЦикла;
	
	Объект.ПриборыУчета.Загрузить(ТЗ_Заполнения)
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	ЛицевойСчетПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаТекущиеПоказателиПриИзменении(Элемент)
	ТекСтрока = Элементы.ПриборыУчета.ТекущиеДанные;
	Если ТекСтрока.ТекущиеПоказания < ТекСтрока.ПредыдущиеПоказания Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Текущий показатель меньше или равен предыдущему показателю!'; uk = 'Поточний показник меньше, або дорівнює попередньому показнику!'");
		Сообщение.Сообщить();
	Иначе
	    ТекСтрока.КвоКубов = ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания;
		ТекСтрока.ПредварительныйРассчет = ПолучитьСуммуПредварительногоРассчета(Объект.ЛицевойСчет, ТекСтрока.Услуга, ТекСтрока.КвоКубов, ТекСтрока.ВидТарифа);
	КонецЕсли;
КонецПроцедуры



//////////////////////////////////////////////////////////////////////////////////
//

&НаСервере
Функция ПолучитьСписокПриборов(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЗаводскойНомер КАК ЗаводскойНомер,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|	ПоказанияПриборовУчетаСрезПоследних.Значение,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга КАК Услуга
		|ИЗ
		|	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&НаДату, ) КАК ПоказанияПриборовУчетаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&НаДату, ОбъектУстановки = &ОбъектУстановки) КАК УстановленныеПриборыУчетаСрезПоследних
		|		ПО (УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета)";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОбъектУстановки", ЛицевойСчет);
	Список = Запрос.Выполнить().Выгрузить();

	Возврат Список;
КонецФункции

&НаСервере
Функция ПоказанияПриборовУчета(ПриборУчета, ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	МАКСИМУМ(ПоказанияПриборовУчетаСрезПоследних.Значение) КАК Значение
	    |ИЗ
	    |	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&НаДату, ПриборУчета = &ПриборУчета) КАК ПоказанияПриборовУчетаСрезПоследних
	    |ГДЕ
	    |	ПоказанияПриборовУчетаСрезПоследних.Отключен = ЛОЖЬ
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета";
    Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	//Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Значение = Выборка.Значение;
	КонецЦикла;
	Возврат Значение;
КонецФункции

&НаСервере
Функция ПолучитьСуммуПредварительногоРассчета(ЛицевойСчет, Услуга, КвоКубов, ВидТарифа)
	Сумма = 0;
	ЗапросТариф = Новый Запрос;
	ЗапросТариф.Текст = 
	    "ВЫБРАТЬ
	    |	ТарифыСрезПоследних.ЗначениеТарифа
	    |ИЗ
	    |	РегистрСведений.Тарифы.СрезПоследних(
	    |			&НаДату,
	    |			Услуга = &Услуга
	    |				И Здание = &Здание
	    |				И ВидТарифа = &ВидТарифа) КАК ТарифыСрезПоследних";
	ЗапросТариф.УстановитьПараметр("НаДату", ТекущаяДата());
	ЗапросТариф.УстановитьПараметр("Услуга", Услуга);
	ЗапросТариф.УстановитьПараметр("Здание", ЛицевойСчет.Владелец);
	ЗапросТариф.УстановитьПараметр("ВидТарифа", Перечисления.ВидыТарифов.Общий);
	Результат = ЗапросТариф.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Тариф = Выборка.ЗначениеТарифа;
		КонецЦикла;
	Иначе
		Сообщить("Тариф не знайдено!");
		Возврат 0;
	КонецЕсли;
	Сумма = Тариф * КвоКубов;
	Возврат Сумма;
КонецФункции