
&НаКлиенте
Процедура ФайлDBFНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр                      = НСтр("ru='Файл XBase (*.dbf)|*.dbf'");
	ДиалогВыбораФайла.Заголовок                   = Заголовок;
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "dbf";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
	    Объект.ФайлDBF = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИмпортФайла(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ФайлDBF) Тогда
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
	КонецЕсли;
	Таб = Новый XBase;
	Таб.ОткрытьФайл(Объект.ФайлDBF,,Истина);
	Таб.Первая();
	Таб.Кодировка = КодировкаXBase.OEM;
	Объект.ТабличнаяЧасть.Очистить();
	Пока Не Таб.ВКонце() Цикл
		НоваяСтрока = Объект.ТабличнаяЧасть.Добавить();
		НоваяСтрока.OWN_NUM           = Таб.OWN_NUM;
		НоваяСтрока.REE_NUM           = Таб.REE_NUM;
		НоваяСтрока.OPP               = Таб.OPP;
		НоваяСтрока.NUMB              = Таб.NUMB;
		НоваяСтрока.MARK              = Таб.MARK;
		НоваяСтрока.CODE              = Таб.CODE;
		НоваяСтрока.ENT_COD           = Таб.ENT_COD;
		НоваяСтрока.FROG              = Таб.FROG;
		НоваяСтрока.FL_PAY            = Таб.FL_PAY;
		НоваяСтрока.NM_PAY            = Таб.NM_PAY;
		НоваяСтрока.DEBT              = Таб.DEBT;
		НоваяСтрока.CODE2_1           = Таб.CODE2_1;
		НоваяСтрока.CODE2_2           = Таб.CODE2_2;
		НоваяСтрока.CODE2_3           = Таб.CODE2_3;
		НоваяСтрока.CODE2_4           = Таб.CODE2_4;
		НоваяСтрока.CODE2_5           = Таб.CODE2_5;
		НоваяСтрока.CODE2_6           = Таб.CODE2_6;
		НоваяСтрока.CODE2_7           = Таб.CODE2_7;
		НоваяСтрока.CODE2_8           = Таб.CODE2_8;
		НоваяСтрока.CODE2_17          = Таб.CODE2_17;
		НоваяСтрока.CODE2_18          = Таб.CODE2_18;
		НоваяСтрока.CODE2_19          = Таб.CODE2_19;
		НоваяСтрока.CODE2_20          = Таб.CODE2_20;
		НоваяСтрока.CODE2_21          = Таб.CODE2_21;
		НоваяСтрока.CODE2_22          = Таб.CODE2_22;
		НоваяСтрока.CODE2_23          = Таб.CODE2_23;
		НоваяСтрока.CODE2_24          = Таб.CODE2_24;
		НоваяСтрока.CODE2_25          = Таб.CODE2_25;
		НоваяСтрока.CODE2_26          = Таб.CODE2_26;
		НоваяСтрока.CODE2_50          = Таб.CODE2_50;
		НоваяСтрока.CODE2_60          = Таб.CODE2_60;
		НоваяСтрока.CODE2_70          = Таб.CODE2_70;
		НоваяСтрока.NORM_F_1          = Таб.NORM_F_1;
		НоваяСтрока.NORM_F_2          = Таб.NORM_F_2;
		НоваяСтрока.NORM_F_3          = Таб.NORM_F_3;
		НоваяСтрока.NORM_F_4          = Таб.NORM_F_4;
		НоваяСтрока.NORM_F_5          = Таб.NORM_F_5;
		НоваяСтрока.NORM_F_6          = Таб.NORM_F_6;
		НоваяСтрока.NORM_F_7          = Таб.NORM_F_7;
		НоваяСтрока.NORM_F_8          = Таб.NORM_F_8;
		НоваяСтрока.OWN_NUM_SR        = Таб.OWN_NUM_SR;
		НоваяСтрока.DAT1              = Таб.DAT1;
		НоваяСтрока.DAT2              = Таб.DAT2;
		НоваяСтрока.OZN_PRZ           = Таб.OZN_PRZ;
		НоваяСтрока.DAT_F_1           = Таб.DAT_F_1;
		НоваяСтрока.DAT_F_2           = Таб.DAT_F_2;
		НоваяСтрока.DAT_FOP_1         = Таб.DAT_FOP_1;
		НоваяСтрока.DAT_FOP_2         = Таб.DAT_FOP_2;
		НоваяСтрока.ID_RAJ            = Таб.ID_RAJ;
		НоваяСтрока.SUR_NAM           = Таб.SUR_NAM;
		НоваяСтрока.F_NAM             = Таб.F_NAM;
		НоваяСтрока.M_NAM             = Таб.M_NAM;
		НоваяСтрока.IND_COD           = Таб.IND_COD;
		НоваяСтрока.INDX              = Таб.INDX;
		НоваяСтрока.N_NAME            = Таб.N_NAME;
		НоваяСтрока.VUL_NAME          = Таб.VUL_NAME;
		НоваяСтрока.BLD_NUM           = Таб.BLD_NUM;
		НоваяСтрока.CORP_NUM          = Таб.CORP_NUM;
		НоваяСтрока.FLAT              = Таб.FLAT;
		НоваяСтрока.CODE3_1           = Таб.CODE3_1;
		НоваяСтрока.CODE3_2           = Таб.CODE3_2;
		НоваяСтрока.CODE3_3           = Таб.CODE3_3;
		НоваяСтрока.CODE3_4           = Таб.CODE3_4;
		НоваяСтрока.CODE3_5           = Таб.CODE3_5;
		НоваяСтрока.CODE3_6           = Таб.CODE3_6;
		НоваяСтрока.CODE3_7           = Таб.CODE3_7;
		НоваяСтрока.CODE3_8           = Таб.CODE3_8;
		НоваяСтрока.CODE3_17          = Таб.CODE3_17;
		НоваяСтрока.CODE3_18          = Таб.CODE3_18;
		НоваяСтрока.CODE3_19          = Таб.CODE3_19;
		НоваяСтрока.CODE3_20          = Таб.CODE3_20;
		НоваяСтрока.CODE3_21          = Таб.CODE3_21;
		НоваяСтрока.CODE3_22          = Таб.CODE3_22;
		НоваяСтрока.CODE3_23          = Таб.CODE3_23;
		НоваяСтрока.CODE3_24          = Таб.CODE3_24;
		НоваяСтрока.CODE3_25          = Таб.CODE3_25;
		НоваяСтрока.CODE3_26          = Таб.CODE3_26;
		НоваяСтрока.CODE3_50          = Таб.CODE3_50;
		НоваяСтрока.CODE3_60          = Таб.CODE3_60;
		НоваяСтрока.CODE3_70          = Таб.CODE3_70;
		НоваяСтрока.OPP_SERV          = Таб.OPP_SERV;
		НоваяСтрока.RESERV1           = Таб.RESERV1;
		НоваяСтрока.RESERV2           = Таб.RESERV2;
		Таб.Следующая();
	КонецЦикла;
	Таб.ЗакрытьФайл();
КонецПроцедуры

&НаКлиенте
Процедура ЕкспортDBF(Команда)
	Файл = Новый XBase;
	Файл.Кодировка = КодировкаXBase.ANSI;
	Файл.поля.Добавить("OWN_NUM","N",15,0);
	Файл.поля.Добавить("REE_NUM","N",2,0);
	Файл.поля.Добавить("OPP","C",8,0);
	Файл.поля.Добавить("NUMB","N",2,0);
	Файл.поля.Добавить("MARK","N",2,0);
	Файл.поля.Добавить("CODE","N",4,0);
	Файл.поля.Добавить("ENT_COD","N",10,0);
	Файл.поля.Добавить("FROG","N",5,1);
	Файл.поля.Добавить("FL_PAY","N",9,2);
	Файл.поля.Добавить("NM_PAY","N",9,2);
	Файл.поля.Добавить("DEBT","N",9,2);
	Файл.поля.Добавить("CODE2_1","N",6,0);
	Файл.поля.Добавить("CODE2_2","N",6,0);
	Файл.поля.Добавить("CODE2_3","N",6,0);
	Файл.поля.Добавить("CODE2_4","N",6,0);
	Файл.поля.Добавить("CODE2_5","N",6,0);
	Файл.поля.Добавить("CODE2_6","N",6,0);
	Файл.поля.Добавить("CODE2_7","N",6,0);
	Файл.поля.Добавить("CODE2_8","N",6,0);
	Файл.поля.Добавить("CODE2_17","N",6,0);
	Файл.поля.Добавить("CODE2_18","N",6,0);
	Файл.поля.Добавить("CODE2_19","N",6,0);
	Файл.поля.Добавить("CODE2_20","N",6,0);
	Файл.поля.Добавить("CODE2_21","N",6,0);
	Файл.поля.Добавить("CODE2_22","N",6,0);
	Файл.поля.Добавить("CODE2_23","N",6,0);
	Файл.поля.Добавить("CODE2_24","N",6,0);
	Файл.поля.Добавить("CODE2_25","N",6,0);
	Файл.поля.Добавить("CODE2_26","N",6,0);
	Файл.поля.Добавить("CODE2_50","N",6,0);
	Файл.поля.Добавить("CODE2_60","N",6,0);
	Файл.поля.Добавить("CODE2_70","N",6,0);
    Файл.поля.Добавить("NORM_F_1","N",10,4);
	Файл.поля.Добавить("NORM_F_2","N",10,4);
	Файл.поля.Добавить("NORM_F_3","N",10,4);
	Файл.поля.Добавить("NORM_F_4","N",10,4);
	Файл.поля.Добавить("NORM_F_5","N",10,4);
	Файл.поля.Добавить("NORM_F_6","N",10,4);
	Файл.поля.Добавить("NORM_F_7","N",10,4);
	Файл.поля.Добавить("NORM_F_8","N",10,4);
	Файл.поля.Добавить("OWN_NUM_SR","C",15,0);
	Файл.поля.Добавить("DAT1","D",8,0);
	Файл.поля.Добавить("DAT2","D",8,0);
	Файл.поля.Добавить("OZN_PRZ","N",1,0);
	Файл.поля.Добавить("DAT_F_1","D",8,0);
	Файл.поля.Добавить("DAT_F_2","D",8,0);
	Файл.поля.Добавить("DAT_FOP_1","D",8,0);
	Файл.поля.Добавить("DAT_FOP_2","D",8,0);
	Файл.поля.Добавить("ID_RAJ","C",5,0);
	Файл.поля.Добавить("SUR_NAM","C",30,0);
	Файл.поля.Добавить("F_NAM","C",15,0);
	Файл.поля.Добавить("M_NAM","C",20,0);
	Файл.поля.Добавить("IND_COD","C",10,0);
	Файл.поля.Добавить("INDX","C",6,0);
	Файл.поля.Добавить("N_NAME","C",30,0);
	Файл.поля.Добавить("VUL_NAME","C",30,0);
	Файл.поля.Добавить("BLD_NUM","C",7,0);
	Файл.поля.Добавить("CORP_NUM","C",2,0);
	Файл.поля.Добавить("FLAT","C",9,0);
	Файл.поля.Добавить("CODE3_1","N",10,0);
	Файл.поля.Добавить("CODE3_2","N",10,0);
	Файл.поля.Добавить("CODE3_3","N",10,0);
	Файл.поля.Добавить("CODE3_4","N",10,0);
	Файл.поля.Добавить("CODE3_5","N",10,0);
	Файл.поля.Добавить("CODE3_6","N",10,0);
	Файл.поля.Добавить("CODE3_7","N",10,0);
	Файл.поля.Добавить("CODE3_8","N",10,0);
	Файл.поля.Добавить("CODE3_17","N",10,0);
	Файл.поля.Добавить("CODE3_18","N",10,0);
	Файл.поля.Добавить("CODE3_19","N",10,0);
	Файл.поля.Добавить("CODE3_20","N",10,0);
	Файл.поля.Добавить("CODE3_21","N",10,0);
	Файл.поля.Добавить("CODE3_22","N",10,0);
	Файл.поля.Добавить("CODE3_23","N",10,0);
	Файл.поля.Добавить("CODE3_24","N",10,0);
	Файл.поля.Добавить("CODE3_25","N",10,0);
	Файл.поля.Добавить("CODE3_26","N",10,0);
	Файл.поля.Добавить("CODE3_50","N",10,0);
	Файл.поля.Добавить("CODE3_60","N",10,0);
	Файл.поля.Добавить("CODE3_70","N",10,0);
	Файл.поля.Добавить("OPP_SERV","C",8,0);
	Файл.поля.Добавить("RESERV1","N",10,0);
	Файл.поля.Добавить("RESERV2","C",10,0);
	Попытка
		Файл.СоздатьФайл(Объект.ФайлDBF);
	Исключение
		Предупреждение("Ошибка создания файла.");
	КонецПопытки;
	Для Каждого стр Из Объект.ТабличнаяЧасть Цикл
		Файл.Добавить();
		Файл.OWN_NUM         = стр.OWN_NUM;
		Файл.REE_NUM         = стр.REE_NUM;
		Файл.OPP             = стр.OPP;
		Файл.NUMB            = стр.NUMB;
		Файл.MARK            = стр.MARK;
		Файл.CODE            = стр.CODE;
		Файл.ENT_COD         = стр.ENT_COD;
		Файл.FROG            = стр.FROG;
		Файл.FL_PAY          = стр.FL_PAY;
		Файл.NM_PAY          = стр.NM_PAY;
		Файл.DEBT            = стр.DEBT;
		Файл.CODE2_1         = стр.CODE2_1;
		Файл.CODE2_2         = стр.CODE2_2;
		Файл.CODE2_3         = стр.CODE2_3;
		Файл.CODE2_4         = стр.CODE2_4;
		Файл.CODE2_5         = стр.CODE2_5;
		Файл.CODE2_6         = стр.CODE2_6;
		Файл.CODE2_7         = стр.CODE2_7;
		Файл.CODE2_8         = стр.CODE2_8;
		Файл.CODE2_17        = стр.CODE2_17;
		Файл.CODE2_18        = стр.CODE2_18;
		Файл.CODE2_19        = стр.CODE2_19;
		Файл.CODE2_20        = стр.CODE2_20;
		Файл.CODE2_21        = стр.CODE2_21;
		Файл.CODE2_22        = стр.CODE2_22;
		Файл.CODE2_23        = стр.CODE2_23;
		Файл.CODE2_24        = стр.CODE2_24;
		Файл.CODE2_25        = стр.CODE2_25;
		Файл.CODE2_26        = стр.CODE2_26;
		Файл.CODE2_50        = стр.CODE2_50;
		Файл.CODE2_60        = стр.CODE2_60;
		Файл.CODE2_70        = стр.CODE2_70;
		Файл.NORM_F_1        = стр.NORM_F_1;
		Файл.NORM_F_2        = стр.NORM_F_2;
		Файл.NORM_F_3        = стр.NORM_F_3;
		Файл.NORM_F_4        = стр.NORM_F_4;
		Файл.NORM_F_5        = стр.NORM_F_5;
		Файл.NORM_F_6        = стр.NORM_F_6;
		Файл.NORM_F_7        = стр.NORM_F_7;
		Файл.NORM_F_8        = стр.NORM_F_8;
		Файл.OWN_NUM_SR      = стр.OWN_NUM_SR;
		Файл.DAT1            = стр.DAT1;
		Файл.DAT2            = стр.DAT2;
		Файл.OZN_PRZ         = стр.OZN_PRZ;
		Файл.DAT_F_1         = стр.DAT_F_1;
		Файл.DAT_F_2         = стр.DAT_F_2;
		Файл.DAT_FOP_1       = стр.DAT_FOP_1;
		Файл.DAT_FOP_2       = стр.DAT_FOP_2;
		Файл.ID_RAJ          = стр.ID_RAJ;
		Файл.SUR_NAM         = стр.SUR_NAM;
		Файл.F_NAM           = стр.F_NAM;
		Файл.M_NAM           = стр.M_NAM;
		Файл.IND_COD         = стр.IND_COD;
		Файл.INDX            = стр.INDX;
		Файл.N_NAME          = стр.N_NAME;
		Файл.VUL_NAME        = стр.VUL_NAME;
		Файл.BLD_NUM         = стр.BLD_NUM;
		Файл.CORP_NUM        = стр.CORP_NUM;
		Файл.FLAT            = стр.FLAT;
		Файл.CODE3_1         = стр.CODE3_1;
		Файл.CODE3_2         = стр.CODE3_2;
		Файл.CODE3_3         = стр.CODE3_3;
		Файл.CODE3_4         = стр.CODE3_4;
		Файл.CODE3_5         = стр.CODE3_5;
		Файл.CODE3_6         = стр.CODE3_6;
		Файл.CODE3_7         = стр.CODE3_7;
		Файл.CODE3_8         = стр.CODE3_8;
		Файл.CODE3_17        = стр.CODE3_17;
		Файл.CODE3_18        = стр.CODE3_18;
		Файл.CODE3_19        = стр.CODE3_19;
		Файл.CODE3_20        = стр.CODE3_20;
		Файл.CODE3_21        = стр.CODE3_21;
		Файл.CODE3_22        = стр.CODE3_22;
		Файл.CODE3_23        = стр.CODE3_23;
		Файл.CODE3_24        = стр.CODE3_24;
		Файл.CODE3_25        = стр.CODE3_25;
		Файл.CODE3_26        = стр.CODE3_26;
		Файл.CODE3_50        = стр.CODE3_50;
		Файл.CODE3_60        = стр.CODE3_60;
		Файл.CODE3_70        = стр.CODE3_70;
		Файл.OPP_SERV        = стр.OPP_SERV;
		Файл.RESERV1         = стр.RESERV1;
		Файл.RESERV2         = стр.RESERV2;
		Файл.Записать();
	КонецЦикла;
	Файл.ЗакрытьФайл();
	Предупреждение("Файл " + Файл + " успішно створений.");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиНаСервере()
	тзТабЧасть = Объект.ТабличнаяЧасть.Выгрузить();
	Для Каждого стр Из тзТабЧасть Цикл
		ЛицСчет = Число(стр.OWN_NUM_SR);
		ЛС = ПолучитьЛицевыеСчета(СтрЗаменить(Строка(ЛицСчет), Символы.НПП, ""));
		стр.FROG     = ПолучитьПроцентЛьгот(ЛС);
		//стр.OPP      = ПризнакУслуг(ЛС);
		КубыСумма    = Начисления(ЛС, стр.DAT1);
		стр.FL_PAY   = КубыСумма.Сумма;
		стр.DEBT     = Долг(ЛС, стр.DAT1);
		стр.NORM_F_4 = КубыСумма.Вода;
		стр.NORM_F_8 = КубыСумма.Канализация;
		//стр.OWN_NUM_SR = ЛС;
	КонецЦикла;
	Объект.ТабличнаяЧасть.Загрузить(тзТабЧасть);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанными(Команда)
	ЗаполнитьДаннымиНаСервере();
КонецПроцедуры




////////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Функция ПолучитьЛицевыеСчета(ЛицевойСчет)
    Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК Ссылка
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(
	    |			&НаДату,
	    |			Действует = ИСТИНА
	    |				И ЛицевойСчет.Наименование = &Наименование) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Наименование", ЛицевойСчет);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛС = Выборка.Ссылка;
	КонецЦикла;
	Возврат ЛС;
КонецФункции

&НаСервере
Функция ПолучитьПроцентЛьгот(ЛС)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеЛьготыСрезПоследних.Льгота.ПроцентЛьготы КАК ПроцентЛьготы
	    |ИЗ
	    |	РегистрСведений.НазначенныеЛьготы.СрезПоследних(
	    |			&НаДату,
	    |			Действует = ИСТИНА
	    |				И ЛицевойСчет = &ЛС) КАК НазначенныеЛьготыСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ЛС", ЛС);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПроцентЛьготы = Выборка.ПроцентЛьготы;
	КонецЦикла;
	Возврат ПроцентЛьготы;
КонецФункции

&НаСервере
Функция ПризнакУслуг(ЛС)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.Услуга.ВидУслуги
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			Действует = ИСТИНА
	    |				И ЛицевойСчет = &ЛС) КАК НазначенныеУслугиСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ЛС", ЛС);
	Результат = Запрос.Выполнить().Выгрузить(); 
	Если Результат.Количество() = 1 Тогда
		Признак = "00001000";
		Возврат Признак;
	Иначе
		Признак = "10001000";
		Возврат Признак;
	КонецЕсли;
КонецФункции

&НаСервере
Функция Начисления(ЛС, ДатаЗапроса)
	Начисления = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	РасчетыПоЛицевымСчетам.Сумма,
	    |	РасчетыПоЛицевымСчетам.Количество,
	    |	РасчетыПоЛицевымСчетам.Услуга.ВидУслуги КАК ВидУслуги,
	    |	РасчетыПоЛицевымСчетам.Услуга
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	    |ГДЕ
	    |	РасчетыПоЛицевымСчетам.ВидДвижения = &ВидДвижения
	    |	И РасчетыПоЛицевымСчетам.МесяцНачисления = &МесяцНачисления
	    |	И РасчетыПоЛицевымСчетам.ЛицевойСчет = &ЛицевойСчет
	    |	И РасчетыПоЛицевымСчетам.Период = &Период";
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Период", ДобавитьМесяц(КонецМесяца(ДатаЗапроса), -1));
	Запрос.УстановитьПараметр("МесяцНачисления", ДобавитьМесяц(НачалоМесяца(ДатаЗапроса), -1));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Канализация = 0;
	Вода = 0;
	Сумма = 0;
	АбонПлата = 0;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидУслуги = Справочники.ВидыУслуг.Водоотведение Тогда
			Канализация = Канализация + Выборка.Количество;
			Сумма = Сумма + Выборка.Сумма;
		ИначеЕсли Выборка.ВидУслуги = Справочники.ВидыУслуг.ХолоднаяВода Тогда
			Вода = Вода + Выборка.Количество;
			Сумма = Сумма + Выборка.Сумма;
		ИначеЕсли Выборка.Услуга.ВидУслуги = Справочники.ВидыУслуг.Дополнительные И Выборка.Услуга.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоРасчетнымЗначениям Тогда//Справочники.Услуги.НайтиПоКоду("Р00000182") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000184") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000185") ИЛИ Выборка.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000186") Тогда
			АбонПлата = АбонПлата + Выборка.Сумма;
			Сумма = Сумма + Выборка.Сумма;
		КонецЕсли;
	КонецЦикла;
	Начисления.Вставить("Канализация", Канализация);
	Начисления.Вставить("Вода", Вода);
	Начисления.Вставить("Сумма", Сумма);
	Начисления.Вставить("АбонПлата", АбонПлата);
	Возврат Начисления;
КонецФункции

&НаСервере
Функция Долг(ЛС, ДатаЗапроса)
	// Запрос по оплате
		Запрос = Новый Запрос;
		Запрос.Текст = 
		    "ВЫБРАТЬ
		    |	РасчетыПоЛицевымСчетамОбороты.СуммаРасход
		    |ИЗ
		    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(&НачалоПериода, &КонецПериода, Авто, ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОбороты";
		Запрос.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоМесяца(ДатаЗапроса), -1));
		Запрос.УстановитьПараметр("КонецПериода", ДобавитьМесяц(КонецМесяца(ДатаЗапроса), -1));
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Оплата = 0;
		Пока Выборка.Следующий() Цикл
			Оплата = Оплата + Выборка.СуммаРасход;
		КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток,
	    |	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления,
	    |	РасчетыПоЛицевымСчетамОстатки.Услуга
	    |ИЗ
	    |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(&НачалоПериода, ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстатки";
	
	
	Запрос.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоМесяца(ДатаЗапроса), -1));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	Результат = Запрос.Выполнить().Выгрузить();
	Долг = Результат.Итог("СуммаОстаток");
	СуммаДолга = Долг - Оплата;
	Если СуммаДолга < 0 Тогда
		СуммаДолга = 0;
	КонецЕсли;

	Возврат СуммаДолга;
КонецФункции