&НаКлиенте
Процедура СформироватьПредставление()
	Объект.НаименованиеПолное = "";
	Если Объект.ИндексГорода <> "" Тогда
		Объект.НаименованиеПолное = Объект.ИндексГорода + ", ";
	КонецЕсли;
	Если Объект.Область <> "" Тогда
		Объект.НаименованиеПолное = Объект.НаименованиеПолное + Объект.Область;
	КонецЕсли;
	Если Объект.Район <> "" Тогда
		Объект.НаименованиеПолное = Объект.НаименованиеПолное + ", " + Объект.Район;
	КонецЕсли;
	Если Объект.Город <> "" Тогда
		Объект.НаименованиеПолное = Объект.НаименованиеПолное + ", " + Объект.Город;
	КонецЕсли;
	Если Объект.НаселенныйПункт <> "" Тогда
		Объект.НаименованиеПолное = Объект.НаименованиеПолное + ", " + Объект.НаселенныйПункт;
	КонецЕсли;
	Если Объект.НазваниеУлицы <> "" Тогда
		Объект.НаименованиеПолное = Объект.НаименованиеПолное + ", " + Объект.НазваниеУлицы;
	КонецЕсли;
	Объект.Наименование = Объект.НаименованиеПолное;
КонецПроцедуры

&НаКлиенте
Процедура ОбластьПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ГородПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура НаселенныйПунктПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура НазваниеУлицыПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ИндексПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры
