//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ   
//

// Процедура - обработчик события формы "ПриЗагрузкеДанныхИзНастроекНаСервере".
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОтборОрганизация	 		= Настройки.Получить("ОтборОрганизация");
	ОтборЗдание		 			= Настройки.Получить("ОтборЗдание");
	ОтборПодъезд	 			= Настройки.Получить("ОтборПодъезд");
	ОтборОтветственныйВладелец	= Настройки.Получить("ОтборОтветственныйВладелец");
	ОтборЖилойФонд				= Настройки.Получить("ОтборЖилойФонд");
	ОтборУслуга					= Настройки.Получить("ОтборУслуга");
	
	УстановитьСвязиПараметровВыбора();
	
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Здание",				ОтборЗдание,				ЗначениеЗаполнено(ОтборЗдание));
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Организация",			ОтборОрганизация,			ЗначениеЗаполнено(ОтборОрганизация));
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Подъезд",				ОтборПодъезд,				ЗначениеЗаполнено(ОтборПодъезд));
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ОтветственныйВладелец",	ОтборОтветственныйВладелец,	ЗначениеЗаполнено(ОтборОтветственныйВладелец));
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ЖилойФонд",				ОтборЖилойФонд,				ЗначениеЗаполнено(ОтборЖилойФонд));
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Услуга",				ОтборУслуга,				ЗначениеЗаполнено(ОтборУслуга));
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СозданПриборУчета" Тогда
		ОтобразитьИзменениеДанных(Параметр, ВидИзмененияДанных.Добавление);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор()
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Здание", ОтборЗдание, ЗначениеЗаполнено(ОтборЗдание));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Подъезд", ОтборПодъезд, ЗначениеЗаполнено(ОтборПодъезд));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗданиеПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодъездПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Подъезд", ОтборПодъезд, ЗначениеЗаполнено(ОтборПодъезд));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветсвенныйВладелецПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ОтветственныйВладелец", ОтборОтветственныйВладелец, ЗначениеЗаполнено(ОтборОтветственныйВладелец));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЖилойФондПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ЖилойФонд", ОтборЖилойФонд, ЗначениеЗаполнено(ОтборЖилойФонд));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборУслугаПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Услуга", ОтборУслуга, ЗначениеЗаполнено(ОтборУслуга));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбора()
	
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Организация", "ОтборОрганизация", РежимИзмененияСвязанногоЗначения.НеИзменять);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		Элементы.ОтборЗдание.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
		Если ОтборЗдание.Организация <> ОтборОрганизация Тогда
			ОтборЗдание = Справочники.ЗданияИСооружения.ПустаяСсылка();
			ОтборПодъезд = Справочники.Подъезды.ПустаяСсылка();
		КонецЕсли;
	Иначе		
		Элементы.ОтборЗдание.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив());
	КонецЕсли;

КонецПроцедуры	



