Функция GetData(ИдентификаторУстройства, ИдентификаторПланаОбмена, НомерОтправленного, НомерПринятого, ВерсияПриложения)
	
	// Возвращаемое значение
	СтруктураОтвета = Новый Структура("Отказ, ИнформацияОбОшибке, Данные");
	СтруктураОтвета.Отказ = Ложь;
	СтруктураОтвета.ИнформацияОбОшибке = "";
	
	УзелУстройства = ОбменДаннымиМобПриложениеСервер.ПолучитьУзелУстройства(СтруктураОтвета, ИдентификаторУстройства, ИдентификаторПланаОбмена);
	
	Если СтруктураОтвета.Отказ Тогда
		Возврат ПоместитьВХранилище(СтруктураОтвета);
	КонецЕсли;
	
	ОбменДаннымиМобПриложениеСервер.РазрешитьОбмен(СтруктураОтвета, УзелУстройства, ВерсияПриложения);
	
	Если СтруктураОтвета.Отказ Тогда
		Возврат ПоместитьВХранилище(СтруктураОтвета);
	КонецЕсли;
	
	ОбработкаОбъект = Обработки.УниверсальныйОбменДаннымиXDTO.Создать();
	ОбработкаОбъект.УзелОбмена = УзелУстройства;
	Попытка
		СтруктураОтветаОбработки = ОбработкаОбъект.СформироватьПакетОбмена();
	Исключение                                                                         	
		СтруктураОтвета.Отказ = Истина;
		СтруктураОтвета.ИнформацияОбОшибке = "Ошибка на стороне сервера при отправке данных: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат ПоместитьВХранилище(СтруктураОтвета);
	КонецПопытки;
	
	ЗаполнитьЗначенияСвойств(СтруктураОтвета, СтруктураОтветаОбработки);
	
	Возврат ПоместитьВХранилище(СтруктураОтвета);
	
КонецФункции

Функция SendData(ИдентификаторУстройства, ИдентификаторПланаОбмена, НомерОтправленного, НомерПринятого, ВерсияПриложения, ДанныеОбмена, ДатаУстройства)
	
	// Возвращаемое значение
	СтруктураОтвета = Новый Структура("Отказ, ИнформацияОбОшибке, Данные");
	СтруктураОтвета.Отказ = Ложь;
	СтруктураОтвета.ИнформацияОбОшибке = "";
	
	УзелУстройства = ОбменДаннымиМобПриложениеСервер.ПолучитьУзелУстройства(СтруктураОтвета, ИдентификаторУстройства, ИдентификаторПланаОбмена);
	
	Если СтруктураОтвета.Отказ Тогда
		Возврат ПоместитьВХранилище(СтруктураОтвета);
	КонецЕсли;
	
	ОбменДаннымиМобПриложениеСервер.РазрешитьОбмен(СтруктураОтвета, УзелУстройства, ВерсияПриложения);
	
	Если СтруктураОтвета.Отказ Тогда
		Возврат ПоместитьВХранилище(СтруктураОтвета);
	КонецЕсли;
	
	Если УзелУстройства.НомерОтправленного < НомерПринятого
		ИЛИ УзелУстройства.НомерПринятого > НомерОтправленного Тогда
		
		Узел = УзелУстройства.ПолучитьОбъект();
		Узел.НомерОтправленного = НомерПринятого;
		Узел.НомерПринятого = НомерОтправленного;
		Узел.Записать();
		
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелУстройства);
		ПланыОбмена.ЗарегистрироватьИзменения(УзелУстройства);
		
	КонецЕсли;
	
	Попытка
		ДанныеОбмена = ДанныеОбмена.Получить();
	Исключение
		СтруктураОтвета.Отказ = Истина;
		СтруктураОтвета.ИнформацияОбОшибке = "Ошибка на сервере при получении данных: не удалось распаковать полученное сообщение.";
		Возврат ПоместитьВХранилище(СтруктураОтвета);
	КонецПопытки;
	
	ОбработкаОбъект = Обработки.УниверсальныйОбменДаннымиXDTO.Создать();
	ОбработкаОбъект.УзелОбмена = УзелУстройства;
	Попытка
		СтруктураОтветаОбработки = ОбработкаОбъект.ПринятьПакетОбмена(ДанныеОбмена);
	Исключение
		СтруктураОтвета.Отказ = Истина;
		СтруктураОтвета.ИнформацияОбОшибке = "Ошибка на стороне сервера при получении данных: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат ПоместитьВХранилище(СтруктураОтвета);
	КонецПопытки;
	
	ЗаполнитьЗначенияСвойств(СтруктураОтвета, СтруктураОтветаОбработки);
	
	Возврат ПоместитьВХранилище(СтруктураОтвета);
	
КонецФункции

Функция Register(ОдноразовыйПароль, ИнформацияОбУстройствеXDTO)
	
	// Возвращаемое значение
	СтруктураОтвета = Новый Структура("Отказ, ИнформацияОбОшибке, Данные");
	СтруктураОтвета.Отказ = Ложь;
	СтруктураОтвета.ИнформацияОбОшибке = "";
	
	// 1. Проверим полученный одноразовый пароль
	ОбменДаннымиМобПриложениеСервер.ПроверитьОдноразовыйПароль(СтруктураОтвета, ОдноразовыйПароль);
	
	Если СтруктураОтвета.Отказ Тогда
		Возврат ПоместитьВХранилище(СтруктураОтвета);
	КонецЕсли;
	
	// 2. Пароль подошел, создадим менеджер записи, чтобы получить информацию о владельце и потом аннулировать пароль
	Менеджер = РегистрыСведений.ОдноразовыеПароли.СоздатьМенеджерЗаписи();
	Менеджер.ОдноразовыйПароль 	= ОдноразовыйПароль;
	Менеджер.Прочитать();
	
	ВладелецУстройства = Менеджер.ФизическоеЛицо;
	
	// 3. Получим информацию об устройстве
	Попытка
		ИнформацияОбУстройстве = СериализаторXDTO.ПрочитатьXDTO(ИнформацияОбУстройствеXDTO);
	Исключение
		СтруктураОтвета.Отказ = Истина;
		СтруктураОтвета.ИнформацияОбОшибке = "Возникла непредвиденная ошибка на сервере при регистрации устройства (не удалось получить информацию об устройстве). Обратитесь к администратору.";
		Возврат ПоместитьВХранилище(СтруктураОтвета);
	КонецПопытки;
	
	// 3. Создаем узел обмена
	ПланОбменаСсылка = ОбменДаннымиМобПриложениеСервер.СоздатьПланОбменаДляМобильногоУстройства(СтруктураОтвета, ИнформацияОбУстройстве, ВладелецУстройства);
	Если ПланОбменаСсылка = Неопределено Тогда
		Возврат ПоместитьВХранилище(СтруктураОтвета);
	КонецЕсли;
	
	// 4. Формируем пакет отправляемых данных
	Данные = Новый Структура;
	Данные.Вставить("ИдентификаторПланаОбмена", Строка(ПланОбменаСсылка.УникальныйИдентификатор()));
	Данные.Вставить("КодЦБ", ПланыОбмена.ОбменСМобильнымиУстройствами.ЭтотУзел().Код);
	Данные.Вставить("КодМУ", ПланОбменаСсылка.Код);
	Данные.Вставить("ВладелецУстройства", Строка(ВладелецУстройства));
	
	СтруктураОтвета.Данные = Данные;
	
	// 5. Удаляем одноразовый пароль
	Менеджер.Удалить();
	
	Возврат ПоместитьВХранилище(СтруктураОтвета);
	
КонецФункции

Функция ПоместитьВХранилище(Данные)
	
	Возврат Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9));
	
КонецФункции

