
&НаКлиенте
Процедура НоваяРегистрация(Команда)
	
	ОткрытьФорму("Документ.УправлениеСоставомЖильцов.Форма.ФормаДокумента");

КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаявления(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ЗаявлениеОРегистрации", Неопределено, Неопределено, Неопределено);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТалона(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ТалонПрибытия", Неопределено, Неопределено, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятиеСрегистрации(Команда)
	ОткрытьФорму("Документ.УправлениеСоставомЖильцов.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТалонаУбытия(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ТалонУбытия", Неопределено, Неопределено, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СправкаОСоставеСемьи(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "СправкаОСоставеСемьи", Неопределено, Неопределено, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СправкаОПрописке(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "СправкаОПрописке", Неопределено, Неопределено, Неопределено);	
КонецПроцедуры

&НаКлиенте
Процедура ФормаА1(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ФормаА1", Неопределено, Неопределено, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СменитьРабочийСтол(Команда)
	ОткрытьФорму("Обработка.УправлениеРабочимСтолом.Форма.Форма");
КонецПроцедуры
