
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МакетДокумента = Обработки.ЗаявлениеОКонфиденциальности.ПолучитьМакет("Макет");
	Текст = МакетДокумента.ПолучитьТекст();
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЛичнойИнформации;
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
  
	
	Если ОбменДаннымиТехПоддержка.ОтправитьЗапросНаРегистрацию(Организация,ФИО,Должность,Город,Email,РегистрационныйНомер,НомерТелефона) Тогда
		Текст = НСтр("ru = 'Данные успешно получены. Благодарим за внимание!'; uk = 'Дані успішно отримані. Дякуємо за увагу!'");	 
	Иначе
		Текст = НСтр("ru = 'Данные не отправлены. Возможно проблемы со связью. Повторите попытку позже.'; uk = 'Дані не відправлені. Можливо проблеми із зв''язком. Спробуйте ще раз пізніше.'");		

	КонецЕсли;
	
	#Если НЕ ВебКлиент Тогда
	Ответ = Вопрос(Текст,РежимДиалогаВопрос.ОК);
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		Закрыть();
	КонецЕсли;	
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыЗаполнения = УчетКоммунальныхУслуг.ПолучитьНастрокиСлужбыПоддержки();
	
	Если ТипЗнч(ПараметрыЗаполнения) = Тип("Структура") Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЛичнойИнформации;
		ЭтаФорма.Заголовок = Нстр("ru = 'Убедитесь что личные данные верны'; uk = 'Переконайтеся що особисті дані вірні'");
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ПараметрыЗаполнения);
	Иначе	
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТекста;
		ЭтаФорма.Заголовок = Нстр("ru = 'Заполните данные для регистрации в службе поддержки'; uk = 'Заповніть дані для реєстрації в службі підтримки'");
	КонецЕсли;	

КонецПроцедуры
