////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//Для Каждого стр Из ПриборыУчета Цикл
	//	НаборЗаписей = РегистрыСведений.ПоказанияПУИзВнешнихИсточников.СоздатьМенеджерЗаписи();
	//	НаборЗаписей.Период = ПериодНачисления;
	//	НаборЗаписей.ВидТарифа = стр.ВидТарифа;
	//	Если НЕ ЗначениеЗаполнено(стр.ТекущиеПоказания) Тогда
	//		НаборЗаписей.Значение = стр.ПредыдущиеПоказания;
	//	Иначе
	//	    НаборЗаписей.Значение  = стр.ТекущиеПоказания;
	//	КонецЕсли;
	//	НаборЗаписей.Источник  = стр.Источник;
	//	НаборЗаписей.ПриборУчета = стр.ПриборУчета;
	//	НаборЗаписей.Записать(Истина);
	//КонецЦикла;

		ТипИсточника = Перечисления.ИсточникиПоказаний.РучнаяОперация;
	
	
	ТабЗаполнения = ПриборыУчета.Выгрузить().Скопировать();
	МассивСтрокУдаления = Новый Массив;
	Для каждого Строка Из ТабЗаполнения  Цикл
	   Если ТипЗнч(Строка.ПриборУчета) = Тип("Строка") тогда
			МассивСтрокУдаления.Добавить(Строка);
		КонецЕсли;	
	
	КонецЦикла; 
	
	
	Для каждого НайденнаяСтрока Из МассивСтрокУдаления Цикл
			ТабЗаполнения.Удалить(НайденнаяСтрока);
	КонецЦикла;
		

	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТЗ",ТабЗаполнения);
	

	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.ПриборУчета,
	               |	ТЗ.ВидТарифа,
	               |	ТЗ.ТекущиеПоказания
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ВТ.ТекущиеПоказания) КАК ПоказаниеТекущее,
	               |	ВТ.ВидТарифа,
	               |	ВТ.ПриборУчета
	               |ИЗ
	               |	ВТ КАК ВТ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.ПриборУчета,
	               |	ВТ.ВидТарифа";
	ТЗ_ТаблицаПоказаний = Запрос.Выполнить().Выгрузить();
	
	
	Если ПриборыУчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.ПоказанияПУИзВнешнихИсточников.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Период.Установить(Дата);
	ТаблицаПриборыУчета = НаборЗаписей.Выгрузить(,);
	
	Для каждого Строка Из ТЗ_ТаблицаПоказаний  Цикл
		
		Если Строка.ПоказаниеТекущее = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если Строка.ПриборУчета = Справочники.ПриборыУчета.ПустаяСсылка()  тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтрока = ТаблицаПриборыУчета.Добавить();
	    НоваяСтрока.Период = Дата;
		НоваяСтрока.ПриборУчета = Строка.ПриборУчета;
		НоваяСтрока.ВидТарифа = Строка.ВидТарифа;
		НоваяСтрока.Значение = Строка.ПоказаниеТекущее;
		НоваяСтрока.Источник = ТипИсточника;
	КонецЦикла; 
	ТаблицаПриборыУчета.Сортировать("ПриборУчета");
	НаборЗаписей.Загрузить(ТаблицаПриборыУчета);
	НаборЗаписей.Записать(Ложь);
	
	// регістр РасчетПоказанийПриборовОтопление Приход
	Движения.РасчетПоказанийПриборовОтопление.Записывать = Истина;
	Для Каждого ТекСтрокаПриборыУчета Из ПриборыУчета Цикл
		Движение = Движения.РасчетПоказанийПриборовОтопление.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ОбъектУстановки = ЛицевойСчет;
		Движение.ПриборУчета = ТекСтрокаПриборыУчета.ПриборУчета;
		Движение.Услуга = Услуга;
		Движение.ВидТарифа = ТекСтрокаПриборыУчета.ВидТарифа;
		Движение.Значение = ТекСтрокаПриборыУчета.КвоКубов;
	КонецЦикла;
	
	// Регістр відомостей ПоказанияПриборовУчета

	НаборЗаписей = РегистрыСведений.ПоказанияПриборовУчета.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);

	ТаблицаПриборыУчета = НаборЗаписей.Выгрузить(,);
	
	Для каждого Строка Из ТЗ_ТаблицаПоказаний  Цикл
		
		Если Строка.ПоказаниеТекущее = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если Строка.ПриборУчета = Справочники.ПриборыУчета.ПустаяСсылка()  тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтрока = ТаблицаПриборыУчета.Добавить();
	    НоваяСтрока.Период = Дата;
		НоваяСтрока.ПриборУчета = Строка.ПриборУчета;
		НоваяСтрока.ВидТарифа = Строка.ВидТарифа;
		НоваяСтрока.Значение = Строка.ПоказаниеТекущее;
		НоваяСтрока.Отключен = Ложь;
		НоваяСтрока.Регистратор = ЭтотОбъект.Ссылка;
		НоваяСтрока.Источник = Перечисления.ИсточникиПоказаний.Оператор;
		НоваяСтрока.Активность = Истина;
	КонецЦикла; 
	ТаблицаПриборыУчета.Сортировать("ПриборУчета");
	НаборЗаписей.Загрузить(ТаблицаПриборыУчета);
	НаборЗаписей.Записать(Ложь);
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	//ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	//
	// Подготовка наборов записей
	//ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	//
	// Запись наборов записей
	//ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	Для Каждого стр Из ПриборыУчета Цикл
		НаборЗаписей = РегистрыСведений.ПоказанияПУИзВнешнихИсточников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПриборУчета.Установить(стр.ПриборУчета);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры
