////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.НачислениеПоЛС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ПроведениеСервер.ОтразитьГарантированныеНачисленияСубсидий(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьРасчетыПоЛицевымСчетам(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьРасшифровкаНачисленияЛьгот(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьВзаиморасчетыПоСубсидиям(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьВзаиморасчетыПоЛьготам(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьРегиональныеНачисленияСубсидий(ДополнительныеСвойства, Движения, Отказ);
    ПроведениеСервер.ОтразитьВзаиморасчетыПоРегиональнымСубсидиям(ДополнительныеСвойства, Движения, Отказ);
	
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.НачислениеПоЛС.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	Документы.НачислениеПоЛС.ВыполнитьКонтрольПовторногоНачисления(Ссылка, ДополнительныеСвойства, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.НачислениеПоЛС.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Услуги.Итог("СуммаНачислено");
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ДЛЯ РАСЧЕТА ИЗ ОБРАБОТКИ

Процедура ЗаполнитьАвтоматическиНаСервере() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛицевыеСчета.ЛицевойСчет,
		|	ЛицевыеСчета.ЛицевойСчет.ОбъектЛицевогоСчета.Код КАК ЛицевойСчетОбъектЛицевогоСчетаКод
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета КАК ЛицевыеСчета
		|ГДЕ
		|	ЛицевыеСчета.Период >= &ДатаНач
		|	И ЛицевыеСчета.Период <= &ДатаКон
		|	И ЛицевыеСчета.ЛицевойСчет.Владелец = &Здание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет,
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета.Код
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета.СрезПоследних(
		|			&ДатаНач,
		|			ЛицевойСчет.Владелец = &Здание
		|				И Действует) КАК ЛицевыеСчетаСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчетОбъектЛицевогоСчетаКод";
		
		
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("Здание", Здание);
	
	ТаблицаДляЗагрузки	= Запрос.Выполнить().Выгрузить();
	
	Услуги.Загрузить(ТаблицаДляЗагрузки);
	
	РассчитатьСуммыНачислений();	
	
КонецПроцедуры

// Процедура - рассчитывает суммы начислений.
//
Процедура РассчитатьСуммыНачислений(ЛицевойСчет = Неопределено)
СтруктураДляРасчета = Новый Структура;
	
	Если ЛицевойСчет = Неопределено Тогда
		
		ТаблицаЛицевыхСчетов = Услуги.Выгрузить();
		ТаблицаЛицевыхСчетов.Свернуть("ЛицевойСчет",);
		СтруктураДляРасчета.Вставить("ЛицевыеСчета", ТаблицаЛицевыхСчетов.ВыгрузитьКолонку("ЛицевойСчет")); 
		
	Иначе
		МассивЛицевыхСчетов = Новый Массив();
		МассивЛицевыхСчетов.Добавить(ЛицевойСчет);
		СтруктураДляРасчета.Вставить("ЛицевыеСчета", МассивЛицевыхСчетов); 
		
	КонецЕсли;
	
	СтруктураДляРасчета.Вставить("ПериодНачисления", ПериодНачисления);
	СтруктураДляРасчета.Вставить("Услуга", Справочники.Услуги.ПустаяСсылка()); 
	
	СтруктураДляРасчета = УчетКоммунальныхУслуг.РассчитатьСуммыНачислений(СтруктураДляРасчета);
	
	Если СтруктураДляРасчета = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаУслуг = СтруктураДляРасчета.НоваяТаблицаУслуг;
	ТаблицаЛьгот = СтруктураДляРасчета.НоваяТаблицаЛьгот.Скопировать();
	
	ДнейВМесяце = День(КонецМесяца(ПериодНачисления));
	
	
	
	Если СтруктураДляРасчета.ЛицевыеСчета.Количество() > 1 Тогда
		Услуги.Загрузить(ТаблицаУслуг);
		Льготы.Загрузить(ТаблицаЛьгот);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЛьгот.ДатаКонПериодаНазначения,
		|	ТаблицаЛьгот.ДатаНачПериодаНазначения,
		|	ТаблицаЛьгот.ДнейНачислено,
		|	ТаблицаЛьгот.Количество,
		|	ТаблицаЛьгот.КоличествоРесурса,
		|	ТаблицаЛьгот.КоличествоЧленовСемьи,
		|	ТаблицаЛьгот.ЛицевойСчет,
		|	ТаблицаЛьгот.Льгота,
		|	ТаблицаЛьгот.ПотребительУслуг,
		|	ТаблицаЛьгот.ПроцентЛьготы,
		|	ТаблицаЛьгот.СтимулирующийТариф,
		|	ТаблицаЛьгот.СуммаЛьготы,
		|	ТаблицаЛьгот.Тариф,
		|	ТаблицаЛьгот.ТарифЛьгота,
		|	ТаблицаЛьгот.Услуга
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаЛьгот КАК ТаблицаЛьгот
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ.ДатаКонПериодаНазначения) КАК ДатаКонПериодаНазначения,
		|	МИНИМУМ(ВТ.ДатаНачПериодаНазначения) КАК ДатаНачПериодаНазначения,
		|	СУММА(ВТ.ДнейНачислено) КАК ДнейНачислено,
		|	СУММА(ВТ.КоличествоРесурса) КАК КоличествоРесурса,
		|	ВТ.КоличествоЧленовСемьи,
		|	ВТ.ЛицевойСчет КАК ЛицевойСчет,
		|	ВТ.Льгота,
		|	ВТ.ПотребительУслуг,
		|	ВТ.ПроцентЛьготы,
		|	ВТ.Тариф,
		|	ВТ.Услуга КАК Услуга,
		|	СУММА(ВТ.Количество) КАК Количество,
		|	ВТ.СтимулирующийТариф,
		|	СУММА(ВТ.СуммаЛьготы) КАК СуммаЛьготы,
		|	ВТ.ТарифЛьгота
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.ТарифЛьгота,
		|	ВТ.СтимулирующийТариф,
		|	ВТ.КоличествоЧленовСемьи,
		|	ВТ.Услуга,
		|	ВТ.ЛицевойСчет,
		|	ВТ.Льгота,
		|	ВТ.ПотребительУслуг,
		|	ВТ.ПроцентЛьготы,
		|	ВТ.Тариф
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет,
		|	Услуга,
		|	ДатаКонПериодаНазначения";
		
		Запрос.УстановитьПараметр("ТаблицаЛьгот",ТаблицаЛьгот);
		
		ТАбЛьготДляПоиска = Запрос.Выполнить().Выгрузить();
		
		
		Для каждого СтрокаТаблицыУслуг  Из Услуги Цикл
			
			Если СтрокаТаблицыУслуг.ВидНачисления = Перечисления.ВидыНачислений.Льгота Тогда
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("ЛицевойСчет",СтрокаТаблицыУслуг.ЛицевойСчет);
				СтруктураПоиска.Вставить("Услуга",СтрокаТаблицыУслуг.Услуга);
				СтруктураПоиска.Вставить("ДатаНачПериодаНазначения",СтрокаТаблицыУслуг.ДатаНачПериодаНазначения);
				СтруктураПоиска.Вставить("ДатаКонПериодаНазначения",КонецДня(СтрокаТаблицыУслуг.ДатаКонПериодаНазначения));
				СтруктураПоиска.Вставить("ПотребительУслуг",СтрокаТаблицыУслуг.ПотребительУслуг);
				НайденнаяСтрока = ТАбЛьготДляПоиска.найтиСтроки(СтруктураПоиска);
				Если НайденнаяСтрока.Количество() <> 0 Тогда
					//Если НайденнаяСтрока[0].ДнейНачислено <> ДнейВМесяце Тогда
						СтрокаТаблицыУслуг.СуммаНачислено =  НайденнаяСтрока[0].СуммаЛьготы;
						СтрокаТаблицыУслуг.Количество =  НайденнаяСтрока[0].Количество;
					//КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
		
		КонецЦикла; 
		
		
		
	ИначеЕсли СтруктураДляРасчета.ЛицевыеСчета.Количество() = 1 Тогда	
		
		МассивСтрок = Услуги.НайтиСтроки(Новый Структура("ЛицевойСчет", СтруктураДляРасчета.ЛицевыеСчета[0]));
		Для каждого НайденнаяСтрока Из МассивСтрок Цикл
			Услуги.Удалить(НайденнаяСтрока);
		КонецЦикла;
		
		Для каждого СтрокаТаблицыУслуг Из ТаблицаУслуг Цикл
			НоваяСтрока = Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыУслуг);
			Если СтрокаТаблицыУслуг.ВидНачисления = Перечисления.ВидыНачислений.Льгота Тогда
			    СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("ЛицевойСчет",СтрокаТаблицыУслуг.ЛицевойСчет);
				СтруктураПоиска.Вставить("Услуга",СтрокаТаблицыУслуг.Услуга);
				СтруктураПоиска.Вставить("ДатаНачПериодаНазначения",СтрокаТаблицыУслуг.ДатаНачПериодаНазначения);
				СтруктураПоиска.Вставить("ДатаКонПериодаНазначения",СтрокаТаблицыУслуг.ДатаКонПериодаНазначения);
				СтруктураПоиска.Вставить("ПотребительУслуг",СтрокаТаблицыУслуг.ПотребительУслуг);
				НайденнаяСтрока = ТаблицаЛьгот.найтиСтроки(СтруктураПоиска);
				Если НайденнаяСтрока.Количество() <> 0 Тогда
					НоваяСтрока.СуммаНачислено =  НайденнаяСтрока[0].СуммаЛьготы;
					НоваяСтрока.Количество =  НайденнаяСтрока[0].Количество;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла; 
		
		МассивСтрок = Льготы.НайтиСтроки(Новый Структура("ЛицевойСчет", СтруктураДляРасчета.ЛицевыеСчета[0]));
		Для каждого НайденнаяСтрока Из МассивСтрок Цикл
			Льготы.Удалить(НайденнаяСтрока);
		КонецЦикла;
		
		Для каждого СтрокаТаблицыЛьгот Из ТаблицаЛьгот Цикл
			
			НоваяСтрока = Льготы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыЛьгот);
		
		КонецЦикла; 
		
	КонецЕсли; 
	
	СуммаДокумента = Услуги.Итог("СуммаНачислено");
	
КонецПроцедуры // РассчитатьСуммыНачислений()
