////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
// Процедура устанавливает видимость реквизитов формы.
//
// Параметры:
//  Нет.
//
Процедура УстановитьВидимостьРеквизитов()
	
	Если Объект.ЮрФизЛицо = ЮрЛицо Тогда
		Элементы.ФизЛицо.Видимость = Ложь;
		Элементы.ЮрЛицо.Видимость = Истина;
	Иначе
		Элементы.ФизЛицо.Видимость = Истина;
		Элементы.ЮрЛицо.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьРеквизитов()



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура обработчик события ПриСозданииНаСервере.
// Осуществляет первоначальное заполнение реквизитов формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЮрЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ВариантЗаполненияНовый = Истина;
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		Элементы.Физлицо.Видимость = Ложь;
		Элементы.ЛичныеДанные.Видимость = Истина;
		Элементы.Наименование.Доступность = Ложь;
		
	Иначе
		
		ВариантЗаполненияНовый = Ложь;
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		Элементы.Физлицо.Видимость = Истина;
		Элементы.ЛичныеДанные.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
// Процедура обработчик события ПередЗаписьюНаСервере.
// Осуществляет первоначальное заполнение реквизитов формы.
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ВариантЗаполненияНовый И НЕ ТекущийОбъект.ЮрФизЛицо = ЮрЛицо И НЕ ЗначениеЗаполнено(ТекущийОбъект.Физлицо) Тогда
	
		ФизЛицоОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
		ФизЛицоОбъект.Наименование = ТекущийОбъект.Наименование;
		ФизЛицоОбъект.ДатаРождения = ДатаРождения;
		ФизЛицоОбъект.Пол = Пол;
		ФизЛицоОбъект.ИНН = ИНН;
		ФизЛицоОбъект.МестоРождения = МестоРождения;
		
		ФизЛицоОбъект.Записать();
		
		ТекущийОбъект.ФизЛицо = ФизЛицоОбъект.Ссылка;		
	
	КонецЕсли; 
	
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Пароль) Тогда
		ТекущийОбъект.Пароль = ПРАВ(ТекущийОбъект.Код,5);
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Логин) Тогда
		ТекущийОбъект.Логин = ПРАВ(ТекущийОбъект.Код,5);
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик события ПослеЗаписи.
// Осуществляет первоначальное заполнение реквизитов формы.
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Элементы.ЛичныеДанные.ТолькоПросмотр = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ЮрФизЛицо = ЮрЛицо Тогда
		Объект.Наименование = Объект.ЮрЛицо;	
	ИначеЕсли ЗначениеЗаполнено(Объект.ФизЛицо) Тогда
		Объект.Наименование = Объект.ФизЛицо;	
	Иначе
		Объект.Наименование = Фамилия + " " + Имя + " " + Отчество;	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьРеквизитов();	
КонецПроцедуры


&НаКлиенте
Процедура ЮрФизЛицоПриИзменении(Элемент)
	
	УстановитьВидимостьРеквизитов();	
	
КонецПроцедуры

