
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРасчетПоказанийПриборовУчета(ДокументСсылкаКорректировкаПоказанийПриборовУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Период,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ОбъектУстановки КАК ОбъектУстановки,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Услуга КАК Услуга,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ВидТарифа КАК ВидТарифа,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПоказаниеПредыдущее,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Показание,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПоказаниеПредыдущееНовое,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПоказаниеНовое,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПоказаниеНовое - ВременнаяТаблицаПоказанияПриборовУчета.ПоказаниеПредыдущееНовое - (ВременнаяТаблицаПоказанияПриборовУчета.Показание - ВременнаяТаблицаПоказанияПриборовУчета.ПоказаниеПредыдущее) КАК Значение
		|ИЗ
		|	ВременнаяТаблицаПоказанияПриборовУчета КАК ВременнаяТаблицаПоказанияПриборовУчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ВременнаяТаблицаПоказанияПриборовУчета.Период,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПриборУчета,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ОбъектУстановки,
		|	УслугиСоставныеУслуги.Услуга,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ВидТарифа,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПоказаниеПредыдущее,
		|	ВременнаяТаблицаПоказанияПриборовУчета.Показание,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПоказаниеПредыдущееНовое,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПоказаниеНовое,
		|	(ВременнаяТаблицаПоказанияПриборовУчета.ПоказаниеНовое - ВременнаяТаблицаПоказанияПриборовУчета.ПоказаниеПредыдущееНовое - (ВременнаяТаблицаПоказанияПриборовУчета.Показание - ВременнаяТаблицаПоказанияПриборовУчета.ПоказаниеПредыдущее)) * УслугиСоставныеУслуги.Коэффициент
		|ИЗ
		|	ВременнаяТаблицаПоказанияПриборовУчета КАК ВременнаяТаблицаПоказанияПриборовУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Услуги.СоставныеУслуги КАК УслугиСоставныеУслуги
		|		ПО ВременнаяТаблицаПоказанияПриборовУчета.Услуга = УслугиСоставныеУслуги.Ссылка
		|ГДЕ
		|	УслугиСоставныеУслуги.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетПоказанийПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетыПоЛицевымСчетам()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуПоказанияПриборовУчета(ДокументСсылкаКорректировкаПоказанийПриборовУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаПоказанияПриборовУчета.Период КАК Период,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ВидТарифа КАК ВидТарифа,
		|	ВременнаяТаблицаПоказанияПриборовУчета.ПоказаниеНовое КАК Значение,
		|	ЛОЖЬ КАК Отключен
		|ИЗ
		|	ВременнаяТаблицаПоказанияПриборовУчета КАК ВременнаяТаблицаПоказанияПриборовУчета";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПоказанияПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуДенежныеСредства()

Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаКорректировкаПоказанийПриборовУчета, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	КорректировкаПоказанийПриборовУчетаОсновная.Ссылка.Услуга,
		 |	КорректировкаПоказанийПриборовУчетаОсновная.ПриборУчета,
		 |	КорректировкаПоказанийПриборовУчетаОсновная.ОбъектУстановки КАК ОбъектУстановки,
		 |	КорректировкаПоказанийПриборовУчетаОсновная.ВидТарифа,
		 |	КОНЕЦПЕРИОДА(КорректировкаПоказанийПриборовУчетаОсновная.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Период,
		 |	КорректировкаПоказанийПриборовУчетаОсновная.Показание,
		 |	КорректировкаПоказанийПриборовУчетаОсновная.ПоказаниеПредыдущее,
		 |	КорректировкаПоказанийПриборовУчетаОсновная.ПоказаниеНовое,
		 |	КорректировкаПоказанийПриборовУчетаОсновная.ПоказаниеПредыдущееНовое,
		 |	КорректировкаПоказанийПриборовУчетаОсновная.Коэффициент
		 |ПОМЕСТИТЬ ВременнаяТаблицаПоказанияПриборовУчета
		 |ИЗ
		 |	Документ.КорректировкаПоказанийПриборовУчета.Основная КАК КорректировкаПоказанийПриборовУчетаОсновная
		 |ГДЕ
		 |	КорректировкаПоказанийПриборовУчетаОсновная.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаКорректировкаПоказанийПриборовУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицуРасчетПоказанийПриборовУчета(ДокументСсылкаКорректировкаПоказанийПриборовУчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицуПоказанияПриборовУчета(ДокументСсылкаКорректировкаПоказанийПриборовУчета, СтруктураДополнительныеСвойства);	
	
КонецПроцедуры

