//Процедура печати 
Процедура Печать(МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода) Экспорт                                                 
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетКарточкиПрописки") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МакетКарточкиПрописки", "ЛицевыеСчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "МакетКарточкиПрописки", ПараметрыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетСправкиПрописанных") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МакетСправкиПрописанных", "ЛицевыеСчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "МакетСправкиПрописанных", ПараметрыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетКвитанцииНаОплату") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МакетКвитанцииНаОплату", "ЛицевыеСчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "МакетКвитанцииНаОплату", ПараметрыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СправкаОПрописке") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СправкаОПрописке", "ЛицевыеСчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "СправкаОПрописке", ПараметрыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетКвитанцияНаОплатуУпрощенная") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МакетКвитанцияНаОплатуУпрощенная", "ЛицевыеСчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "МакетКвитанцияНаОплатуУпрощенная", ПараметрыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетНаОплату") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетНаОплату", "ЛицевыеСчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "СчетНаОплату", ПараметрыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Акт") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Акт", "ЛицевыеСчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "Акт", ПараметрыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОтчетПоЛС") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ОтчетПоЛС", "ЛицевыеСчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ОтчетПоЛС", ПараметрыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПамяткаДляДоступаВЛичныйКабинетНаСайте") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПамяткаДляДоступаВЛичныйКабинетНаСайте", "ЛицевыеСчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ПамяткаДляДоступаВЛичныйКабинетНаСайте", ПараметрыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СправкаОСоставеСемьиИПрописке") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_СправкаОСоставеСемьиИПрописке", "ЛицевыеСчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_СправкаОСоставеСемьиИПрописке", ПараметрыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СправкаОРазмереПлатежей") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_СправкаОРазмереПлатежей", "ЛицевыеСчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_СправкаОРазмереПлатежей", ПараметрыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_МакетАктСверки") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_МакетАктСверки", "ЛицевыеСчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_МакетАктСверки", ПараметрыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_МакетПеня") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_МакетПеня", "ЛицевыеСчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_МакетПеня", ПараметрыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СчетЗаказ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_СчетЗаказ", "ЛицевыеСчета", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_СчетЗаказ", ПараметрыПечати));
	КонецЕсли;

	
КонецПроцедуры

//Формирование печатных форм
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ЛицевыеСчета";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "МакетКарточкиПрописки" Тогда
			
			ТабличныйДокумент = ПечатьКарточкаПрописки(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент);
			
		ИначеЕсли ИмяМакета = "МакетСправкиПрописанных" Тогда
			
			ТабличныйДокумент = ПечатьСправкаПрописанных(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент);
			
		ИначеЕсли ИмяМакета = "МакетКвитанцииНаОплату" Тогда
			//Параметры: (Лицевые счета, Табличный документ,Месяц начисления, БанковскиеСчетаОрганизации)
			ПечатьКвитанцииНаОплату.ПечатьКвитанцииНаОплату(ТекущийДокумент, ТабличныйДокумент, ПараметрыПечати.ПериодПечати, ПараметрыПечати.БанковскийСчетНаПечать);	
		ИначеЕсли ИмяМакета = "МакетКвитанцияНаОплатуУпрощенная" Тогда
			//Параметры: (Лицевые счета, Табличный документ,Месяц начисления, БанковскиеСчетаОрганизации)
			ПечатьКвитанцииНаОплату.ПечатьКвитанцииНаОплатуУпрощенная(ТекущийДокумент, ТабличныйДокумент, ПараметрыПечати.ПериодПечати, ПараметрыПечати.БанковскийСчетНаПечать);
		ИначеЕсли ИмяМакета = "СправкаОПрописке" Тогда
			
			ТабличныйДокумент = ПечатьСправкаОПрописке(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент);
			
		ИначеЕсли ИмяМакета = "Акт" Тогда
			
			ТабличныйДокумент = ПечатьАкт(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент);
			
		ИначеЕсли ИмяМакета = "СчетНаОплату" Тогда
			
			ТабличныйДокумент = ПечатьСчетНаОплату(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент);
			
		ИначеЕсли ИмяМакета = "ОтчетПоЛС" Тогда
			
			ТабличныйДокумент = ПечатьОтчетПоЛС(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент);
			
		ИначеЕсли ИмяМакета = "ПамяткаДляДоступаВЛичныйКабинетНаСайте" Тогда
			
			ТабличныйДокумент = ПечатьПамяткаДляДоступаВЛичныйКабинетНаСайте(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент);
			
		ИначеЕсли ИмяМакета = "ПФ_MXL_СправкаОСоставеСемьиИПрописке" Тогда
			
			ТабличныйДокумент = ПечатьСправкаОСоставеСемьи(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент);
			
		ИначеЕсли ИмяМакета = "ПФ_MXL_СправкаОРазмереПлатежей" Тогда
			
			ТабличныйДокумент = ПечатьСправкаОРазмереПлатежей(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент);	

		ИначеЕсли ИмяМакета = "ПФ_MXL_МакетАктСверки" Тогда
			
			ТабличныйДокумент = ПечатьАктСверки(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент);
			
		ИначеЕсли ИмяМакета = "ПФ_MXL_МакетПеня" Тогда
			
			ТабличныйДокумент = ПечатьПеня(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент);
			
		ИначеЕсли ИмяМакета = "ПФ_MXL_СчетЗаказ" Тогда
			
			ТабличныйДокумент = ПечатьСчетЗаказ(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент);
			
		КонецЕсли;                        

				
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.Защита = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция НайтиРеквизитыАдреса(Адрес)
	
	СтруктураАдреса = Новый Структура;
	КлючПоследнегоЭлемента = Неопределено;
	
	Для Сч = 1 По СтрЧислоСтрок(Адрес) Цикл
		Стр = СтрПолучитьСтроку(Адрес, Сч);
		Если Лев(Стр, 1) = Символы.Таб Тогда
			Если КлючПоследнегоЭлемента <> Неопределено Тогда
				СтруктураАдреса.Вставить(
				КлючПоследнегоЭлемента,
				СтруктураАдреса[КлючПоследнегоЭлемента] + Символы.ПС + Сред(Стр, 2)
				);
			КонецЕсли;
		Иначе
			Поз = Найти(Стр, "=");
			Если Поз <> 0 Тогда
				КлючПоследнегоЭлемента = Лев(Стр, Поз-1);
				СтруктураАдреса.Вставить(КлючПоследнегоЭлемента, СокрЛП(Сред(Стр, Поз+1)));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураАдреса;
	
КонецФункции // ()

Функция НайтиРеквизитыКвартиры(Квартира, СтрокаРеквизита, Подстрока)
	
	Строка = СтрПолучитьСтроку(Квартира,СтрокаРеквизита);
	Число = Найти(Строка,Подстрока);
	
	Возврат СокрЛП(Прав(Строка,СтрДлина(Строка)-Число)); 
	
КонецФункции // ()

//===================================================  ФУНКЦИИ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ ==================================================================
Функция ПечатьСчетЗаказ(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент)
	Макет = ПолучитьМакет("ПФ_MXL_СчетЗаказ");
	ПечататьРезультат = Ложь;
	РезультатЗапроса = ПолучитьОбщуюСтруктуруКвитанции(ТекущийДокумент,ПараметрыПечати.ПериодПечати);
	//ЗаголовокСчета
	ВладелецЛС = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец;
	ВладелецЛицевогоСчета = ВладелецЛС.Наименование;

	Организация = ТекущийДокумент.Владелец.Организация;
	БанкОрганизации = Организация.БанковскийСчетПоУмолчанию;
	
	Отбор = Новый Структура("Организация",Организация);
	СтавкаНДС = РегистрыСведений.СистемыНалогообложенияОрганизаций.ПолучитьПоследнее(ТекущаяДата(),Отбор).СистемаНалогообложения;
	НДС = 0;
	Если  СтавкаНДС = Перечисления.СистемыНалогооблажения.НалогНаПрибыльИНДС Тогда
		НДС = 1.2;    //Временная мера
	КонецЕсли;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	//Штрихкод или Номер квитанции
	Штрихкод = ТекущийДокумент.Наименование+"-"+Строка(Формат(НачалоМесяца(ПараметрыПечати.ПериодПечати),"ДФ=ddMMyyyy"))+НСтр("ru = ' від '; uk = ' від '")+Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy")  ;
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовок, ТекущийДокумент.Ссылка);
	ОбластьЗаголовок.Параметры.ТекстЗаголовка =НСтр("ru = 'Рахунок на сплату №'; uk = 'Рахунок на сплату №'")+Штрихкод;
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	//Поставщик
	ВыгрузкаБанки = ПараметрыПечати.БанковскийСчетНаПечать.Выгрузить();
	РеквизитыПоставщикаБанк = "";
	Для Каждого Строка из ВыгрузкаБанки Цикл;
		Если Строка.Печать  Тогда 
			БанкРекв = Строка.БанковскийСчет;
			РеквизитыПостав = НСтр("ru = 'Р/с'; uk = 'П/р'")+БанкРекв.НомерСчета+", "+
			БанкРекв.Банк.Наименование+", "+
			БанкРекв.Банк.Город+", МФО "+
			БанкРекв.Банк.Код+Символы.ПС+
			?(Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,"Вид") = Неопределено,"",Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,"Вид").Представление+", тел.:")+
			?(Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,"Вид") = Неопределено,"",Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,"Вид").Представление)+Символы.ПС+Символы.ПС;
			РеквизитыПоставщикаБанк = РеквизитыПоставщикаБанк + РеквизитыПостав;
		КонецЕсли;
	КонецЦикла;
	РеквизитыПокупателяБанк = "";
	Если ВладелецЛС.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		РеквизитыПокуп = ВладелецЛС.МобДляСайта;
		РеквизитыПокупателяБанк = РеквизитыПокупателяБанк + РеквизитыПокуп;
	КонецЕсли;
			
	ОбластьПоставщик = Макет.ПолучитьОбласть("Поставщик");
	ОбластьПоставщик.Параметры.ПредставлениеПоставщика = Организация.НаименованиеПолное;	
	ОбластьПоставщик.Параметры.РеквизитыПоставщика = РеквизитыПоставщикаБанк;			
	ТабличныйДокумент.Вывести(ОбластьПоставщик);

	//Покупатель
	ОбластьПокупатель = Макет.ПолучитьОбласть("Покупатель");
	ОбластьПокупатель.Параметры.ПредставлениеПокупателя = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование;
	ОбластьПокупатель.Параметры.РеквизитыПокупателя = РеквизитыПокупателяБанк;
	ТабличныйДокумент.Вывести(ОбластьПокупатель);
	
	// Договора
	ОбластьДоговора = Макет.ПолучитьОбласть("Договора");
	ОбластьДоговора.Параметры.Договор       = ВладелецЛС.ЮрЛицо.ДоговорПоУмолчанию.Наименование;
	ОбластьДоговора.Параметры.НомерДоговора = ВладелецЛС.ЮрЛицо.ДоговорПоУмолчанию.НомерДоговора;
	ОбластьДоговора.Параметры.ДатаДоговора  = Формат(ВладелецЛС.ЮрЛицо.ДоговорПоУмолчанию.ДатаДоговора, "Л=uk_UA; ДФ=dd.MM.yyyy"); 
	ТабличныйДокумент.Вывести(ОбластьДоговора);
			
	//ШапкаТаблицы
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	Долг =0;
	Аванс = 0;
	ПредыдущаяУслуга = "";
	ДобавитьКАвансу = 0;
	
	ВыборкаОстатокПоУслугам = РезультатЗапроса[5].Выбрать();

	
	РезультатОстаток = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	РезультатОстаток.Следующий();
	Остаток = РезультатОстаток.СуммаОстаток;
	Если Остаток = Неопределено Тогда
		Остаток = 0;
	КонецЕсли;
	
	ВыборкаПоПриборамУчета = РезультатЗапроса[1].Выбрать();
	ВыборкаАвансовыхПлатежей = РезультатЗапроса[3].Выбрать();
	ВыборкаПоУслугам = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НомерСтроки = 1;
	Пока ВыборкаПоУслугам.Следующий() Цикл
		НачислениеИтог = ВыборкаПоУслугам.Начисление;
		ЛьготаИтог = ВыборкаПоУслугам.Льгота;
		СубсидияИтог = ВыборкаПоУслугам.Субсидия;
		ПерерасчетИтог  = ВыборкаПоУслугам.Перерасчет;
		КорректировкаИтог = ВыборкаПоУслугам.Корректировка;
		ОплатаИтог = ВыборкаПоУслугам.Оплата;
		ИтогоНачислено = НачислениеИтог+ ЛьготаИтог+  СубсидияИтог +ПерерасчетИтог + КорректировкаИтог;
		УслугиДетали = ВыборкаПоУслугам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока УслугиДетали.Следующий() Цикл
		    ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
			ОбластьСтрока.Параметры.Услуга = УслугиДетали.Услуга.ПолноеНаименование;
			ВыборкаТариф = УслугиДетали.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Тариф = "";
			КоличествоЕдИзм = 0;
			Пока ВыборкаТариф.Следующий() Цикл
				Если Тариф = "" Тогда
				    Значение = ?(ВыборкаТариф.Тариф = 0 ,"",Строка(ВыборкаТариф.Тариф)) ;

				Иначе 
					Значение = "\"+Строка(ВыборкаТариф.Тариф);
				КонецЕсли;
				Тариф = Тариф+Значение;
				КоличествоЕдИзм = КоличествоЕдИзм+ ВыборкаТариф.КоличествоЕдИзм;
			КонецЦикла;

			ОбластьСтрока.Параметры.Тариф = Тариф;
			ОбластьСтрока.Параметры.Единица = УслугиДетали.ЕдиницаИзмерения;
			ОбластьСтрока.Параметры.Количество = КоличествоЕдИзм;
			ОбластьСтрока.Параметры.Насчитано = УслугиДетали.Начисление;
			//ОбластьСтрока.Параметры.Льготы = УслугиДетали.Льгота;
			//ОбластьСтрока.Параметры.Субсидии = УслугиДетали.Субсидия;
			//ОбластьСтрока.Параметры.Корректировка = УслугиДетали.Корректировка;
			//ОбластьСтрока.Параметры.Перерасчет = УслугиДетали.Перерасчет;
			//Сумма = УслугиДетали.Начисление + УслугиДетали.Льгота+ УслугиДетали.Субсидия +УслугиДетали.Корректировка+УслугиДетали.Перерасчет;
			//ОбластьСтрока.Параметры.Сумма = Сумма;
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			Если УслугиДетали.Услуга.ВидУслуги = Справочники.ВидыУслуг.ХолоднаяВода Тогда
				СтруктураПоискаПриборов = Новый Структура("ОбъектУстановки, Услуга");
				СтруктураПоискаПриборов.ОбъектУстановки = ТекущийДокумент;
				СтруктураПоискаПриборов.Услуга = УслугиДетали.Услуга;
				Пока ВыборкаПоПриборамУчета.НайтиСледующий(СтруктураПоискаПриборов) Цикл
					ОбластьПриборы = Макет.ПолучитьОбласть("ПриборУчета");
					ОбластьПриборы.Параметры.Прибор = ВыборкаПоПриборамУчета.ПриборУчета;
					ОбластьПриборы.Параметры.ПредыдущиеПоказания = ВыборкаПоПриборамУчета.ПредыдущиеПоказания;
					ОбластьПриборы.Параметры.ТекущиеПоказания = ВыборкаПоПриборамУчета.ТекущиеПоказания;
					ОбластьПриборы.Параметры.Разница = ВыборкаПоПриборамУчета.ТекущиеПоказания - ВыборкаПоПриборамУчета.ПредыдущиеПоказания;
					ТабличныйДокумент.Вывести(ОбластьПриборы);
				КонецЦикла;
			КонецЕсли;
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
	КонецЦикла;
	//Итого
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.Всего = ИтогоНачислено;
	ТабличныйДокумент.Вывести(ОбластьИтого);
	
	
	СуммаНДС = 0;		
	//Итого
	Если НДС <> 0 Тогда
		
		ОбластьИтогоНДС = Макет.ПолучитьОбласть("ИтогоНДС");
		
		ИтогСуммы = ИтогоНачислено;
		//Мера временная
		ОбластьИтогоНДС.Параметры.ВсегоНДС = ИтогоНачислено;
		
		СуммаНДС = Формат(ИтогоНачислено - ИтогоНачислено/НДС, "ЧЦ=10; ЧДЦ=2");
		ОбластьИтогоНДС.Параметры.НДС = "в т.ч. ПДВ:";
		ОбластьИтогоНДС.Параметры.ВсегоНДС = СуммаНДС;
		
		
		ТабличныйДокумент.Вывести(ОбластьИтогоНДС);
		
		Если ПечататьРезультат Тогда
			ОбластьИтого = Макет.ПолучитьОбласть("ИтогоНДСРезультат");
			ИтогСуммы = Долг + Аванс + ИтогоНачислено+ ДобавитьКАвансу;
			ОбластьИтого.Параметры.Всего = ИтогСуммы;
			
			ОбластьИтого.Параметры.Аванс = Аванс+ ДобавитьКАвансу;
			
			ОбластьИтого.Параметры.Долг = Долг;
		КонецЕсли;	
	Иначе
		//ОбластьИтого = Макет.ПолучитьОбласть("Итого");
		//
		//ИтогСуммы = ИтогоНачислено;
		//ОбластьИтого.Параметры.Всего = ИтогоНачислено;

		//ТабличныйДокумент.Вывести(ОбластьИтого);
		//
		//Если ПечататьРезультат Тогда
		//	
		//	ОбластьИтого = Макет.ПолучитьОбласть("ИтогоРезультат");
		//	ИтогСуммы = Долг + Аванс + ИтогоНачислено + ДобавитьКАвансу;
		//	
		//	ОбластьИтого.Параметры.Всего = ИтогСуммы;
		//	
		//	ОбластьИтого.Параметры.Аванс = Аванс+ ДобавитьКАвансу;
		//	
		//	ОбластьИтого.Параметры.Долг = Долг;
		//	
		//	ТабличныйДокумент.Вывести(ОбластьИтого);
		//КонецЕсли;
	КонецЕсли;

	
	//СуммаПрописью
	ОбластьСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьСуммаПрописью.Параметры.ИтоговаяСтрока = НСтр("ru='Всього надано послуг ';uk='Всього надано послуг '",)+(НомерСтроки-1) + ", "+
	НСтр("ru=' на суму ';uk=' на суму '",) + ИтогСуммы+ " грн.";
	
	КодЛок = ТекущийКодЛокализации();
	ОбластьСуммаПрописью.Параметры.СуммаПрописью = ЧислоПрописью(ИтогСуммы,НСтр("ru = 'Л= ru_RU; ДП=Истина'; uk = 'Л= uk_UA; ДП=Истина'"), НСтр("ru = 'гривня,гривні,гривень,ж,копійка,копійки,копійок,ж,'; uk = 'гривня,гривні,гривень,ж,копійка,копійки,копійок,ж,2'"));

	ТабличныйДокумент.Вывести(ОбластьСуммаПрописью);
	
	//Подписи
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	ТабличныйДокумент.Вывести(ОбластьПодписи);
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьОтчетПоЛС (ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент)
	
	Макет = ПолучитьМакет("ОтчетВладельцуЛС");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЗаводскойНомер КАК ЗаводскойНомер,
	                |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга КАК Услуга,
	                |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Тарифность КАК Тарифность,
	                |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.СпособРегистрацииПоказаний КАК СпособРегистрацииПоказаний,
	                |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                |	ЕСТЬNULL(ВЫБОР
	                |			КОГДА ПоверкиПриборовУчетаСрезПоследних.Период < &МесяцНачисления
	                |					И ПоверкиПриборовУчетаСрезПоследних.ПоверкаВыполнена = ИСТИНА
	                |				ТОГДА ПоверкиПриборовУчетаСрезПоследних.Период
	                |		КОНЕЦ, """") КАК ДатаПоследнейПоверки,
	                |	ЕСТЬNULL(ВЫБОР
	                |			КОГДА ПоверкиПриборовУчетаСрезПоследних.Период > &МесяцНачисления
	                |				ТОГДА ПоверкиПриборовУчетаСрезПоследних.Период
	                |		КОНЕЦ, """") КАК ДатаСледуюшейПоверки,
	                |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
	                |	УстановленныеПриборыУчетаСрезПоследних.Период КАК ДатаУстановки,
	                |	ПоказанияПрибораУчета.ТекущиеПоказания
	                |ИЗ
	                |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(, ОбъектУстановки В (&ЛицевыеСчета)) КАК УстановленныеПриборыУчетаСрезПоследних
	                |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                |			ПоказанияПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	                |			СУММА(ПоказанияПриборовУчетаСрезПоследних.Значение) КАК ТекущиеПоказания,
	                |			СУММА(0) КАК ПредыдущиеПоказания
	                |		ИЗ
	                |			РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ) КАК ПоказанияПриборовУчетаСрезПоследних
	                |		
	                |		СГРУППИРОВАТЬ ПО
	                |			ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
	                |		
	                |		ОБЪЕДИНИТЬ ВСЕ
	                |		
	                |		ВЫБРАТЬ
	                |			ПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	                |			СУММА(0),
	                |			СУММА(ПоказанияПриборовУчетаСрезПоследних.Значение)
	                |		ИЗ
	                |			РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ДЕНЬ, -1), ) КАК ПоказанияПриборовУчетаСрезПоследних
	                |		ГДЕ
	                |			ПоказанияПриборовУчетаСрезПоследних.Период < КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	                |		
	                |		СГРУППИРОВАТЬ ПО
	                |			ПоказанияПриборовУчетаСрезПоследних.ПриборУчета) КАК ПоказанияПрибораУчета
	                |		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПрибораУчета.ПриборУчета
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоверкиПриборовУчета.СрезПоследних(&МесяцНачисления, ОбъектУстановки В (&ЛицевыеСчета)) КАК ПоверкиПриборовУчетаСрезПоследних
	                |		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоверкиПриборовУчетаСрезПоследних.ПриборУчета
	                |			И УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = ПоверкиПриборовУчетаСрезПоследних.ОбъектУстановки
	                |ГДЕ
	                |	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец КАК Здание,
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
	                |	РасчетыПоЛицевымСчетам.Услуга КАК Услуга,
	                |	РасчетыПоЛицевымСчетам.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                |	МАКСИМУМ(РасчетыПоЛицевымСчетам.Тариф) КАК Тариф,
	                |	СУММА(РасчетыПоЛицевымСчетам.ДнейНачислено) КАК ДнейНачислено,
	                |	СУММА(ЕСТЬNULL(ВЫБОР
	                |				КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	                |					ТОГДА РасчетыПоЛицевымСчетам.Количество
	                |			КОНЕЦ, 0)) КАК КоличествоЕдИзм,
	                |	СУММА(ВЫБОР
	                |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	                |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК Начисление,
	                |	СУММА(ВЫБОР
	                |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	                |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК Субсидия,
	                |	СУММА(ВЫБОР
	                |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	                |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК Льгота,
	                |	СУММА(ВЫБОР
	                |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
	                |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК Перерасчет,
	                |	СУММА(ВЫБОР
	                |			КОГДА РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК Оплата,
	                |	СУММА(ВЫБОР
	                |			КОГДА НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	                |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	                |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	                |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
	                |					И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК Корректировка,
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет.ОбъектЛицевогоСчета КАК Квартира,
	                |	ЕСТЬNULL(РасчетыПоЛицевымСчетам.Порог, """") КАК Порог,
	                |	РасчетыПоЛицевымСчетам.МесяцНачисления КАК МесяцНачисления,
	                |	СУММА(ЕСТЬNULL(ВложенныйЗапрос.СуммаОстаток, 0)) КАК Долг
	                |ИЗ
	                |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	                |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                |			РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет,
	                |			РасчетыПоЛицевымСчетамОстатки.Услуга КАК Услуга,
	                |			РасчетыПоЛицевымСчетамОстатки.МесяцНачисления КАК МесяцНачисления,
	                |			РасчетыПоЛицевымСчетамОстатки.СуммаОстаток КАК СуммаОстаток
	                |		ИЗ
	                |			РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(&МесяцНачисления, ЛицевойСчет В (&ЛицевыеСчета)) КАК РасчетыПоЛицевымСчетамОстатки) КАК ВложенныйЗапрос
	                |		ПО РасчетыПоЛицевымСчетам.ЛицевойСчет = ВложенныйЗапрос.ЛицевойСчет
	                |			И РасчетыПоЛицевымСчетам.Услуга = ВложенныйЗапрос.Услуга
	                |			И РасчетыПоЛицевымСчетам.МесяцНачисления = ВложенныйЗапрос.МесяцНачисления
	                |ГДЕ
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет В(&ЛицевыеСчета)
	                |	И РасчетыПоЛицевымСчетам.Период <= КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет,
	                |	РасчетыПоЛицевымСчетам.Услуга,
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец,
	                |	РасчетыПоЛицевымСчетам.Услуга.ЕдиницаИзмерения,
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет.ОбъектЛицевогоСчета,
	                |	ЕСТЬNULL(РасчетыПоЛицевымСчетам.Порог, """"),
	                |	РасчетыПоЛицевымСчетам.МесяцНачисления
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	МесяцНачисления,
	                |	Услуга УБЫВ
	                |ИТОГИ
	                |	СУММА(Начисление),
	                |	СУММА(Субсидия),
	                |	СУММА(Льгота),
	                |	СУММА(Перерасчет),
	                |	СУММА(Оплата),
	                |	СУММА(Корректировка),
	                |	СУММА(Долг)
	                |ПО
	                |	МесяцНачисления
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЛицевыеСчета.Представление КАК ЛицевойСчет,
	                |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.Представление КАК ОтветственныйВладелец,
	                |	ЛицевыеСчетаСрезПоследних.КоличествоПрописанных,
	                |	ЛицевыеСчетаСрезПоследних.КоличествоПроживающих,
	                |	МашиноМестаСрезПоследних.КоличествоМашиноМест,
	                |	ЛицевыеСчета.ОбъектЛицевогоСчета КАК Квартира,
	                |	ЛицевыеСчета.ОбъектЛицевогоСчета.Владелец КАК Здание,
	                |	ЛицевыеСчета.ОбъектЛицевогоСчета.Владелец.Организация КАК Организация
	                |ИЗ
	                |	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	                |		ПО ЛицевыеСчета.Ссылка = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчета.СрезПоследних(&МесяцНачисления, ) КАК ЛицевыеСчетаСрезПоследних
	                |		ПО ЛицевыеСчета.Ссылка = ЛицевыеСчетаСрезПоследних.ЛицевойСчет
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МашиноМеста.СрезПоследних(&МесяцНачисления, ) КАК МашиноМестаСрезПоследних
	                |		ПО ЛицевыеСчета.Ссылка = МашиноМестаСрезПоследних.ЛицевойСчет
	                |ГДЕ
	                |	ЛицевыеСчета.Ссылка В(&ЛицевыеСчета)";
		Запрос.УстановитьПараметр("ЛицевыеСчета",ТекущийДокумент);
		Запрос.УстановитьПараметр("МесяцНачисления",ТекущаяДата());
		
		Результат = Запрос.ВыполнитьПакет();
		
		ВыборкаОсновная 	= Результат[2].Выбрать();
		ВыборкаПриборы 		= Результат[0].Выбрать();
		ВыборкаУслуги 		= Результат[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		//Заполнение шапки отчета
		ВыборкаОсновная.Следующий();
		
		ОбластьШапкаОтчета = Макет.ПолучитьОбласть("ШапкаОтчета");
		ОбластьШапкаОтчета.Параметры.ЛицевойСчет = ВыборкаОсновная.ЛицевойСчет;
		ОбластьШапкаОтчета.Параметры.Организация = ВыборкаОсновная.Организация;
		ОбластьШапкаОтчета.Параметры.ДатаВыдачи  = ТекущаяДата();
		ТабличныйДокумент.Вывести(ОбластьШапкаОтчета);
		
		//Заполнение основных данных о ЛС
		ОбластьОсновныеДанные = Макет.ПолучитьОбласть("ОсновныеДанные");
		ОбластьОсновныеДанные.Параметры.ЛицевойСчет 			= ВыборкаОсновная.ЛицевойСчет;
		ОбластьОсновныеДанные.Параметры.ОтветственныйВладелец	= ВыборкаОсновная.ОтветственныйВладелец;
		ОбластьОсновныеДанные.Параметры.Прописано 				= ВыборкаОсновная.КоличествоПрописанных;
		ОбластьОсновныеДанные.Параметры.Проживает 				= ВыборкаОсновная.КоличествоПроживающих;
		ОбластьОсновныеДанные.Параметры.Адрес 					= Строка(ВыборкаОсновная.Здание)+", "+Строка(ВыборкаОсновная.Квартира);
		ОбластьОсновныеДанные.Параметры.КоличествоМашиномест 	= ВыборкаОсновная.КоличествоМашиномест;
		ТабличныйДокумент.Вывести(ОбластьОсновныеДанные);
		
		//Заполеннение таблицы взаиморасчетов по услугам
		ОбластьШапкаТаблицыВзаиморасчетов = Макет.ПолучитьОбласть("ШапкаУслуги");
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыВзаиморасчетов);
		
		Пока ВыборкаУслуги.Следующий() Цикл
			ОбластьМесяцНачисления = Макет.ПолучитьОбласть("МесяцНачисления");
			ОбластьМесяцНачисления.Параметры.МесяцНачисления = Формат(ВыборкаУслуги.МесяцНачисления,"ДФ='MMMM yyyy'");
			ОбластьМесяцНачисления.Параметры.Долг = ВыборкаУслуги.Долг;
			ОбластьМесяцНачисления.Параметры.Начислено = ВыборкаУслуги.Начисление;
			ОбластьМесяцНачисления.Параметры.Льгота  = ВыборкаУслуги.Льгота;
			ОбластьМесяцНачисления.Параметры.Субсидия = ВыборкаУслуги.Субсидия;
			ОбластьМесяцНачисления.Параметры.Корректировка = ВыборкаУслуги.Корректировка;
			ОбластьМесяцНачисления.Параметры.Перерасчет = ВыборкаУслуги.Перерасчет;
			ОбластьМесяцНачисления.Параметры.Оплата = ВыборкаУслуги.Оплата;
			ОбластьМесяцНачисления.Параметры.Итого = ВыборкаУслуги.Долг + ВыборкаУслуги.Начисление + ВыборкаУслуги.Льгота + ВыборкаУслуги.Субсидия+  ВыборкаУслуги.Корректировка + ВыборкаУслуги.Перерасчет - ВыборкаУслуги.Оплата; 
			ТабличныйДокумент.Вывести(ОбластьМесяцНачисления);
			
			ВыборкаУслугиПодробно = ВыборкаУслуги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаУслугиПодробно.Следующий() Цикл
				
				ОбластьТаблицыУслуга = Макет.ПолучитьОбласть("Услуга");
				ОбластьТаблицыУслуга.Параметры.Услуга = ВыборкаУслугиПодробно.Услуга;
				ТабличныйДокумент.Вывести(ОбластьТаблицыУслуга);
				
				ОбластьТаблицыДанные = Макет.ПолучитьОбласть("ДанныеУслуга");
				ОбластьТаблицыДанные.Параметры.Долг 		= ВыборкаУслугиПодробно.Долг;
				ОбластьТаблицыДанные.Параметры.Тариф 		= ВыборкаУслугиПодробно.Тариф;
				ОбластьТаблицыДанные.Параметры.ЕдИзм 		= ВыборкаУслугиПодробно.ЕдиницаИзмерения;
				ОбластьТаблицыДанные.Параметры.Количество 	= ВыборкаУслугиПодробно.КоличествоЕдИзм;
				ОбластьТаблицыДанные.Параметры.Начислено 	= ВыборкаУслугиПодробно.Начисление;
				ОбластьТаблицыДанные.Параметры.Льгота 		= ВыборкаУслугиПодробно.Льгота;
				ОбластьТаблицыДанные.Параметры.Субсидия 	= ВыборкаУслугиПодробно.Субсидия;
				ОбластьТаблицыДанные.Параметры.Корректировка= ВыборкаУслугиПодробно.Корректировка;
				ОбластьТаблицыДанные.Параметры.Перерасчет 	= ВыборкаУслугиПодробно.Перерасчет;
				ОбластьТаблицыДанные.Параметры.Оплачено 	= ВыборкаУслугиПодробно.Оплата;
				ОбластьТаблицыДанные.Параметры.Итого 		= ВыборкаУслугиПодробно.Долг + ВыборкаУслугиПодробно.Начисление + ВыборкаУслугиПодробно.Льгота 
														+ ВыборкаУслугиПодробно.Субсидия + ВыборкаУслугиПодробно.Корректировка +  ВыборкаУслугиПодробно.Перерасчет - ВыборкаУслугиПодробно.Оплата;
				ТабличныйДокумент.Вывести(ОбластьТаблицыДанные);
			КонецЦикла;
		КонецЦикла;
		
		//Заполнаяем таблицу приборов
		ОбластьШапкаТаблыцыПриборов = Макет.ПолучитьОбласть("ПриборыШапка");
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблыцыПриборов);
		
		Пока ВыборкаПриборы.Следующий() Цикл 
			ОбластьСтрокаПриборы = Макет.ПолучитьОбласть("ТаблицаПриборы");
			ОбластьСтрокаПриборы.Параметры.НомерСчетчика 		= ВыборкаПриборы.ЗаводскойНомер;
			ОбластьСтрокаПриборы.Параметры.Услуга  		 		= ВыборкаПриборы.Услуга;
			ОбластьСтрокаПриборы.Параметры.Тарифность	 		= ВыборкаПриборы.Тарифность;
			ОбластьСтрокаПриборы.Параметры.СпособРегистрации    = ВыборкаПриборы.СпособРегистрацииПоказаний;
			ОбластьСтрокаПриборы.Параметры.ЕдИзм 				= ВыборкаПриборы.ЕдиницаИзмерения;
			ОбластьСтрокаПриборы.Параметры.ДатаУстановки		= ВыборкаПриборы.ДатаУстановки;
			ОбластьСтрокаПриборы.Параметры.ДатаПоследнейПоверки = ВыборкаПриборы.ДатаПоследнейПоверки;
			ОбластьСтрокаПриборы.Параметры.ДатаСледующейПоверки = ВыборкаПриборы.ДатаСледуюшейПоверки;
			ОбластьСтрокаПриборы.Параметры.Показание 			= ВыборкаПриборы.ТекущиеПоказания;
			ТабличныйДокумент.Вывести(ОбластьСтрокаПриборы);
		КонецЦикла;
		
	Возврат ТабличныйДокумент;	
	 
КонецФункции

Функция ПечатьКарточкаПрописки(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФизическиеЛица.Ссылка,
	|	ФизическиеЛица.Ссылка.Пол,
	|	ФизическиеЛица.Ссылка.ДатаРождения,
	|	ФизическиеЛица.Ссылка.МестоРождения,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	ДокументыФизическихЛицСрезПоследних.ВидДокумента,
	|	ДокументыФизическихЛицСрезПоследних.Серия,
	|	ДокументыФизическихЛицСрезПоследних.Номер,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи,
	|	ДокументыФизическихЛицСрезПоследних.КемВыдан,
	|	ДокументыФизическихЛицСрезПоследних.СрокДействия
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
	|		ПО ФизическиеЛица.Ссылка.Ссылка = ДокументыФизическихЛицСрезПоследних.Физлицо.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
	|		ПО ФизическиеЛица.Ссылка.Ссылка = ФИОФизЛицСрезПоследних.ФизЛицо.Ссылка
	|ГДЕ
	|	ФизическиеЛица.Ссылка = &ФизЛицо";
	Запрос.УстановитьПараметр("ФизЛицо",ПараметрыПечати.ТекущийЖитель);
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Макет = ПолучитьМакет("МакетКарточкиПрописки");
	
	//ШАПКА
	Для Каждого Строка Из Выборка Цикл
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.Фамилия = Строка.Фамилия;
		ОбластьШапка.Параметры.Имя = Строка.Имя;
		ОбластьШапка.Параметры.Отчество = Строка.Отчество;
		ОбластьШапка.Параметры.Национальность = "";
	КонецЦикла;
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	//РОЖДЕНИЕ
	ОбластьРождение = Макет.ПолучитьОбласть("Рождение");
	Для Каждого Строка Из Выборка Цикл
		ОбластьРождение.Параметры.ЧислоРождения = Строка.СсылкаДатаРождения;
		ОбластьРождение.Параметры.МесяцРождения = Строка.СсылкаДатаРождения;
		ОбластьРождение.Параметры.ГодРождения = Строка.СсылкаДатаРождения;
		ОбластьРождение.Параметры.ОбластьРождения = Строка.СсылкаМестоРождения;
	КонецЦикла;
	ТабличныйДокумент.Вывести(ОбластьРождение);
	
	//ПРИБЫТИЕ
	ОбластьПрибытие = Макет.ПолучитьОбласть("Прибытие");
	ОбластьПрибытие.Параметры.ОбластьПрибытия = "";
	ОбластьПрибытие.Параметры.РайонПрибытия = "";
	ОбластьПрибытие.Параметры.ГородПрибытия = "";
	ОбластьПрибытие.Параметры.ЧислоПрибытия = "";
	ОбластьПрибытие.Параметры.МесяцПрибытия = "";
	ОбластьПрибытие.Параметры.ГодПрибытия = "";
	ОбластьПрибытие.Параметры.УлицаПрибытия = "";
	ОбластьПрибытие.Параметры.ДомПрибытия = "";
	ОбластьПрибытие.Параметры.КорпусПрибытия = "";
	ОбластьПрибытие.Параметры.КвартираПрибытия = "";
	ОбластьПрибытие.Параметры.ЧислоПрибытия = "";
	ОбластьПрибытие.Параметры.ГодПрибытия = "";
	ТабличныйДокумент.Вывести(ОбластьПрибытие);
	
	//ПАСПОРТШАПКА
	ОбластьПаспортШапка = Макет.ПолучитьОбласть("ПаспортШапка");
	ТабличныйДокумент.Вывести(ОбластьПаспортШапка);
	
	//ПАСПОРТТЕЛО
	ОбластьПаспортТело = Макет.ПолучитьОбласть("ПаспортТело");
	Для Каждого Строка Из Выборка Цикл
		Если Строка.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.Паспорт Тогда
			ОбластьПаспортТело.Параметры.Серия = Строка.Серия;
			ОбластьПаспортТело.Параметры.Номер = Строка.Номер;
			ОбластьПаспортТело.Параметры.КемВыдан = Строка.КемВыдан;
			ОбластьПаспортТело.Параметры.КогдаВыдан = Формат(Строка.ДатаВыдачи,"ДФ=dd.MM.yyyy");
		КонецЕсли;
	КонецЦикла;
	ТабличныйДокумент.Вывести(ОбластьПаспортТело);
	
	//МЕСТОНАХОЖДЕНИЕ
	
	Если ТекущийДокумент.Владелец.КонтактнаяИнформация.Количество() > 0 Тогда
		Для каждого СтрокаАдреса Из ТекущийДокумент.Владелец.КонтактнаяИнформация Цикл
			Если СтрокаАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗданияИСооружения Тогда
				Адрес = СтрокаАдреса.ЗначенияПолей;
			КонецЕсли;
		КонецЦикла; 
	Иначе
		Адрес = "";
	КонецЕсли;
	
	СтруктураАдреса = НайтиРеквизитыАдреса(Адрес);
	ОбластьМестонахождения = Макет.ПолучитьОбласть("Местонахождение");
	Попытка
		ОбластьМестонахождения.Параметры.ГородПроживания = СтруктураАдреса.Город;
		ОбластьМестонахождения.Параметры.УлицаПроживания = СтруктураАдреса.Улица;
		ОбластьМестонахождения.Параметры.ДомПроживания = СтруктураАдреса.Дом;
		ОбластьМестонахождения.Параметры.КорпусПроживания = СтруктураАдреса.Корпус;
	Исключение
		Сообщить(НСтр("ru='Не удалось получить адрес здания. Проверьте правильность заполнения адреса.';uk='Не вдалося отримати адресу будівлі. Перевірте правильність заповнення адреси.'"));
	КонецПопытки;
	ОбластьМестонахождения.Параметры.КвартираПроживания = НайтиРеквизитыКвартиры(ТекущийДокумент.ОбъектЛицевогоСчета, 1,"№");
	ТабличныйДокумент.Вывести(ОбластьМестонахождения);
	
	//РАБОТА
	ОбластьРабота = Макет.ПолучитьОбласть("Работа");
	ТабличныйДокумент.Вывести(ОбластьРабота);
	
	//ДЕТИ
	ОбластьДетиПараметры = Макет.ПолучитьОбласть("Дети|ДетиДо16");
	ОбластьДетиЗначение = Макет.ПолучитьОбласть("ДетиЗначение|ДетиДо16Значение");
	ТабличныйДокументДети = Новый ТабличныйДокумент;
	Для Счет = 1 По 4 Цикл
		ОбластьДетиЗначение.Параметры.ФИО = "";
		ОбластьДетиЗначение.Параметры.ГодРождения = "";
		ОбластьДетиЗначение.Параметры.НомерСвидетельстваОРождении = "";
		ОбластьДетиЗначение.Параметры.Город = "";
		ТабличныйДокументДети.Вывести(ОбластьДетиЗначение);
	КонецЦикла; 
	ТабличныйДокумент.Вывести(ОбластьДетиПараметры);
	ТабличныйДокумент.Присоединить(ТабличныйДокументДети);
	
	//АРМИЯ
	ОбластьАрмия = Макет.ПолучитьОбласть("Армия");
	Для Каждого Строка Из Выборка Цикл
		Если Строка.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилет Тогда
			ОбластьАрмия.Параметры.КемПринят = Строка.КемВыдан;
			ОбластьАрмия.Параметры.КогдаПринят = Формат(Строка.ДатаВыдачи,"ДФ=dd.MM.yyyy");
			ОбластьАрмия.Параметры.КемСнят = Строка.КемВыдан;
			ОбластьАрмия.Параметры.КогдаСнят = Формат(Строка.СрокДействия,"ДФ=dd.MM.yyyy");
		КонецЕсли;
	КонецЦикла;
	ТабличныйДокумент.Вывести(ОбластьАрмия);
	
	//ПРОПИСКА
	ОбластьПрописка = Макет.ПолучитьОбласть("Прописка");
	ТабличныйДокумент.Вывести(ОбластьПрописка);
	
	Возврат ТабличныйДокумент;

КонецФункции // ()

Функция ПечатьСправкаПрописанных(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент)

	ЗапросПоЛицевомуСчету = Новый Запрос;
	ЗапросПоЛицевомуСчету.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                              |	ЛицевыеСчета.Владелец,
	                              |	ЛицевыеСчета.ОбъектЛицевогоСчета,
	                              |	ЛицевыеСчета.Наименование,
	                              |	МИНИМУМ(ЛицевыеСчета.ОбъектЛицевогоСчета.Этаж) КАК ОбъектЛицевогоСчетаЭтаж,
	                              |	ЛицевыеСчета.ОбъектЛицевогоСчета.Подъезд,
	                              |	МИНИМУМ(ЛицевыеСчета.ОбъектЛицевогоСчета.КоличествоКомнат) КАК ОбъектЛицевогоСчетаКоличествоКомнат,
	                              |	ЛицевыеСчета.ОбъектЛицевогоСчета.ЖилойФонд,
	                              |	МАКСИМУМ(ВЫБОР
	                              |			КОГДА ПлощадьОбъектовЛицевыхСчетовСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Справочник.ВидыПлощадей.ОбщаяПлощадь)
	                              |				ТОГДА ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь
	                              |		КОНЕЦ) КАК Площадь,
	                              |	МИНИМУМ(ЛицевыеСчетаСрезПоследних.КоличествоПрописанных) КАК КоличествоПрописанных,
	                              |	МИНИМУМ(ЛицевыеСчетаСрезПоследних.КоличествоПроживающих) КАК КоличествоПроживающих,
	                              |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
	                              |	МАКСИМУМ(ВЫБОР
	                              |			КОГДА ПлощадьОбъектовЛицевыхСчетовСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Справочник.ВидыПлощадей.ЖилаяПолощадь)
	                              |				ТОГДА ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь
	                              |		КОНЕЦ) КАК ЖилаяПлощадь
	                              |ИЗ
	                              |	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчета.СрезПоследних КАК ЛицевыеСчетаСрезПоследних
	                              |		ПО ЛицевыеСчета.Ссылка = ЛицевыеСчетаСрезПоследних.ЛицевойСчет
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	                              |		ПО ЛицевыеСчета.Ссылка = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
	                              |		ПО ЛицевыеСчета.ОбъектЛицевогоСчета.Ссылка = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение
	                              |ГДЕ
	                              |	ЛицевыеСчета.Ссылка = &ЛицевойСчет
	                              |
	                              |СГРУППИРОВАТЬ ПО
	                              |	ЛицевыеСчета.ОбъектЛицевогоСчета,
	                              |	ЛицевыеСчета.Наименование,
	                              |	ЛицевыеСчета.Владелец,
	                              |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
	                              |	ЛицевыеСчета.ОбъектЛицевогоСчета.ЖилойФонд,
	                              |	ЛицевыеСчета.ОбъектЛицевогоСчета.Подъезд";
	ЗапросПоЛицевомуСчету.УстановитьПараметр("ЛицевойСчет",ТекущийДокумент);
	ВыборкаТаблицаЗначенияПоЛицевомуСчету = ЗапросПоЛицевомуСчету.Выполнить().Выгрузить();

	Макет = ПолучитьМакет("МакетСправкиПрописанных");

	//ШАПКА
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	Для каждого Строка Из ВыборкаТаблицаЗначенияПоЛицевомуСчету Цикл
		
		ОбластьШапка.Параметры.ФИО = ПараметрыПечати.ТекущийЖитель;
		ОбластьШапка.Параметры.Постоянство = "";
		
		Если ТекущийДокумент.Владелец.КонтактнаяИнформация.Количество() > 0 Тогда
			Для каждого СтрокаАдреса Из ТекущийДокумент.Владелец.КонтактнаяИнформация Цикл
				Если СтрокаАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗданияИСооружения Тогда
					Адрес = СтрокаАдреса.ЗначенияПолей;
				КонецЕсли;
			КонецЦикла; 
		Иначе
			Адрес = "";
		КонецЕсли;
		
		
		СтруктураАдреса = НайтиРеквизитыАдреса(Адрес);
		Попытка
			ОбластьШапка.Параметры.Улица = СтруктураАдреса.Улица;
			ОбластьШапка.Параметры.НомерДома = СтруктураАдреса.Дом;
			ОбластьШапка.Параметры.Постоянство = СтруктураАдреса.Город;

		Исключение
			Сообщить(НСтр("ru='Не удалось получить адрес здания. Проверьте правильность заполнения адреса.';uk='Не вдалося отримати адресу будівлі. Перевірте правильність заповнення адреси.'"));
		КонецПопытки;
		ОбластьШапка.Параметры.КоличествоКомнат = Строка.ОбъектЛицевогоСчетаКоличествоКомнат;
		ОбластьШапка.Параметры.Квартира = НайтиРеквизитыКвартиры(Строка.ОбъектЛицевогоСчета, 1,"№");
		ОбластьШапка.Параметры.Площадь = НСТР("ru = 'общ. '; uk = 'заг. '" )+ Строка(Строка.Площадь);
		ОбластьШапка.Параметры.ЖилаяПлощадь = Строка(Строка.ЖилаяПлощадь);
		ОбластьШапка.Параметры.Этаж = Строка.ОбъектЛицевогоСчетаЭтаж;
		ОбластьШапка.Параметры.ВсегоЭтажей = Строка.ОбъектЛицевогоСчета.Подъезд.КоличествоЭтажей;               
		ОбластьШапка.Параметры.Домовладелец = Строка.Владелец.Организация;
		ОбластьШапка.Параметры.ВладелецСчета = Строка.ОтветственныйВладелец;
		ОбластьШапка.Параметры.ТехСостояниеДома = "";
		ОбластьШапка.Параметры.ХаратеристикиЖилПлощади = "";
		ОбластьШапка.Параметры.КоличествоПрописанных = Строка.КоличествоПроживающих;
		
	КонецЦикла; 
	ТабличныйДокумент.Вывести(ОбластьШапка);

	//ШАПКАТАБЛИЦЫ
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);

	ЗапросПроживающиеЖильцы = Новый Запрос;
	ЗапросПроживающиеЖильцы.Текст = "ВЫБРАТЬ
	                                |	ФизическиеЛица.Ссылка КАК ПотребительУслуг,
	                                |	СведенияОПроживающихЖильцахСрезПоследних.Период КАК ДатаПроживания,
	                                |	СведенияОПроживающихЖильцахСрезПоследних.Проживает,
	                                |	СведенияОПрописанныхЖильцахСрезПоследних.Период КАК ДатаПрописки,
	                                |	СведенияОПрописанныхЖильцахСрезПоследних.Прописан,
	                                |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо КАК ОтветственныйВладелец,
	                                |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.Период КАК ДатаВладелец,
	                                |	ВЫБОР
	                                |		КОГДА ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо, 0) = 0
	                                |			ТОГДА ЛОЖЬ
	                                |		ИНАЧЕ ИСТИНА
	                                |	КОНЕЦ КАК ВыбранВладелец,
	                                |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.Регистратор КАК РегистраторВладелец,
	                                |	СведенияОПроживающихЖильцахСрезПоследних.Регистратор КАК РегистраторПроживающих,
	                                |	СведенияОПрописанныхЖильцахСрезПоследних.Регистратор КАК РегистраторПрописанных,
	                                |	СтепеньРодстваФизическихЛицСрезПоследних.СтепеньРодства
	                                |ИЗ
	                                |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПроживающихЖильцах.СрезПоследних(
	                                |				&Период,
	                                |				Проживает
	                                |					И ЛицевойСчет = &ЛицевойСчет) КАК СведенияОПроживающихЖильцахСрезПоследних
	                                |		ПО ФизическиеЛица.Ссылка = СведенияОПроживающихЖильцахСрезПоследних.Жилец
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПрописанныхЖильцах.СрезПоследних(
	                                |				&Период,
	                                |				Прописан
	                                |					И ЛицевойСчет = &ЛицевойСчет) КАК СведенияОПрописанныхЖильцахСрезПоследних
	                                |		ПО ФизическиеЛица.Ссылка = СведенияОПрописанныхЖильцахСрезПоследних.Жилец
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	                                |		ПО ФизическиеЛица.Ссылка = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтепеньРодстваФизическихЛиц.СрезПоследних КАК СтепеньРодстваФизическихЛицСрезПоследних
	                                |		ПО ФизическиеЛица.Ссылка = СтепеньРодстваФизическихЛицСрезПоследних.ФизическоеЛицоСвязанное
	                                |ГДЕ
	                                |	(СведенияОПроживающихЖильцахСрезПоследних.Проживает = ИСТИНА
	                                |			ИЛИ ВЫБОР
	                                |				КОГДА ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо, 0) = 0
	                                |					ТОГДА ЛОЖЬ
	                                |				ИНАЧЕ ИСТИНА
	                                |			КОНЕЦ)";
	ЗапросПроживающиеЖильцы.УстановитьПараметр("ЛицевойСчет",ТекущийДокумент);
	ЗапросПроживающиеЖильцы.УстановитьПараметр("Период",ТекущаяДата());
	ВыборкаТаблицаЗначенийПоПроживающимЖильцам = ЗапросПроживающиеЖильцы.Выполнить().Выгрузить();

	//ТЕЛОТАБЛИЦЫ
	НомерСтроки = 1;
	ОбластьТелоТаблицы = Макет.ПолучитьОбласть("ТелоТаблицы");
	Для Каждого СтрокаТаблицыЗнач Из ВыборкаТаблицаЗначенийПоПроживающимЖильцам Цикл
		ОбластьТелоТаблицы.Параметры.НомерСтроки = НомерСтроки;
		ОбластьТелоТаблицы.Параметры.ФИО = СтрокаТаблицыЗнач.ПотребительУслуг;
		ОбластьТелоТаблицы.Параметры.РодственныеОтношения = ?(ЗначениеЗаполнено(СтрокаТаблицыЗнач.ОтветственныйВладелец),
																		НСтр("ru = 'Ответственный владелец'; uk = 'Відповідальний власник'"),
																		СтрокаТаблицыЗнач.СтепеньРодства);
		ОбластьТелоТаблицы.Параметры.ГодРождения = СтрокаТаблицыЗнач.ПотребительУслуг.ДатаРождения;
		ОбластьТелоТаблицы.Параметры.ДатаПропискиВДоме = СтрокаТаблицыЗнач.ДатаПрописки;
		ОбластьТелоТаблицы.Параметры.ДатаПропискиВНаселенномПункте = СтрокаТаблицыЗнач.ДатаПрописки;
		ТабличныйДокумент.Вывести(ОбластьТелоТаблицы);
		НомерСтроки = НомерСтроки +1;
	КонецЦикла;
	
	Разница = 9 - НомерСтроки;
	Если Разница > 0 Тогда
		Пока Разница <> 0 Цикл
			ОбластьТелоТаблицы = Макет.ПолучитьОбласть("ТелоТаблицы");
			ТабличныйДокумент.Вывести(ОбластьТелоТаблицы);
			Разница = Разница - 1;
		КонецЦикла;
	КонецЕсли;


	//ШАПКАТАБЛИЦЫ2
	ОбластьШапкаТаблицы2 = Макет.ПолучитьОбласть("ШапкаТаблицы2");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы2);


	//ТЕЛОТАБЛИЦЫ2
	ОбластьТелоТаблицы2 = Макет.ПолучитьОбласть("ТелоТаблицы2");
	Для счет = 1 По 3 Цикл
		ТабличныйДокумент.Вывести(ОбластьТелоТаблицы2);
	КонецЦикла;

	//ПОДВАЛ
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	//ОбластьПодвал.Параметры.Директор = ТекущийДокумент.Владелец.Организация.ТекущийРуководитель;
	//ОбластьПодвал.Параметры.Бухгалтер = ТекущийДокумент.Владелец.Организация.ТекущийГлавныйБухгалтер;
	//ОбластьПодвал.Параметры.Паспортист = ТекущийДокумент.Владелец.Организация.ТекущийПаспортист;
	ТабличныйДокумент.Вывести(ОбластьПодвал);

	Возврат ТабличныйДокумент;
	
КонецФункции // ()
 
Функция ПечатьСправкаОПрописке(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СведенияОПрописанныхЖильцахСрезПоследних.Период КАК ДатаПрописки,
	|	СведенияОПрописанныхЖильцахСрезПоследних.Прописан,
	|	СведенияОПрописанныхЖильцахСрезПоследних.Регистратор КАК РегистраторПрописанных,
	|	СведенияОПрописанныхЖильцахСрезПоследних.Жилец,
	|	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь,
	|	СведенияОПрописанныхЖильцахСрезПоследних.ЛицевойСчет,
	|	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение,
	|	СведенияОПрописанныхЖильцахСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета,
	|	ЛицевыеСчета.Ссылка
	|ИЗ
	|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&Период, ВидПлощади = &ВидПлощади) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
	|		ПО ЛицевыеСчета.ОбъектЛицевогоСчета = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПрописанныхЖильцах.СрезПоследних(&Период, Прописан) КАК СведенияОПрописанныхЖильцахСрезПоследних
	|		ПО ЛицевыеСчета.Ссылка = СведенияОПрописанныхЖильцахСрезПоследних.ЛицевойСчет
	|ГДЕ
	|	ЛицевыеСчета.Ссылка = &ЛицевойСчет";
	Запрос.УстановитьПараметр("ЛицевойСчет",ТекущийДокумент);
	Запрос.УстановитьПараметр("ВидПлощади",Справочники.ВидыПлощадей.ЖилаяПолощадь);
	Запрос.УстановитьПараметр("Период",ТекущаяДата());
	Выборка = Запрос.Выполнить().Выгрузить();			
	Макет = ПолучитьМакет("ПФ_MXL_СправкаОПрописке");
	
	//ШАПКА
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ФИО = ПараметрыПечати.ТекущийЖитель;
	
	Если ТекущийДокумент.Владелец.КонтактнаяИнформация.Количество() > 0 Тогда
		Для каждого СтрокаАдреса Из ТекущийДокумент.Владелец.КонтактнаяИнформация Цикл
			Если СтрокаАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗданияИСооружения Тогда
				Адрес = СтрокаАдреса.ЗначенияПолей;
			КонецЕсли;
		КонецЦикла; 
	Иначе
		Адрес = "";
	КонецЕсли;
	
	СтруктураАдреса = НайтиРеквизитыАдреса(Адрес);
	Попытка
		ОбластьШапка.Параметры.Город = СтруктураАдреса.Город;
		ОбластьШапка.Параметры.Улица = СтруктураАдреса.Улица;
		ОбластьШапка.Параметры.Дом = СтруктураАдреса.Дом;
		ОбластьШапка.Параметры.Корпус = СтруктураАдреса.Корпус;
	Исключение
		Сообщить(НСтр("ru='Не удалось получить адрес здания. Проверьте правильность заполнения адреса.';uk='Не вдалося отримати адресу будівлі. Перевірте правильність заповнення адреси.'"));
	КонецПопытки;
	
	ОбластьШапка.Параметры.Квартира = НайтиРеквизитыКвартиры(ТекущийДокумент.ОбъектЛицевогоСчета, 1,"№");
	
	Для Каждого Строка Из Выборка Цикл					
		ОбластьШапка.Параметры.Жилплощадь = Строка.Площадь;				
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);			
	
	//ТАБЛИЦА
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	ОбластьТелоТаблицы = Макет.ПолучитьОбласть("ТелоТаблицы");
	Для Каждого Строка Из Выборка Цикл
		
		ОбластьТелоТаблицы.Параметры.Жилец = Строка.Жилец;
		ТабличныйДокумент.Вывести(ОбластьТелоТаблицы);
		
	КонецЦикла;
	
	//ПОДВАЛ
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.ФИОДиректор = ТекущийДокумент.Владелец.Организация.ТекущийРуководитель;
	ОбластьПодвал.Параметры.ФИОБухгалтер = ТекущийДокумент.Владелец.Организация.ТекущийГлавныйБухгалтер;
	ОбластьПодвал.Параметры.ФИОПаспортист = ТекущийДокумент.Владелец.Организация.ТекущийПаспортист;
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
			
КонецФункции // ()

Функция ПечатьАкт(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент)

	
	Макет = ПолучитьМакет("Акт");
	ПечататьРезультат = Ложь;
	РеквизитыПокупателяБанк = "";
	РуководительПокупатель = "";
	
	РезультатЗапроса = ПолучитьОбщуюСтруктуруКвитанции(ТекущийДокумент,ПараметрыПечати.ПериодПечати);
	
	
	ВладелецЛС = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец;
	ВладелецЛицевогоСчета = ВладелецЛС.Наименование;
	Организация = ТекущийДокумент.Владелец.Организация;
	БанкОрганизации = Организация.БанковскийСчетПоУмолчанию;
	Отбор = Новый Структура("Организация",Организация);
	СтавкаНДС = РегистрыСведений.СистемыНалогообложенияОрганизаций.ПолучитьПоследнее(ТекущаяДата(),Отбор).СистемаНалогообложения;
	НДС = 0;
	Если  СтавкаНДС = Перечисления.СистемыНалогооблажения.НалогНаПрибыльИНДС Тогда
		НДС = 1.2;    //Временная мера
	КонецЕсли;	

	
	ВыгрузкаБанки = ПараметрыПечати.БанковскийСчетНаПечать.Выгрузить();

	РеквизитыПоставщикаБанк = Организация.НаименованиеПолное + Нстр("ru = ' ЕДРПОУ '; uk = ' ЄДРПОУ '")+Организация.КодПоЕДРПОУ+", тел.:"+?(Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,"Вид") = Неопределено,"",Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,"Вид").Представление);
	Для Каждого Строка из ВыгрузкаБанки Цикл;
		Если Строка.Печать  Тогда			
			БанкРекв = Строка.БанковскийСчет;
			РеквизитыПостав =Символы.ПС+Нстр("ru = ' Р/с '; uk = 'П/р '") +БанкРекв.НомерСчета+", "+
			БанкРекв.Банк.Наименование+" "+
			БанкРекв.Банк.Город+"МФО "+
			БанкРекв.Банк.Код+",";
			РеквизитыПоставщикаБанк = РеквизитыПоставщикаБанк + РеквизитыПостав;
		КонецЕсли;
		
	КонецЦикла;
	РеквизитыПоставщикаБанк = РеквизитыПоставщикаБанк+Символы.ПС+
			?(Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,"Вид") = Неопределено,"",Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,"Вид").Представление);
			
			
	АдресЛС =(ТекущийДокумент.Владелец.Наименование)+", "+ТекущийДокумент.ОбъектЛицевогоСчета.Наименование;
	Должность = "Директор";	
	Если ВладелецЛС.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		РуководительПокупатель = ВладелецЛС.ЮрЛицо.Руководитель;
		Должность = ?(ЗначениеЗаполнено(ВладелецЛС.ЮрЛицо.ТипДиректора),ВладелецЛС.ЮрЛицо.ТипДиректора+ " директор","Директор");
		Договор = ВладелецЛС.ЮрЛицо.ДоговорПоУмолчанию;
		БанкРекв = ВладелецЛС.ЮрЛицо.БанковскийСчетПоУмолчанию;
		РеквизитыПокуп = ВладелецЛС.ЮрЛицо.Наименование + ?(ЗначениеЗаполнено(ВладелецЛС.ЮрЛицо.КодПоЕДРПОУ),Нстр("ru = ', ЕДРПОУ '; uk = ', ЄДРПОУ '"),"")+ВладелецЛС.ЮрЛицо.КодПоЕДРПОУ+
		?(ЗначениеЗаполнено(ВладелецЛС.ЮрЛицо.ИНН),", ІПН "+ ВладелецЛС.ЮрЛицо.ИНН,"")+
		?(ЗначениеЗаполнено(ВладелецЛС.ЮрЛицо.НомерСвидетельства),", № свід. "+ВладелецЛС.ЮрЛицо.НомерСвидетельства,"")+
		Нстр("ru = ', Р/с '; uk = ', П/р '")+БанкРекв.НомерСчета+", "+
		БанкРекв.Банк.Наименование+
		?(ЗначениеЗаполнено(БанкРекв.Банк.Город),", "+Строка(БанкРекв.Банк.Город),"")+", МФО "+
		БанкРекв.Банк.Код+","+Символы.ПС+
		?(ВладелецЛС.ЮрЛицо.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,"Вид") = Неопределено,"",ВладелецЛС.ЮрЛицо.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,"Вид").Представление+?(ЗначениеЗаполнено(ТекущийДокумент.Телефон),", тел.:",""))+
		//?(ВладелецЛС.ЮрЛицо.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,"Вид") = Неопределено,"",ВладелецЛС.ЮрЛицо.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,"Вид").Представление)+Символы.ПС;
		ТекущийДокумент.Телефон;
		РеквизитыПокупателяБанк = РеквизитыПокупателяБанк + РеквизитыПокуп+ Символы.ПС+Символы.ПС;
		РеквизитыПокуп = СтрЗаменить(РеквизитыПокуп,"дом","буд.");
	КонецЕсли;
		

	
	//ШАПКА
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ПредставлениеПокупателя = ВладелецЛицевогоСчета;
	ОбластьШапка.Параметры.ПредставлениеПоставщика =  Организация.НаименованиеПолное;
	ОбластьШапка.Параметры.РуководительПоставщика = Организация.ТекущийРуководитель;
	ОбластьШапка.Параметры.ДолжностьРуководителяПоставщика = Организация.ТекущаяДолжностьРуководителя;
	Если РуководительПокупатель <> "" Тогда
		ОбластьШапка.Параметры.ДолжностьРуководителяПокупателя = Должность;
		ОбластьШапка.Параметры.РуководительПокупателя = РуководительПокупатель;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТекущийГлавныйБухгалтер =  "гол. бухгалтер " + ПолучитьСокращенноеПредставлениеФИО(Строка(Организация.ТекущийГлавныйБухгалтер));
	//ЗАГОЛОВОК
			//Штрихкод или Номер квитанции
		Штрихкод = ТекущийДокумент.Наименование+"-"+Строка(Формат(НачалоМесяца(ПараметрыПечати.ПериодПечати),"ДФ=ddMMyyyy"));
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовок, ТекущийДокумент.Ссылка);
		ОбластьЗаголовок.Параметры.ТекстЗаголовка =НСтр("ru = 'Акт оказания услуг №'; uk = 'Акт надання послуг №'")+Штрихкод+ НСтр("ru = ' от '; uk = ' від '")+ Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		                                                                                      
		//ТекстАктаНачало
		ОбластьТекстАктаНачало = Макет.ПолучитьОбласть("ТекстАктаНачало");
		ОбластьТекстАктаНачало.Параметры.ПредставлениеПокупателя = ВладелецЛицевогоСчета;
		ОбластьТекстАктаНачало.Параметры.ПредставлениеПоставщика = Организация.НаименованиеПолное;
		ОбластьТекстАктаНачало.Параметры.ПредставительПоставщика = ТекущийГлавныйБухгалтер;
		ТабличныйДокумент.Вывести(ОбластьТекстАктаНачало);
		
		//ТекстАктаКонец
		ОбластьТекстАктаКонец = Макет.ПолучитьОбласть("ТекстАктаКонец");
		ТабличныйДокумент.Вывести(ОбластьТекстАктаКонец);
		
			
		//ДопИнформация
		ОбластьДопИнформация = Макет.ПолучитьОбласть("ДопИнформация");
		
		//Если ЗначениеЗаполнено(Договор) Тогда
			ОбластьДопИнформация.Параметры.НазваниеПараметра = "Договiр:";
			ОбластьДопИнформация.Параметры.ЗначениеПараметра = ТекущийДокумент.ОбъектЛицевогоСчета.Код;
		//КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьДопИнформация);
		
		//Пробел
		ОбластьПробел = Макет.ПолучитьОбласть("Пробел");
		ТабличныйДокумент.Вывести(ОбластьПробел);
		
		//ШапкаТаблицы
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		Долг =0;
		Аванс = 0;
		
		ВыборкаОстатокПоУслугам = РезультатЗапроса[5].Выбрать();
		
		РезультатОстаток = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		РезультатОстаток.Следующий();
		Остаток = РезультатОстаток.СуммаОстаток;
		Если Остаток = Неопределено Тогда
			Остаток = 0;
		КонецЕсли;	
		
		НомерСтроки = 1;
		ДобавитьКАвансу = 0;
		ПредыдущаяУслуга = "";
		РезультатУслуги = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ИтогоНачислено = 0;
		Пока РезультатУслуги.Следующий() Цикл
			НачислениеИтог = РезультатУслуги.Начисление;
			ЛьготаИтог = РезультатУслуги.Льгота;
			СубсидияИтог = РезультатУслуги.Субсидия;
			ПерерасчетИтог  = РезультатУслуги.Перерасчет;
			КорректировкаИтог = РезультатУслуги.Корректировка;
			ОплатаИтог = РезультатУслуги.Оплата;
			ИтогоНачислено = НачислениеИтог+ ЛьготаИтог+  СубсидияИтог +ПерерасчетИтог + КорректировкаИтог;
			УслугиДетали = РезультатУслуги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Если Остаток >= 0 Тогда
				Долг = Остаток;
			Иначе
				Аванс = Остаток;
			КонецЕсли;
			
			Пока УслугиДетали.Следующий() Цикл
				
				ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
				ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
				ОбластьСтрока.Параметры.Услуга = УслугиДетали.Услуга.Наименование;
				ВыборкаТариф = УслугиДетали.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Тариф = "";
				КоличествоЕдИзм = 0;
				Пока ВыборкаТариф.Следующий() Цикл
					Если Тариф = "" Тогда
					    Значение = ?(ВыборкаТариф.Тариф = 0 ,"",Строка(ВыборкаТариф.Тариф)) ;

					Иначе 
						Значение = "\"+Строка(ВыборкаТариф.Тариф);
					КонецЕсли;
					Тариф = Тариф+Значение;
					КоличествоЕдИзм = КоличествоЕдИзм+ ВыборкаТариф.КоличествоЕдИзм;
				КонецЦикла;

				ОбластьСтрока.Параметры.Тариф = Тариф;
				ОбластьСтрока.Параметры.ЕдиницаИзмерения = УслугиДетали.ЕдиницаИзмерения;
				ОбластьСтрока.Параметры.Количество = КоличествоЕдИзм;
				ОбластьСтрока.Параметры.Начислено = УслугиДетали.Начисление;
				ОбластьСтрока.Параметры.Льгота = УслугиДетали.Льгота;
				ОбластьСтрока.Параметры.Субсидии = УслугиДетали.Субсидия;
				ОбластьСтрока.Параметры.Корректировка = УслугиДетали.Корректировка;
				ОбластьСтрока.Параметры.Перерасчет = УслугиДетали.Перерасчет;
				
				Сумма = УслугиДетали.Начисление + УслугиДетали.Льгота+ УслугиДетали.Субсидия +УслугиДетали.Корректировка+УслугиДетали.Перерасчет;
				ОбластьСтрока.Параметры.Сумма = Сумма;
				// Добавление к авансу
				СтруктураПоискаДолгаПоУслуге = Новый Структура("ЛицевойСчет, Услуга");
				СтруктураПоискаДолгаПоУслуге.ЛицевойСчет = УслугиДетали.ЛицевойСчет;
				СтруктураПоискаДолгаПоУслуге.Услуга = УслугиДетали.Услуга;
				
				ВыборкаОстатокПоУслугам.Сбросить();
				Долгпериода = 0;
				Пока ВыборкаОстатокПоУслугам.НайтиСледующий(СтруктураПоискаДолгаПоУслуге) Цикл
					Долгпериода = ВыборкаОстатокПоУслугам.СуммаОстаток;
					Прервать;
				КонецЦикла;
				Если Долгпериода = Неопределено Тогда
					Долгпериода = 0;
				КонецЕсли;
				
				Если Долгпериода < 0  И  ПредыдущаяУслуга <> УслугиДетали.Услуга Тогда
					ПредыдущаяУслуга = УслугиДетали.Услуга;
					Если Сумма >= -Долгпериода  Тогда
						ДобавитьКАвансу = ДобавитьКАвансу + Долгпериода;
					Иначе
						ДобавитьКАвансу = ДобавитьКАвансу - Сумма;
					КонецЕсли;
				КонецЕсли;

				Если Сумма <> 0 Тогда
					ТабличныйДокумент.Вывести(ОбластьСтрока);
				КонецЕсли;	
				НомерСтроки =НомерСтроки+1;
			КонецЦикла;	
		КонецЦикла;
			
		СуммаНДС = 0;		
		//Итого
	Если НДС <> 0 Тогда
			
			ОбластьИтого = Макет.ПолучитьОбласть("ИтогоНДС");
			
			ИтогСуммы = ИтогоНачислено;
			//Мера временная
			ОбластьИтого.Параметры.Начислено = ИтогоНачислено;
			
			СуммаНДС = ИтогоНачислено - ИтогоНачислено/НДС;
			ОбластьИтого.Параметры.СуммаНДС =СуммаНДС;
			
			
			
			ТабличныйДокумент.Вывести(ОбластьИтого);
			
			Если ПечататьРезультат Тогда
				ОбластьИтого = Макет.ПолучитьОбласть("ИтогоНДСРезультат");
				ИтогСуммы = Долг + Аванс + ИтогоНачислено+ ДобавитьКАвансу;
				ОбластьИтого.Параметры.Всего = ИтогСуммы;
				
				ОбластьИтого.Параметры.Аванс = Аванс+ ДобавитьКАвансу;
				
				ОбластьИтого.Параметры.Долг = Долг;
			КонецЕсли;	
		Иначе
			ОбластьИтого = Макет.ПолучитьОбласть("Итого");
			
			ИтогСуммы = ИтогоНачислено;
			ОбластьИтого.Параметры.Начислено = ИтогоНачислено;

			ТабличныйДокумент.Вывести(ОбластьИтого);
			
			Если ПечататьРезультат Тогда
				
				ОбластьИтого = Макет.ПолучитьОбласть("ИтогоРезультат");
				ИтогСуммы = Долг + Аванс + ИтогоНачислено + ДобавитьКАвансу;
				
				ОбластьИтого.Параметры.Всего = ИтогСуммы;
				
				ОбластьИтого.Параметры.Аванс = Аванс+ ДобавитьКАвансу;
				
				ОбластьИтого.Параметры.Долг = Долг;
				
				ТабличныйДокумент.Вывести(ОбластьИтого);
			КонецЕсли;
		КонецЕсли;
		
		
		//СуммаПрописью
		ОбластьСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
		
		КодЛок = ТекущийКодЛокализации();
		
		ОбластьСуммаПрописью.Параметры.СуммаПрописью = НСтр("ru = 'Всего предоставлено услуг на сумму '; uk = 'Всього надано послуг на суму '")
		+ЧислоПрописью(ИтогоНачислено,НСтр("ru = 'Л= ru_RU; ДП=Истина'; uk = 'Л= uk_UA; ДП=Истина'"), НСтр("ru = 'гривна,гривны,гривен,ж,копейка,копейки,копеек,м,'; uk = 'гривня,гривні,гривень,ж,копійка,копійки,копійок,ж,2'"))
		+","+Символы.ПС+
		?(НДС<>0,Нстр("ru = 'В том числе НДС: '; uk = 'У тому числі ПДВ: '")+ЧислоПрописью(СуммаНДС,НСтр("ru = 'Л= ru_RU; ДП=Истина'; uk = 'Л= uk_UA; ДП=Истина'"), НСтр("ru = 'гривна,гривны,гривен,ж,копейка,копейки,копеек,ж,'; uk = 'гривня,гривні,гривень,ж,копійка,копійки,копійок,ж,2'"))+","+ Символы.ПС,"")+
		Нстр("ru = 'Всего к оплате: '; uk = 'Разом до сплати: '")+ЧислоПрописью(ИтогСуммы,НСтр("ru = 'Л= ru_RU; ДП=Истина'; uk = 'Л= uk_UA; ДП=Истина'"), НСтр("ru = 'гривна,гривны,гривен,ж,копейка,копейки,копеек,ж,'; uk = 'гривня,гривні,гривень,ж,копійка,копійки,копійок,ж,2'"));
			
		ТабличныйДокумент.Вывести(ОбластьСуммаПрописью);

		
		//МестоСоставления
		ОбластьМестоСоставления = Макет.ПолучитьОбласть("МестоСоставления");
		
		Город = "";
		
		Для каждого СтрокаАдреса Из ТекущийДокумент.Владелец.КонтактнаяИнформация Цикл
			Если СтрокаАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗданияИСооружения Тогда
				Город = УправлениеКонтактнойИнформацией.ПолучитьЗначениеКонтактнойИнформации(СтрокаАдреса.ЗначенияПолей,"Город");
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ОбластьМестоСоставления.Параметры.МестоСоставления = Город;
		ТабличныйДокумент.Вывести(ОбластьМестоСоставления);
		
		//Подписи
		ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
		ОбластьПодписи.Параметры.ПредставительПоставщика = Организация.НаименованиеПолное;
		ОбластьПодписи.Параметры.РеквизитыПоставщика = РеквизитыПоставщикаБанк;
		ОбластьПодписи.Параметры.РеквизитыПокупателя = РеквизитыПокупателяБанк;		
		ОбластьПодписи.Параметры.Дата = ПараметрыПечати.ПериодПечати;
		ОбластьПодписи.Параметры.ПредставительПокупателя = ВладелецЛицевогоСчета;
		ТабличныйДокумент.Вывести(ОбластьПодписи);
	
	
	Возврат ТабличныйДокумент;
			
КонецФункции 
 
Функция ПечатьСчетНаОплату(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент)

	Макет = ПолучитьМакет("СчетНаОплату");
	ПечататьРезультат = Ложь;
	РезультатЗапроса = ПолучитьОбщуюСтруктуруКвитанции(ТекущийДокумент,ПараметрыПечати.ПериодПечати);
	
	//ЗаголовокСчета
	ВладелецЛС = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец;
	ВладелецЛицевогоСчета = ВладелецЛС.Наименование;

	Организация = ТекущийДокумент.Владелец.Организация;
	БанкОрганизации = Организация.БанковскийСчетПоУмолчанию;
	
	Отбор = Новый Структура("Организация",Организация);
	СтавкаНДС = РегистрыСведений.СистемыНалогообложенияОрганизаций.ПолучитьПоследнее(ТекущаяДата(),Отбор).СистемаНалогообложения;
	НДС = 0;
	Если  СтавкаНДС = Перечисления.СистемыНалогооблажения.НалогНаПрибыльИНДС Тогда
		НДС = 1.2;    //Временная мера
	КонецЕсли;
	
	ОбластьЗаголовокСчета = Макет.ПолучитьОбласть("ЗаголовокСчета");
	ОбластьЗаголовокСчета.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное;
	ОбластьЗаголовокСчета.Параметры.ЕДРПОУОрганизации = Организация.КодПоЕДРПОУ;
	ОбластьЗаголовокСчета.Параметры.БанкОрганизации = ВРег(БанкОрганизации.Банк.Наименование);
	ОбластьЗаголовокСчета.Параметры.МФОБанкаОрганизации = БанкОрганизации.Банк.Код;
	ОбластьЗаголовокСчета.Параметры.НомерРасчетногоСчетаОрганизации = БанкОрганизации.НомерСчета;
	ТабличныйДокумент.Вывести(ОбластьЗаголовокСчета);
		//Штрихкод или Номер квитанции
		Штрихкод = ТекущийДокумент.Наименование+"-"+Строка(Формат(НачалоМесяца(ПараметрыПечати.ПериодПечати),"ДФ=ddMMyyyy"))+НСтр("ru = ' от '; uk = ' від '")+Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy")  ;
		
		//ЗАГОЛОВОК
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовок, ТекущийДокумент.Ссылка);
		ОбластьЗаголовок.Параметры.ТекстЗаголовка =НСтр("ru = 'Счет на оплату №'; uk = 'Рахунок на сплату №'")+Штрихкод;
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		//Поставщик

		ВыгрузкаБанки = ПараметрыПечати.БанковскийСчетНаПечать.Выгрузить();

		РеквизитыПоставщикаБанк = "";
		Для Каждого Строка из ВыгрузкаБанки Цикл;
			Если Строка.Печать  Тогда 
				БанкРекв = Строка.БанковскийСчет;
				РеквизитыПостав = НСтр("ru = 'Р/с'; uk = 'П/р'")+БанкРекв.НомерСчета+", "+
				БанкРекв.Банк.Наименование+", "+
				БанкРекв.Банк.Город+", МФО "+
				БанкРекв.Банк.Код+Символы.ПС+
				?(Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,"Вид") = Неопределено,"",Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,"Вид").Представление+", тел.:")+
				?(Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,"Вид") = Неопределено,"",Организация.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,"Вид").Представление)+Символы.ПС+Символы.ПС;
				РеквизитыПоставщикаБанк = РеквизитыПоставщикаБанк + РеквизитыПостав;
			КонецЕсли;
		КонецЦикла;
		
		РеквизитыПокупателяБанк = "";
		Если ВладелецЛС.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			БанкРекв = ВладелецЛС.ЮрЛицо.БанковскийСчетПоУмолчанию;
			РеквизитыПокуп =  НСтр("ru = 'Р/с'; uk = 'П/р'")+БанкРекв.НомерСчета+", "+
			БанкРекв.Банк.Наименование+", "+
			БанкРекв.Банк.Город+", МФО "+
			БанкРекв.Банк.Код+Символы.ПС+
			?(ВладелецЛС.ЮрЛицо.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,"Вид") = Неопределено,"",ВладелецЛС.ЮрЛицо.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,"Вид").Представление+", тел.:")+
			?(ВладелецЛС.ЮрЛицо.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,"Вид") = Неопределено,"",ВладелецЛС.ЮрЛицо.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,"Вид").Представление)+Символы.ПС+Символы.ПС;
			РеквизитыПокупателяБанк = РеквизитыПокупателяБанк + РеквизитыПокуп;
		КонецЕсли;
				
		ОбластьПоставщик = Макет.ПолучитьОбласть("Поставщик");
		ОбластьПоставщик.Параметры.ПредставлениеПоставщика = Организация.НаименованиеПолное;
		
		ОбластьПоставщик.Параметры.РеквизитыПоставщика = РеквизитыПоставщикаБанк;
				
		ТабличныйДокумент.Вывести(ОбластьПоставщик);
		
		//Покупатель
		ОбластьПокупатель = Макет.ПолучитьОбласть("Покупатель");
		ОбластьПокупатель.Параметры.ПредставлениеПокупателя = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ТекущийДокумент))[0].ОтветственныйВладелец.Наименование;
		ОбластьПокупатель.Параметры.РеквизитыПокупателя = РеквизитыПокупателяБанк;
		ТабличныйДокумент.Вывести(ОбластьПокупатель);
		
		//ДопИнформация
		ОбластьДопИнформация = Макет.ПолучитьОбласть("ДопИнформация");
		ТабличныйДокумент.Вывести(ОбластьДопИнформация);
				
		//ШапкаТаблицы
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		Долг =0;
		Аванс = 0;
		ПредыдущаяУслуга = "";
		ДобавитьКАвансу = 0;
		
		ВыборкаОстатокПоУслугам = РезультатЗапроса[5].Выбрать();

		
		РезультатОстаток = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		РезультатОстаток.Следующий();
		Остаток = РезультатОстаток.СуммаОстаток;
		Если Остаток = Неопределено Тогда
			Остаток = 0;
		КонецЕсли;
			
		
		НомерСтроки = 1;
		РезультатУслуги = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока РезультатУслуги.Следующий() Цикл
			НачислениеИтог = РезультатУслуги.Начисление;
			ЛьготаИтог = РезультатУслуги.Льгота;
			СубсидияИтог = РезультатУслуги.Субсидия;
			ПерерасчетИтог  = РезультатУслуги.Перерасчет;
			КорректировкаИтог = РезультатУслуги.Корректировка;
			ОплатаИтог = РезультатУслуги.Оплата;
			ИтогоНачислено = НачислениеИтог+ ЛьготаИтог+  СубсидияИтог +ПерерасчетИтог + КорректировкаИтог;
			УслугиДетали = РезультатУслуги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Если Остаток >= 0 Тогда
				Долг = Остаток;
			Иначе
				Аванс = Остаток;
			КонецЕсли;
			
			Пока УслугиДетали.Следующий() Цикл
				
				ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
				ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
				ОбластьСтрока.Параметры.Услуга = УслугиДетали.Услуга;
				ВыборкаТариф = УслугиДетали.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Тариф = "";
				КоличествоЕдИзм = 0;
				Пока ВыборкаТариф.Следующий() Цикл
					Если Тариф = "" Тогда
					    Значение = ?(ВыборкаТариф.Тариф = 0 ,"",Строка(ВыборкаТариф.Тариф)) ;

					Иначе 
						Значение = "\"+Строка(ВыборкаТариф.Тариф);
					КонецЕсли;
					Тариф = Тариф+Значение;
					КоличествоЕдИзм = КоличествоЕдИзм+ ВыборкаТариф.КоличествоЕдИзм;
				КонецЦикла;

				ОбластьСтрока.Параметры.Тариф = Тариф;
				ОбластьСтрока.Параметры.ЕдиницаИзмерения = УслугиДетали.ЕдиницаИзмерения;
				ОбластьСтрока.Параметры.Количество = КоличествоЕдИзм;
				ОбластьСтрока.Параметры.Начислено = УслугиДетали.Начисление;
				ОбластьСтрока.Параметры.Льготы = УслугиДетали.Льгота;
				ОбластьСтрока.Параметры.Субсидии = УслугиДетали.Субсидия;
				ОбластьСтрока.Параметры.Корректировка = УслугиДетали.Корректировка;
				ОбластьСтрока.Параметры.Перерасчет = УслугиДетали.Перерасчет;
				Сумма = УслугиДетали.Начисление + УслугиДетали.Льгота+ УслугиДетали.Субсидия +УслугиДетали.Корректировка+УслугиДетали.Перерасчет;
				ОбластьСтрока.Параметры.Сумма = Сумма;
				
				// Добавление к авансу
				СтруктураПоискаДолгаПоУслуге = Новый Структура("ЛицевойСчет, Услуга");
				СтруктураПоискаДолгаПоУслуге.ЛицевойСчет = УслугиДетали.ЛицевойСчет;
				СтруктураПоискаДолгаПоУслуге.Услуга = УслугиДетали.Услуга;
				
				ВыборкаОстатокПоУслугам.Сбросить();
				Долгпериода = 0;
				Пока ВыборкаОстатокПоУслугам.НайтиСледующий(СтруктураПоискаДолгаПоУслуге) Цикл
					Долгпериода = ВыборкаОстатокПоУслугам.СуммаОстаток;
					Прервать;
				КонецЦикла;
				Если Долгпериода = Неопределено Тогда
					Долгпериода = 0;
				КонецЕсли;
				
				Если Долгпериода < 0  И  ПредыдущаяУслуга <> УслугиДетали.Услуга Тогда
					ПредыдущаяУслуга = УслугиДетали.Услуга;
					Если Сумма >= -Долгпериода  Тогда
						ДобавитьКАвансу = ДобавитьКАвансу + Долгпериода;
					Иначе
						ДобавитьКАвансу = ДобавитьКАвансу - Сумма;
					КонецЕсли;
				КонецЕсли;
				
				Если Сумма <> 0 Тогда
					ТабличныйДокумент.Вывести(ОбластьСтрока);
				КонецЕсли;	
				НомерСтроки =НомерСтроки+1;
			КонецЦикла;	
		КонецЦикла;
			
			
		
		//Итого
		СуммаНДС = 0;		
		//Итого
		Если НДС <> 0 Тогда
			
			ОбластьИтого = Макет.ПолучитьОбласть("ИтогоНДС");
			
			ИтогСуммы = ИтогоНачислено;
			//Мера временная
			ОбластьИтого.Параметры.Начислено = ИтогоНачислено;
			
			СуммаНДС = ИтогоНачислено - ИтогоНачислено/НДС;
			ОбластьИтого.Параметры.СуммаНДС =СуммаНДС;
			
			
			
			ТабличныйДокумент.Вывести(ОбластьИтого);
			
			Если ПечататьРезультат Тогда
				ОбластьИтого = Макет.ПолучитьОбласть("ИтогоНДСРезультат");
				ИтогСуммы = Долг + Аванс + ИтогоНачислено+ ДобавитьКАвансу;
				ОбластьИтого.Параметры.Всего = ИтогСуммы;
				
				ОбластьИтого.Параметры.Аванс = Аванс+ ДобавитьКАвансу;
				
				ОбластьИтого.Параметры.Долг = Долг;
			КонецЕсли;	
		Иначе
			ОбластьИтого = Макет.ПолучитьОбласть("Итого");
			
			ИтогСуммы = ИтогоНачислено;
			ОбластьИтого.Параметры.Начислено = ИтогоНачислено;

			ТабличныйДокумент.Вывести(ОбластьИтого);
			
			Если ПечататьРезультат Тогда
				
				ОбластьИтого = Макет.ПолучитьОбласть("ИтогоРезультат");
				ИтогСуммы = Долг + Аванс + ИтогоНачислено + ДобавитьКАвансу;
				
				ОбластьИтого.Параметры.Всего = ИтогСуммы;
				
				ОбластьИтого.Параметры.Аванс = Аванс+ ДобавитьКАвансу;
				
				ОбластьИтого.Параметры.Долг = Долг;
				
				ТабличныйДокумент.Вывести(ОбластьИтого);
			КонецЕсли;
		КонецЕсли;

		
		//СуммаПрописью
		ОбластьСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
		ОбластьСуммаПрописью.Параметры.ИтоговаяСтрока = НСтр("ru='Всего предоставлено услуг ';uk='Всього надано послуг '",)+(НомерСтроки-1) + ", "+
		НСтр("ru=' на сумму ';uk=' на суму '",) + ИтогСуммы+ " грн.";
		
		КодЛок = ТекущийКодЛокализации();
		ОбластьСуммаПрописью.Параметры.СуммаПрописью = ЧислоПрописью(ИтогСуммы,НСтр("ru = 'Л= ru_RU; ДП=Истина'; uk = 'Л= uk_UA; ДП=Истина'"), НСтр("ru = 'гривна,гривны,гривен,ж,копейка,копейки,копеек,ж,'; uk = 'гривня,гривні,гривень,ж,копійка,копійки,копійок,ж,2'"));

		ТабличныйДокумент.Вывести(ОбластьСуммаПрописью);
		
		//Подписи
		ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
		ТабличныйДокумент.Вывести(ОбластьПодписи);
		
	Возврат ТабличныйДокумент;
			
КонецФункции

Функция ПечатьСправкаОСоставеСемьи(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент)

	Макет = ПолучитьМакет("ПФ_MXL_СправкаОСоставеСемьиИПрописке");

	//ШАПКА
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ОбластьНазначение = Макет.ПолучитьОбласть("Назначение");
	
	ОбластьНазначение.Параметры.ФИО = ПараметрыПечати.ТекущийЖитель;
	
	Если ТекущийДокумент.Владелец.КонтактнаяИнформация.Количество() > 0 Тогда
		Для каждого СтрокаАдреса Из ТекущийДокумент.Владелец.КонтактнаяИнформация Цикл
			Если СтрокаАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗданияИСооружения Тогда
				Адрес = СтрокаАдреса.Представление;
			КонецЕсли;
		КонецЦикла; 
	Иначе
		Адрес = "";
	КонецЕсли;
	
	ОбластьНазначение.Параметры.адрес = Адрес;
	
	ТабличныйДокумент.Вывести(ОбластьНазначение);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	//ТАБЛИЦА
	ЗапросПроживающиеЖильцы = Новый Запрос;
	ЗапросПроживающиеЖильцы.Текст = "ВЫБРАТЬ
	                                |	ФизическиеЛица.Ссылка КАК ПотребительУслуг,
	                                |	СведенияОПроживающихЖильцахСрезПоследних.Период КАК ДатаПроживания,
	                                |	СведенияОПроживающихЖильцахСрезПоследних.Проживает,
	                                |	СведенияОПрописанныхЖильцахСрезПоследних.Период КАК ДатаПрописки,
	                                |	СведенияОПрописанныхЖильцахСрезПоследних.Прописан,
	                                |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо КАК ОтветственныйВладелец,
	                                |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.Период КАК ДатаВладелец,
	                                |	ВЫБОР
	                                |		КОГДА ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо, 0) = 0
	                                |			ТОГДА ЛОЖЬ
	                                |		ИНАЧЕ ИСТИНА
	                                |	КОНЕЦ КАК ВыбранВладелец,
	                                |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.Регистратор КАК РегистраторВладелец,
	                                |	СведенияОПроживающихЖильцахСрезПоследних.Регистратор КАК РегистраторПроживающих,
	                                |	СведенияОПрописанныхЖильцахСрезПоследних.Регистратор КАК РегистраторПрописанных,
	                                |	СтепеньРодстваФизическихЛицСрезПоследних.СтепеньРодства,
	                                |	ВЫБОР
	                                |		КОГДА ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.Паспорт)
	                                |			ТОГДА ДокументыФизическихЛицСрезПоследних.Серия
	                                |	КОНЕЦ КАК СерияПаспорта,
	                                |	ВЫБОР
	                                |		КОГДА ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОРождении)
	                                |			ТОГДА ДокументыФизическихЛицСрезПоследних.Серия
	                                |	КОНЕЦ КАК СерияСвидетельства,
	                                |	ВЫБОР
	                                |		КОГДА ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.Паспорт)
	                                |			ТОГДА ДокументыФизическихЛицСрезПоследних.Номер
	                                |	КОНЕЦ КАК НомерПаспорта,
	                                |	ВЫБОР
	                                |		КОГДА ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОРождении)
	                                |			ТОГДА ДокументыФизическихЛицСрезПоследних.Номер
	                                |	КОНЕЦ КАК НомерСвидетельства
	                                |ИЗ
	                                |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПроживающихЖильцах.СрезПоследних(
	                                |				&Период,
	                                |				Проживает
	                                |					И ЛицевойСчет = &ЛицевойСчет) КАК СведенияОПроживающихЖильцахСрезПоследних
	                                |		ПО ФизическиеЛица.Ссылка = СведенияОПроживающихЖильцахСрезПоследних.Жилец
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПрописанныхЖильцах.СрезПоследних(
	                                |				&Период,
	                                |				Прописан
	                                |					И ЛицевойСчет = &ЛицевойСчет) КАК СведенияОПрописанныхЖильцахСрезПоследних
	                                |		ПО ФизическиеЛица.Ссылка = СведенияОПрописанныхЖильцахСрезПоследних.Жилец
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	                                |		ПО ФизическиеЛица.Ссылка = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтепеньРодстваФизическихЛиц.СрезПоследних КАК СтепеньРодстваФизическихЛицСрезПоследних
	                                |		ПО ФизическиеЛица.Ссылка = СтепеньРодстваФизическихЛицСрезПоследних.ФизическоеЛицоСвязанное
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(&Период, ) КАК ДокументыФизическихЛицСрезПоследних
	                                |		ПО ФизическиеЛица.Ссылка = ДокументыФизическихЛицСрезПоследних.Физлицо
	                                |ГДЕ
	                                |	(СведенияОПроживающихЖильцахСрезПоследних.Проживает = ИСТИНА
	                                |			ИЛИ ВЫБОР
	                                |				КОГДА ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо, 0) = 0
	                                |					ТОГДА ЛОЖЬ
	                                |				ИНАЧЕ ИСТИНА
	                                |			КОНЕЦ)
	                                |
	                                |УПОРЯДОЧИТЬ ПО
	                                |	ВыбранВладелец УБЫВ";
	ЗапросПроживающиеЖильцы.УстановитьПараметр("ЛицевойСчет",ТекущийДокумент);
	ЗапросПроживающиеЖильцы.УстановитьПараметр("Период",ТекущаяДата());
	ВыборкаТаблицаЗначенийПоПроживающимЖильцам = ЗапросПроживающиеЖильцы.Выполнить().Выгрузить();
	
	НомерСтроки = 1;
	ОбластьТелоТаблицы = Макет.ПолучитьОбласть("Строка");
	Для Каждого СтрокаТаблицыЗнач Из ВыборкаТаблицаЗначенийПоПроживающимЖильцам Цикл
		ОбластьТелоТаблицы.Параметры.ФИО = СтрокаТаблицыЗнач.ПотребительУслуг;
		ОбластьТелоТаблицы.Параметры.Отношение = ?(СтрокаТаблицыЗнач.ВыбранВладелец,"уповноважений власник (співвласник, наймач)" ,СтрокаТаблицыЗнач.СтепеньРодства);
		ОбластьТелоТаблицы.Параметры.ДатаРождения = СтрокаТаблицыЗнач.ПотребительУслуг.ДатаРождения;
		Если ЗначениеЗаполнено(СтрокаТаблицыЗнач.СерияПаспорта) Тогда
			Документ = СТРОКА(СтрокаТаблицыЗнач.СерияПаспорта)+", "+СТРОКА(СтрокаТаблицыЗнач.НомерПаспорта);
		ИначеЕсли  	ЗначениеЗаполнено(СтрокаТаблицыЗнач.СерияСвидетельства) Тогда
		    Документ = СТРОКА(СтрокаТаблицыЗнач.СерияСвидетельства)+", "+СТРОКА(СтрокаТаблицыЗнач.НомерСвидетельства);
		КонецЕсли;	
		ОбластьТелоТаблицы.Параметры.Документ = Документ;
		
		ТабличныйДокумент.Вывести(ОбластьТелоТаблицы);
		НомерСтроки = НомерСтроки +1;
	КонецЦикла;

		Разница = 11 - НомерСтроки;
	Если Разница > 0 Тогда
		Пока Разница <> 0 Цикл
			ОбластьТелоТаблицы = Макет.ПолучитьОбласть("Строка");
			ТабличныйДокумент.Вывести(ОбластьТелоТаблицы);
			Разница = Разница - 1;
		КонецЦикла;
	КонецЕсли;
	
	//ПОДВАЛ
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьПодвал.Параметры.ВсегоЖильцов = НомерСтроки-1;
	
	ТекущийРуководитель = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СТРОКА(ТекущийДокумент.Владелец.Организация.ТекущийРуководитель)," ");
	ТекущийПаспортист	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СТРОКА(ТекущийДокумент.Владелец.Организация.ТекущийПаспортист)," ");
	
    ОбластьПодвал.Параметры.Начальник = ?(ТекущийРуководитель.Количество() = 3,ТекущийРуководитель[0]+" "+Лев(ТекущийРуководитель[1],1)+". "+Лев(ТекущийРуководитель[2],1)+".",ТекущийДокумент.Владелец.Организация.ТекущийРуководитель);
											
	ОбластьПодвал.Параметры.Паспортист =?(ТекущийПаспортист.Количество() = 3,ТекущийПаспортист[0]+" "+Лев(ТекущийПаспортист[1],1)+". "+Лев(ТекущийПаспортист[2],1)+".",ТекущийДокумент.Владелец.Организация.ТекущийПаспортист);
	
	ОбластьПодвал.Параметры.День = ТекущаяДата();
	ОбластьПодвал.Параметры.Месяц = ТекущаяДата();
	ОбластьПодвал.Параметры.Год = ТекущаяДата();
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);

	
	Возврат ТабличныйДокумент;
	
	
КонецФункции

Функция ПечатьСправкаОРазмереПлатежей(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент)
	Макет = ПолучитьМакет("ПФ_MXL_СправкаОРазмереПлатежей");
//{{MRG[ <-> ]
//	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();
//	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
//}}MRG[ <-> ]
	МесяцНачало = "";
	Месяцокончание = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыЗапретаИзменения.ДатаЗапрета
		|ИЗ
		|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
		|ГДЕ
		|	ДатыЗапретаИзменения.Объект = &Здание
		|	И ДатыЗапретаИзменения.Раздел = &Раздел";
		
	Запрос.УстановитьПараметр("Здание", ТекущийДокумент.Владелец);
	Запрос.УстановитьПараметр("Раздел", ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.Здания);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
	
		МесяцНачало = НачалоМесяца(РезультатЗапроса.ДатаЗапрета);
		Месяцокончание = КонецМесяца(РезультатЗапроса.ДатаЗапрета);
					
	КонецЕсли;

		
	ФИО = ПараметрыПечати.ТекущийЖитель;
	Адрес1 = "";
	Адрес2 = "";
	Если ТекущийДокумент.Владелец.КонтактнаяИнформация.Количество() > 0 Тогда
		Для каждого СтрокаАдреса Из ТекущийДокумент.Владелец.КонтактнаяИнформация Цикл
			Если СтрокаАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗданияИСооружения Тогда
				Индекс = УправлениеКонтактнойИнформацией.ПолучитьЗначениеКонтактнойИнформации(СтрокаАдреса.ЗначенияПолей,"Индекс");
				Регион =  УправлениеКонтактнойИнформацией.ПолучитьЗначениеКонтактнойИнформации(СтрокаАдреса.ЗначенияПолей,"Регион");
				Район =  УправлениеКонтактнойИнформацией.ПолучитьЗначениеКонтактнойИнформации(СтрокаАдреса.ЗначенияПолей,"Район");
				Город =  УправлениеКонтактнойИнформацией.ПолучитьЗначениеКонтактнойИнформации(СтрокаАдреса.ЗначенияПолей,"Город");
				Улица =  УправлениеКонтактнойИнформацией.ПолучитьЗначениеКонтактнойИнформации(СтрокаАдреса.ЗначенияПолей,"Улица");
				ТипДома = УправлениеКонтактнойИнформацией.ПолучитьЗначениеКонтактнойИнформации(СтрокаАдреса.ЗначенияПолей,"ТипДома");
				
				Дом = ТипДома +" " + УправлениеКонтактнойИнформацией.ПолучитьЗначениеКонтактнойИнформации(СтрокаАдреса.ЗначенияПолей,"Дом");
				
				ТипКорпуса =  УправлениеКонтактнойИнформацией.ПолучитьЗначениеКонтактнойИнформации(СтрокаАдреса.ЗначенияПолей,"ТипКорпуса");
				Корпус = ТипКорпуса +" " + УправлениеКонтактнойИнформацией.ПолучитьЗначениеКонтактнойИнформации(СтрокаАдреса.ЗначенияПолей,"Корпус");
		        
				
				//АдресМасс = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущийДокумент.Владелец.Наименование,",");
				//ПредставдениеАдреса = ПечатьКвитанцииНаОплату.ПолучитьПредставлениеАдреса(АдресМасс,ТекущийДокумент.ОбъектЛицевогоСчета);
				//Адрес = ПредставдениеАдреса;
				Адрес1 = Город+", "+Район+", "+Регион;
				Адрес2 = Улица+", "+Дом+", "+Корпус+", "+Строка(ТекущийДокумент.ОбъектЛицевогоСчета);
				
				
			КонецЕсли;
		КонецЦикла; 
	Иначе
		Адрес = "";
	КонецЕсли;
	АдресОрганизации = "";
	Если ТекущийДокумент.Владелец.Организация.КонтактнаяИнформация.Количество() > 0 Тогда
		Для каждого СтрокаАдреса Из ТекущийДокумент.Владелец.Организация.КонтактнаяИнформация Цикл
			Если СтрокаАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации Тогда
//{{MRG[ <-> ]
//				Организация = ТекущийДокумент.Владелец.Организация;
//}}MRG[ <-> ]
				Индекс = УправлениеКонтактнойИнформацией.ПолучитьЗначениеКонтактнойИнформации(СтрокаАдреса.ЗначенияПолей,"Индекс");
				Район =  УправлениеКонтактнойИнформацией.ПолучитьЗначениеКонтактнойИнформации(СтрокаАдреса.ЗначенияПолей,"Регион");
				АдресМасс = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущийДокумент.Владелец.Организация.Наименование,",");
//{{MRG[ <-> ]
				ПредставдениеАдреса = ПечатьКвитанцииНаОплату2.ПолучитьПредставлениеАдреса(АдресМасс,ТекущийДокумент.ОбъектЛицевогоСчета);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//				ПредставдениеАдреса = ПечатьКвитанцииНаОплату.ПолучитьПредставлениеАдреса(АдресМасс,ТекущийДокумент.ОбъектЛицевогоСчета,КодЯзыкаПечать);
//}}MRG[ <-> ]
				АдресОрганизации = СтрокаАдреса.Представление;
				АдресОрганизации = ?(Индекс = "",АдресОрганизации,СтрЗаменить(АдресОрганизации,Индекс+",",""));
//{{MRG[ <-> ]
//				БанковскиеРеквизиты = "код ЄДРПОУ" +Организация.КодПоЕДРПОУ+" п/р "+ТекущийДокумент.Владелец.Организация.БанковскийСчетПоУмолчанию.НомерСчета+" МФО"+ТекущийДокумент.Владелец.Организация.БанковскийСчетПоУмолчанию.Банк.Код;
//}}MRG[ <-> ]
				Прервать;
			КонецЕсли;
		КонецЦикла; 
	Иначе
		АдресОрганизации = "";
	КонецЕсли;

	
		
	//ТАБЛИЦА
	ЗапросПроживающиеЖильцы = Новый Запрос;
	ЗапросПроживающиеЖильцы.Текст = "ВЫБРАТЬ
	                                |	СтепеньРодстваФизическихЛицСрезПоследних.ФизическоеЛицоСвязанное КАК ПотребительУслуг,
	                                |	СведенияОПроживающихЖильцахСрезПоследних.Период КАК ДатаПроживания,
	                                |	ЕСТЬNULL(СведенияОПроживающихЖильцахСрезПоследних.Проживает, ЛОЖЬ) КАК Проживает,
	                                |	СведенияОПрописанныхЖильцахСрезПоследних.Период КАК ДатаПрописки,
	                                |	ЕСТЬNULL(СведенияОПрописанныхЖильцахСрезПоследних.Прописан, ЛОЖЬ) КАК Прописан,
	                                |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо КАК ОтветственныйВладелец,
	                                |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.Период КАК ДатаВладелец,
	                                |	ВЫБОР
	                                |		КОГДА ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо, 0) = 0
	                                |			ТОГДА ЛОЖЬ
	                                |		ИНАЧЕ ИСТИНА
	                                |	КОНЕЦ КАК ВыбранВладелец,
	                                |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.Регистратор КАК РегистраторВладелец,
	                                |	СведенияОПроживающихЖильцахСрезПоследних.Регистратор КАК РегистраторПроживающих,
	                                |	СведенияОПрописанныхЖильцахСрезПоследних.Регистратор КАК РегистраторПрописанных,
	                                |	ЕСТЬNULL(СтепеньРодстваФизическихЛицСрезПоследних.СтепеньРодства, """") КАК СтепеньРодства,
	                                |	ВЫБОР
	                                |		КОГДА ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.Паспорт)
	                                |			ТОГДА ДокументыФизическихЛицСрезПоследних.Серия
	                                |	КОНЕЦ КАК СерияПаспорта,
	                                |	ВЫБОР
	                                |		КОГДА ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОРождении)
	                                |			ТОГДА ДокументыФизическихЛицСрезПоследних.Серия
	                                |	КОНЕЦ КАК СерияСвидетельства,
	                                |	ВЫБОР
	                                |		КОГДА ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.Паспорт)
	                                |			ТОГДА ДокументыФизическихЛицСрезПоследних.Номер
	                                |	КОНЕЦ КАК НомерПаспорта,
	                                |	ВЫБОР
	                                |		КОГДА ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОРождении)
	                                |			ТОГДА ДокументыФизическихЛицСрезПоследних.Номер
	                                |	КОНЕЦ КАК НомерСвидетельства,
	                                |	ДокументыФизическихЛицСрезПоследних.ВидДокумента
	                                |ИЗ
	                                |	РегистрСведений.СтепеньРодстваФизическихЛиц.СрезПоследних(&Период, Регистратор.ЛицевойСчет = &ЛицевойСчет) КАК СтепеньРодстваФизическихЛицСрезПоследних
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПроживающихЖильцах.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК СведенияОПроживающихЖильцахСрезПоследних
	                                |		ПО СтепеньРодстваФизическихЛицСрезПоследних.ФизическоеЛицоСвязанное = СведенияОПроживающихЖильцахСрезПоследних.Жилец
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПрописанныхЖильцах.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК СведенияОПрописанныхЖильцахСрезПоследних
	                                |		ПО СтепеньРодстваФизическихЛицСрезПоследних.ФизическоеЛицоСвязанное = СведенияОПрописанныхЖильцахСрезПоследних.Жилец
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	                                |		ПО СтепеньРодстваФизическихЛицСрезПоследних.ФизическоеЛицоОсновное = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(&Период, ) КАК ДокументыФизическихЛицСрезПоследних
	                                |		ПО СтепеньРодстваФизическихЛицСрезПоследних.ФизическоеЛицоСвязанное = ДокументыФизическихЛицСрезПоследних.Физлицо
	                                |
	                                |СГРУППИРОВАТЬ ПО
	                                |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.ФизЛицо,
	                                |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.Регистратор,
	                                |	ЕСТЬNULL(СведенияОПроживающихЖильцахСрезПоследних.Проживает, ЛОЖЬ),
	                                |	СведенияОПроживающихЖильцахСрезПоследних.Период,
	                                |	ЕСТЬNULL(СведенияОПрописанныхЖильцахСрезПоследних.Прописан, ЛОЖЬ),
	                                |	СведенияОПрописанныхЖильцахСрезПоследних.Период,
	                                |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.Период,
	                                |	СведенияОПроживающихЖильцахСрезПоследних.Регистратор,
	                                |	СведенияОПрописанныхЖильцахСрезПоследних.Регистратор,
	                                |	СтепеньРодстваФизическихЛицСрезПоследних.СтепеньРодства,
	                                |	ВЫБОР
	                                |		КОГДА ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.Паспорт)
	                                |			ТОГДА ДокументыФизическихЛицСрезПоследних.Серия
	                                |	КОНЕЦ,
	                                |	ВЫБОР
	                                |		КОГДА ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОРождении)
	                                |			ТОГДА ДокументыФизическихЛицСрезПоследних.Серия
	                                |	КОНЕЦ,
	                                |	ВЫБОР
	                                |		КОГДА ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОРождении)
	                                |			ТОГДА ДокументыФизическихЛицСрезПоследних.Номер
	                                |	КОНЕЦ,
	                                |	ВЫБОР
	                                |		КОГДА ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.Паспорт)
	                                |			ТОГДА ДокументыФизическихЛицСрезПоследних.Номер
	                                |	КОНЕЦ,
	                                |	СтепеньРодстваФизическихЛицСрезПоследних.ФизическоеЛицоСвязанное,
	                                |	ДокументыФизическихЛицСрезПоследних.ВидДокумента
	                                |
	                                |УПОРЯДОЧИТЬ ПО
	                                |	ВыбранВладелец УБЫВ
	                                |;
	                                |
	                                |////////////////////////////////////////////////////////////////////////////////
	                                |ВЫБРАТЬ
	                                |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет,
	                                |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК Владелец
	                                |ИЗ
	                                |	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	                                |;
	                                |
	                                |////////////////////////////////////////////////////////////////////////////////
	                                |ВЫБРАТЬ
	                                |	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.ВидПлощади,
	                                |	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь
	                                |ИЗ
	                                |	РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(, Помещение = &Квартира) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
	                                |;
	                                |
	                                |////////////////////////////////////////////////////////////////////////////////
	                                |ВЫБРАТЬ
	                                |	НазначенныеЛьготыСрезПоследних.Льгота КАК Льгота,
	                                |	НазначенныеЛьготыСрезПоследних.Услуга,
	                                |	НазначенныеЛьготыСрезПоследних.КоличествоЧленовСемьи,
	                                |	НазначенныеЛьготыСрезПоследних.СоциальнаяНормаНаЛьготника,
	                                |	НазначенныеЛьготыСрезПоследних.СоциальнаяНормаНаСемью,
	                                |	0 КАК Долг
	                                |ИЗ
	                                |	РегистрСведений.НазначенныеЛьготы.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК НазначенныеЛьготыСрезПоследних
	                                |ГДЕ
	                                |	НазначенныеЛьготыСрезПоследних.Действует = ИСТИНА
	                                |;
	                                |
	                                |////////////////////////////////////////////////////////////////////////////////
	                                |ВЫБРАТЬ
	                                |	РасчетыПоЛицевымСчетамОбороты.Услуга КАК Услуга,
	                                |	СУММА(РасчетыПоЛицевымСчетамОбороты.СуммаПриход) КАК Сумма,
	                                |	СУММА(0) КАК Долг,
	                                |	ТарифыСрезПоследних.ЗначениеТарифа КАК Тариф
	                                |ИЗ
//{{MRG[ <-> ]
	                                |	РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(&МесяцНачало, &МесяцОкончание, , ) КАК РасчетыПоЛицевымСчетамОбороты
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	                                |	РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(&МесяцНачало, &МесяцОкончание2, , ) КАК РасчетыПоЛицевымСчетамОбороты
//}}MRG[ <-> ]
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Тарифы.СрезПоследних(&МесяцОкончание, ) КАК ТарифыСрезПоследних
	                                |		ПО РасчетыПоЛицевымСчетамОбороты.Организация = ТарифыСрезПоследних.Организация
	                                |			И РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет.Владелец = ТарифыСрезПоследних.Здание
	                                |			И РасчетыПоЛицевымСчетамОбороты.Услуга = ТарифыСрезПоследних.Услуга
	                                |ГДЕ
	                                |	РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет = &ЛицевойСчет
	                                |	И РасчетыПоЛицевымСчетамОбороты.МесяцНачисления = &МесяцНачисления
	                                |
	                                |СГРУППИРОВАТЬ ПО
	                                |	РасчетыПоЛицевымСчетамОбороты.Услуга,
	                                |	ТарифыСрезПоследних.ЗначениеТарифа
	                                |
	                                |ОБЪЕДИНИТЬ ВСЕ
	                                |
	                                |ВЫБРАТЬ
	                                |	РасчетыПоЛицевымСчетамОстатки.Услуга,
	                                |	СУММА(0),
	                                |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток),
	                                |	СУММА(0)
	                                |ИЗ
	                                |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(&Период, ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстатки
	                                |
	                                |СГРУППИРОВАТЬ ПО
	                                |	РасчетыПоЛицевымСчетамОстатки.Услуга
	                                |
	                                |ОБЪЕДИНИТЬ ВСЕ
	                                |
	                                |ВЫБРАТЬ
	                                |	НазначенныеУслугиСрезПоследних.Услуга,
	                                |	0,
	                                |	0,
	                                |	ЕСТЬNULL(ТарифыСрезПоследних.ЗначениеТарифа, 0)
	                                |ИЗ
	                                |	РегистрСведений.НазначенныеУслуги.СрезПоследних(&МесяцОкончание, ЛицевойСчет = &ЛицевойСчет) КАК НазначенныеУслугиСрезПоследних
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Тарифы.СрезПоследних КАК ТарифыСрезПоследних
	                                |		ПО НазначенныеУслугиСрезПоследних.Услуга = ТарифыСрезПоследних.Услуга
	                                |			И НазначенныеУслугиСрезПоследних.ЛицевойСчет.Владелец = ТарифыСрезПоследних.Здание
	                                |ГДЕ
	                                |	НазначенныеУслугиСрезПоследних.Действует = ИСТИНА
	                                |ИТОГИ
	                                |	СУММА(Сумма),
	                                |	МАКСИМУМ(Долг),
	                                |	МАКСИМУМ(Тариф)
	                                |ПО
	                                |	Услуга";
	ЗапросПроживающиеЖильцы.УстановитьПараметр("МесяцНачало",МесяцНачало);
	ЗапросПроживающиеЖильцы.УстановитьПараметр("МесяцОкончание",Месяцокончание);
//{{MRG[ <-> ]
//	ЗапросПроживающиеЖильцы.УстановитьПараметр("МесяцОкончание2",Новый Граница(Месяцокончание,ВидГраницы.Включая));
//}}MRG[ <-> ]
	ЗапросПроживающиеЖильцы.УстановитьПараметр("МесяцНачисления",МесяцНачало);
	ЗапросПроживающиеЖильцы.УстановитьПараметр("ЛицевойСчет",ТекущийДокумент);
	ЗапросПроживающиеЖильцы.УстановитьПараметр("Период",ТекущаяДата());
	ЗапросПроживающиеЖильцы.УстановитьПараметр("Квартира",ТекущийДокумент.ОбъектЛицевогоСчета);
	ВыборкаТаблица = ЗапросПроживающиеЖильцы.ВыполнитьПакет();
	ВыборкаТаблицаЗначенийПоПроживающимЖильцам = ВыборкаТаблица[0].Выгрузить();
	ВыборкаВладелец = ВыборкаТаблица[1].Выбрать();
	ВыборкаПлощадь = ВыборкаТаблица[2].Выбрать();
	ВыборкаЛьгота = ВыборкаТаблица[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВЫборкаДолги =  ВыборкаТаблица[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаВладелец.Следующий();
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ФИО = ФИО;
	ОбластьШапка.Параметры.ЛицевойСчет = ТекущийДокумент;
	ОбластьШапка.Параметры.Адрес1 = Адрес1;
	ОбластьШапка.Параметры.Адрес2 = Адрес2;
	ТабличныйДокумент.вывести(ОбластьШапка);
	
	НомерСтроки = 1;
	ОбластьТелоТаблицы = Макет.ПолучитьОбласть("Строка");
	Владелец = ВыборкаВладелец.Владелец;                                                               
	МассивОбласчетйСтрок = Новый Массив;
	МинусЛюди =0;
	Потребители = 0;
	Для Каждого СтрокаТаблицыЗнач Из ВыборкаТаблицаЗначенийПоПроживающимЖильцам Цикл
		
//{{MRG[ <-> ]
		ОбластьТелоТаблицы.Параметры.ФИО = Строка(СтрокаТаблицыЗнач.ПотребительУслуг);
		ОбластьТелоТаблицы.Параметры.Номер = Строка(НомерСтроки)+".";
		ОбластьТелоТаблицы.Параметры.Отношение = ?(СтрокаТаблицыЗнач.СтепеньРодства = "" и СтрокаТаблицыЗнач.ВыбранВладелец,"Власник" ,СтрокаТаблицыЗнач.СтепеньРодства);
		ОбластьТелоТаблицы.Параметры.ДатаРождения = ФОРМАТ(СтрокаТаблицыЗнач.ПотребительУслуг.ДатаРождения,"ДФ=dd.MM.yyyy");
		Если СтрокаТаблицыЗнач.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.Паспорт Тогда
			Документ = "Паспорт: " + СТРОКА(СтрокаТаблицыЗнач.СерияПаспорта)+" "+СТРОКА(СтрокаТаблицыЗнач.НомерПаспорта);
		ИначеЕсли  	ЗначениеЗаполнено(СтрокаТаблицыЗнач.СерияСвидетельства) Тогда
			Документ = "Свідоцтво про народження: " + СТРОКА(СтрокаТаблицыЗнач.СерияСвидетельства)+" "+СТРОКА(СтрокаТаблицыЗнач.НомерСвидетельства);
		КонецЕсли;	
		ОбластьТелоТаблицы.Параметры.Документ = Документ;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		//ОбластьТелоТаблицы.Параметры.ФИО = Строка(СтрокаТаблицыЗнач.ПотребительУслуг);
//		//ОбластьТелоТаблицы.Параметры.Номер = Строка(НомерСтроки)+".";
//		//ОбластьТелоТаблицы.Параметры.Отношение = ?(СтрокаТаблицыЗнач.СтепеньРодства = "" и СтрокаТаблицыЗнач.ВыбранВладелец,"Власник" ,СтрокаТаблицыЗнач.СтепеньРодства);
//		//ОбластьТелоТаблицы.Параметры.ДатаРождения = ФОРМАТ(СтрокаТаблицыЗнач.ПотребительУслуг.ДатаРождения,"ДФ=dd.MM.yyyy");
//		//Если СтрокаТаблицыЗнач.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.Паспорт Тогда
//		//	Документ = "Паспорт: " + СТРОКА(СтрокаТаблицыЗнач.СерияПаспорта)+" "+СТРОКА(СтрокаТаблицыЗнач.НомерПаспорта);
//		//ИначеЕсли  	ЗначениеЗаполнено(СтрокаТаблицыЗнач.СерияСвидетельства) Тогда
//		//	Документ = "Свідоцтво про народження: " + СТРОКА(СтрокаТаблицыЗнач.СерияСвидетельства)+" "+СТРОКА(СтрокаТаблицыЗнач.НомерСвидетельства);
//		//КонецЕсли;	
//		//ОбластьТелоТаблицы.Параметры.Документ = Документ;
//}}MRG[ <-> ]
		Если СтрокаТаблицыЗнач.Прописан Тогда
			
		Иначе
			
			МинусЛюди = МинусЛюди+1;
		КонецЕсли;
		Если СтрокаТаблицыЗнач.Прописан или СтрокаТаблицыЗнач.Проживает  Тогда

			Потребители = Потребители+1;
		КонецЕсли;	
//{{MRG[ <-> ]
		ТабличныйДокумент.Вывести(ОбластьТелоТаблицы);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		//ТабличныйДокумент.Вывести(ОбластьТелоТаблицы);
//}}MRG[ <-> ]
		НомерСтроки = НомерСтроки +1;
		
	КонецЦикла;

	Если  ВыборкаТаблицаЗначенийПоПроживающимЖильцам.Количество()  = 0 тогда
//{{MRG[ <-> ]
		ОбластьТелоТаблицы = Макет.ПолучитьОбласть("Строка");
		ОбластьТелоТаблицы.Параметры.ФИО = Строка(НомерСтроки)+". "+Строка(Владелец);
		ОбластьТелоТаблицы.Параметры.Отношение = "Власник";
		ТабличныйДокумент.Вывести(ОбластьТелоТаблицы);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		//ОбластьТелоТаблицы = Макет.ПолучитьОбласть("Строка");
//		//ОбластьТелоТаблицы.Параметры.ФИО = Строка(НомерСтроки)+". "+Строка(Владелец);
//		//ОбластьТелоТаблицы.Параметры.Отношение = "Власник";
//		//ТабличныйДокумент.Вывести(ОбластьТелоТаблицы);
//}}MRG[ <-> ]
	КонецЕсли;
		
	
	Если Владелец <> Неопределено Тогда
		Если Владелец.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
//{{MRG[ <-> ]
			ОбластьТелоТаблицы = Макет.ПолучитьОбласть("Строка");
			ОбластьТелоТаблицы.Параметры.ФИО = Строка(НомерСтроки)+". "+Строка(Владелец);
			ОбластьТелоТаблицы.Параметры.Отношение = "Власник";
			ТабличныйДокумент.Вывести(ОбластьТелоТаблицы);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//			//ОбластьТелоТаблицы = Макет.ПолучитьОбласть("Строка");
//			//ОбластьТелоТаблицы.Параметры.ФИО = Строка(НомерСтроки)+". "+Строка(Владелец);
//			//ОбластьТелоТаблицы.Параметры.Отношение = "Власник";
//			//ТабличныйДокумент.Вывести(ОбластьТелоТаблицы);
//}}MRG[ <-> ]
			//ВсегоЖильцов = 0;
		КонецЕсли;
	КонецЕсли;	
		
	
		
	//Центр,,,,,
	ОбластьЦентр = Макет.ПолучитьОбласть("Центр");
	ПараметрыПредметаИсчисления = " , , , , , , , , 0";
	ВсегоЖильцов = НомерСтроки-1-МинусЛюди;
	ОбластьЦентр.Параметры.ВсегоЖильцов = ?(ВсегоЖильцов = 0,"0",ВсегоЖильцов);
	ОбластьЦентр.Параметры.ФормаСобственнсти = "приватна";
	Если ВсегоЖильцов > 0 Тогда
		ВсегоЖильцовПрописью = Строка(ЧислоПрописью(ВсегоЖильцов,"Л=uk_UA; ЧДЦ=; ЧН=Ноль; ЧГ=0; НД = Ложь",ПараметрыПредметаИсчисления));
	Иначе
		ВсегоЖильцовПрописью = "";
	КонецЕсли;
	
//{{MRG[ <-> ]
	ОбластьЦентр.Параметры.ВсегоЖильцовСтрока = "("+СокрЛП(НРег(ВсегоЖильцовПрописью))+")";
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	//ОбластьЦентр.Параметры.ВсегоЖильцовСтрока = "("+СокрЛП(НРег(ВсегоЖильцовПрописью))+")";
//}}MRG[ <-> ]

	ОбщаяПл = 0;
	СанНорма = Потребители*13.65+35.22;
	ПлощадьДляВычисления = 0;
	Пока ВыборкаПлощадь.следующий() Цикл	
		если ВыборкаПлощадь.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
			
			ОбщаяПл = ВыборкаПлощадь.Площадь;
			ОбластьЦентр.Параметры.Общая = 	ОбщаяПл;	
			
		Иначеесли ВыборкаПлощадь.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
			ОбластьЦентр.Параметры.Отапливаемая = 	ВыборкаПлощадь.Площадь;	
		КонецЕсли;
	КонецЦикла;
	
	
	ОбластьЦентр.Параметры.СанНорма = МИН(ОбщаяПл,СанНорма);
	ПлощадьДляВычисления = ОбластьЦентр.Параметры.СанНорма;
	ПроцентЛьготы = 0;
	Если ВыборкаЛьгота.следующий() Тогда
		Если ВыборкаЛьгота.Льгота <> "" тогда
			
			ОбластьЦентр.Параметры.Льгота = Строка(ВыборкаЛьгота.Льгота) + ", "+Строка(ВыборкаЛьгота.Льгота.ПроцентЛьготы)+"%";
			ПроцентЛьготы = ВыборкаЛьгота.Льгота.ПроцентЛьготы;
		Иначе
			ОбластьЦентр.Параметры.Льгота = "пільги відсутні";
		КонецЕсли;
	Иначе
			ОбластьЦентр.Параметры.Льгота = "пільги відсутні";	
	КонецЕсли;
	ВыборкаЛьгота.Сбросить();
	
	ТабличныйДокумент.вывести(ОбластьЦентр);
	Всего = 0;
	ВсегоПоНорме = 0;
	ВсегоНачислено = 0;
	Пока ВЫборкаДолги.Следующий() Цикл
	
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаНач");
		Если  ВЫборкаДолги.Услуга = Справочники.Услуги.ПустаяСсылка() тогда
			Продолжить;
		КонецЕсли;
		
		ОбластьСтрока.Параметры.Услуга = ВЫборкаДолги.Услуга;
		если ВЫборкаДолги.Услуга = Справочники.Услуги.ПениШтрафы Тогда
			ОбластьСтрока.Параметры.Процент	= "";
			ОбластьСтрока.Параметры.Начислено = "-";	
			ОбластьСтрока.Параметры.Долг = ВЫборкаДолги.Долг;
		Иначе	
			ОбластьСтрока.Параметры.Процент	= ПроцентЛьготы;
			ОбластьСтрока.Параметры.Начислено = ВЫборкаДолги.Сумма;	
			ОбластьСтрока.Параметры.Долг = ВЫборкаДолги.Долг;
		КонецЕсли;	
		Всего =  Всего +  ВЫборкаДолги.Долг;
		ВсегоНачислено = ВсегоНачислено + ВЫборкаДолги.Сумма;
		
				//Если ВЫборкаДолги.Сумма <> 0 Тогда
			Если ВЫборкаДолги.Услуга.ВидУслуги = Справочники.ВидыУслуг.СДПТ Тогда
				ОбластьСтрока.Параметры.ПоНорме =  ВЫборкаДолги.Тариф  * ПлощадьДляВычисления;
					 
				
			ИначеЕсли  ВЫборкаДолги.Услуга.ВидУслуги = Справочники.ВидыУслуг.Водоотведение
						ИЛИ ВЫборкаДолги.Услуга.ВидУслуги = Справочники.ВидыУслуг.ХолоднаяВода
						Или  ВЫборкаДолги.Услуга.ВидУслуги = Справочники.ВидыУслуг.ГорячаяВода Тогда
				 ОбластьСтрока.Параметры.ПоНорме =  ВЫборкаДолги.Тариф  * 4 *?(Потребители = 0,1,Потребители);
				 
			ИначеЕсли ВЫборкаДолги.Услуга.ВидУслуги = Справочники.ВидыУслуг.Электроэнергия Тогда
				 ОбластьСтрока.Параметры.ПоНорме = ВЫборкаДолги.Тариф  * МИН((30 *(?(Потребители = 0,1,Потребители)-1) + 130),250);
				 
				 
			 ИначеЕсли ВЫборкаДолги.Услуга.ВидУслуги = Справочники.ВидыУслуг.Отопление Тогда
//{{MRG[ <-> ]
				 ОбластьСтрока.Параметры.ПоНорме =  ВЫборкаДолги.Тариф  *0.0431*ВЫборкаДолги.Услуга.ПоправочныйКоэффициент* ПлощадьДляВычисления;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//				 ОбластьСтрока.Параметры.ПоНорме =  ВЫборкаДолги.Тариф  * ПлощадьДляВычисления;//ВЫборкаДолги.Услуга.ПоправочныйКоэффициент* ПлощадьДляВычисления;
//}}MRG[ <-> ]
				 
			 ИначеЕсли ВЫборкаДолги.Услуга = Справочники.Услуги.ПениШтрафы Тогда
				 ОбластьСтрока.Параметры.ПоНорме =  0;	 
				
			КонецЕсли;
			Попытка
				ВсегоПоНорме = ВсегоПоНорме + областьСтрока.Параметры.ПоНорме;
			Исключение
			КонецПопытки;
		//КонецЕсли;
		Если ВыборкаЛьгота.НайтиСледующий(новый Структура("Услуга",ВЫборкаДолги.Услуга)) тогда
			ОбластьСтрока.Параметры.Процент	= ПроцентЛьготы;
		Иначе
			ОбластьСтрока.Параметры.Процент	= 0;
		КонецЕсли;
		если ВЫборкаДолги.Услуга = Справочники.Услуги.ПениШтрафы Тогда
			ОбластьСтрока.Параметры.Процент	= "-";
			ОбластьСтрока.Параметры.ПоНорме =  "-";
        КонецЕсли;
		ВыборкаЛьгота.Сбросить();
	    ТабличныйДокумент.вывести(ОбластьСтрока);
	КонецЦикла;  	
	
	Подвал =  Макет.ПолучитьОбласть("Подвал");
	Подвал.Параметры.Организация = ТекущийДокумент.Владелец.Организация;
	Подвал.Параметры.Всего = Всего;
	Подвал.Параметры.ВсегоНачислено = ВсегоНачислено;
	Подвал.Параметры.ВсгоПоНорме = ВсегоПоНорме;
	Подвал.Параметры.АдресОрганизации = АдресОрганизации;
//{{MRG[ <-> ]
//	Подвал.Параметры.Реквизиты = БанковскиеРеквизиты;
//}}MRG[ <-> ]
	Подвал.Параметры.Дата = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	
	ТабличныйДокумент.вывести(Подвал);
	
	Возврат ТабличныйДокумент;
	КонецФункции

Функция ПечатьПамяткаДляДоступаВЛичныйКабинетНаСайте(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент)
	
	Если ТипЗнч(ТекущийДокумент) <> Тип("Структура") Тогда
		Возврат ТабличныйДокумент;	
	КонецЕсли;
	
	Макет = ПолучитьМакет("ПамяткаДляДоступаВЛичныйКабинетНаСайте");
	
	СтруктураНастроек = ХранилищеОбщихНастроек.Загрузить("Обработка.ИнтеграцияССайтом");
	
	АдресСайта = "";	
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		АдресСайта = СтруктураНастроек.НастройкаДоступа.АдресСайта;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК ФИО,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.Владелец.Наименование КАК Адрес,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета.Наименование КАК Квартира,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.Владелец КАК Здание
		|ИЗ
		|	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних";
		
	Запрос.УстановитьПараметр("ЛицевойСчет", ТекущийДокумент.ЛицевойСчет);
	Запрос.УстановитьПараметр("Дата",     ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
	
		Область = Макет.ПолучитьОбласть("Блок1");
		Область.Параметры.ЛицевойСчет = РезультатЗапроса.ЛицевойСчет;
		Область.Параметры.ФИО = РезультатЗапроса.ФИО;
		Область.Параметры.Адрес = РезультатЗапроса.Адрес + " " + РезультатЗапроса.Квартира;
		
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("Блок2");
		Область.Параметры.ФИО = РезультатЗапроса.ФИО;
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("Блок3");
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("Блок4");
		Область.Параметры.АдресСайта = АдресСайта;
		Область.Параметры.Логин = ТекущийДокумент.Логин;
		Область.Параметры.Пароль = ТекущийДокумент.Пароль;
		ТабличныйДокумент.Вывести(Область);
		
	КонецЕсли;
	
	Возврат ТабличныйДокумент;	
	 
КонецФункции

Функция ПолучитьОбщуюСтруктуруКвитанции(ЛицевыеСчета, МесяцНачисления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга КАК Услуга,
	               |	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ЛицевойСчет В (&ЛицевыеСчета)) КАК РасчетыПоЛицевымСчетамОстатки
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга,
	               |	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток
	               |ИТОГИ
	               |	СУММА(СуммаОстаток)
	               |ПО
	               |	ЛицевойСчет,
	               |	Услуга
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
	               |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
	               |	СУММА(ЕСТЬNULL(ПоказанияПрибораУчета.ТекущиеПоказания, 0)) КАК ТекущиеПоказания,
	               |	СУММА(ЕСТЬNULL(ПоказанияПрибораУчета.ПредыдущиеПоказания, 0)) КАК ПредыдущиеПоказания,
	               |	ПоказанияПрибораУчета.ПриборУчета.Коэффициент,
	               |	КОЛИЧЕСТВО(УстановленныеПриборыУчетаСрезПоследних.ПриборУчета) КАК КоличествоПиборовНаУслуге,
	               |	ПоказанияПрибораУчета.ПриборУчета.Услуга КАК Услуга,
	               |	ПоказанияПрибораУчета.ПриборУчета.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ОбъектУстановки В (&ЛицевыеСчета)) КАК УстановленныеПриборыУчетаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ПоказанияПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	               |			СУММА(ПоказанияПриборовУчетаСрезПоследних.Значение) КАК ТекущиеПоказания,
	               |			СУММА(0) КАК ПредыдущиеПоказания,
	               |			ПоказанияПриборовУчетаСрезПоследних.ВидТарифа КАК ВидТарифа
	               |		ИЗ
	               |			РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ) КАК ПоказанияПриборовУчетаСрезПоследних
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	               |			ПоказанияПриборовУчетаСрезПоследних.ВидТарифа
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			ПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	               |			СУММА(0),
	               |			СУММА(ПоказанияПриборовУчетаСрезПоследних.Значение),
	               |			ПоказанияПриборовУчетаСрезПоследних.ВидТарифа
	               |		ИЗ
	               |			РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ДЕНЬ, -1), ) КАК ПоказанияПриборовУчетаСрезПоследних
	               |		ГДЕ
	               |			ПоказанияПриборовУчетаСрезПоследних.Период < КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	               |			ПоказанияПриборовУчетаСрезПоследних.ВидТарифа) КАК ПоказанияПрибораУчета
	               |		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПрибораУчета.ПриборУчета
	               |ГДЕ
	               |	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
	               |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
	               |	ПоказанияПрибораУчета.ПриборУчета.Коэффициент,
	               |	ПоказанияПрибораУчета.ПриборУчета.Услуга,
	               |	ПоказанияПрибораУчета.ПриборУчета.ЕдиницаИзмерения
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗаменыПриборовУчета.ОбъектУстановки,
	               |	ЗаменыПриборовУчета.ПриборУчета,
	               |	ЗаменыПриборовУчета.Показание,
	               |	ЗаменыПриборовУчета.ПоказаниеПредыдущее,
	               |	ЗаменыПриборовУчета.ПриборУчета.Коэффициент,
	               |	0,
	               |	ЗаменыПриборовУчета.Услуга,
	               |	ЗаменыПриборовУчета.ПриборУчета.ЕдиницаИзмерения
	               |ИЗ
	               |	РегистрНакопления.ЗаменыПриборовУчета КАК ЗаменыПриборовУчета
	               |ГДЕ
	               |	ЗаменыПриборовУчета.Период МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Услуга УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец КАК Здание,
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетам.Услуга КАК Услуга,
	               |	РасчетыПоЛицевымСчетам.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	РасчетыПоЛицевымСчетам.Тариф КАК Тариф,
	               |	РасчетыПоЛицевымСчетам.ДнейНачислено КАК ДнейНачислено,
	               |	СУММА(ЕСТЬNULL(ВЫБОР
	               |				КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	               |					ТОГДА РасчетыПоЛицевымСчетам.Количество
	               |			КОНЕЦ, 0)) КАК КоличествоЕдИзм,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Начисление,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Субсидия,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Льгота,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Перерасчет,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |					И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.ДоговорРеструктуризацииДолга)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Оплата,
	               |	СУММА(ВЫБОР
	               |			КОГДА НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	               |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
	               |					И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |					И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.ДоговорРеструктуризацииДолга)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Корректировка,
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет.ОбъектЛицевогоСчета КАК Квартира,
	               |	ЕСТЬNULL(РасчетыПоЛицевымСчетам.Порог, """") КАК Порог
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет В(&ЛицевыеСчета)
	               |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |	И РасчетыПоЛицевымСчетам.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетам.Услуга,
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец,
	               |	РасчетыПоЛицевымСчетам.Услуга.ЕдиницаИзмерения,
	               |	РасчетыПоЛицевымСчетам.Тариф,
	               |	РасчетыПоЛицевымСчетам.ДнейНачислено,
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет.ОбъектЛицевогоСчета,
	               |	ЕСТЬNULL(РасчетыПоЛицевымСчетам.Порог, """")
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Услуга УБЫВ
	               |ИТОГИ
	               |	СУММА(КоличествоЕдИзм),
	               |	СУММА(Начисление),
	               |	СУММА(Субсидия),
	               |	СУММА(Льгота),
	               |	СУММА(Перерасчет),
	               |	СУММА(Оплата),
	               |	СУММА(Корректировка)
	               |ПО
	               |	ЛицевойСчет,
	               |	Услуга
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПланированиеАвансовЛицевыеСчета.ЛицевойСчет,
	               |	ПланированиеАвансовЛицевыеСчета.СуммаНачислено КАК СуммаАванса,
	               |	ПланированиеАвансовЛицевыеСчета.Ссылка.Услуга
	               |ИЗ
	               |	Документ.ПланированиеАвансов.ЛицевыеСчета КАК ПланированиеАвансовЛицевыеСчета
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ПланированиеАвансовЛицевыеСчета.Ссылка.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&МесяцНачисления, МЕСЯЦ, 1), МЕСЯЦ)
	               |	И ПланированиеАвансовЛицевыеСчета.ЛицевойСчет В(&ЛицевыеСчета)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПлатежиПоРеструктуризацииДолга.ЛицевойСчет КАК ЛицевойСчет,
	               |	ПлатежиПоРеструктуризацииДолга.СуммаПлатежа КАК СуммаПлатежа,
	               |	ПлатежиПоРеструктуризацииДолга.ОбщаяСумма КАК ОбщаяСумма,
	               |	ПлатежиПоРеструктуризацииДолга.Регистратор КАК ДокументРеструктуризации,
	               |	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход, 0) КАК Оплаты,
	               |	ПлатежиПоРеструктуризацииДолга.ОбщаяСумма - ЕСТЬNULL(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход, 0) КАК ОстатокРеструктуризации
	               |ИЗ
	               |	РегистрСведений.ПлатежиПоРеструктуризацииДолга КАК ПлатежиПоРеструктуризацииДолга
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(, КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), , , Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	               |		ПО ПлатежиПоРеструктуризацииДолга.ЛицевойСчет = РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет
	               |ГДЕ
	               |	ПлатежиПоРеструктуризацииДолга.Период >= КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |	И ПлатежиПоРеструктуризацииДолга.ЛицевойСчет В(&ЛицевыеСчета)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга КАК Услуга,
	               |	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ), ЛицевойСчет В (&ЛицевыеСчета)) КАК РасчетыПоЛицевымСчетамОстатки
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстатки.Услуга,
	               |	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток
	               |ИТОГИ
	               |	СУММА(СуммаОстаток)
	               |ПО
	               |	ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДоговорРеструктуризацииДолга.Ссылка
	               |ИЗ
	               |	Документ.ДоговорРеструктуризацииДолга КАК ДоговорРеструктуризацииДолга
	               |ГДЕ
	               |	ДоговорРеструктуризацииДолга.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	               |	И ДоговорРеструктуризацииДолга.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ЛицевыеСчета", ЛицевыеСчета);
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат Результат;
	
КонецФункции

Функция ПечатьАктСверки(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент)

	Макет = ПолучитьМакет("ПФ_MXL_МакетАктСверки");

	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыПечати.ДатаНачала);
	Запрос.УстановитьПараметр("ОкончаниеПериода", Новый Граница(ПараметрыПечати.ДатаОкончания,ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыПечати.ДатаОкончания);

	Запрос.УстановитьПараметр("ЛицевойСчет",ТекущийДокумент);
	
	Запрос.Текст =  "ВЫБРАТЬ
	                |	СУММА(ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0)) КАК СуммаОстаток,
	                |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет
	                |ИЗ
	                |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ), ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстатки
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	СУММА(ВЫБОР
	                |			КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетамОбороты.Регистратор) <> ТИП(Документ.КорректировкаНачислений)
	                |				ТОГДА ВЫБОР
	                |						КОГДА ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаПриход, 0) > 0
	                |							ТОГДА ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаПриход, 0)
	                |						КОГДА РасчетыПоЛицевымСчетамОбороты.Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.ПениШтрафы)
	                |							ТОГДА ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаПриход, 0)
	                |						ИНАЧЕ 0
	                |					КОНЕЦ
	                |			ИНАЧЕ ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаПриход, 0)
	                |		КОНЕЦ) КАК СуммаПриход,
	                |	СУММА(ВЫБОР
	                |			КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетамОбороты.Регистратор) <> ТИП(Документ.КорректировкаНачислений)
	                |				ТОГДА ВЫБОР
	                |						КОГДА ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаПриход, 0) < 0
	                |								И РасчетыПоЛицевымСчетамОбороты.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.ПениШтрафы)
	                |							ТОГДА -ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаПриход, 0)
	                |						ИНАЧЕ ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаРасход, 0)
	                |					КОНЕЦ
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК СуммаРасход,
	                |	РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет КАК ЛицевойСчет,
	                |	ВЫБОР
	                |		КОГДА РасчетыПоЛицевымСчетамОбороты.Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
	                |				ИЛИ ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетамОбороты.Регистратор) = ТИП(Документ.ЗакрытиеМесяца)
	                |			ТОГДА ""Аванс""
	                |		ИНАЧЕ РасчетыПоЛицевымСчетамОбороты.Услуга
	                |	КОНЕЦ КАК УслугаИтого
	                |ИЗ
	                |	РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(&НачалоПериода, &ОкончаниеПериода, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОбороты
	                |ГДЕ
	                |	ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетамОбороты.Регистратор) <> ТИП(Документ.КорректировкаРегистров)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет,
	                |	ВЫБОР
	                |		КОГДА РасчетыПоЛицевымСчетамОбороты.Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
	                |				ИЛИ ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетамОбороты.Регистратор) = ТИП(Документ.ЗакрытиеМесяца)
	                |			ТОГДА ""Аванс""
	                |		ИНАЧЕ РасчетыПоЛицевымСчетамОбороты.Услуга
	                |	КОНЕЦ
	                |ИТОГИ
	                |	СУММА(СуммаПриход),
	                |	СУММА(СуммаРасход)
	                |ПО
	                |	ЛицевойСчет,
	                |	УслугаИтого
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет,
	                |	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток
	                |ИЗ
	                |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(&ОкончаниеПериода, ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстатки
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЛицевыеСчета.Наименование КАК ЛицевойСчет,
	                |	ЛицевыеСчета.Владелец КАК Здание,
	                |	ЛицевыеСчета.Владелец.Организация КАК Организация,
	                |	ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец, ""Невизначений"") КАК ОтветСтвенныйВладелец,
	                |	ЛицевыеСчета.ОбъектЛицевогоСчета.Наименование КАК Квартира
	                |ИЗ
	                |	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&ОкончаниеПериода, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	                |		ПО ЛицевыеСчета.Ссылка = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
	                |ГДЕ
	                |	ЛицевыеСчета.Ссылка = &ЛицевойСчет
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец, ""Невизначений""),
	                |	ЛицевыеСчета.Наименование,
	                |	ЛицевыеСчета.Владелец,
	                |	ЛицевыеСчета.Владелец.Организация,
	                |	ЛицевыеСчета.ОбъектЛицевогоСчета.Наименование
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВЫБОР
	                |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.КорректировкаНачислений)
	                |				И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                |			ТОГДА ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
	                |		КОГДА (ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.ПоступлениеНаСчет)
	                |				ИЛИ РасчетыПоЛицевымСчетам.Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка))
	                |				И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.КорректировкаНачислений)
	                |			ТОГДА РасчетыПоЛицевымСчетам.Период
	                |		ИНАЧЕ РасчетыПоЛицевымСчетам.Услуга
	                |	КОНЕЦ КАК Услуга,
	                |	НАЧАЛОПЕРИОДА(РасчетыПоЛицевымСчетам.Период, МЕСЯЦ) КАК МесяцНачисления,
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
	                |	ВЫБОР
	                |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.КорректировкаНачислений)
	                |				И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                |			ТОГДА ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
	                |		ИНАЧЕ РасчетыПоЛицевымСчетам.Услуга
	                |	КОНЕЦ КАК УслугаИгого,
	                |	СУММА(ВЫБОР
	                |			КОГДА РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК СуммаПриход,
	                |	СУММА(ВЫБОР
	                |			КОГДА РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК СуммаРасход,
	                |	ВЫБОР
	                |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.КорректировкаНачислений)
	                |				И РасчетыПоЛицевымСчетам.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	                |				И РасчетыПоЛицевымСчетам.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Корректировка)
	                |		ИНАЧЕ РасчетыПоЛицевымСчетам.ВидНачисления
	                |	КОНЕЦ КАК ВидНачисления,
	                |	РасчетыПоЛицевымСчетам.Количество
	                |ИЗ
	                |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	                |ГДЕ
	                |	РасчетыПоЛицевымСчетам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	                |	И РасчетыПоЛицевымСчетам.ЛицевойСчет = &ЛицевойСчет
	                |	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.ЗакрытиеМесяца)
	                |	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.КорректировкаРегистров)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	НАЧАЛОПЕРИОДА(РасчетыПоЛицевымСчетам.Период, МЕСЯЦ),
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет,
	                |	ВЫБОР
	                |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.КорректировкаНачислений)
	                |				И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                |			ТОГДА ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
	                |		КОГДА (ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.ПоступлениеНаСчет)
	                |				ИЛИ РасчетыПоЛицевымСчетам.Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка))
	                |				И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.КорректировкаНачислений)
	                |			ТОГДА РасчетыПоЛицевымСчетам.Период
	                |		ИНАЧЕ РасчетыПоЛицевымСчетам.Услуга
	                |	КОНЕЦ,
	                |	ВЫБОР
	                |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.КорректировкаНачислений)
	                |				И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                |			ТОГДА ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
	                |		ИНАЧЕ РасчетыПоЛицевымСчетам.Услуга
	                |	КОНЕЦ,
	                |	ВЫБОР
	                |		КОГДА ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.КорректировкаНачислений)
	                |				И РасчетыПоЛицевымСчетам.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	                |				И РасчетыПоЛицевымСчетам.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Корректировка)
	                |		ИНАЧЕ РасчетыПоЛицевымСчетам.ВидНачисления
	                |	КОНЕЦ,
	                |	РасчетыПоЛицевымСчетам.Количество
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	МесяцНачисления,
	                |	ВидНачисления,
	                |	Услуга
	                |ИТОГИ ПО
	                |	МесяцНачисления";
	Результат = Запрос.ВыполнитьПакет();
	
	ДанныеШапки = Результат[3].выбрать();
	ДанныеНачало = Результат[0].выбрать();
	ДанныеОкончание = Результат[2].выбрать();
	ДанныеПериод = Результат[1].выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДанныеПериодМесяц = Результат[4].выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//ШАПКА
	Шапка = Макет.ПолучитьОбласть("Шапка");
	
	ПериодНачало =  ФОРМАТ(ПараметрыПечати.ДатаНачала,"Л=uk_UA; ДФ='dd.MM.yyyy'");
	ПериодОкончание =  ФОРМАТ(ПараметрыПечати.ДатаОкончания,"Л=uk_UA; ДФ='dd.MM.yyyy'");
	ПериодОкончание2 =  ФОРМАТ(ПараметрыПечати.ДатаОкончания,"Л=uk_UA; ДФ='dd MMMM yyyy'");

	
	ДанныеШапки.Следующий();
	ДанныеНачало.Следующий();
	Организация = ДанныеШапки.Организация;
	МассивДляФио = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДанныеШапки.ОтветСтвенныйВладелец," ");
	Если МассивДляФио.количество() = 3 И не ДанныеШапки.ОтветСтвенныйВладелец.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		Фио = МассивДляФио[0]+" "+Лев(МассивДляФио[1],1)+"."+Лев(МассивДляФио[2],1)+".";
	Иначе	
		ФИО =  Строка(ДанныеШапки.ОтветСтвенныйВладелец);
	КонецЕсли;
	
	ПердставлениеЛС = ФИО +" (" + ДанныеШапки.Квартира +" о\р " +ДанныеШапки.ЛицевойСчет+")";
	
	Шапка.Параметры.Организация = Организация;
	Шапка.Параметры.ФИО = ФИО;

	Шапка.Параметры.ПердставлениеЛС = ПердставлениеЛС;
	Шапка.Параметры.МестоСоставвления = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Организация,Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
	Шапка.Параметры.ПериодНачало = ПериодНачало;
	Шапка.Параметры.ПериодОкончание = ПериодОкончание;
	Шапка.Параметры.ПериодОкончание2 = ПериодОкончание2;
	Попытка
		Если   ДанныеНачало.СуммаОстаток < 0 Тогда
			Шапка.Параметры.Оплачено =- ДанныеНачало.СуммаОстаток;
		Иначе
			Шапка.Параметры.Начислено = ДанныеНачало.СуммаОстаток;
		КонецЕсли;
	Исключение
	КонецПопытки;
	ТабличныйДокумент.Вывести(Шапка);
	
	
	//Строки
	
	Пока ДанныеПериод.Следующий() Цикл
		ОблатьИтогоПоЛС = Макет.ПолучитьОбласть("СтрокаЛС");
		ОблатьИтогоПоЛС.Параметры.Услуга = "Обсяг за період в т.ч.";
		Попытка
			ОблатьИтогоПоЛС.Параметры.Начислено = ДанныеПериод.СуммаПриход;
		Исключение
			ОблатьИтогоПоЛС.Параметры.Начислено = ДанныеПериод.СуммаПриход;
		КонецПопытки;
		
		ОблатьИтогоПоЛС.Параметры.Оплачено = ДанныеПериод.СуммаРасход;
		
		ДанныеПериодУслугаИтого  =  ДанныеПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		МассивОбластейИтогоУслуга = Новый Массив;
		
		Пока ДанныеПериодУслугаИтого.Следующий() Цикл
		
			ОбластьПериодУслугаИтого = Макет.ПолучитьОбласть("Строка");
			Если ТипЗнч(ДанныеПериодУслугаИтого.УслугаИтого) = Тип("Строка") Тогда
			    ОбластьПериодУслугаИтого.Параметры.Услуга = ДанныеПериодУслугаИтого.УслугаИтого;
			Иначе
				ОбластьПериодУслугаИтого.Параметры.Услуга = ДанныеПериодУслугаИтого.УслугаИтого.ПолноеНаименование;
			КонецЕсли;
			ОбластьПериодУслугаИтого.Параметры.Начислено = ДанныеПериодУслугаИтого.СуммаПриход;
			ОбластьПериодУслугаИтого.Параметры.Оплачено = ДанныеПериодУслугаИтого.СуммаРасход;
			//ОбластьПериодУслугаИтого.Параметры.Кво      = ДанныеПериодУслугаИтого.Количество;
			//Если  ДанныеПериодУслугаИтого.УслугаИтого = "Аванс" Тогда
			//	//Ничего 
			//	Продолжить;
			//Иначе
				Если  ДанныеПериодУслугаИтого.СуммаПриход = 0 и ДанныеПериодУслугаИтого.СуммаРасход = 0 Тогда
					Продолжить;
				Иначе	
					МассивОбластейИтогоУслуга.Добавить(ОбластьПериодУслугаИтого);
				КонецЕсли;
				
			//КонецЕсли;
			
			
		
		КонецЦикла; 
		
		
	КонецЦикла;
	
	Пока ДанныеПериодМесяц.Следующий() Цикл
		
		ОбластьМесяц = Макет.ПолучитьОбласть("СтрокаИтог");
		ОбластьМесяц.Параметры.Услуга = "Всьго за "+Формат(ДанныеПериодМесяц.МесяцНачисления,"Л=uk_UA; ДФ='MMMM yyyy'");
		ОбластьМесяц.Параметры.Начислено = ДанныеПериодМесяц.СуммаПриход;
		ОбластьМесяц.Параметры.Оплачено = ДанныеПериодМесяц.СуммаРасход;
		Детали = ДанныеПериодМесяц.Выбрать();
		Пока Детали.Следующий() Цикл
			Префикс = "";
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			Если ТипЗнч(Детали.Услуга) = Тип("Дата") Тогда
				ОбластьСтрока.Параметры.Услуга = "Оплата "+ Строка(Формат(Детали.Услуга,"Л=uk_UA; ДФ='dd.MM.yyyy'"));
			Иначе
				
				Если Детали.ВидНачисления = Перечисления.ВидыНачислений.Льгота Тогда
					Префикс = " (Пiльга)";
				ИначеЕсли Детали.ВидНачисления = Перечисления.ВидыНачислений.Субсидия ТОгда
					Префикс = " (Субсидiя)";
				ИначеЕсли Детали.ВидНачисления = Перечисления.ВидыНачислений.Корректировка ТОгда
					Префикс = " (Коригування)";	
				КонецЕсли;
				
				ОбластьСтрока.Параметры.Услуга = Строка(Детали.Услуга.ПолноеНаименование)+Префикс;
			КонецЕсли;
			ОбластьСтрока.Параметры.Кво = Детали.Количество;
			ОбластьСтрока.Параметры.Начислено = Детали.СуммаПриход;
			ОбластьСтрока.Параметры.Оплачено = Детали.СуммаРасход;
			Если  Детали.СуммаПриход =0 и Детали.СуммаРасход = 0 Тогда
				Продолжить;
			Иначе
				ТабличныйДокумент.Вывести(ОбластьСтрока);
			КонецЕсли;	
		КонецЦикла;
		ТабличныйДокумент.Вывести(ОбластьМесяц);
	КонецЦикла;
	Попытка
		ТабличныйДокумент.Вывести(ОблатьИтогоПоЛС);
	Исключение
	КонецПопытки;
	
	
	Инд = 0;
	Если МассивОбластейИтогоУслуга <> Неопределено Тогда
		Пока Инд<= МассивОбластейИтогоУслуга.ВГраница() Цикл
			
			ТабличныйДокумент.Вывести(МассивОбластейИтогоУслуга[Инд]);
			Инд = Инд+1;
		КонецЦикла;
	КонецЕсли;	
	
	
	ДанныеОкончание.Следующий();
	ОбластьСальдо = Макет.ПолучитьОбласть("СтрокаИтог");
	ОбластьСальдо.Параметры.Услуга = "Сальдо на "+ ПериодОкончание;
	ОбластьСальдо.Параметры.Услуга2 = "Сальдо на "+ ПериодОкончание;
	Попытка
		Если ДанныеОкончание.СуммаОстаток < 0 Тогда
			
			ОбластьСальдо.Параметры.Оплачено	 = -ДанныеОкончание.СуммаОстаток;	
		Иначе   
			ОбластьСальдо.Параметры.Начислено = ДанныеОкончание.СуммаОстаток;
			
		КонецЕсли;
	Исключение
	КонецПопытки;
	ТабличныйДокумент.Вывести(ОбластьСальдо);
	
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Подвал.Параметры.Организация = Организация;
	Подвал.Параметры.ФИО = Фио;
	ТабличныйДокумент.Вывести(Подвал);
	
	Возврат ТабличныйДокумент;
	
	
КонецФункции


Функция ПечатьПеня(ТабличныйДокумент, ПараметрыПечати, ТекущийДокумент)

	Макет = ПолучитьМакет("ПФ_MXL_МакетПеня");

	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ЛицевойСчет = ТекущийДокумент;
	ОбластьШапка.Параметры.Адрес = Строка(ТекущийДокумент.Владелец)+", "+ТекущийДокумент.ОбъектЛицевогоСчета.Наименование;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыПечати.ДатаНачала);
	//Запрос.УстановитьПараметр("ОкончаниеПериода", Новый Граница(ПараметрыПечати.ДатаОкончания,ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыПечати.ДатаОкончания);

	Запрос.УстановитьПараметр("ЛицевойСчет",ТекущийДокумент);
	
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеПениПоЛС.Ссылка КАК Ссылка,
		|	НАЧАЛОПЕРИОДА(НачислениеПениПоЛС.Дата, ДЕНЬ) КАК Дата,
		|	НачислениеПениПоЛС.Здание,
		|	НачислениеПениПоЛС.ЛицевойСчет,
		|	НачислениеПениПоЛС.Организация,
		|	НачислениеПениПоЛС.ПериодНачисления,
		|	НачислениеПениПоЛС.Сумма КАК Сумма,
		|	НачислениеПениПоЛС.Услуга,
		|	НачислениеПениПоЛС.ПериодС,
		|	НачислениеПениПоЛС.ПериодПо,
		|	НачислениеПениПоЛС.КоличествоДней,
		|	НачислениеПениПоЛС.СумаДолга,
		|	НачислениеПениПоЛС.Процент,
		|	НачислениеПениПоЛС.МесяцНачисления КАК Месяц
		|ИЗ
		|	Документ.НачислениеПениПоЛС КАК НачислениеПениПоЛС
		|ГДЕ
		|	НачислениеПениПоЛС.Проведен = ИСТИНА
		|	И НачислениеПениПоЛС.ЛицевойСчет = &ЛицевойСчет
		|	И НачислениеПениПоЛС.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Ссылка УБЫВ,
		|	МесяцНачисления
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
		|	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход) КАК СуммаПриход,
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(РасчетыПоЛицевымСчетамОстаткиИОбороты.Период, МЕСЯЦ), ДЕНЬ) КАК МЕСЯЦ
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(РасчетыПоЛицевымСчетамОстаткиИОбороты.Период, МЕСЯЦ), ДЕНЬ)";
	
	
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаСверки = РезультатЗапроса[0].Выгрузить().СкопироватьКолонки();
	ТаблицаСортировки = ТаблицаСверки.СкопироватьКолонки();
	
	ВыборкаДата = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаНачсисление = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаДата.Следующий() Цикл
		Если ВыборкаДата.Сумма = 0 Тогда 
			Продолжить;
		КонецЕсли;
		ОбластьОсн = Макет.ПолучитьОбласть("ОСН");
		ОбластьОсн.Параметры.Месяц = Формат(ВыборкаДата.Дата,"Л=uk_UA; ДФ='MMMM'");
		ОбластьОсн.Параметры.Сумма = ВыборкаДата.Сумма;
		
		СтрукПоиск = Новый Структура;
		СтрукПоиск.Вставить("ЛицевойСчет",ТекущийДокумент);
		СтрукПоиск.Вставить("Месяц",ВыборкаДата.Дата);

		Если ВыборкаНачсисление.НайтиСледующий(СтрукПоиск) Тогда
			ОбластьОсн.Параметры.Начисление = ВыборкаНачсисление.СуммаПриход;
			ВыборкаНачсисление.сбросить();
		КонецЕсли;	
		
		ВыборкаДетальныеЗаписи = ВыборкаДата.Выбрать();
	    Первый = Истина;
		ПеняВсего = 0;
		ПеняОбласть = 0;
		Начисление = 0;
		МассивОбластей = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если  ВыборкаДетальныеЗаписи.Сумма < 0 Тогда
				Прервать;
			КонецЕсли;
			//ОблСтрока = Макет.ПолучитьОбласть("ОСН1");
			//Выводим = ЕстьДолгПоЭтомуМесяцу(ВыборкаДетальныеЗаписи.Месяц,ВыборкаДетальныеЗаписи.Дата,ТекущийДокумент);
			
			Если ТаблицаСверки.Количество() <> 0 Тогда
				СтруктураПоискаДубля =  Новый Структура;
				СтруктураПоискаДубля.Вставить("ПериодС",ВыборкаДетальныеЗаписи.ПериодС);
				СтруктураПоискаДубля.Вставить("ПериодПо",ВыборкаДетальныеЗаписи.ПериодПо);
				СтруктураПоискаДубля.Вставить("КоличествоДней",ВыборкаДетальныеЗаписи.КоличествоДней);
				СтруктураПоискаДубля.Вставить("СумаДолга",ВыборкаДетальныеЗаписи.СумаДолга);
				СтруктураПоискаДубля.Вставить("Месяц",ВыборкаДетальныеЗаписи.Месяц);
				СтруктураПоискаДубля.Вставить("Сумма",ВыборкаДетальныеЗаписи.Сумма);
				СтрокиТаб = ТаблицаСверки.найтиСтроки(СтруктураПоискаДубля);
				Если СтрокиТаб.Количество() <> 0 Тогда
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;	
			
			//ЗаполнитьЗначенияСвойств(ОблСтрока.Параметры,ВыборкаДетальныеЗаписи);
			//ПеняВсего =ПеняВсего+ ВыборкаДетальныеЗаписи.Сумма;
			НоваяСтрока = ТаблицаСверки.Добавить();
			НаваяСтрокаТ = ТаблицаСортировки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
			ЗаполнитьЗначенияСвойств(НаваяСтрокаТ,ВыборкаДетальныеЗаписи);
			
			
			//МассивОбластей.Добавить(ОблСтрока);
			//ТабличныйДокумент.вывести(ОблСтрока);
		КонецЦикла;
		
		ТаблицаСортировки.Сортировать("Месяц Возр, ПериодС Возр");
		Для Каждого Строка  Из  ТаблицаСортировки Цикл
			ОблСтрока = Макет.ПолучитьОбласть("ОСН1");
			
			Если Первый Тогда
					
					ОблСтрока.Параметры.Пеня = ОбластьОсн.Параметры.Сумма;
					ОблСтрока.Параметры.Начисление = ОбластьОсн.Параметры.Начисление - ОбластьОсн.Параметры.Сумма;
				    Первый = Ложь;
					ОбластьОсн.Параметры.Сумма =  ТаблицаСортировки.итог("Сумма");
					ТабличныйДокумент.вывести(ОбластьОсн);
				КонецЕсли;
			ЗаполнитьЗначенияСвойств(ОблСтрока.Параметры,Строка);
			Оплаты = ЕстьОплатыПоЭтомуМесяцу(Строка.Месяц,Строка.ПериодПо,ТекущийДокумент,ВыборкаДата.Дата);
			Если ТипЗнч(Оплаты) = Тип("Структура") Тогда
				ОблСтрока.Параметры.Оплата  =  Оплаты.Оплата;
		        ОблСтрока.Параметры.ДатаОплаты = Оплаты.ДатаОплаты;
			КонецЕсли;	
			ТабличныйДокумент.вывести(ОблСтрока);
			 
		КонецЦикла;
		ТаблицаСортировки.Очистить();
		
	КонецЦикла;
	
	

	
	Возврат ТабличныйДокумент;
	
	
КонецФункции

Функция ЕстьОплатыПоЭтомуМесяцу(Месяц,Дата,ЛицевойСчет,ДатаСрез)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетамОбороты.СуммаРасход,
		|	РасчетыПоЛицевымСчетамОбороты.Период
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(
		|			&МесяцНачало,
		|			&МесяцОкончание,
		|			Регистратор,
		|			ЛицевойСчет = &ЛицевойСчет
		|				И НАЧАЛОПЕРИОДА(МесяцНачисления, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Месяц, МЕСЯЦ)) КАК РасчетыПоЛицевымСчетамОбороты
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетамОбороты.Регистратор) = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЛицевымСчетамОбороты.Период,
		|	РасчетыПоЛицевымСчетамОбороты.СуммаРасход";
	
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("МесяцНачало", НачалоМесяца(ДатаСрез));
	Запрос.УстановитьПараметр("МесяцОкончание", КонецМесяца(ДатаСрез));
	Запрос.УстановитьПараметр("Месяц", Месяц);
	Запрос.УстановитьПараметр("Регистратор", Тип("ДокументСсылка.ПоступлениеНаСчет"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЛОЖЬ;
	Иначе
		Выборка  = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если КонецДня(Выборка.Период) = КонецДня(Дата) 
				Или  КонецДня(КонецДня(Дата) + 500) = КонецДня(Выборка.Период) Тогда
				СтрукВозвр = Новый Структура;
				СтрукВозвр.Вставить("ДатаОплаты", КонецДня(Выборка.Период));
				СтрукВозвр.Вставить("Оплата", Выборка.СуммаРасход);
				
				Возврат  СтрукВозвр;
			КонецЕсли;
		КонецЦикла;
		
		
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьСокращенноеПредставлениеФИО(ТекущийГлавныйБухгалтер)
	
	СтрокаФИО = "";
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущийГлавныйБухгалтер," ");
	Инд = 0;
	Пока Инд<= МассивСтрок.вГраница()  Цикл
		Если Инд <> 0 Тогда
			СтрокаФИО = СтрокаФИО + " "+Лев(МассивСтрок[Инд],1)+".";
		Иначе
			СтрокаФИО = СтрокаФИО +МассивСтрок[Инд];
		КонецЕсли;	
		
		Инд = Инд+1;
	КонецЦикла; 
	
	Возврат СтрокаФИО;
КонецФункции

Функция ПолучитьТаблицуДанныхЗаМесяц(МесяцНачисления,ЛицевойСчет)
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец КАК Здание,
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
	                |	РасчетыПоЛицевымСчетам.Услуга КАК Услуга,
	                |	РасчетыПоЛицевымСчетам.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                |	РасчетыПоЛицевымСчетам.Тариф КАК Тариф,
	                |	РасчетыПоЛицевымСчетам.ДнейНачислено КАК ДнейНачислено,
	                |	СУММА(ЕСТЬNULL(ВЫБОР
	                |				КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	                |					ТОГДА РасчетыПоЛицевымСчетам.Количество
	                |			КОНЕЦ, 0)) КАК КоличествоЕдИзм,
	                |	СУММА(ВЫБОР
	                |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	                |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК Начисление,
	                |	СУММА(ВЫБОР
	                |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	                |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК Субсидия,
	                |	СУММА(ВЫБОР
	                |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	                |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК Льгота,
	                |	СУММА(ВЫБОР
	                |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
	                |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК Перерасчет,
	                |	СУММА(ВЫБОР
	                |			КОГДА РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                |					И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.ДоговорРеструктуризацииДолга)
	                |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК Оплата,
	                |	СУММА(ВЫБОР
	                |			КОГДА НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	                |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	                |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	                |					И НЕ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
	                |					И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                |					И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.ДоговорРеструктуризацииДолга)
	                |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК Корректировка,
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет.ОбъектЛицевогоСчета КАК Квартира,
	                |	ЕСТЬNULL(РасчетыПоЛицевымСчетам.Порог, """") КАК Порог
	                |ИЗ
	                |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	                |ГДЕ
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет = &ЛицевойСчет
	                |	И РасчетыПоЛицевымСчетам.Период МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ) И КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
	                |	И РасчетыПоЛицевымСчетам.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет,
	                |	РасчетыПоЛицевымСчетам.Услуга,
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец,
	                |	РасчетыПоЛицевымСчетам.Услуга.ЕдиницаИзмерения,
	                |	РасчетыПоЛицевымСчетам.Тариф,
	                |	РасчетыПоЛицевымСчетам.ДнейНачислено,
	                |	РасчетыПоЛицевымСчетам.ЛицевойСчет.ОбъектЛицевогоСчета,
	                |	ЕСТЬNULL(РасчетыПоЛицевымСчетам.Порог, """")
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Услуга УБЫВ
	                |ИТОГИ
	                |	СУММА(КоличествоЕдИзм),
	                |	СУММА(Начисление),
	                |	СУММА(Субсидия),
	                |	СУММА(Льгота),
	                |	СУММА(Перерасчет),
	                |	СУММА(Оплата),
	                |	СУММА(Корректировка)
	                |ПО
	                |	Услуга";
	 
	 Запрос.УстановитьПараметр("МесяцНачисления",МесяцНачисления);
	 Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	 
	 Результат = ЗАпрос.Выполнить();
	 Если Результат.Пустой() Тогда
		 Возврат Неопределено;
	 ИНаче
		 Возврат Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	 КонецЕсли;	 
	
КонецФункции
//=================================================== КОНЕЦ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ =====================================================================
