
Процедура ОбработкаПроведения(Отказ, Режим)
	// регістр РасчетыПоЛицевымСчетам Приход
	Движения.РасчетыПоЛицевымСчетам.Записывать = Истина;
	Для Каждого ТекСтрокаЛицевыеСчета Из ЛицевыеСчета Цикл
		Движение                 = Движения.РасчетыПоЛицевымСчетам.Добавить();
		Если ЗначениеЗаполнено(ТекСтрокаЛицевыеСчета.СуммаПоДебету) Тогда
			Движение.ВидДвижения     = ВидДвиженияНакопления.Приход;
			Движение.Период          = Дата;
			Движение.Организация     = Организация;
			Движение.ЛицевойСчет     = ТекСтрокаЛицевыеСчета.ЛицевойСчет;
			Движение.Услуга          = ТекСтрокаЛицевыеСчета.Услуга;
			Движение.МесяцНачисления = ТекСтрокаЛицевыеСчета.МесяцНачисления;
			Движение.Сумма           = ТекСтрокаЛицевыеСчета.СуммаПоДебету;
		Иначе
			Движение.ВидДвижения     = ВидДвиженияНакопления.Расход;
			Движение.Период          = Дата;
			Движение.Организация     = Организация;
			Движение.ЛицевойСчет     = ТекСтрокаЛицевыеСчета.ЛицевойСчет;
			Движение.Услуга          = ТекСтрокаЛицевыеСчета.Услуга;
			Движение.МесяцНачисления = ТекСтрокаЛицевыеСчета.МесяцНачисления;
			Движение.Сумма           = ТекСтрокаЛицевыеСчета.СуммаПоКредиту;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
