//РаботаСВнешнимОборудованием
Перем глПодключаемоеОборудование Экспорт; // для кэширования на клиенте

Перем глДоступныеТипыОборудования Экспорт;
//Конец РаботаСВнешнимОборудованием

// СтандартныеПодсистемы

// СтандартныеПодсистемы.БазоваяФункциональность

Перем СообщенияДляЖурналаРегистрации Экспорт;	// СписокЗначений для накапливания пакета сообщений в журнал регистрации, формируемых в клиентской бизнес-логике.

Перем ПредлагатьУстановкуРасширенияРаботыСФайлами Экспорт;	// Признак того, что в данном сеансе не нужно повторно предлагать установку

Перем ПропуститьПредупреждениеПередЗавершениемРаботыСистемы Экспорт;	// Признак того, что в данном сеансе не нужно запрашивать стандартное подтверждение при выходе

// Конец СтандартныеПодсистемы.БазоваяФункциональность

// СтандартныеПодсистемы.ЗавершениеРаботыПользователей
Перем РаботаПользователейЗавершается Экспорт;	// Информация о завершении работы пользователей.
// Конец СтандартныеПодсистемы.ЗавершениеРаботыПользователей
		
// СтандартныеПодсистемы.ОбновлениеКонфигурации

Перем ДоступноеОбновлениеКонфигурации Экспорт;	// Информация о доступном обновлении конфигурации, обнаруженном в Интернете при запуске программы.

Перем НастройкиОбновленияКонфигурации Экспорт;	// Структура с параметрами помощника обновления конфигурации.

// Конец СтандартныеПодсистемы.ОбновлениеКонфигурации

// СтандартныеПодсистемы.РаботаСФайлами
Перем КомпонентаTwain Экспорт;	// Twain компонента для работы со сканером
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.ФайловыеФункции
Перем ПроверкаДоступаКРабочемуКаталогуВыполнена Экспорт;	// Признак того, что в данном сеансе не нужно повторно делать проверку доступа к каталогу на диске
// Конец СтандартныеПодсистемы.ФайловыеФункции

// СтандартныеПодсистемы.РезервноеКопированиеИБ

Перем ПараметрыРезервногоКопированияИБ Экспорт;	// Параметры для резервного копирования

Перем ОповещатьОРезервномКопированииПриЗавершенииСеанса Экспорт;	// Признак выполнения резервного копирования при завершении сеанса

Перем ДатаОтложенногоРезервногоКопирования Экспорт;	// Максимальная дата отложенного резервного копирования

// Конец СтандартныеПодсистемы.РезервноеКопированиеИБ

// Конец СтандартныеПодсистемы

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ДействияПередНачаломРаботыСистемы(Отказ);
	// Конец СтандартныеПодсистемы
	
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	Локализация.ПроверитьСоответсвиеЯзыкаПлатформыИПользователя();
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ДействияПриНачалеРаботыСистемы(Истина);
	// Конец СтандартныеПодсистемы
	
	ЗапускМенеджераЛицензий();
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПриНачалеРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
	#Если Не ВебКлиент Тогда 
		
			
		ПроверкаПересеченияЛьготИСубсидий();
		
	#КонецЕсли
	
	
	
	ВидРС = РС_СменитьСтол.ПолучитьНастройкиСтола();
	Если ВидРС = Неопределено Тогда
		РС_СменитьСтол.СменитьСтол(ВидРС);
	КонецЕсли;
	ОСМДКлиент.ПолучитьПараметрыФункциональныхОпций();
	
	#Если Не ВебКлиент Тогда
		Если TelegramApi.ЗапускОбработкиЗапросов() и Пользователи.ЭтоПолноправныйПользователь(Пользователи.АвторизованныйПользователь()) Тогда
			ОткрытьФорму("Обработка.ВыполнениеЗаданийКлиент.Форма.Форма");
		КонецЕсли;
	#КонецЕсли
	

КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ДействияПередЗавершениемРаботыСистемы(Отказ);
	// Конец СтандартныеПодсистемы
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПередЗавершениемРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры


Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)

	// ПодключаемоеОборудование
	// Подготовить данные
	ОписаниеСобытия = Новый Структура();
	ОписаниеОшибки  = "";

	ОписаниеСобытия.Вставить("Источник", Источник);
	ОписаниеСобытия.Вставить("Событие",  Событие);
	ОписаниеСобытия.Вставить("Данные",   Данные);

	// Передать на обработку данные
	Результат = МенеджерОборудованияКлиент.ОбработатьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки);
	Если Не Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При обработке внешнего события от устройства произошла ошибка.';uk='При обробці зовнішньої події від пристрою сталася помилка.'")
		                                                 + Символы.ПС + ОписаниеОшибки);
	КонецЕсли;
	// Конец ПодключаемоеОборудование

КонецПроцедуры

Функция ЗапускМенеджераЛицензий()
	 	
	ОсвобождатьЛицензиюПриЗавершенииРаботы = СЛК.ОсвобождатьЛицензиюПриЗавершенииРаботы();
	
	Попытка
		
		// Запуск
		СЛК.Старт();
		
		Лицензия = СЛК.ПолучитьЛицензию();
		
	Исключение
		Инфо = ИнформацияОбОшибке();
		Сообщить("Ошибка запуска СЛК: " + Инфо.Описание);
		
		КлассИсключения = СЛКОбщие.ПолучитьКлассИсключения(Инфо.Описание);
		Если КлассИсключения = "EExecuteError" Или КлассИсключения = "ELocalServerNotFound" Тогда
			
			ОткрытьФорму("Обработка.СЛК.Форма.ПараметрыСвязи");
			
		ИначеЕсли  КлассИсключения = "EServerResult.ELicenceNotFound"  Тогда
			
			ОткрытьФорму("Обработка.СЛК.Форма.ПараметрыСвязи");
			
		КонецЕсли;
				
	КонецПопытки;

КонецФункции

Процедура ЗапускЗаявлениеОКонфиденциальности()

	СтруктураНастроек = УчетКоммунальныхУслуг.ПолучитьНастрокиСлужбыПоддержки();
	
	Если ТипЗнч(СтруктураНастроек) <> Тип("Структура") Тогда
		
		ОткрытьФорму("Обработка.ЗаявлениеОКонфиденциальности.Форма.Форма");
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ИнформацияПриЗапуске", "Показывать", Истина) Тогда
	
		ОткрытьФорму("Обработка.ИнформацияПриЗапуске.Форма");
		
	КонецЕсли;	

КонецПроцедуры

Процедура ПроверкаПересеченияЛьготИСубсидий()
		
	ОткрытьФорму("ОбщаяФорма.ПроверкаПересеченияЛьготИСубсидий"); 
	
КонецПроцедуры