
&НаКлиенте
Процедура ОтражениеПериодаНачисленияПриИзменении(Элемент)
	ЭтаФорма.ПериодНачисления 		= КонецМесяца(ЭтаФорма.ПериодНачисления);
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ЭтаФорма.ОтражениеПериодаНачисления 	= Формат(ЭтаФорма.ПериодНачисления, НСтр(ФорматнаяСтрока));
КонецПроцедуры

&НаКлиенте
Процедура ОтражениеПериодаНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаПоказаний.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		ТаблицаПоказаний.Очистить();
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.ПериодНачисления= Дата('00010101'), ТекущаяДата(), ЭтаФорма.ПериодНачисления));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ЭтаФорма.ПериодНачисления = КонецДня(ДатаКалендаряНачало);
	
	ОтражениеПериодаНачисленияПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОтражениеПериодаНачисленияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаПоказаний.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		ТаблицаПоказаний.Очистить();
	КонецЕсли;
	

	ЭтаФорма.ПериодНачисления = ?(ЗначениеЗаполнено(ЭтаФорма.ПериодНачисления), 
						ДобавитьМесяц(ЭтаФорма.ПериодНачисления, Направление),
						ДобавитьМесяц(КонецМесяца(ТекущаяДата()), Направление));
						
	ОтражениеПериодаНачисленияПриИзменении(Элемент);
	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодНачисления = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
		
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ОтражениеПериодаНачисления = Формат(ЭтаФорма.ПериодНачисления, НСтр(ФорматнаяСтрока));
	ДатаВвода = ТекущаяДата();
	
	Если Параметры.Свойство("ЗаданиеМобильногоПриложения") Тогда
		
		Элементы.ТаблицаПоказаний.Видимость 						= Истина;
		Элементы.ТаблицаПоказанийПриборУчета.Видимость 				= Истина;
		Элементы.ТаблицаПоказанийЛицевойСчет.Видимость 				= Истина;
		Элементы.ТаблицаПоказанийКвартира.Видимость 				= Истина;
		Элементы.ТаблицаПоказанийОтветственныйВладелец.Видимость 	= Истина;
		Элементы.Исполнитель.Видимость 								= Истина;
		
		Элементы.ТаблицаПоказанийПриборУчетаСтрока.Видимость 		= Ложь;
		Элементы.ЗаписатьПоказания.Видимость 						= Ложь;
		Элементы.ЗаполнитьИзФайла.Видимость 						= Ложь;
		Элементы.ПутьКФайлу.Видимость 								= Ложь;
		Элементы.ОтражениеПериодаНачисления.Видимость 				= Ложь;
		Элементы.ЛицевойСчет.Видимость 								= Ложь;

		
		Элементы.ДатаВвода.Заголовок = Нстр("ru = 'Выполнить до'; uk = 'Виконати до'");
		
	ИначеЕсли Параметры.Свойство("ИндивидуальныйВвод") Тогда
		ЭтаФорма.Заголовок = НСтр("ru = 'Индивидуальный ввод показаний приборов учета'; uk = 'Індивідуальне введення показань приладів обліку'");
		Элементы.ЛицевойСчет.Видимость 								= Истина;		
		Элементы.ТаблицаПоказаний.Видимость 						= Истина;
		Элементы.ТаблицаПоказанийПриборУчета.Видимость 				= Истина;
		Элементы.ТаблицаПоказанийЛицевойСчет.Видимость 				= Истина;
		Элементы.ТаблицаПоказанийКвартира.Видимость 				= Истина;
		Элементы.ТаблицаПоказанийОтветственныйВладелец.Видимость 	= Истина;
		Элементы.ТаблицаПоказанийЗаписатьИндивидуальныеПоказания.Видимость = Истина;
		
		//Элементы.ТаблицаПоказаний.Видимость 						= Ложь;
		Элементы.Исполнитель.Видимость								= Ложь;
	    Элементы.ТаблицаПоказанийПриборУчетаСтрока.Видимость 		= Ложь;
		Элементы.ТаблицаПоказанийЗаполнитьПриборыСОтбором.Видимость = Ложь;
		Элементы.ЗаписатьПоказания.Видимость 						= Ложь;
		Элементы.ЗаполнитьИзФайла.Видимость 						= Ложь;
		Элементы.ПутьКФайлу.Видимость 								= Ложь;
		
	Иначе
		
		Элементы.ОписаниеПолей.Видимость 							= Истина;
		Элементы.ТаблицаПоказанийВывестиСписок.Видимость 			= Истина;
		Элементы.ТаблицаПоказанийЗаполнитьПриборыСОтбором.Видимость = Истина;
		Элементы.ТаблицаПоказаний.Видимость 						= Истина;
		Элементы.ТаблицаПоказанийПриборУчета.Видимость 				= Истина;
		Элементы.ЗаполнитьИзФайла.КнопкаПоУмолчанию 				= Истина;
		
		Элементы.ТаблицаПоказанийПриборУчетаСтрока.Видимость 		= Ложь;
		Элементы.ТаблицаПоказанийЗаполнитьПриборыСОтбором.Видимость = Ложь;
		Элементы.ЗаписатьПоказания.Доступность 						= Ложь;
		Элементы.ЗаписатьПоказания.КнопкаПоУмолчанию 				= Ложь;
		Элементы.Исполнитель.Видимость 								= Ложь;
		Элементы.ЛицевойСчет.Видимость 								= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры                  

&НаСервере
Процедура ЗаполнитьПриборыНаСервере(АдресЛицевыхСчетовВХранилище = Неопределено,ИндивидуальныйВвод = ложь)
	ТаблицаПоказаний.Очистить();
	
	Запрос = Новый Запрос;
	Если АдресЛицевыхСчетовВХранилище <> Неопределено Тогда
		ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
		МассивОбъектовУстановки = ТаблицаДляЗагрузки.ВыгрузитьКолонку("ЛицевойСчет");
		
		ТекстЗапросаДоб = "	И УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки В(&МассивОбъектовУстановки)";
		Запрос.УстановитьПараметр("МассивОбъектовУстановки", МассивОбъектовУстановки);
	ИначеЕсли ИндивидуальныйВвод Тогда
		МассивОбъектовУстановки = Новый Массив;
		МассивОбъектовУстановки.Добавить(ЛицевойСчет);
		
		ТекстЗапросаДоб = "	И УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки В(&МассивОбъектовУстановки)";
		Запрос.УстановитьПараметр("МассивОбъектовУстановки", МассивОбъектовУстановки);
	Иначе
		ТекстЗапросаДоб = "";
	КонецЕсли;	

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки КАК ЛицевойСчет,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета КАК Квартира,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета.Владелец КАК Здание,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Коэффициент КАК Коэффициент,
		|	ЕСТЬNULL(УслугиВидыТарифов.ВидТарифа, ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Общий)) КАК ВидТарифа,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец
		|ИЗ
		|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&ДатаСреза, ПриборУчета.Услуга = &Услуга) КАК УстановленныеПриборыУчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Услуги.ВидыТарифов КАК УслугиВидыТарифов
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга = УслугиВидыТарифов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|ГДЕ
		|	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА"+ТекстЗапросаДоб;
	
	Запрос.УстановитьПараметр("ДатаСреза", НачалоДня(ДатаВвода));
	Если ЗначениеЗаполнено(Услуга) Тогда
		Запрос.УстановитьПараметр("Услуга", Услуга);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПриборУчета.Услуга = &Услуга","");
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_Заполнения = РезультатЗапроса.Выгрузить();
	
	ТаблицаПоказаний.Загрузить(ТЗ_Заполнения);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПриборы(Команда)
	Отказ = ПроверитьДатуВвода();
	//Если Отказ Тогда
	//	
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = НСТР("ru = 'Дата ввода показаний не соответствует выбранному периоду. Укажите дату в пределах периода начисления.'; uk = 'Дата введення показникiв не відповідає вибраному періоду. Вкажіть дату в межах періоду нарахування.'");
	//	Сообщение.Поле = "ДатаВвода";
	//	Сообщение.Сообщить(); 
	//	Возврат;
	//КонецЕсли;
	
	ЗаполнитьПриборыНаСервере(,?(ЗначениеЗаполнено(ЛицевойСчет),Истина,ЛОЖЬ));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПриборыСОтбором(Команда)
	
	Отказ = ПроверитьДатуВвода();
	//Если Отказ Тогда
	//	
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = НСТР("ru = 'Дата ввода показаний не соответствует выбранному периоду. Укажите дату в пределах периода начисления.'; uk = 'Дата введення показникiв не відповідає вибраному періоду. Вкажіть дату в межах періоду нарахування.'");
	//	Сообщение.Поле = "ДатаВвода";
	//	Сообщение.Сообщить(); 
	//	Возврат;
	//КонецЕсли;
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ДатаНачала",		НачалоМесяца(ПериодНачисления));
	ПараметрыЗаполнения.Вставить("ДатаОкончания",	КонецМесяца(ПериодНачисления));

		
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		
		ЗаполнитьПриборыНаСервере(АдресЛицевыхСчетовВХранилище);
		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзФайла(Команда)
	
	Отказ = ПроверитьДатуВвода();
	Если Отказ Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСТР("ru = 'Дата ввода показаний не соответствует выбранному периоду. Укажите дату в пределах периода начисления.'; uk = 'Дата введення показникiв не відповідає вибраному періоду. Вкажіть дату в межах періоду нарахування.'");
		Сообщение.Поле = "ДатаВвода";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не выбран файл для загрузки.'; uk = 'Не вибраний файл для завантаження.'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	ТаблицаПоказаний.Очистить();
	
	
	 Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить("Не удалось подключиться" + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(ПутьКФайлу);
	
	Excel.Sheets(1).select();
	КоличествоСтрок = Excel.Cells.CurrentRegion.Rows.Count;
	ЕстьНеНайденные = Ложь;
	Для Счетчик=2 По КоличествоСтрок Цикл
		СтруктураПрибора =  ПриборУчетаПоиск(СокрЛП(Excel.Cells(Счетчик, 1).Value),СокрЛП(Excel.Cells(Счетчик, 2).Value));
		Если СтруктураПрибора.ПриборУчета <> Неопределено Тогда
			
			    НоваяСтрока = ТаблицаПоказаний.Добавить();
				НоваяСтрока.ПриборУчета = СтруктураПрибора.ПриборУчета;
				НоваяСтрока.ВидТарифа = СтруктураПрибора.ВидТарифа;	
				НоваяСтрока.ПоказаниеТекущее =   Excel.Cells(Счетчик, 3).Value;
				
		Иначе
			
			    НоваяСтрока = ТаблицаПоказаний.Добавить();
				НоваяСтрока.ПриборУчетаСтрока = СокрЛП(Excel.Cells(Счетчик, 1).Value);	
				НоваяСтрока.ПоказаниеТекущее =   Excel.Cells(Счетчик, 3).Value;
				НоваяСтрока.НеНайден = Истина;
				ЕстьНеНайденные = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Excel.Workbooks.Close();
	
	Если ЕстьНеНайденные Тогда
		Элементы.ТаблицаПоказаний.ОтборСтрок = Новый ФиксированнаяСтруктура("НеНайден",Истина);
		Элементы.ТаблицаПоказанийЗаполнитьПриборы.Видимость = Истина;
		Элементы.ТаблицаПоказанийЗаполнитьПриборыСОтбором.Видимость = Ложь;
		Элементы.ТаблицаПоказанийЗаписатьИндивидуальныеПоказания.Видимость = Ложь;
	КонецЕсли;	
	//ЗаполнитьТаблицуПоказаний();
	Если ТаблицаПоказаний.Количество() <> 0 Тогда
		Элементы.ЗаписатьПоказания.Доступность = Истина;
		Элементы.ЗаписатьПоказания.КнопкаПоУмолчанию = Истина;
		Элементы.ЗаполнитьИзФайла.КнопкаПоУмолчанию = Ложь;
	КонецЕсли;	
		

	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПриборУчетаПоиск(ПУ_Строка,стВидТарифа)

	СтруктураВозврата = Новый Структура;
	
	
	//Поиск по наименованию
	ПриборВозврат  = Неопределено;
	Прибор = Справочники.ПриборыУчета.НайтиПоНаименованию(ПУ_Строка);
	Если Прибор <> Справочники.ПриборыУчета.ПустаяСсылка() тогда
		ПриборВозврат= Прибор;
	Иначе
		//Поиск с удалением пропусков в строке
		ПриборСтрока = СтрЗаменить(ПУ_Строка," ","");
	    Прибор = Справочники.ПриборыУчета.НайтиПоНаименованию(ПриборСтрока);
		Если Прибор <> Справочники.ПриборыУчета.ПустаяСсылка() Тогда
			ПриборВозврат = Прибор;
		Иначе
			ПриборВозврат = Неопределено;
		КонецЕсли;	
	КонецЕсли;	

	ВидТарифа = Перечисления.ВидыТарифов.Общий;
	Если стВидТарифа = "Общий" или стВидТарифа = "Загальний" Тогда
		ВидТарифа = Перечисления.ВидыТарифов.Общий;
	КонецЕсли;
	
	Если стВидТарифа = "Дневной" или стВидТарифа = "Денний" Тогда
		ВидТарифа = Перечисления.ВидыТарифов.Дневной;
	КонецЕсли;
	Если стВидТарифа = "Ночной" или стВидТарифа = "Нічний" Тогда
		ВидТарифа = Перечисления.ВидыТарифов.Ночной;
	КонецЕсли;
	Если стВидТарифа = "Пиковый" или стВидТарифа = "Піковий" Тогда
		ВидТарифа = Перечисления.ВидыТарифов.Пиковый;
	КонецЕсли;
	
	СтруктураВозврата.Вставить("ПриборУчета",ПриборВозврат);
	СтруктураВозврата.Вставить("ВидТарифа",ВидТарифа);
	
	Возврат СтруктураВозврата;
КонецФункции 

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = ПутьКФайлу;
	Фильтр = "Электронная таблица Excel(*.xls)|*.xls";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПоказанийПоказаниеТекущееПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаПоказаний.ТекущиеДанные;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПоказанияНаСервере(Источник)
	
	Если Источник = "Контролер" Тогда
		ТипИсточника = Перечисления.ИсточникиПоказаний.ТаблицаExcel;
	Иначе 
		ТипИсточника = Перечисления.ИсточникиПоказаний.Оператор;
	КонецЕсли;	
	
	ТабЗаполнения = ТаблицаПоказаний.Выгрузить().Скопировать();
	МассивСтрокУдаления = Новый Массив;
	Для каждого Строка Из ТабЗаполнения  Цикл
	   Если ТипЗнч(Строка.ПриборУчета) = Тип("Строка") тогда
			МассивСтрокУдаления.Добавить(Строка);
		КонецЕсли;	
	
	КонецЦикла; 
	
	
	Для каждого НайденнаяСтрока Из МассивСтрокУдаления Цикл
			ТабЗаполнения.Удалить(НайденнаяСтрока);
	КонецЦикла;
		

	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТЗ",ТабЗаполнения);
	

	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.ПриборУчета,
	               |	ТЗ.ВидТарифа,
	               |	ТЗ.ПоказаниеТекущее
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ВТ.ПоказаниеТекущее) КАК ПоказаниеТекущее,
	               |	ВТ.ВидТарифа,
	               |	ВТ.ПриборУчета
	               |ИЗ
	               |	ВТ КАК ВТ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.ПриборУчета,
	               |	ВТ.ВидТарифа";
	ТЗ_ТаблицаПоказаний = Запрос.Выполнить().Выгрузить();
	
	
	Если ТаблицаПоказаний.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.ПоказанияПУИзВнешнихИсточников.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Период.Установить(ДатаВвода);
	ТаблицаПриборыУчета = НаборЗаписей.Выгрузить(,);
	
	Для каждого Строка Из ТЗ_ТаблицаПоказаний  Цикл
		
		Если Строка.ПоказаниеТекущее = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если Строка.ПриборУчета = Справочники.ПриборыУчета.ПустаяСсылка()  тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтрока = ТаблицаПриборыУчета.Добавить();
	    НоваяСтрока.Период = ДатаВвода;
		НоваяСтрока.ПриборУчета = Строка.ПриборУчета;
		НоваяСтрока.ВидТарифа = Строка.ВидТарифа;
		НоваяСтрока.Значение = Строка.ПоказаниеТекущее;
		НоваяСтрока.Источник = ТипИсточника;
	КонецЦикла; 
	ТаблицаПриборыУчета.Сортировать("ПриборУчета");
	НаборЗаписей.Загрузить(ТаблицаПриборыУчета);
	НаборЗаписей.Записать(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПоказания(Команда)
	ЗаписатьПоказанияНаСервере("Контролер");
	Ответ = Вопрос(НСТР("ru = 'Загрузка показаний окончена'; uk = 'Завантаження свідчень закінчене'"), РежимДиалогаВопрос.ок); 
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИндивидуальныеПоказания(Команда)
	ЗаписатьПоказанияНаСервере("Оператор");
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДатуВвода()
	
	Если ДатаВвода >= НачалоМесяца(ПериодНачисления) и ДатаВвода <= КонецМесяца(ПериодНачисления) Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
	
//{{MRG[ <-> ]
КонецФункции
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//КонецФункции
//}}MRG[ <-> ]
