
&НаКлиенте
Процедура ФайлDBFНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ФайлDBF;
	Фильтр = "Электронная таблица DBF(*.dbf)|*.dbf";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ФайлDBF = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ФайлDBF) Тогда
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Банк) Тогда
		Сообщить(НСтр("ru='Укажите банковский счет.';uk='Вкажіть банківський рахунок.'"));
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаВыпискиДок) Тогда
		Сообщить(НСтр("ru='Укажите дату выписки.';uk='Вкажіть дату виписки.'"));
		Возврат;
	КонецЕсли;
    Таб = Новый XBase;
	Таб.ОткрытьФайл(Объект.ФайлDBF,,Истина);
	Таб.Первая();
	Таб.Кодировка = КодировкаXBase.OEM;
	Объект.ПриватБанк.Очистить();
	Пока Не Таб.ВКонце() Цикл
		НоваяСтрока                   = Объект.ПриватБанк.Добавить();
		НоваяСтрока.ЛицевойСчет       = Таб.LS;
		НоваяСтрока.КодУслуги         = Таб.KOD_USLUGA;
		НоваяСтрока.ФИО               = Таб.FIO;
		НоваяСтрока.Город             = Таб.TOWN;
		НоваяСтрока.Улица             = Таб.VUL;
		НоваяСтрока.Дом               = Таб.BUD;
		НоваяСтрока.Квартира          = Таб.FLAT;
		НоваяСтрока.Счетчик1          = Таб.IDLICH1;
		НоваяСтрока.ПоказаниеДо1      = Таб.POKBEG1;
		НоваяСтрока.ПоказаниеПосле1   = Таб.POKEND1;
		НоваяСтрока.Счетчик2          = Таб.IDLICH2;
		НоваяСтрока.ПоказаниеДо2      = Таб.POKBEG2;
		НоваяСтрока.ПоказаниеПосле2   = Таб.POKEND2;
		НоваяСтрока.Счетчик3          = Таб.IDLICH3;
		НоваяСтрока.ПоказаниеДо3      = Таб.POKBEG3;
		НоваяСтрока.ПоказаниеПосле3   = Таб.POKEND3;
		НоваяСтрока.Счетчик4          = Таб.IDLICH4;
		НоваяСтрока.ПоказаниеДо4      = Таб.POKBEG4;
		НоваяСтрока.ПоказаниеПосле4   = Таб.POKEND4;
		НоваяСтрока.Счетчик5          = Таб.IDLICH5;
		НоваяСтрока.ПоказаниеДо5      = Таб.POKBEG5;
		НоваяСтрока.ПоказаниеПосле5   = Таб.POKEND5;
		НоваяСтрока.ДатаПлатежа       = Таб.D_PLAT;
		НоваяСтрока.НомерПлатежу      = Таб.N_PLAT;
		НоваяСтрока.СуммаПлатежа      = Таб.SUMA;
		НоваяСтрока.НазначениеПлатежа = Таб.DEST;
		НоваяСтрока.МФО               = Таб.MFO;
		Таб.Следующая();
	КонецЦикла;
	Таб.ЗакрытьФайл();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОщад(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ФайлDBF) Тогда
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Банк) Тогда
		Сообщить(НСтр("ru='Укажите банковский счет.';uk='Вкажіть банківський рахунок.'"));
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаВыпискиДок) Тогда
		Сообщить(НСтр("ru='Укажите дату выписки.';uk='Вкажіть дату виписки.'"));
		Возврат;
	КонецЕсли;
    Таб = Новый XBase;
	Таб.ОткрытьФайл(Объект.ФайлDBF,,Истина);
	Таб.Первая();
	Таб.Кодировка = КодировкаXBase.ANSI;
	Объект.ОщадБанк.Очистить();
	Пока Не Таб.ВКонце() Цикл
		НоваяСтрока                   = Объект.ОщадБанк.Добавить();
		НоваяСтрока.LS                = Таб.LS;
		НоваяСтрока.FIO               = Таб.FIO;
		НоваяСтрока.TOWN              = Таб.TOWN;
		НоваяСтрока.STREET            = Таб.STREET;
		НоваяСтрока.BUILDING          = Таб.BUILDING;
		НоваяСтрока.FLAT              = Таб.FLAT;
		НоваяСтрока.D_PLAT            = Таб.D_PLAT;
		НоваяСтрока.N_PLAT            = Таб.N_PLAT;
		НоваяСтрока.SUMM              = Таб.SUMM;
		НоваяСтрока.SERVICECOD        = Таб.SERVICECOD;
		НоваяСтрока.SERVICE           = Таб.SERVICE;
		Таб.Следующая();
	КонецЦикла;
	Таб.ЗакрытьФайл();
КонецПроцедуры

&НаСервере
Процедура СохранитьВыпискуНаСервере()
	Для Каждого стр Из объект.ПриватБанк Цикл
		ДокОплатаУслугМВК                        = Документы.ОплатаУслугМВК.СоздатьДокумент();
		ДокОплатаУслугМВК.БанковскийСчет         = Объект.Банк;
		ДокОплатаУслугМВК.Дата                   = Объект.ДатаВыпискиДок;
		ДокОплатаУслугМВК.ВидОперации            = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтЛицевогоСчета;
		ДокОплатаУслугМВК.ДатаВходящегоДокумента = стр.ДатаПлатежа;
		ДокОплатаУслугМВК.Комментарий            = НСтр("ru = 'Документ создан обработкой ""Загрузка банковской выписки.""'; uk = 'Документ створено обробкою ""Завантаження банківської виписки.""'");
		ДокОплатаУслугМВК.ЛицевойСчет            = НайтиЛицевойСчет(СтрЗаменить(Строка(стр.ЛицевойСчет), Символы.НПП, ""));
		ДокОплатаУслугМВК.НазначениеПлатежа      = стр.НазначениеПлатежа;
		ДокОплатаУслугМВК.Организация            = Справочники.Организации.НайтиПоКоду("000000001");
		ДокОплатаУслугМВК.СуммаПлатежа           = стр.СуммаПлатежа;
		ОтветственныйВладелецИКвоПрописанных     = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(ДокОплатаУслугМВК.ЛицевойСчет);
		ДокОплатаУслугМВК.Потребитель            = ОтветственныйВладелецИКвоПрописанных.ОтветственныйВладелец;
		ДокОплатаУслугМВК.Здание                 = ДокОплатаУслугМВК.ЛицевойСчет.Владелец;
		ДокОплатаУслугМВК.Ответственный          = ПараметрыСеанса.ТекущийПользователь;
		
		НоваяСтрока = ДокОплатаУслугМВК.РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ПризнакАванса = Истина;
		НоваяСтрока.Сумма = стр.СуммаПлатежа;
		
		Попытка
		    ДокОплатаУслугМВК.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			ДокОплатаУслугМВК.Записать();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Не удалось провести докмент '; uk = 'Не вдалося провести документ '") + ДокОплатаУслугМВК.Номер; 
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВыписку(Команда)
	СохранитьВыпискуНаСервере();
КонецПроцедуры



// ДРУГИЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

&НаСервере
Функция ПолучитьСписокПриборов(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЗаводскойНомер КАК ЗаводскойНомер,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|	ПоказанияПриборовУчетаСрезПоследних.Значение,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга КАК Услуга
		|ИЗ
		|	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&НаДату, ) КАК ПоказанияПриборовУчетаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&НаДату, ОбъектУстановки = &ОбъектУстановки) КАК УстановленныеПриборыУчетаСрезПоследних
		|		ПО (УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета)";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОбъектУстановки", ЛицевойСчет);
	Список = Запрос.Выполнить().Выгрузить();

	Возврат Список;
КонецФункции

&НаСервере
Функция НайтиЛицевойСчет(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, ЛицевойСчет.Наименование = &ЛицевойСчет И Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛС = Выборка.ЛицевойСчет;
	КонецЦикла;
	Возврат ЛС;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьАБанк(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ФайлDBF) Тогда
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Банк) Тогда
		Сообщить(НСтр("ru='Укажите банковский счет.';uk='Вкажіть банківський рахунок.'"));
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаВыпискиДок) Тогда
		Сообщить(НСтр("ru='Укажите дату выписки.';uk='Вкажіть дату виписки.'"));
		Возврат;
	КонецЕсли;
    Таб = Новый XBase;
	Таб.ОткрытьФайл(Объект.ФайлDBF,,Истина);
	Таб.Первая();
	Таб.Кодировка = КодировкаXBase.OEM;
	Объект.АБанк.Очистить();
	Пока Не Таб.ВКонце() Цикл
		НоваяСтрока                   = Объект.АБанк.Добавить();
		НоваяСтрока.PAY_NUM           = Таб.PAY_NUM;
		НоваяСтрока.NUMBER            = Таб.NUMBER;
		НоваяСтрока.OPERDAY           = Таб.OPERDAY;
		НоваяСтрока.LS                = Таб.LS;
		НоваяСтрока.FIO               = Таб.FIO;
		НоваяСтрока.ADDRESS           = Таб.ADDRESS;
		НоваяСтрока.PREV_COUNT        = Таб.PREV_COUNT;
		НоваяСтрока.CURR_COUNT        = Таб.CURR_COUNT;
		НоваяСтрока.MONTH             = Таб.MONTH;
		НоваяСтрока.YEAR              = Таб.YEAR;
		НоваяСтрока.SUMM              = Таб.SUMM;
		НоваяСтрока.KOMISS_D          = Таб.KOMISS_D;
		НоваяСтрока.KOMISS_V          = Таб.KOMISS_V;
		НоваяСтрока.KS_NAME           = Таб.KS_NAME;
		Таб.Следующая();
	КонецЦикла;
	Таб.ЗакрытьФайл();
КонецПроцедуры

&НаСервере
Процедура СохранитьАБанкНаСервере()
	Для Каждого стр Из Объект.АБанк Цикл
		ДокОплатаУслугМВК                        = Документы.ОплатаУслугМВК.СоздатьДокумент();
		ДокОплатаУслугМВК.БанковскийСчет         = Объект.Банк;
		ДокОплатаУслугМВК.Дата                   = Объект.ДатаВыпискиДок;
		ДокОплатаУслугМВК.ВидОперации            = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтЛицевогоСчета;
		ДокОплатаУслугМВК.ДатаВходящегоДокумента = Объект.ДатаВыпискиДок;
		ДокОплатаУслугМВК.Комментарий            = НСтр("ru = 'Документ создан обработкой ""Загрузка банковской выписки.""'; uk = 'Документ створено обробкою ""Завантаження банківської виписки.""'");
		ДокОплатаУслугМВК.ЛицевойСчет            = НайтиЛицевойСчет(СтрЗаменить(Строка(стр.LS), Символы.НПП, ""));
		ДокОплатаУслугМВК.НазначениеПлатежа      = стр.KS_NAME;
		ДокОплатаУслугМВК.Организация            = Справочники.Организации.НайтиПоКоду("000000001");
		ДокОплатаУслугМВК.СуммаПлатежа           = стр.SUMM;
		ОтветственныйВладелецИКвоПрописанных     = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(ДокОплатаУслугМВК.ЛицевойСчет);
		ДокОплатаУслугМВК.Потребитель            = ОтветственныйВладелецИКвоПрописанных.ОтветственныйВладелец;
		ДокОплатаУслугМВК.Здание                 = ДокОплатаУслугМВК.ЛицевойСчет.Владелец;
		ДокОплатаУслугМВК.Ответственный          = ПараметрыСеанса.ТекущийПользователь;
		
		НоваяСтрока = ДокОплатаУслугМВК.РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ПризнакАванса = Истина;
		НоваяСтрока.Сумма = стр.SUMM;
		Попытка
		    ДокОплатаУслугМВК.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			ДокОплатаУслугМВК.Записать();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Не удалось провести докмент '; uk = 'Не вдалося провести документ '") + ДокОплатаУслугМВК.Номер; 
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьАБанк(Команда)
	СохранитьАБанкНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьОщадНаСервере()
	Для Каждого стр Из Объект.ОщадБанк Цикл
		ДокОплатаУслугМВК                        = Документы.ОплатаУслугМВК.СоздатьДокумент();
		ДокОплатаУслугМВК.БанковскийСчет         = Объект.Банк;
		ДокОплатаУслугМВК.Дата                   = Объект.ДатаВыпискиДок;
		ДокОплатаУслугМВК.ВидОперации            = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтЛицевогоСчета;
		ДокОплатаУслугМВК.ДатаВходящегоДокумента = Объект.ДатаВыпискиДок;
		ДокОплатаУслугМВК.Комментарий            = НСтр("ru = 'Документ создан обработкой ""Загрузка банковской выписки.""'; uk = 'Документ створено обробкою ""Завантаження банківської виписки.""'");
		ДокОплатаУслугМВК.ЛицевойСчет            = НайтиЛицевойСчет(СтрЗаменить(Строка(стр.LS), Символы.НПП, ""));
		ДокОплатаУслугМВК.НазначениеПлатежа      = стр.SERVICE;
		ДокОплатаУслугМВК.Организация            = Справочники.Организации.НайтиПоКоду("000000001");
		ДокОплатаУслугМВК.СуммаПлатежа           = стр.SUMM;
		ОтветственныйВладелецИКвоПрописанных     = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(ДокОплатаУслугМВК.ЛицевойСчет);
		ДокОплатаУслугМВК.Потребитель            = ОтветственныйВладелецИКвоПрописанных.ОтветственныйВладелец;
		ДокОплатаУслугМВК.Здание                 = ДокОплатаУслугМВК.ЛицевойСчет.Владелец;
		ДокОплатаУслугМВК.Ответственный          = ПараметрыСеанса.ТекущийПользователь;
		
		НоваяСтрока = ДокОплатаУслугМВК.РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ПризнакАванса = Истина;
		НоваяСтрока.Сумма = стр.SUMM;
		Попытка
		    ДокОплатаУслугМВК.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			ДокОплатаУслугМВК.Записать();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Не удалось провести докмент '; uk = 'Не вдалося провести документ '") + ДокОплатаУслугМВК.Номер; 
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОщад(Команда)
	СохранитьОщадНаСервере();
КонецПроцедуры



            