
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУправлениеУслугами, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	Запрос.Текст =
       "ВЫБРАТЬ
       |	УправлениеУслугамиЛицевыеСчета.ЛицевойСчет,
       |	УправлениеУслугамиУслуги.Услуга,
       |	УправлениеУслугамиУслуги.Ссылка.ДатаНачала КАК ДатаНачала,
       |	УправлениеУслугамиУслуги.Ссылка.ДатаОкончания КАК ДатаОкончания,
       |	УправлениеУслугамиЛицевыеСчета.Ссылка.Организация,
       |	УправлениеУслугамиУслуги.Ссылка.КоэффициентКачества
       |ПОМЕСТИТЬ ВременнаяТаблицаУслуги
       |ИЗ
       |	Документ.УправлениеУслугами.ЛицевыеСчета КАК УправлениеУслугамиЛицевыеСчета,
       |	Документ.УправлениеУслугами.Услуги КАК УправлениеУслугамиУслуги
       |ГДЕ
       |	УправлениеУслугамиЛицевыеСчета.Ссылка = &Ссылка
       |	И УправлениеУслугамиУслуги.Ссылка = &Ссылка
       |;
       |
       |////////////////////////////////////////////////////////////////////////////////
       |ВЫБРАТЬ
       |	УслугиДатаНачала.ЛицевойСчет,
       |	УслугиДатаНачала.Услуга,
       |	КОНЕЦПЕРИОДА(УслугиДатаНачала.ДатаНачала, ДЕНЬ) КАК Период,
       |	ИСТИНА КАК Действует,
       |	УслугиДатаНачала.Организация,
       |	УслугиДатаНачала.КоэффициентКачества КАК Коэффициент
       |ИЗ
       |	ВременнаяТаблицаУслуги КАК УслугиДатаНачала
       |ГДЕ
       |	УслугиДатаНачала.ДатаНачала <> &Пустаядата
       |
       |ОБЪЕДИНИТЬ ВСЕ
       |
       |ВЫБРАТЬ
       |	УслугиДатаОкончания.ЛицевойСчет,
       |	УслугиДатаОкончания.Услуга,
       |	НАЧАЛОПЕРИОДА(УслугиДатаОкончания.ДатаОкончания, ДЕНЬ),
       |	ЛОЖЬ,
       |	УслугиДатаОкончания.Организация,
       |	УслугиДатаОкончания.КоэффициентКачества
       |ИЗ
       |	ВременнаяТаблицаУслуги КАК УслугиДатаОкончания
       |ГДЕ
       |	УслугиДатаОкончания.ДатаОкончания <> &ПустаяДата";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУправлениеУслугами);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНазначенныеУслуги", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
