////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.НазначениеУслуги Тогда
		ДатаОкончания = '00010101';
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.ОтключениеУслуги Тогда
		ДатаНачала = '00010101';
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.УправлениеУслугами.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	Если ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.ИзменениеКачестваУслуг Тогда
		ПроведениеСервер.ОтразитьКачествоУслуг(ДополнительныеСвойства, Движения, Отказ);
	Иначе	
		ПроведениеСервер.ОтразитьНазначенныеУслуги(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;	
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
	//Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.ОтключениеУслуги Тогда
	//	Для Каждого стрЛС Из ЭтотОбъект.ЛицевыеСчета Цикл
	//		Для Каждого стр Из ЭтотОбъект.Услуги Цикл
	//			Запрос = Новый Запрос;
	//			Запрос.Текст =
	//			    "ВЫБРАТЬ
	//			    |	НазначенныеУслуги.Регистратор,
	//			    |	НазначенныеУслуги.Организация,
	//			    |	НазначенныеУслуги.ЛицевойСчет,
	//			    |	НазначенныеУслуги.Услуга,
	//			    |	НазначенныеУслуги.Действует
	//			    |ИЗ
	//			    |	РегистрСведений.НазначенныеУслуги КАК НазначенныеУслуги
	//			    |ГДЕ
	//			    |	НазначенныеУслуги.ЛицевойСчет = &ЛицевойСчет
	//			    |	И НазначенныеУслуги.Услуга = &Услуга
	//			    |	И НазначенныеУслуги.Действует = ИСТИНА";
	//			Запрос.УстановитьПараметр("ЛицевойСчет", стрЛС.ЛицевойСчет);
	//			Запрос.УстановитьПараметр("Услуга", стр.Услуга);
	//			Рез = Запрос.Выполнить().Выгрузить();
	//		КонецЦикла;
	//	КонецЦикла;
	//	Для Каждого стрРез Из Рез Цикл
	//		УстановкаУслуг = стрРез.Регистратор.ПолучитьОбъект();
	//		НаборЗаписей = УстановкаУслуг.Движения.НазначенныеУслуги;
	//		НаборЗаписей.Прочитать();
	//		Для Каждого стрНабор Из НаборЗаписей Цикл
	//			стрНабор.Действует = Ложь;
	//			НаборЗаписей.Записать(Истина);
	//		КонецЦикла;
	//	КонецЦикла;
	//КонецЕсли;
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.ОтключениеУслуги Тогда
		Для Каждого стрЛС Из ЭтотОбъект.ЛицевыеСчета Цикл
			Для Каждого стр Из ЭтотОбъект.Услуги Цикл
				Запрос = Новый Запрос;
				Запрос.Текст =
				    "ВЫБРАТЬ
				    |	НазначенныеУслуги.Регистратор,
				    |	НазначенныеУслуги.Организация,
				    |	НазначенныеУслуги.ЛицевойСчет,
				    |	НазначенныеУслуги.Услуга,
				    |	НазначенныеУслуги.Действует
				    |ИЗ
				    |	РегистрСведений.НазначенныеУслуги КАК НазначенныеУслуги
				    |ГДЕ
				    |	НазначенныеУслуги.ЛицевойСчет = &ЛицевойСчет
				    |	И НазначенныеУслуги.Услуга = &Услуга
				    |	И НазначенныеУслуги.Действует = ЛОЖЬ";
				Запрос.УстановитьПараметр("ЛицевойСчет", стрЛС.ЛицевойСчет);
				Запрос.УстановитьПараметр("Услуга", стр.Услуга);
				Рез = Запрос.Выполнить().Выгрузить();
			КонецЦикла;
		КонецЦикла;
		Для Каждого стрРез Из Рез Цикл
			УстановкаУслуг = стрРез.Регистратор.ПолучитьОбъект();
			НаборЗаписей = УстановкаУслуг.Движения.НазначенныеУслуги;
			НаборЗаписей.Прочитать();
			Для Каждого стрНабор Из НаборЗаписей Цикл
				стрНабор.Действует = Истина;
				НаборЗаписей.Записать(Истина);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("ВидОперации") Тогда
			ВидОперации = ДанныеЗаполнения.ВидОперации;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("Организация") Тогда
			Организация = ДанныеЗаполнения.Организация;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("Здание") Тогда
			Здание = ДанныеЗаполнения.Здание;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("ЛицевойСчет") Тогда
			Если ЛицевыеСчета.Количество() = 0 Тогда
				НоваяСтрока = ЛицевыеСчета.Добавить();
				НоваяСтрока.ЛицевойСчет = ДанныеЗаполнения.ЛицевойСчет;
			Иначе
				ЛицевыеСчета[0].ЛицевойСчет = ДанныеЗаполнения.ЛицевойСчет;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
