
// ПРОЦЕДУРЫ ПРИ ОТКРЫТИИ И ИЗМЕНЕНИИ ШАПКИ ДОКУМЕНТА
//

// Процедура устанавливает видимость и доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////

// ОСНОВНЫЕ ПРОЦЕДУРЫ
//

&НаСервере
Процедура ЛицевойСчетПриИзмененииНаСервере()
	ОтветственныйВладелецИКвоПрописанных                         = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(Объект.ЛицевойСчет);
	Объект.Потребитель                                           = ОтветственныйВладелецИКвоПрописанных.ОтветственныйВладелец;
	Объект.РасшифровкаПлатежа.Очистить();
	
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Объект.Здание        = Объект.ЛицевойСчет.Владелец;
	Объект.ОбъектЛицевогоСчета = Объект.Здание.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	ЛицевойСчетПриИзмененииНаСервере();
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("ОтборОрганизация",	Объект.Организация);

	ОткрытьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, Элемент);
КонецПроцедуры

&НаСервере
Процедура ПотребительПриИзмененииНаСервере()
	Объект.ЛицевойСчет = ОбщийМодульМВК.ПолучитьЛицевойСчет(Объект.Потребитель);
	ОтветственныйВладелецИКвоПрописанных                         = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(Объект.ЛицевойСчет);
	Объект.РасшифровкаПлатежа.Очистить();
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Объект.Здание        = Объект.ЛицевойСчет.Владелец;
	Объект.ОбъектЛицевогоСчета = Объект.Здание.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура ПотребительПриИзменении(Элемент)
	ПотребительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗданиеПриИзмененииНаСервере()
	Объект.ЛицевойСчет = НайтиЛицевойСчетПоЗданию(Объект.Здание);
	ОтветственныйВладелецИКвоПрописанных                         = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(Объект.ЛицевойСчет);
	Объект.Потребитель                                           = ОтветственныйВладелецИКвоПрописанных.ОтветственныйВладелец;
	Объект.РасшифровкаПлатежа.Очистить();
	Объект.Здание        = Объект.ЛицевойСчет.Владелец;
	Объект.ОбъектЛицевогоСчета = Объект.Здание.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	ЗданиеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СуммаПлатежаПриИзменении(Элемент)
	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		НоваяСтрока = Объект.РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ПризнакАванса = Истина;
	    НоваяСтрока.Сумма = Объект.СуммаПлатежа;
	Иначе
	    ТекСтр = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	    ТекСтр.Сумма = Объект.СуммаПлатежа;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ФизЛицоПриИзмененииНаСервере()
	// Найдем ЛС
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	СведенияОПроживающихЖильцахСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.СведенияОПроживающихЖильцах.СрезПоследних(&НаДату, &Жилец = Жилец И Проживает = ИСТИНА) КАК СведенияОПроживающихЖильцахСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Жилец", Объект.ФизЛицо);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект.ЛицевойСчет = Выборка.ЛицевойСчет;
	КонецЦикла;
	//////// Заполним владельца по ЛС
	ОтветственныйВладелецИКвоПрописанных                         = ОбщийМодульМВК.ОпределитьКоличествоПрописанных(Объект.ЛицевойСчет);
	Объект.Потребитель                                           = ОтветственныйВладелецИКвоПрописанных.ОтветственныйВладелец;
	Объект.РасшифровкаПлатежа.Очистить();
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Объект.Здание        = Объект.ЛицевойСчет.Владелец;
	Объект.ОбъектЛицевогоСчета = Объект.Здание.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	ФизЛицоПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПредыдущиеПоказанияПриИзменении(Элемент)
	ТекСтрока = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.ТекущиеПоказания) Тогда
		ТекСтрока.КвоКубов = ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания;
		ТекСтрока.Сумма    = ТекСтрока.КвоКубов * ТекСтрока.СтоимостьУслуги;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаТекущиеПоказанияПриИзменении(Элемент)
	ТекСтрока = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	ТекСтрока.КвоКубов = ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания;
	ТекСтрока.Сумма    = ТекСтрока.КвоКубов * ТекСтрока.СтоимостьУслуги;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПризнакАвансаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТекущиеДанные.ПризнакАванса Тогда
		ТекущиеДанные.МесяцНачисления = '00010101';	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаМесяцНачисленияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущиеДанные.МесяцНачисления) Тогда
		ТекущиеДанные.ПризнакАванса = Ложь;	
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

// ДРУГИЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

&НаСервере
Функция НайтиЛицевойСчетПоЗданию(Здание)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОткрытиеЛицевогоСчета.ЛицевойСчет КАК ЛицевойСчет
		|ИЗ
		|	Документ.ОткрытиеЛицевогоСчета КАК ОткрытиеЛицевогоСчета
		|ГДЕ
		|	ОткрытиеЛицевогоСчета.Здание = &Здание";
	Запрос.УстановитьПараметр("Здание", Здание);
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛС = Выборка.ЛицевойСчет;
	КонецЦикла;
	Возврат ЛС;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = Справочники.Организации.НайтиПоКоду("000000001");
КонецПроцедуры

&НаСервере
Функция ПроверкаРоли()
    Пользователь = ПараметрыСеанса.ТекущийПользователь.Наименование;
	Возврат Пользователь;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ТолькоПросмотр = Истина;
	Пользователь = ПроверкаРоли();
	Если Пользователь = "Администратор" Тогда
	    ЭтаФорма.ТолькоПросмотр = Ложь;
	ИначеЕсли  Пользователь = "Шевченко Л.В." Тогда
		ЭтаФорма.ТолькоПросмотр = Ложь;
	ИначеЕсли Пользователь = "Войтенко О.О." Тогда
		ЭтаФорма.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры
