
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуУстановленныеПриборыУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаПриборыУчетаВключение.ПриборУчета КАК ПриборУчета,
		|	ТаблицаПриборыУчетаВключение.ОбъектУстановки КАК ОбъектУстановки,
		|	ТаблицаПриборыУчетаВключение.ДатаВключения КАК Период,
		|	ТаблицаПриборыУчетаВключение.ДатаПоследнейПоверки,
		|	ТаблицаПриборыУчетаВключение.ДатаСледующейПоверки,
		|	ТаблицаПриборыУчетаВключение.ТипПрибора,
		|	ТаблицаПриборыУчетаВключение.МестоРазмещения,
		|	ИСТИНА КАК Действует,
		|	0 КАК СреднемесячноеПоказание
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаПриборыУчетаВключение
		|ГДЕ
		|	ТаблицаПриборыУчетаВключение.ДатаВключения <> &ПустаяДата
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПриборыУчетаВключение.ПриборУчета,
		|	ТаблицаПриборыУчетаВключение.ДатаВключения,
		|	ТаблицаПриборыУчетаВключение.ОбъектУстановки,
		|	ТаблицаПриборыУчетаВключение.ТипПрибора,
		|	ТаблицаПриборыУчетаВключение.ДатаПоследнейПоверки,
		|	ТаблицаПриборыУчетаВключение.ДатаСледующейПоверки,
		|	ТаблицаПриборыУчетаВключение.МестоРазмещения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаПриборыУчетаОтключение.ПриборУчета,
		|	ТаблицаПриборыУчетаОтключение.ОбъектУстановки,
		|	ТаблицаПриборыУчетаОтключение.ДатаОтключения,
		|	ЕСТЬNULL(NULL, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)),
		|	ЕСТЬNULL(NULL, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)),
		|	ЕСТЬNULL(NULL, """"),
		|	ЕСТЬNULL(NULL, """"),
		|	ЛОЖЬ,
		|	МАКСИМУМ(ТаблицаПриборыУчетаОтключение.СреднемесячноеПоказание)
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаПриборыУчетаОтключение
		|ГДЕ
		|	ТаблицаПриборыУчетаОтключение.ДатаОтключения <> &ПустаяДата
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПриборыУчетаОтключение.ОбъектУстановки,
		|	ТаблицаПриборыУчетаОтключение.ДатаОтключения,
		|	ТаблицаПриборыУчетаОтключение.ПриборУчета";
	
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУстановленныеПриборыУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуУстановленныеПриборыУчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуПоказанияПриборовУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаПриборыУчетаПоказания.ПриборУчета КАК ПриборУчета,
		|	ТаблицаПриборыУчетаПоказания.ВидТарифа КАК ВидТарифа,
		|	ТаблицаПриборыУчетаПоказания.ДатаВключения,
		|	ТаблицаПриборыУчетаПоказания.ДатаОтключения,
		|	ТаблицаПриборыУчетаПоказания.ВидОперации КАК ВидОперации,
		|	ТаблицаПриборыУчетаПоказания.НачальноеПоказание,
		|	ТаблицаПриборыУчетаПоказания.КонечноеПоказание,
		|	ВЫБОР
		|		КОГДА ТаблицаПриборыУчетаПоказания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеНаПоверку)
		|				ИЛИ ТаблицаПриборыУчетаПоказания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеПрибораУчета)
		|			ТОГДА ТаблицаПриборыУчетаПоказания.ДатаОтключения
		|		ИНАЧЕ ТаблицаПриборыУчетаПоказания.ДатаВключения
		|	КОНЕЦ КАК Период,
		|	ВЫБОР
		|		КОГДА ТаблицаПриборыУчетаПоказания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеНаПоверку)
		|				ИЛИ ТаблицаПриборыУчетаПоказания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеПрибораУчета)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Отключен,
		|	ВЫБОР
		|		КОГДА ТаблицаПриборыУчетаПоказания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеНаПоверку)
		|				ИЛИ ТаблицаПриборыУчетаПоказания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеПрибораУчета)
		|			ТОГДА ТаблицаПриборыУчетаПоказания.КонечноеПоказание
		|		ИНАЧЕ ТаблицаПриборыУчетаПоказания.НачальноеПоказание
		|	КОНЕЦ КАК Значение
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаПриборыУчетаПоказания
		|ГДЕ
		|	(ТаблицаПриборыУчетаПоказания.ДатаВключения <> &ПустаяДата
		|			ИЛИ ТаблицаПриборыУчетаПоказания.ДатаОтключения <> &ПустаяДата)";
	
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПоказанияПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуУстановленныеПриборыУчета()

Процедура СформироватьТаблицуПломбыПриборовУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаПриборыУчетаПоказания.ПриборУчета КАК ПриборУчета,
		|	ВЫБОР
		|		КОГДА ТаблицаПриборыУчетаПоказания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеНаПоверку)
		|				ИЛИ ТаблицаПриборыУчетаПоказания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеПрибораУчета)
		|			ТОГДА ТаблицаПриборыУчетаПоказания.ДатаОтключения
		|		ИНАЧЕ ТаблицаПриборыУчетаПоказания.ДатаВключения
		|	КОНЕЦ КАК Период,
		|	ВЫБОР
		|		КОГДА ТаблицаПриборыУчетаПоказания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеНаПоверку)
		|				ИЛИ ТаблицаПриборыУчетаПоказания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеПрибораУчета)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Действует,
		|	МАКСИМУМ(ТаблицаПриборыУчетаПоказания.ВидПломбы) КАК ВидПломбы,
		|	МАКСИМУМ(ТаблицаПриборыУчетаПоказания.СерийныйНомер) КАК СерийныйНомер,
		|	ТаблицаПриборыУчетаПоказания.ОбъектУстановки КАК ЛицевойСчет,
		|	ТаблицаПриборыУчетаПоказания.Здание,
		|	ТаблицаПриборыУчетаПоказания.Организация
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаПриборыУчетаПоказания
		|ГДЕ
		|	(ТаблицаПриборыУчетаПоказания.ДатаВключения <> &ПустаяДата
		|			ИЛИ ТаблицаПриборыУчетаПоказания.ДатаОтключения <> &ПустаяДата)
		|	И ТаблицаПриборыУчетаПоказания.ВидПломбы <> &ВидПломбы
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПриборыУчетаПоказания.ПриборУчета,
		|	ТаблицаПриборыУчетаПоказания.ОбъектУстановки,
		|	ТаблицаПриборыУчетаПоказания.Здание,
		|	ТаблицаПриборыУчетаПоказания.Организация,
		|	ВЫБОР
		|		КОГДА ТаблицаПриборыУчетаПоказания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеНаПоверку)
		|				ИЛИ ТаблицаПриборыУчетаПоказания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеПрибораУчета)
		|			ТОГДА ТаблицаПриборыУчетаПоказания.ДатаОтключения
		|		ИНАЧЕ ТаблицаПриборыУчетаПоказания.ДатаВключения
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТаблицаПриборыУчетаПоказания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеНаПоверку)
		|				ИЛИ ТаблицаПриборыУчетаПоказания.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеПрибораУчета)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("ВидПломбы", Справочники.ВидыПломбПриборовУчета.ПустаяСсылка());

	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ПломбыПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуУстановленныеПриборыУчета()

Процедура СформироватьТаблицуЗаменыПломбыПриборовУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаПриборыУчетаПоказания.ПриборУчета КАК ПриборУчета,
		|	МАКСИМУМ(ТаблицаПриборыУчетаПоказания.ВидПломбы) КАК ВидПломбы,
		|	МАКСИМУМ(ТаблицаПриборыУчетаПоказания.СерийныйНомер) КАК СерийныйНомер,
		|	ТаблицаПриборыУчетаПоказания.Дата КАК Период,
		|	ЛОЖЬ КАК Действует,
		|	ТаблицаПриборыУчетаПоказания.ОбъектУстановки КАК ЛицевойСчет,
		|	ТаблицаПриборыУчетаПоказания.Здание,
		|	ТаблицаПриборыУчетаПоказания.Организация
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаПриборыУчетаПоказания
		|ГДЕ
		|	ТаблицаПриборыУчетаПоказания.ВидПломбы <> &ВидПломбы
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПриборыУчетаПоказания.ПриборУчета,
		|	ТаблицаПриборыУчетаПоказания.Дата,
		|	ТаблицаПриборыУчетаПоказания.ОбъектУстановки,
		|	ТаблицаПриборыУчетаПоказания.Здание,
		|	ТаблицаПриборыУчетаПоказания.Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаПриборыУчетаПоказания.ПриборУчета,
		|	МАКСИМУМ(ТаблицаПриборыУчетаПоказания.ВидПломбыНовый),
		|	МАКСИМУМ(ТаблицаПриборыУчетаПоказания.СерийныйНомерНовый),
		|	ТаблицаПриборыУчетаПоказания.Дата,
		|	ИСТИНА,
		|	ТаблицаПриборыУчетаПоказания.ОбъектУстановки,
		|	ТаблицаПриборыУчетаПоказания.Здание,
		|	ТаблицаПриборыУчетаПоказания.Организация
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаПриборыУчетаПоказания
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПриборыУчетаПоказания.ПриборУчета,
		|	ТаблицаПриборыУчетаПоказания.Дата,
		|	ТаблицаПриборыУчетаПоказания.ОбъектУстановки,
		|	ТаблицаПриборыУчетаПоказания.Здание,
		|	ТаблицаПриборыУчетаПоказания.Организация";
	
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("ВидПломбы", Справочники.ВидыПломбПриборовУчета.ПустаяСсылка());

	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ПломбыПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуУстановленныеПриборыУчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуПоверкиПриборовУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаПриборыУчетаВключение.ПриборУчета КАК ПриборУчета,
		|	ТаблицаПриборыУчетаВключение.ОбъектУстановки КАК ОбъектУстановки,
		|	ТаблицаПриборыУчетаВключение.ДатаПоследнейПоверки КАК Период,
		|	ИСТИНА КАК ПоверкаВыполнена
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаПриборыУчетаВключение
		|ГДЕ
		|	ТаблицаПриборыУчетаВключение.ДатаПоследнейПоверки <> &ПустаяДата
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПриборыУчетаВключение.ОбъектУстановки,
		|	ТаблицаПриборыУчетаВключение.ПриборУчета,
		|	ТаблицаПриборыУчетаВключение.ДатаПоследнейПоверки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаПриборыУчетаОтключение.ПриборУчета,
		|	ТаблицаПриборыУчетаОтключение.ОбъектУстановки,
		|	ТаблицаПриборыУчетаОтключение.ДатаСледующейПоверки,
		|	ЛОЖЬ
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаПриборыУчетаОтключение
		|ГДЕ
		|	ТаблицаПриборыУчетаОтключение.ДатаСледующейПоверки <> &ПустаяДата
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПриборыУчетаОтключение.ПриборУчета,
		|	ТаблицаПриборыУчетаОтключение.ОбъектУстановки,
		|	ТаблицаПриборыУчетаОтключение.ДатаСледующейПоверки";
	
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПоверкиПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуУстановленныеПриборыУчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуЗаменыПриборовУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаЗаменыПриборовУчета.ДатаОтключения КАК Период,
		|	ТаблицаЗаменыПриборовУчета.ОбъектУстановки КАК ОбъектУстановки,
		|	ТаблицаЗаменыПриборовУчета.ПриборУчета КАК ПриборУчета,
		|	ТаблицаЗаменыПриборовУчета.ВидОперации КАК ВидОперации,
		|	ТаблицаЗаменыПриборовУчета.Услуга КАК Услуга,
		|	ТаблицаЗаменыПриборовУчета.ВидТарифа КАК ВидТарифа,
		|	ТаблицаЗаменыПриборовУчета.КонечноеПоказание КАК Показание,
		|	0 КАК ПоказаниеПредыдущее,
		|	ТаблицаЗаменыПриборовУчета.СреднемесячноеПоказание
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаЗаменыПриборовУчета
		|ГДЕ
		|	(ТаблицаЗаменыПриборовУчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеПрибораУчета)
		|			ИЛИ ТаблицаЗаменыПриборовУчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеНаПоверку))";	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка Из РезультатЗапроса Цикл
		ТаблицаПредыдущихПоказаний = РегистрыСведений.ПоказанияПриборовУчета.СрезПоследних(Новый Граница(Строка.Период, ВидГраницы.Исключая), Новый Структура("ПриборУчета", Строка.ПриборУчета));
		Если ТаблицаПредыдущихПоказаний.Количество() > 0 Тогда
			Строка.ПоказаниеПредыдущее = ТаблицаПредыдущихПоказаний[0].Значение;
		КонецЕсли; 
	КонецЦикла; 
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаменыПриборовУчета", РезультатЗапроса);
	
КонецПроцедуры // СформироватьТаблицуЗаменыПриборовУчета()

Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УправлениеПриборамиУчетаПриборыУчета.ПриборУчета,
	|	УправлениеПриборамиУчетаПриборыУчета.ДатаВключения,
	|	УправлениеПриборамиУчетаПриборыУчета.ДатаОтключения,
	|	УправлениеПриборамиУчетаПриборыУчета.НачальноеПоказание,
	|	УправлениеПриборамиУчетаПриборыУчета.КонечноеПоказание,
	|	УправлениеПриборамиУчетаПриборыУчета.ДатаПоследнейПоверки,
	|	УправлениеПриборамиУчетаПриборыУчета.ДатаСледующейПоверки,
	|	УправлениеПриборамиУчетаПриборыУчета.Ссылка.ВидОперации КАК ВидОперации,
	|	УправлениеПриборамиУчетаПриборыУчета.Ссылка.ОбъектУстановки КАК ОбъектУстановки,
	|	УправлениеПриборамиУчетаПриборыУчета.ПриборУчета.Услуга КАК Услуга,
	|	УправлениеПриборамиУчетаПриборыУчета.СреднемесячноеПоказание,
	|	УправлениеПриборамиУчетаПриборыУчета.ВидТарифа,
	|	УправлениеПриборамиУчетаПриборыУчета.ВидПломбы,
	|	УправлениеПриборамиУчетаПриборыУчета.СерийныйНомерПломбы КАК СерийныйНомер,
	|	УправлениеПриборамиУчетаПриборыУчета.ВидПломбыНовый,
	|	УправлениеПриборамиУчетаПриборыУчета.СерийныйНомерПломбыНовый КАК СерийныйНомерНовый,
	|	УправлениеПриборамиУчетаПриборыУчета.Ссылка.Дата,
	|	УправлениеПриборамиУчетаПриборыУчета.Ссылка.Организация,
	|	УправлениеПриборамиУчетаПриборыУчета.Ссылка.Здание,
	|	УправлениеПриборамиУчетаПриборыУчета.ТипПрибора,
	|	УправлениеПриборамиУчетаПриборыУчета.МестоРазмещения
	|ПОМЕСТИТЬ ВременнаяТаблицаПриборыУчета
	|ИЗ
	|	Документ.УправлениеПриборамиУчета.ПриборыУчета КАК УправлениеПриборамиУчетаПриборыУчета
	|ГДЕ
	|	УправлениеПриборамиУчетаПриборыУчета.Ссылка = &Ссылка"; 
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУправлениеПриборамиУчета);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ДокументСсылкаУправлениеПриборамиУчета.ВидОперации <>  Перечисления.ВидыОперацийУправленияПриборамиУчета.ЗаменаПломбы Тогда
		СформироватьТаблицуУстановленныеПриборыУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства);
		СформироватьТаблицуПоказанияПриборовУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства);
		СформироватьТаблицуПоверкиПриборовУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства);
		СформироватьТаблицуЗаменыПриборовУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства);
		СформироватьТаблицуПломбыПриборовУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства);
	Иначе	
		СформироватьТаблицуЗаменыПломбыПриборовУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства);
	КонецЕсли;	
КонецПроцедуры
