////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.УправлениеПриборамиУчета.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	Если  ВидОперации <> Перечисления.ВидыОперацийУправленияПриборамиУчета.ЗаменаПломбы Тогда
		ПроведениеСервер.ОтразитьУстановленныеПриборыУчета(ДополнительныеСвойства, Движения, Отказ);
		ПроведениеСервер.ОтразитьПоказанияПриборовУчета(ДополнительныеСвойства, Движения, Отказ);
		ПроведениеСервер.ОтразитьПоверкиПриборовУчета(ДополнительныеСвойства, Движения, Отказ);
		ПроведениеСервер.ОтразитьЗаменыПриборовУчета(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
	Если УказатьПломбыПриборовУчета Или ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.ЗаменаПломбы Тогда
		ПроведениеСервер.ОтразитьПломбыПриборовУчета(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли; 	
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

// Процедура - обработчик события Заполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("ВидОперации") Тогда
			ВидОперации = ДанныеЗаполнения.ВидОперации;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("Организация") Тогда
			Организация = ДанныеЗаполнения.Организация;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("Здание") Тогда
			Здание = ДанныеЗаполнения.Здание;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("ЛицевойСчет") Тогда
			ОбъектУстановки = ДанныеЗаполнения.ЛицевойСчет;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.УстановкаПрибораУчета Тогда
		
		Для Каждого СтрокаПриборыУчета Из ПриборыУчета Цикл
			СтрокаПриборыУчета.ДатаОтключения = '00010101';	
			СтрокаПриборыУчета.КонечноеПоказание = 0;	
		КонецЦикла;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.ОтключениеПрибораУчета Тогда
		
		Для Каждого СтрокаПриборыУчета Из ПриборыУчета Цикл
			СтрокаПриборыУчета.ДатаВключения = '00010101';	
			СтрокаПриборыУчета.НачальноеПоказание = 0;	
		КонецЦикла;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.ОтключениеНаПоверку Тогда
		
		Для Каждого СтрокаПриборыУчета Из ПриборыУчета Цикл
			СтрокаПриборыУчета.ДатаВключения = '00010101';	
			СтрокаПриборыУчета.НачальноеПоказание = 0;	
		КонецЦикла;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.ВключениеПослеПоверки Тогда
		
		Для Каждого СтрокаПриборыУчета Из ПриборыУчета Цикл
			СтрокаПриборыУчета.ДатаОтключения = '00010101';	
			СтрокаПриборыУчета.КонечноеПоказание = 0;	
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
