// Процедура для загрузки курсов валют по определенному периоду.
//
// Параметры
// Валюты		- Любая коллекция - со следующими полями:
//					КодВалюты - числовой код валюты
//					Валюта - ссылка на валюту
// НачалоПериодаЗагрузки	- Дата - начало периода загрузки курсов
// ОкончаниеПериодаЗагрузки	- Дата - окончание периода загрузки курсов
// КодДоступа	            - Код для возможности загрузки курсов за период
// ПоясняющееСообщение		- строка - в случае возникновения ошибки
//							(исключения) в функции, содержит текстовое представление описания ошибки
//
// Возвращаемое значение:
// Истина	- валюты успешно загружены
// Ложь		- хотя бы одна валюта не была загружена
//
Функция ЗагрузитьКурсыВалютПоПараметрам(знач Валюты,
										знач НачалоПериодаЗагрузки,
										знач ОкончаниеПериодаЗагрузки,
										знач КодДоступа,
										ПоясняющееСообщение = "",
										ПриЗагрузкеВозниклиОшибки = Ложь) Экспорт
	
	СтатусОперации = Истина;
	
	ПриЗагрузкеВозниклиОшибки = Ложь;
	
	СерверИсточник = "fin.1c.ua";
	
	Адрес1 = "1c/cb/";  // в интервале
	Адрес2 = "1c/";     // по 1 дате
	
	Если СокрЛП(КодДоступа) <> "" Тогда
		Код = "?"+КодДоступа;
	Иначе	
		Код = "";
		НачалоПериодаЗагрузки = ТекущаяДата();
		ОкончаниеПериодаЗагрузки = ТекущаяДата();
	КонецЕсли; 
	
	Если НачалоПериодаЗагрузки = ОкончаниеПериодаЗагрузки Тогда  // по 1 дате
		Адрес = Адрес2;
		ТМП   = "/"+Формат(Год(ОкончаниеПериодаЗагрузки),"ЧРГ=; ЧГ=0")+"/"+Формат(Месяц(ОкончаниеПериодаЗагрузки),"ЧЦ=2;ЧДЦ=0;ЧВН=")+"/"+Формат(День(ОкончаниеПериодаЗагрузки),"ЧЦ=2;ЧДЦ=0;ЧВН=");
	Иначе    // в интервале
		Адрес = Адрес1;
		ТМП   = "";
	КонецЕсли;
	
	Для Каждого Валюта из Валюты Цикл
		ФайлНаВебСервере = "http://" + СерверИсточник + "/" + Адрес + Прав(Валюта.КодВалюты, 3) + ТМП + ".tsv" + СокрЛП(Код);
		
#Если НаКлиенте Тогда
		Результат = ПолучениеФайловИзИнтернетаКлиент.СкачатьФайлНаКлиенте(ФайлНаВебСервере);
#Иначе
		Результат = ПолучениеФайловИзИнтернета.СкачатьФайлНаСервере(ФайлНаВебСервере);
#КонецЕсли
		
		Если Результат.Статус Тогда
#Если НаКлиенте Тогда
			ДвоичныеДанные = Новый ДвоичныеДанные (Результат.Путь);
			АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			ПоясняющееСообщение = ПоясняющееСообщение + РаботаСКурсамиВалют.ЗагрузитьКурсВалютыИзФайла(Валюта.Валюта, АдресВоВременномХранилище, НачалоПериодаЗагрузки, ОкончаниеПериодаЗагрузки) + Символы.ПС;
#Иначе
			ПоясняющееСообщение = ПоясняющееСообщение + РаботаСКурсамиВалют.ЗагрузитьКурсВалютыИзФайла(Валюта.Валюта, Результат.Путь, НачалоПериодаЗагрузки, ОкончаниеПериодаЗагрузки) + Символы.ПС;
#КонецЕсли
			УдалитьФайлы(Результат.Путь);
		Иначе
			СтатусОперации = Ложь;
			ПриЗагрузкеВозниклиОшибки = Истина;
			ПоясняющееСообщение= НСтр("ru='Не возможно получить файл данных с курсами валюты (%1 - %2):"
"%3"
"Возможно, нет доступа к веб сайту с курсами валют, либо указана несуществующая валюта.';uk='Не можливо одержати файл даних з курсами валюти (%1 - %2): %3  Можливо, немає доступу до веб сайту з курсами валют, або зазначена неіснуюча валюта.'");
			ПоясняющееСообщение = 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								ПоясняющееСообщение,
								Валюта.КодВалюты,
								Валюта.Валюта,
								Результат.СообщениеОбОшибке);
		КонецЕсли;
	КонецЦикла;
	
	Если СтатусОперации Тогда
		ПоясняющееСообщение = Лев(ПоясняющееСообщение, СтрДлина(ПоясняющееСообщение) - 2);
	КонецЕсли;
	
	Возврат СтатусОперации;
	
КонецФункции

// Устарела: Следует использовать функцию ПересчитатьПоКурсу
// 
// Пересчитывает сумму из валюты ВалютаНач по курсу ПоКурсуНач 
// в валюту ВалютаКон по курсу ПоКурсуКон.
// 
// Параметры:
//   Сумма          (Число) Сумма, которую следует пересчитать
//   ВалютаНач      (СправочникСсылка.Валюты) Валюта, из которой надо пересчитать
//   ВалютаКон      (СправочникСсылка.Валюты) Валюта, в  которую надо пересчитать
//   ПоКурсуНач     (Число) Курс, из которого надо пересчитать
//   ПоКурсуКон     (Число) Курс, в  который  надо пересчитать
//   ПоКратностьНач (Число) Кратность, из которой надо пересчитать (по умолчанию = 1)
//   ПоКратностьКон (Число) Кратность, в  которую надо пересчитать (по умолчанию = 1)
// 
// Возвращаемое значение: 
//   (Число) Сумма, пересчитанная в другую валюту
// 
Функция ПересчитатьИзВалютыВВалюту(Сумма, ВалютаНач, ВалютаКон, ПоКурсуНач, ПоКурсуКон, 
	ПоКратностьНач = 1, ПоКратностьКон = 1) Экспорт
	
	Возврат ПересчитатьПоКурсу(
		Сумма, 
		Новый Структура("Валюта, Курс, Кратность", ВалютаНач, ПоКурсуНач, ПоКратностьНач),
		Новый Структура("Валюта, Курс, Кратность", ВалютаКон, ПоКурсуКон, ПоКратностьКон)
	);
	
КонецФункции
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Валюты"
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Пересчитывает Сумму из Текущей валюты в Новую валюту по параметрам их курсов. 
//   Параметры курсов валют можно получить воспользовавшись функцией 
//   РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ДатаКурса).
// 
// Параметры:
//   Сумма                  (Число)     Сумма, которую следует пересчитать
//   ПараметрыТекущегоКурса (Структура) Параметры курса валюты, из которой надо пересчитать
//       |- Валюта    (СправочникСсылка.Валюты)
//       |- Курс      (Число)
//       |- Кратность (Число)
//   ПараметрыНовогоКурса   (Структура) Параметры курса валюты, в  которую надо пересчитать
//       |- Валюта    (СправочникСсылка.Валюты)
//       |- Курс      (Число)
//       |- Кратность (Число)
// 
// Возвращаемое значение: 
//   (Число) Сумма, пересчитанная в другую валюту
// 
Функция ПересчитатьПоКурсу(Сумма, ПараметрыТекущегоКурса, ПараметрыНовогоКурса) Экспорт
	Если ПараметрыТекущегоКурса.Валюта = ПараметрыНовогоКурса.Валюта
		ИЛИ (
			ПараметрыТекущегоКурса.Курс = ПараметрыНовогоКурса.Курс 
			И ПараметрыТекущегоКурса.Кратность = ПараметрыНовогоКурса.Кратность
		) Тогда
		
		Возврат Сумма;
		
	КонецЕсли;
	
	Если ПараметрыТекущегоКурса.Курс = 0
		ИЛИ ПараметрыТекущегоКурса.Кратность = 0
		ИЛИ ПараметрыНовогоКурса.Курс = 0
		ИЛИ ПараметрыНовогоКурса.Кратность = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='При пересчете в валюту %1 сумма %2 установлена в нулевое значение, т.к. курс валюты не задан.';uk=' При перерахуванні у валюту %1 сума %2 установлена в нульове значення, тому що курс валюти не заданий.'"), 
				ПараметрыНовогоКурса.Валюта, 
				Формат(Сумма, "ЧДЦ=2; ЧН=0")
			)
		);
		
		Возврат 0;
		
	КонецЕсли;
	
	Возврат Окр((Сумма * ПараметрыТекущегоКурса.Курс * ПараметрыНовогоКурса.Кратность) / (ПараметрыНовогоКурса.Курс * ПараметрыТекущегоКурса.Кратность), 2);
КонецФункции

