////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура устанавливает видимость и доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Элементы.ГруппаПрописанные.Видимость = ?(Объект.ВидОперации = Перечисления.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеДанныхОПотребителяхУслуг, Истина, Ложь);
	Элементы.ГруппаСменыОтветственногоВладельца.Видимость = ?(Объект.ВидОперации = Перечисления.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеОтветственногоВладельца, Истина, Ложь);;
	Элементы.ГруппаМашиноМесто.Видимость = ?(Объект.ВидОперации = Перечисления.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеМашиноМест, Истина, Ложь);;
	Элементы.ГруппаДополнительныеРеквизиты.Видимость = ?(Объект.ВидОперации = Перечисления.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеДополнительныхРеквизитов, Истина, Ложь);;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРасширениеНачисленийЛицевыхСчетов") Тогда
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеДополнительныхРеквизитов);	
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьИДоступность()

// Функция возвращает физическое лицо.
//
&НаСервереБезКонтекста
Функция ПолучитьФизЛицо(ПотребительУслуг)
	
	Возврат ПотребительУслуг.ФизЛицо;
	
КонецФункции

// Процедура - обработчик команды "ДокументыФизЛиц".
//
&НаКлиенте
Процедура КомандаДокументыФизЛиц(Команда)
	
	Если Элементы.ПотребителиУслуг.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФизЛицо = ПолучитьФизЛицо(Элементы.ПотребителиУслуг.ТекущиеДанные.ПотребительУслуг);
	Если НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("ФизЛицо", ФизЛицо);
	ПараметрыФизЛицо = Новый Структура("Отбор",СтруктураОтбора);
	ОткрытьФорму("РегистрСведений.ДокументыФизическихЛиц.Форма.ДокументыФизическогоЛица", ПараметрыФизЛицо);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "ВидОперации".
//
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

// Функция возвращает данные о лицевом счете.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеЛицевойСчетПриИзменении(ЛицевойСчет, Дата)
	
	ДатаПред = Дата - (24*60*60);
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить("Организация", ЛицевойСчет.Владелец.Организация);
	СтруктураДанные.Вставить("Здание", ЛицевойСчет.Владелец);

	
	Если НЕ ЗначениеЗаполнено(ЛицевойСчет) Тогда
		
		СтруктураДанные.Вставить("ОтветственныйВладелец", Справочники.ПотребителиУслуг.ПустаяСсылка());
		СтруктураДанные.Вставить("КоличествоПрописанных", 0);
		СтруктураДанные.Вставить("КоличествоПроживающих", 0);
		
		Возврат СтруктураДанные;
		
	КонецЕсли;
	
	ТаблицаОтветственныйВладелец = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ДатаПред, Новый Структура("ЛицевойСчет", ЛицевойСчет));
	
	Если ТаблицаОтветственныйВладелец.Количество() > 0 Тогда
		СтруктураДанные.Вставить("ОтветственныйВладелец", ТаблицаОтветственныйВладелец[0].ОтветственныйВладелец);
	Иначе
		СтруктураДанные.Вставить("ОтветственныйВладелец", Справочники.ПотребителиУслуг.ПустаяСсылка());
	КонецЕсли;
	
	ТаблицаЛицевойСчет = РегистрыСведений.ЛицевыеСчета.СрезПоследних(ДатаПред, Новый Структура("ЛицевойСчет", ЛицевойСчет));
	
	Если ТаблицаЛицевойСчет.Количество() > 0 Тогда
		
		СтруктураДанные.Вставить("КоличествоПрописанных", ТаблицаЛицевойСчет[0].КоличествоПрописанных);
		СтруктураДанные.Вставить("КоличествоПроживающих", ТаблицаЛицевойСчет[0].КоличествоПроживающих);
		
	Иначе	
		СтруктураДанные.Вставить("КоличествоПрописанных", 0);
		СтруктураДанные.Вставить("КоличествоПроживающих", 0);
		
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеЛицевойСчетПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	СтруктураДанные = ПолучитьДанныеЛицевойСчетПриИзменении(Объект.ЛицевойСчет, Объект.Дата);
	
	Объект.Организация = СтруктураДанные.Организация;
	Объект.Здание = СтруктураДанные.Здание;
	ОтветственныйВладелецПред = СтруктураДанные.ОтветственныйВладелец;
	
	КоличествоПрописанныхПред = СтруктураДанные.КоличествоПрописанных;
	КоличествоПроживающихПред = СтруктураДанные.КоличествоПроживающих;
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыВыбораЗначения.Вставить("ОтборЗдание",			Объект.Здание);

	ОткрытьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, Элемент);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	УстановитьВидимостьИДоступность();
	
	СтруктураДанные = ПолучитьДанныеЛицевойСчетПриИзменении(Объект.ЛицевойСчет, Объект.Дата);
	ОтветственныйВладелецПред = СтруктураДанные.ОтветственныйВладелец;
	
	КоличествоПрописанныхПред = СтруктураДанные.КоличествоПрописанных;
	КоличествоПроживающихПред = СтруктураДанные.КоличествоПроживающих;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И Объект.ВидОперации = Перечисления.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеМашиноМест Тогда
		ТаблицаМашиноМест = РегистрыСведений.МашиноМеста.СрезПоследних(, Новый Структура("ЛицевойСчет", Объект.ЛицевойСчет));
		
		Объект.МашиноМеста.Очистить();
		
		Для Каждого СтрокаМашиноМест Из ТаблицаМашиноМест Цикл 
			Если СтрокаМашиноМест.КоличествоМашиноМест = 0 Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Объект.МашиноМеста.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМашиноМест);
		КонецЦикла;
	КонецЕсли; 
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
	Оповестить("ИзмененЛицевойСчет", Объект.ЛицевойСчет , ЭтаФорма);
	
КонецПроцедуры

