
&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ВидРС = РС_СменитьСтол.ПолучитьНастройкиСтола();
	Если ЗначениеЗаполнено(ВидРС) = Ложь тогда
		РС_СменитьСтол.СменитьСтол();
	Иначе
		РС_СменитьСтол.СменитьСтол(ВидРС);
	КонецЕсли;
	ОСМДКлиент.ПолучитьПараметрыФункциональныхОпций();

КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ОбновлениеИБ", "ПервоначальноеЗаполнениеИБ", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НаборКонстант.ИспользоватьВариантКоттеджныйПоселок Тогда
		Элементы.ОпцияПоселок.ТекущаяСтраница = Элементы.ОпцияПоселок.ПодчиненныеЭлементы.ПоселокДА;
	Иначе
		Элементы.ОпцияПоселок.ТекущаяСтраница = Элементы.ОпцияПоселок.ПодчиненныеЭлементы.ПоселокНет;
	КонецЕсли;
	
	Если НаборКонстант.УслугиСДПТПодробно Тогда
		Элементы.ОпцияСДПТФлаг.ТекущаяСтраница = Элементы.ОпцияСДПТФлаг.ПодчиненныеЭлементы.СДПТФлагДА;
	Иначе
		Элементы.ОпцияСДПТФлаг.ТекущаяСтраница = Элементы.ОпцияСДПТФлаг.ПодчиненныеЭлементы.СДПТФлагНет;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	Элементы.ОпцияПоселок.ТекущаяСтраница = Элементы.ОпцияПоселок.ПодчиненныеЭлементы.ПоселокНет;
	НаборКонстант.ИспользоватьВариантКоттеджныйПоселок = Ложь;
	Модифицированность = Истина;
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура Декорация3Нажатие(Элемент)
	
	Элементы.ОпцияПоселок.ТекущаяСтраница = Элементы.ОпцияПоселок.ПодчиненныеЭлементы.ПоселокДА;
	Элементы.ОпцияГородФлаг.ТекущаяСтраница = Элементы.ОпцияГородФлаг.ПодчиненныеЭлементы.ОпцияГородНЕТ;
	НаборКонстант.ЗадействоватьОпциюГород = Ложь;
	НаборКонстант.ИспользоватьВариантКоттеджныйПоселок = Истина;
	Модифицированность = Истина;
	ОбновитьИнтерфейс();
	
КонецПроцедуры


&НаКлиенте
Процедура ПодобратьИзКлассификатора(Команда)
	
	ОткрытьФормуМодально("Справочник.Услуги.Форма.КлассификаторУслуг");
	Элементы.УслугиСписок.Обновить();

КонецПроцедуры


&НаКлиенте
Процедура ЛьготаПодобрать(Команда)
	
	ОткрытьФормуМодально("Справочник.Льготы.Форма.КлассификаторЛьгот");
	Элементы.Льготы.Обновить();

КонецПроцедуры


&НаКлиенте
Процедура Декорация8Нажатие(Элемент)
	
	Организация = УстановитьОрганизациюНаСервере();
	
	Если Организация <> Неопределено Тогда
		ПараметрыОткрытия = Новый Структура("Ключ",Организация);
		ОткрытьФорму("Справочник.Организации.Форма.ФормаЭлемента" ,ПараметрыОткрытия);
	Иначе
		ОткрытьФорму("Справочник.Организации.ФормаСписка");
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция  УстановитьОрганизациюНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации";
	Организации =  Запрос.Выполнить().Выгрузить();			
	
	Если Организации.Количество() = 1 Тогда
		 Возврат Организации[0].Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
			  
КонецФункции //

&НаКлиенте
Процедура Декорация10Нажатие(Элемент)
	
	Элементы.ОпцияСДПТФлаг.ТекущаяСтраница = Элементы.ОпцияСДПТФлаг.ПодчиненныеЭлементы.СДПТФлагНет;
	ОбновитьЗначениеКонстант(Ложь);
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация11Нажатие(Элемент)
	Элементы.ОпцияСДПТФлаг.ТекущаяСтраница = Элементы.ОпцияСДПТФлаг.ПодчиненныеЭлементы.СДПТФлагДА;
	ОбновитьЗначениеКонстант(Истина);
	ОбновитьИнтерфейс();

КонецПроцедуры

Процедура ОбновитьЗначениеКонстант(Значение);
	НаборКонстант.УслугиСДПТПодробно = Значение;
	Константы.УслугиСДПТПодробно.Установить(Значение);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация12Нажатие(Элемент)
	
	ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.ФормаОбъекта", 
						Новый Структура("Ключ", РаботаСПочтовымиСообщениями.ПолучитьСистемнуюУчетнуюЗапись()));

КонецПроцедуры

&НаКлиенте
Процедура Декорация16Нажатие(Элемент)
	
	Элементы.ОпцияГородФлаг.ТекущаяСтраница = Элементы.ОпцияГородФлаг.ПодчиненныеЭлементы.ОпцияГородДА;
	Элементы.ОпцияПоселок.ТекущаяСтраница = Элементы.ОпцияПоселок.ПодчиненныеЭлементы.ПоселокНет;
	НаборКонстант.ИспользоватьВариантГород = Истина;
	НаборКонстант.ИспользоватьВариантКоттеджныйПоселок = Ложь;
	Модифицированность = Истина;
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация15Нажатие(Элемент)
	Элементы.ОпцияГородФлаг.ТекущаяСтраница = Элементы.ОпцияГородФлаг.ПодчиненныеЭлементы.ОпцияГородНЕТ;
	НаборКонстант.ИспользоватьВариантГород = Ложь;
	Модифицированность = Истина;
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ОпцияГород.Видимость = Константы.ЗадействоватьОпциюГород.Получить();
	
	Если НаборКонстант.ИспользоватьВариантКоттеджныйПоселок = Истина Тогда
		Элементы.ОпцияПоселок.ТекущаяСтраница = Элементы.ОпцияПоселок.ПодчиненныеЭлементы.ПоселокДА;
	Иначе
		Элементы.ОпцияПоселок.ТекущаяСтраница = Элементы.ОпцияПоселок.ПодчиненныеЭлементы.ПоселокНет;
	КонецЕсли;
	
	Если НаборКонстант.УслугиСДПТПодробно = Истина тогда
		Элементы.ОпцияСДПТФлаг.ТекущаяСтраница = Элементы.ОпцияСДПТФлаг.ПодчиненныеЭлементы.СДПТФлагДА;
	Иначе
		Элементы.ОпцияСДПТФлаг.ТекущаяСтраница = Элементы.ОпцияСДПТФлаг.ПодчиненныеЭлементы.СДПТФлагНЕТ;
	КонецЕсли;
	
	Если НаборКонстант.ИспользоватьВариантГород = Истина Тогда
		Элементы.ОпцияГородФлаг.ТекущаяСтраница  = Элементы.ОпцияГородФлаг.ПодчиненныеЭлементы.ОпцияГородДА;
	Иначе
		Элементы.ОпцияГородФлаг.ТекущаяСтраница  = Элементы.ОпцияГородФлаг.ПодчиненныеЭлементы.ОпцияГородНЕТ;
    КонецЕсли;
		
	
КонецПроцедуры
