
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидОперации") Тогда
		Если Параметры.ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.УстановкаПрибораУчета Тогда	
			
			ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Действует", Ложь, Истина);
			
			Если Параметры.Свойство("Услуга") Тогда
				
				ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Услуга", Параметры.Услуга, Истина);
			
			КонецЕсли;
			
		ИначеЕсли Параметры.ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.ОтключениеПрибораУчета Тогда
			
			Если Параметры.Свойство("ОбъектУстановки") Тогда
				
				ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет", Параметры.ОбъектУстановки, Истина);
				ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Действует", Истина, Истина);
				
			КонецЕсли;
			
		ИначеЕсли Параметры.ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.ОтключениеНаПоверку Тогда
			
			Если Параметры.Свойство("ОбъектУстановки") Тогда
				
				ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет", Параметры.ОбъектУстановки, Истина);
				ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Действует", Истина, Истина);
				
			КонецЕсли;
			
		ИначеЕсли Параметры.ВидОперации = Перечисления.ВидыОперацийУправленияПриборамиУчета.ВключениеПослеПоверки Тогда
			
			Если Параметры.Свойство("ОбъектУстановки") Тогда
				
				ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет", Параметры.ОбъектУстановки, Истина);
				ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Действует", Ложь, Истина);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
