
&НаКлиенте
Процедура ОтборЗданиеПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Здание", ОтборЗдание, ЗначениеЗаполнено(ОтборЗдание));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Здание", ОтборЗдание, ЗначениеЗаполнено(ОтборЗдание));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Подъезд", ОтборПодъезд, ЗначениеЗаполнено(ОтборПодъезд));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ОтветственныйВладелец", ОтборОтветственныйВладелец, ЗначениеЗаполнено(ОтборОтветственныйВладелец));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодъездПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Подъезд", ОтборПодъезд, ЗначениеЗаполнено(ОтборПодъезд));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветсвенныйВладелецПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ОтветственныйВладелец", ОтборОтветственныйВладелец, ЗначениеЗаполнено(ОтборОтветственныйВладелец));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборОрганизация") Тогда
		ОтборОрганизация = Параметры.ОтборОрганизация;
		Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
			Элементы.ОтборОрганизация.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("ОтборЗдание") Тогда
		ОтборЗдание = Параметры.ОтборЗдание;
		Если ЗначениеЗаполнено(ОтборЗдание) Тогда
			Элементы.ОтборЗдание.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("ОтборПодъезд") Тогда
		ОтборПодъезд = Параметры.ОтборПодъезд;
		Если ЗначениеЗаполнено(ОтборПодъезд) Тогда
			Элементы.ОтборПодъезд.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборЛицевойСчет") Тогда
		Если ЗначениеЗаполнено(Параметры.ОтборЛицевойСчет) Тогда
			ОтборЗдание = Параметры.ОтборЛицевойСчет.Владелец;
		КонецЕсли;
	КонецЕсли;
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры
