///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ, ВЫЗЫВАЕМЫЕ ПРИ ОБНОВЛЕНИИ ИНФОРМАЦИОННОЙ БАЗЫ.
Процедура ЗаполнитьПредопределенныеУслуги() Экспорт
	
	УслугаОбъект = Справочники.Услуги.ПениШтрафы.ПолучитьОбъект();
	
	УслугаОбъект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("383");
	УслугаОбъект.ВидУслуги = Справочники.ВидыУслуг.ПениШтрафы;
	УслугаОбъект.ПолноеНаименование = УслугаОбъект.Наименование;
	УслугаОбъект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ФиксированноеНачисление;
	
	Попытка
		УслугаОбъект.Записать();
	Исключение
	КонецПопытки;
		
	
	УслугаОбъект = Справочники.Услуги.ДолгиПрошлыхПериодов.ПолучитьОбъект();
	
	УслугаОбъект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("383");
	УслугаОбъект.ПолноеНаименование = УслугаОбъект.Наименование;
	УслугаОбъект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ФиксированноеНачисление;
	
	Попытка
		УслугаОбъект.Записать();
	Исключение
	КонецПопытки;
	
	УслугаОбъект = Справочники.Услуги.РеструктуризацияДолга.ПолучитьОбъект();
	
	УслугаОбъект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("383");
	УслугаОбъект.ПолноеНаименование = УслугаОбъект.Наименование;
	УслугаОбъект.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ФиксированноеНачисление;
	
	Попытка
		УслугаОбъект.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры
