
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоКоличествуЖильцов Тогда
		
		ПроверяемыеРеквизиты.Добавить("ВидПотребителяУслуг");
		
	ИначеЕсли СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоПлощади Тогда
		
		ПроверяемыеРеквизиты.Добавить("ВидПлощади");
		
	ИначеЕсли СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоНормамПотребления Тогда
		
		ПроверяемыеРеквизиты.Добавить("НормаПотребления");
		
	ИначеЕсли СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоРасчетнымЗначениям Тогда
		
		ПроверяемыеРеквизиты.Добавить("БазаРаспределенияРасчетнойУслуги");
		
	ИначеЕсли СпособНачисления = Перечисления.СпособыНачисленияУслуг.ПоКоличествуМашиноМест Тогда
		
		ПроверяемыеРеквизиты.Добавить("ВидМашиноМеста");

	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	Префикс = "Р";	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	//Составные услуги только для услуг, расчитываемых по приборам учета
	Если СпособНачисления <> Перечисления.СпособыНачисленияУслуг.ПоПоказаниямПрибораУчета
		И СпособНачисления <> Перечисления.СпособыНачисленияУслуг.ПоРасчетнымЗначениям Тогда
				
		СоставныеУслуги.Очистить();
		ПоказаниеПрибораУчетаДляЛьготы = 0;
		
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	МАКСИМУМ(ЕСТЬNULL(Услуги.ПолеСортировки, 0)) КАК ПолеСортировки
			|ИЗ
			|	Справочник.Услуги КАК Услуги
			|ГДЕ
			|	НЕ Услуги.ЭтоГруппа
			|	И Услуги.ВидУслуги = &ВидУслуги";
			
		Запрос.УстановитьПараметр("ВидУслуги", ВидУслуги);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезультатЗапроса.Следующий() Тогда
			
			Попытка
				ПолеСортировки = РезультатЗапроса.ПолеСортировки + 1;	
			Исключение
			КонецПопытки;
			
		КонецЕсли; 
		
		Идентификатор = ОСМДСервер.СгенерироватьИдентификатор();
		
	КонецЕсли; 
	
	Если НЕ ПороговыйМетод Тогда
		
		КоличествоПорогов = 0;
	
	КонецЕсли; 
	
КонецПроцедуры

