
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РасположениеСервераПриИзменении(Элементы.РасположениеСервера);
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	Если АдресСервера <> "" Тогда
		Попытка
			СЛК.СохранитьПараметрыСвязи(АдресСервера, ПортСервера);
			СЛК.Старт();
			
			Закрыть();
			
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	Иначе 
		ТекущийЭлемент = Элементы.АдресСервера;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоКлиентСервернаяБаза = Не Найти(ВРег(СтрокаСоединенияИнформационнойБазы()), "FILE=");
	
	Стр = "Локально, на комьютере " + ИмяКомпьютера() + ? (ЭтоКлиентСервернаяБаза, ", где работает сервер приложений", ", где запущено клиентское приложение");
	
	Элементы.РасположениеСервера.СписокВыбора.Добавить(0, Стр);
	Элементы.РасположениеСервера.СписокВыбора.Добавить(1, "На другом компьютере сети");
	
	ПараметрыСвязи = СЛК.ПолучитьПараметрыСвязи();
	АдресСервера = ПараметрыСвязи.АдресСервера;
	ПортСервера = ПараметрыСвязи.ПортСервера;
	
	РасположениеСервера = ?(ПараметрыСвязи.АдресСервера = "localhost", 0, 1);
КонецПроцедуры

&НаКлиенте
Процедура РасположениеСервераПриИзменении(Элемент)
	АдресСервера = ?(РасположениеСервера = 0, "localhost", ?(АдресСервера = "localhost", "", АдресСервера));
	ПортСервера = ?(РасположениеСервера = 0, "", ?(ПортСервера = "", "9099", ПортСервера));
	
	Элементы.АдресСервера.Доступность = РасположениеСервера > 0;
	Элементы.ПортСервера.Доступность = РасположениеСервера > 0;
	
	ТекущийЭлемент = Элементы.АдресСервера;
КонецПроцедуры
