////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обновление версии ИБ"
// Клиентские процедуры и функции интерактивного обновления информационной базы.
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Проверить, есть ли необходимость выполнять обновление информационной базы, и
// если необходимо - выполняется обновление.
// Если обновление не удалось выполнить, то процедура предлагает завершить работу системы.
//
Процедура ВыполнитьОбновлениеИнформационнойБазы() Экспорт
	
	Если НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().НеобходимоОбновлениеИнформационнойБазы Тогда
		Возврат;
	КонецЕсли;
	
	Состояние(НСтр("ru='Пожалуйста, подождите, выполняется обновление информационной базы...';uk=' Будь ласка, почекайте, виконується відновлення інформаційної бази...'"));
	ДокументОписаниеОбновлений = Неопределено;
	
	Попытка
		ВыполненныеОбработчикиОбновления = ОбновлениеИнформационнойБазы.ВыполнитьОбновлениеИнформационнойБазы();
	Исключение
		ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='При обновлении информационной базы возникла ошибка:"
""
"%1"
""
"Подробности см. в Журнале регистрации.';uk=' При відновленні інформаційної бази виникла помилка:  %1  Подробиці див. у Журналі реєстрації.'"), 
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение ТекстСообщенияОбОшибке;
	КонецПопытки;
	
	Состояние(НСтр("ru='Обновление информационной базы выполнено успешно.';uk='Відновлення інформаційної бази виконане успішно.'"));
		
	Если ВыполненныеОбработчикиОбновления <> Неопределено Тогда	
		ОбновитьИнтерфейс();
	КонецЕсли;
	
	Если ВыполненныеОбработчикиОбновления <> "" Тогда	
		ОткрытьФорму("ОбщаяФорма.ОписаниеИзмененийСистемы", 
			Новый Структура("ВыполненныеОбработчикиОбновления", ВыполненныеОбработчикиОбновления));
	КонецЕсли;
	
КонецПроцедуры

// Если есть непоказанные описания изменения и у пользователя не отключен
// показ - открыть форму ОписаниеИзмененийСистемы.
//
Процедура ПоказатьОписаниеИзмененийСистемы() Экспорт
	
	Если НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента();
	Если НЕ ПараметрыРаботыКлиента.Свойство("ПоказатьОписаниеИзмененийСистемы")
		ИЛИ НЕ ПараметрыРаботыКлиента.ПоказатьОписаниеИзмененийСистемы Тогда
		
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ОписаниеИзмененийСистемы"); 
	
КонецПроцедуры

// Проверить, возможно ли выполнять обновление информационной базы.
//
Функция ВозможноВыполнитьОбновлениеИнформационнойБазы() Экспорт
	
	Результат = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ИнформационнаяБазаЗаблокированаДляОбновления;
	Если Результат Тогда
		Сообщение = НСтр("ru='Информационная база заблокирована в связи с обновлением версии конфигурации. Работа программы будет завершена."
"Обратитесь к системному администратору за подробностями.';uk=""Інформаційна база заблокована у зв'язку з відновленням версії конфігурації. Робота програми буде завершена.  Звернетеся до системного адміністратора за подробицями.""");
		Предупреждение(Сообщение);
	КонецЕсли;
	
	Возврат НЕ Результат;
	
КонецФункции
