
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаБухгалтерскаяСправкаПоЗатратам, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец КАК Здание,
		|	РасчетыПоЛицевымСчетам.Услуга КАК Услуга,
		|	СУММА(РасчетыПоЛицевымСчетам.Сумма) КАК Сумма
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		|ГДЕ
		|	РасчетыПоЛицевымСчетам.Период >= &ДатаНач
		|	И РасчетыПоЛицевымСчетам.Период <= &ДатаКон
		|	И РасчетыПоЛицевымСчетам.МесяцНачисления = &ДатаНач
		|	И РасчетыПоЛицевымСчетам.Организация = &Организация
		|	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И (РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
		|			ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РазовоеНачисление))
		|	И НЕ РасчетыПоЛицевымСчетам.Услуга.НеВключатьВРаспределение
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец,
		|	РасчетыПоЛицевымСчетам.Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Ссылка.Дата КАК Период,
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Затрата КАК СтатьяЗатрат,
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Здание,
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Услуга,
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Сумма
		|ИЗ
		|	Документ.БухгалтерскаяСправкаПоЗатратам.СтатьиЗатрат КАК БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат
		|ГДЕ
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Ссылка = &Ссылка
		|	И БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Здание <> ЗНАЧЕНИЕ(Справочник.ЗданияИСооружения.ПустаяСсылка)
		|	И БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Ссылка.Дата КАК Период,
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Затрата КАК СтатьяЗатрат,
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Здание,
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Услуга,
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Сумма
		|ИЗ
		|	Документ.БухгалтерскаяСправкаПоЗатратам.СтатьиЗатрат КАК БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат
		|ГДЕ
		|	БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Ссылка = &Ссылка
		|	И (БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Здание = ЗНАЧЕНИЕ(Справочник.ЗданияИСооружения.ПустаяСсылка)
		|			ИЛИ БухгалтерскаяСправкаПоЗатратамСтатьиЗатрат.Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка))";
		
		
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ДокументСсылкаБухгалтерскаяСправкаПоЗатратам.Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ДокументСсылкаБухгалтерскаяСправкаПоЗатратам.Дата));
	Запрос.УстановитьПараметр("Организация", ДокументСсылкаБухгалтерскаяСправкаПоЗатратам.Организация);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаБухгалтерскаяСправкаПоЗатратам);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаНачислений = РезультатЗапроса[0].Выгрузить();
	ТаблицаПрямыхЗатрат = РезультатЗапроса[1].Выгрузить();
	ТаблицаЗатратДляРаспределения = РезультатЗапроса[2].Выгрузить();
	
	Для каждого СтрокаЗатрат Из ТаблицаЗатратДляРаспределения Цикл
		Если ЗначениеЗаполнено(СтрокаЗатрат.Здание) И НЕ ЗначениеЗаполнено(СтрокаЗатрат.Услуга) Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Здание", СтрокаЗатрат.Здание); 
			ТаблицаТМП = ТаблицаНачислений.Скопировать(Отбор);
		
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаЗатрат.Здание) И ЗначениеЗаполнено(СтрокаЗатрат.Услуга) Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Услуга", СтрокаЗатрат.Услуга); 
			ТаблицаТМП = ТаблицаНачислений.Скопировать(Отбор);
			
		Иначе
			ТаблицаТМП = ТаблицаНачислений.Скопировать();
			
		КонецЕсли; 
		
		ИтогБаза = ТаблицаТМП.Итог("Сумма");
		ОстатокРаспределения = СтрокаЗатрат.Сумма;
		
		Если ИтогБаза = 0 Тогда
			НоваяСтрока = ТаблицаПрямыхЗатрат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗатрат); 
		Иначе	
			Для каждого СтрокаТМП Из ТаблицаТМП Цикл
				
				Сумма = Окр(СтрокаЗатрат.Сумма * (СтрокаТМП.Сумма / ИтогБаза ), 2);
				Если Сумма = 0 Тогда
					Продолжить;
				КонецЕсли; 
				
				НоваяСтрока = ТаблицаПрямыхЗатрат.Добавить();
				НоваяСтрока.Период = СтрокаЗатрат.Период;
				НоваяСтрока.СтатьяЗатрат = СтрокаЗатрат.СтатьяЗатрат;
				НоваяСтрока.Здание = СтрокаТМП.Здание;
				НоваяСтрока.Услуга = СтрокаТМП.Услуга;
				НоваяСтрока.Сумма = Сумма;
				
				ОстатокРаспределения = ОстатокРаспределения - НоваяСтрока.Сумма;
				
			КонецЦикла; 
			НоваяСтрока.Сумма = НоваяСтрока.Сумма + ОстатокРаспределения;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСтатьиЗатрат", ТаблицаПрямыхЗатрат);

КонецПроцедуры

// Выполняет контроль закрытия месяца.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаБухгалтерскаяСправкаПоЗатратам, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗданияИСооружения.Ссылка КАК Здание,
		|	ДатыЗапретаИзменения.ДатаЗапрета
		|ИЗ
		|	Справочник.ЗданияИСооружения КАК ЗданияИСооружения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
		|		ПО ЗданияИСооружения.Ссылка = ДатыЗапретаИзменения.Объект
		|ГДЕ
		|	ЗданияИСооружения.Организация = &Организация
		|	И ДатыЗапретаИзменения.ДатаЗапрета < &ДатаЗапрета";
		
	Запрос.УстановитьПараметр("Организация", ДокументСсылкаБухгалтерскаяСправкаПоЗатратам.Организация);
	Запрос.УстановитьПараметр("ДатаЗапрета", НачалоМесяца(ДокументСсылкаБухгалтерскаяСправкаПоЗатратам.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ДокументОбъектБухгалтерскаяСправкаПоЗатратам = ДокументСсылкаБухгалтерскаяСправкаПоЗатратам.ПолучитьОбъект();
		
		ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
		ОСМДСервер.СообщитьОбОшибкахПроведенияПоРегиструСтатьиЗатратСписком(ДокументОбъектБухгалтерскаяСправкаПоЗатратам, ВыборкаИзРезультатаЗапроса, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры
