////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.БухгалтерскаяСправкаПоЗатратам.ВыполнитьКонтроль(Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли; 
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.БухгалтерскаяСправкаПоЗатратам.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ПроведениеСервер.ОтразитьСтатьиЗатрат(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	
КонецПроцедуры


// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = СтатьиЗатрат.Итог("Сумма");
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого СтрокаСтатьиЗатрат Из СтатьиЗатрат Цикл
	
		Если СтрокаСтатьиЗатрат.Услуга.НеВключатьВРаспределение
		И НЕ ЗначениеЗаполнено(СтрокаСтатьиЗатрат.Здание) Тогда
		
			Поле = "СтатьиЗатрат[" + (СтрокаСтатьиЗатрат.НомерСтроки - 1) + "].Здание";
			ТекстСообщения = НСтр("ru='Не заполнен реквизит Здание.';uk='Не заповнен реквізит Будинок.'");
			
			ОСМДСервер.СообщитьОбОшибке(ТекстСообщения, ЭтотОбъект, Отказ, Поле);
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры
