
&НаКлиенте
Процедура ФайлЕксельНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок                   = "Виберіть файл";
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
	    ФайлЕксель = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Путь = ФайлЕксель;
	Если НЕ ЗначениеЗаполнено(ФайлЕксель) Тогда
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
	КонецЕсли;
	Если тзДанные.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	тзДанные.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.ActiveSheet.UsedRange.Rows.Count();//Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик = 2 По КоличествоСтрок Цикл
		НоваяСтрока                  = тзДанные.Добавить();
		НоваяСтрока.ЛицевойСчет      = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.ПриборУчета      = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.Показания        = Excel.Cells(Счетчик, 3).Value;
	КонецЦикла;
	Excel.Workbooks.Close();
	Excel.Quit();
КонецПроцедуры

&НаСервере
Процедура СоздатьАктНаСервере()
	Для Каждого стр Из тзДанные Цикл
		ЛС                            = НайтиЛицевойСчет(СтрЗаменить(Строка(стр.ЛицевойСчет), Символы.НПП, ""));
		Прибор                        = НайтиПриборУчета(СтрЗаменить(Строка(стр.ПриборУчета), Символы.НПП, ""));
		ДанныеПоСчетчику              = РасчетУслугПоТЕиГВ.ПолучитьПоказанияПрибораУчетаПоТЕ(Прибор, КонецМесяца(ДатаПоказаний));
		Акт                           = Документы.АктСнятияПоказанийТеплосчетчика.СоздатьДокумент();
		Акт.Дата                      = КонецМесяца(ДатаПоказаний);
		Акт.ПериодНачисления          = НачалоМесяца(ДатаПоказаний);
		Акт.Организация               = Справочники.Организации.НайтиПоКоду("000000001");
		Акт.ЛицевойСчет               = ЛС;
		Акт.Здание                    = ЛС.Владелец;
		НовСтрока                     = Акт.ПоказанияПриборов.Добавить();
		НовСтрока.ПриборУчета         = Прибор;
		НовСтрока.ВидТарифа           = Перечисления.ВидыТарифов.Общий;
		НовСтрока.ЕдиницаИзмерения    = Прибор.ЕдиницаИзмерения;
		НовСтрока.Коэффициент         = Прибор.Коэффициент;
		НовСтрока.ПоказаниеТекущее    = стр.Показания;
	    Если ДанныеПоСчетчику.Количество() <> 0 Тогда
			Если ДанныеПоСчетчику.ПоказаниеПредыдущее = Неопределено Тогда
				НовСтрока.ПоказаниеПредыдущее = 0;
			Иначе
				НовСтрока.ПоказаниеПредыдущее = ДанныеПоСчетчику.ПоказаниеПредыдущее;
			КонецЕсли;
		КонецЕсли;
		НовСтрока.РазницаПоказания    = стр.Показания - НовСтрока.ПоказаниеПредыдущее;
		Попытка
			Акт.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			Акт.Записать();
			Сообщить("Не вдалося провести документ № " + Акт.Номер);
		КонецПопытки;
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАкт(Команда)
	СоздатьАктНаСервере();
КонецПроцедуры

&НаСервере
Функция НайтиЛицевойСчет(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, ЛицевойСчет.Наименование = &ЛицевойСчет И Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛС = Выборка.ЛицевойСчет;
	КонецЦикла;
	Возврат ЛС;
КонецФункции

&НаСервере
Функция НайтиПриборУчета(ПриборУчетаПоказаний)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета
	    |ИЗ
	    |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
	    |			&НаДату,
	    |			ПриборУчета.ЗаводскойНомер = &ЗаводскойНомер
	    |				И Действует = ИСТИНА) КАК УстановленныеПриборыУчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("ЗаводскойНомер", ПриборУчетаПоказаний);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПУ = Выборка.ПриборУчета;
	КонецЦикла;
	Возврат ПУ;
КонецФункции