////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	РасчетПоказанийПриборовУчета.НомерСтроки КАК НомерСтроки,
	|	РасчетПоказанийПриборовУчета.ОбъектУстановки КАК ОбъектУстановки,
	|	РасчетПоказанийПриборовУчета.ПриборУчета КАК ПриборУчета,
	|	РасчетПоказанийПриборовУчета.Услуга КАК Услуга,
	|	РасчетПоказанийПриборовУчета.ВидТарифа КАК ВидТарифа,
	|	РасчетПоказанийПриборовУчета.Значение КАК ЗначениеПередЗаписью,
	|	РасчетПоказанийПриборовУчета.Значение КАК ЗначениеИзменение,
	|	РасчетПоказанийПриборовУчета.Значение КАК ЗначениеПриЗаписи
	|ПОМЕСТИТЬ ДвиженияРасчетПоказанийПриборовУчетаИзменение
	|ИЗ
	|	РегистрНакопления.РасчетПоказанийПриборовУчета КАК РасчетПоказанийПриборовУчета");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияРасчетПоказанийПриборовУчетаИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()
