////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИнформационныйЛистДляГолосования") Тогда
		// Заполнение шапки
		ВопросГолосования = ДанныеЗаполнения.ВопросГолосования;
		Здание = ДанныеЗаполнения.Здание;
		Комментарий = ДанныеЗаполнения.Комментарий;
		НеобходимоГолосовЗА = ДанныеЗаполнения.НеобходимоГолосовЗА;
		Организация = ДанныеЗаполнения.Организация;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		КоличествоУчасниковГолосованияПлан = ДанныеЗаполнения.УчастникиГолосования.Количество();
		Для Каждого ТекСтрокаУчастникиГолосования Из ДанныеЗаполнения.УчастникиГолосования Цикл
			НоваяСтрока = РезультатыГолосования.Добавить();
			НоваяСтрока.ЛицевойСчет = ТекСтрокаУчастникиГолосования.ЛицевойСчет;
			НоваяСтрока.ОтветственныйВладелец = ТекСтрокаУчастникиГолосования.ОтветственныйВладелец;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
