////////////////////////////////////////////////////////////////////////////////
// Подсистема "Пользователи".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// Для работы интерфейса ролей в управляемой форме

// Предлагает создать администратора или завершить работу.
Процедура СоздатьАдминистратораИлиЗавершитьРаботу() Экспорт
	
	ТекстВопроса =
		НСтр("ru='Запуск с пустым списком пользователей информационной базы невозможен."
"Добавить пользователя Администратор и перезапустить программу?"
""
"Пояснение: также можно завершить работу и вручную добавить в список"
"пользователей информационной базы учетную запись администратора с двумя ролями"
"""Администратор системы"", ""Полные права"" и повторить запуск программы от его имени."
""
"Так же будет добавлен служебный пользователь ""countmob"" для использования мобильного приложения."
""
"Для перехода к списку пользователей информационной базы необходимо открыть"
"Конфигуратор и воспользоваться пунктом меню ""Администрирование - Пользователи"".';uk='Запуск з порожнім списком користувачів інформаційної бази неможливий."
"Додати користувача Адміністратор і перезапустити програму?"
""
"Так само буде доданий службовий користувач "" countmob"" для використання мобільного застосування."
""
"Пояснення: також можна завершити роботу і вручну додати до списку"
"користувачів інформаційної бази обліковий запис адміністратора з двома ролями"
"""Адміністратор системи"", ""Повні права"" і повторити запуск програми від його імені."
""
"Для переходу до списку користувачів інформаційної бази необхідно відкрити"
"Конфігуратор і скористатися пунктом меню ""Адміністрування - Користувачі"".'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("СоздатьИПерезапустить", НСтр("ru='Добавить и перезапустить';uk='Додати і перезапустити'"));
	Кнопки.Добавить("ЗавершитьРаботу",       НСтр("ru='Завершить работу';uk='Завершити роботу'"));
	
	Ответ = Вопрос(
		ТекстВопроса,
		Кнопки,
		,
		"СоздатьИПерезапустить",
		НСтр("ru='Авторизация пользователя';uk='Авторизація користувача'") );
		
	Если Ответ = "СоздатьИПерезапустить" Тогда
		ПользователиСлужебныйВызовСервера.СоздатьПервогоАдминистратораСистемы();
		
		ПрекратитьРаботуСистемы(Истина);
	КонецЕсли;
	
КонецПроцедуры

