
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если СтандартныеПодсистемыВызовСервераПереопределяемый.ПараметрыРаботыКлиента().ИнформационнаяБазаФайловая Тогда
		Элементы.ПутьКАрхивуWindows.Заголовок = НСтр("ru='Для сервера 1С:Предприятия под управлением Microsoft Windows';uk=' Для сервера 1С:Підприємства під керуванням Microsoft Windows'"); 
	Иначе
		Элементы.ПутьКАрхивуWindows.КнопкаВыбора = Ложь; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Разместить(Команда)
	
	ОчиститьСообщения();
	
	Если ПустаяСтрока(ПутьКАрхивуWindows) И ПустаяСтрока(ПутьКАрхивуLinux) Тогда
		Текст = НСтр("ru='Укажите полное имя архива с файлами начального образа (файл *.zip)';uk=""Укажіть повне ім'я архіву з файлами початкового образа (файл *.zip)""");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "ПутьКАрхивуWindows");
		Возврат;
	КонецЕсли;
	
	Если НЕ СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ИнформационнаяБазаФайловая Тогда
	
		Если Не ПустаяСтрока(ПутьКАрхивуWindows) И (Лев(ПутьКАрхивуWindows, 2) <> "\\" ИЛИ Найти(ПутьКАрхивуWindows, ":") <> 0) Тогда
			ТекстОшибки = НСтр("ru='Путь к архиву с файлами начального образа должен быть в формате UNC (\\servername\resource) ';uk='Шлях до архіву з файлами початкового образа повинен бути у форматі UNC (\\servername\resource) '");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "ПутьКАрхивуWindows");
			Возврат;
		КонецЕсли;
	
	КонецЕсли;
	
	Состояние(НСтр("ru='Обмен данными';uk='Обмін даними'"), ,
				НСтр("ru='Осуществляется размещение файлов из архива с файлами начального образа...';uk='Здійснюється розміщення файлів з архіву з файлами початкового образа...'"),
				БиблиотекаКартинок.СоздатьНачальныйОбраз);
	
	ОбменФайламиВызовСервера.ДобавитьФайлыВТома(ПутьКАрхивуWindows, ПутьКАрхивуLinux);
	
	Предупреждение(НСтр("ru='Размещение файлов из архива с файлами начального образа успешно завершено';uk='Розміщення файлів з архіву з файлами початкового образа успішно завершене'"));
	
КонецПроцедуры


&НаКлиенте
Процедура ПутьКАрхивуWindowsНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
		Предупреждение(НСтр("ru='Для данной операции необходимо установить расширение работы с файлами.';uk=' Для даної операції необхідно встановити розширення роботи з файлами.'"));
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Диалог.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Диалог.ПолноеИмяФайла				= ?(ЭтаФорма.ПутьКАрхивуWindows = "", "files.zip", ЭтаФорма.ПутьКАрхивуWindows);
	Диалог.МножественныйВыбор			= Ложь;
	Диалог.ПредварительныйПросмотр		= Ложь;
	Диалог.ПроверятьСуществованиеФайла	= Истина;
	Диалог.Фильтр						= "Архивы zip(*.zip)|*.zip";
	
	Если Диалог.Выбрать() Тогда
		
		ЭтаФорма.ПутьКАрхивуWindows = Диалог.ПолноеИмяФайла;
		
	КонецЕсли;
	
КонецПроцедуры

