// Возвращает список процедур-обработчиков обновления ИБ для всех поддерживаемых версий ИБ.
//
// Пример добавления процедуры-обработчика в список:
//    Обработчик = Обработчики.Добавить();
//    Обработчик.Версия = "1.0.0.0";
//    Обработчик.Процедура = "ОбновлениеИБ.ПерейтиНаВерсию_1_0_0_0";
//
// Вызывается перед началом обновления данных ИБ.
//
Функция ОбработчикиОбновления() Экспорт
	
	Обработчики = ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления();
	
	// Подключаются процедуры-обработчики обновления конфигурации

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ВариантыОтчетов.ОбработкаПредопределенныхВариантов";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.ПервыйЗапуск";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.3";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_1_3";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.5";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_1_5";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.6";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_1_6";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.8";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_1_8";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.2.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_2_1";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.2.2";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_2_2";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.2.3";
	Обработчик.Процедура = "Справочники.Услуги.ЗаполнитьПредопределенныеУслуги";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.2.4";
	Обработчик.Процедура = "УправлениеКонтактнойИнформациейПереопределяемый.КонтактнаяИнформацияОбновлениеИБ";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.2.5";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_2_5";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.2.6";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_2_6";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.2.7";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_2_7";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.3.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_3_1";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.4.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_4_1";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.5.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_5_1";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.5.2";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_5_2";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.5.3";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_5_3";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.5.4";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_5_4";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.5.5";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_5_5";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.5.6";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_5_6";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.5.7";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_5_7";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.5.8";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_5_8";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.5.9";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_5_9";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.6.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_6_1";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.6.2";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_6_2";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.6.3";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_6_3";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.6.4";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_6_4";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.7.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_7_1";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.7.2";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_7_2";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.8.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_8_1";

	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.9.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_9_1";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.9.2";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыОСМД.Релиз1_0_9_2";
	
	Возврат Обработчики;
	
КонецФункции

// Процедура заполняет пустую ИБ.
//
Процедура ПервыйЗапуск() Экспорт

	Справочники.Валюты.ЗаполнитьВалютыПоУмолчанию();
	Справочники.КлассификаторЕдиницИзмерения.ЗаполнитьЕдиницыИзмеренияПоУмолчанию();
	ЗаполнитьКонстантыПоУмолчанию();
	Справочники.ВидыУслуг.ЗаполнитьПредопределенныеВидыУслуг();
	ВерсионированиеОбъектов.ОбновитьНастройкиВерсионированияОбъектов();
	УстановитьПервуюОрганизацию();
	ОбновитьДополнительныеОбработки();
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ОбновлениеИБ", "ПервоначальноеЗаполнениеИБ", Истина);
	
КонецПроцедуры

// Процедура заполняет константы значением по умочанию.
//
Процедура ЗаполнитьКонстантыПоУмолчанию()
	
	Константы.УслугиСДПТПодробно.Установить(Истина);
	Константы.КонтролироватьОстаткиПриПроведении.Установить(Истина);
	
	ВалютаУчета = Справочники.Валюты.НайтиПоКоду("980");
	Константы.ВалютаУчета.Установить(ВалютаУчета);
	
КонецПроцедуры // ЗаполнитьКонстантыПоУмолчанию()

// Формирует код и наименование узла этой ИБ
//
//
// Параметры:
// нет
//  
// Возвращаемое значение:
// Нет
//
Процедура УстановитьКодНаименованиеУзлаЭтойИБ()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЭтотУзел = ПланыОбмена.ОбменУчетВОСМДБухгалтерия.ЭтотУзел();
	ЭтотУзелОбъект = ЭтотУзел.ПолучитьОбъект();
	
	ЕстьИзменения = Ложь;
	
	Если ПустаяСтрока(ЭтотУзелОбъект.Код) Тогда
		ЭтотУзелОбъект.УстановитьНовыйКод();
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	Если ПустаяСтрока(ЭтотУзелОбъект.Наименование) Тогда
		ЭтотУзелОбъект.Наименование = НСтр("ru='Эта информационная база';uk='Ця інформаційна база'");
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	Если ЕстьИзменения Тогда
		ЭтотУзелОбъект.Записать();
	КонецЕсли;
	
	/////
	ЭтотУзел = ПланыОбмена.ОбменСМобильнымиУстройствами.ЭтотУзел();
	ЭтотУзелОбъект = ЭтотУзел.ПолучитьОбъект();
	
	ЕстьИзменения = Ложь;
	
	Если ПустаяСтрока(ЭтотУзелОбъект.Код) Тогда
		ЭтотУзелОбъект.Код = "001";
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	Если ПустаяСтрока(ЭтотУзелОбъект.Наименование) Тогда
		ЭтотУзелОбъект.Наименование = НСтр("ru='Центральный узел';uk='Центральний вузол'");
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	Если ЕстьИзменения Тогда
		ЭтотУзелОбъект.Записать();
	КонецЕсли;
		
КонецПроцедуры

Процедура УстановитьПервуюОрганизацию()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|");
	
	Если Не Запрос.Выполнить().Пустой() тогда
		Возврат;
	КонецЕсли;
	
	ЗаписыватьОбъект = Ложь;
	
	СправочникОбъект = Справочники.Организации.СоздатьЭлемент();
	СправочникОбъект.УстановитьНовыйКод();
	СправочникОбъект.Наименование = "Наша Организация";
	СправочникОбъект.НаименованиеПолное = "Наша Организация";
	СправочникОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
	СправочникОбъект.ТипОрганизации = Справочники.ТипыОрганизаций.ОСМД;
	
	Попытка
		СправочникОбъект.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры	

// Процедура обновления резиза 1.0.1.3.
//
Процедура Релиз1_0_1_3() Экспорт

	ВыборкаКвартир = Справочники.ОбъектыЛицевыхСчетов.Выбрать();
	Пока ВыборкаКвартир.Следующий() цикл
		Объект = ВыборкаКвартир.ПолучитьОбъект();
		Если Объект.ЖилойФонд = Перечисления.ЖилойНеЖилойФонд.Жилой тогда
			Объект.Наименование = "кв. №" + Прав("    "+Объект.Код,4) + Объект.Суффикс;
		Иначе
			Объект.Наименование = "оф. №" + Прав("    "+Объект.Код,4) + Объект.Суффикс;
		КонецЕсли;
		
		Попытка
			Объект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Процедура обновления резиза 1.0.1.5.
//
Процедура Релиз1_0_1_5() Экспорт

	ВыборкаПриборыУчета = Справочники.ПриборыУчета.Выбрать();
	Пока ВыборкаПриборыУчета.Следующий() цикл
		Объект = ВыборкаПриборыУчета.ПолучитьОбъект();
		
		Объект.Наименование = Объект.ЗаводскойНомер + "/" + Объект.Услуга.ВидУслуги;
		
		Попытка
			Объект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Процедура обновления резиза 1.0.1.6.
//
Процедура Релиз1_0_1_6() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Услуги.Ссылка КАК Услуга,
		|	Услуги.УДАЛИТЬДополнительнаяУслуга КАК ДополнительнаяУслуга
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|ГДЕ
		|	НЕ Услуги.ЭтоГруппа
		|	И Услуги.УДАЛИТЬДополнительнаяУслуга <> ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)";
		
	РезультатЗапроса = Запрос.Выполнить().Выбрать();		
	
	Пока РезультатЗапроса.Следующий() цикл
		Объект = РезультатЗапроса.Услуга.ПолучитьОбъект();
		
		Объект.СоставныеУслуги.Очистить();
		НоваяСтрока = Объект.СоставныеУслуги.Добавить(); 
		НоваяСтрока.Услуга = РезультатЗапроса.ДополнительнаяУслуга;
		
		Попытка
			Объект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Процедура обновления резиза 1.0.1.8.
//
Процедура Релиз1_0_1_8() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Услуги.Ссылка КАК Услуга
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|ГДЕ
		|	НЕ Услуги.ЭтоГруппа
		|	И Услуги.УДАЛИТЬУсловиеРасчетаЛьготы";
		
	РезультатЗапроса = Запрос.Выполнить().Выбрать();		
	
	Пока РезультатЗапроса.Следующий() цикл
		Объект = РезультатЗапроса.Услуга.ПолучитьОбъект();
		
		Объект.ПоказаниеПрибораУчетаДляЛьготы = 1;
		
		Попытка
			Объект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Процедура обновления резиза 1.0.2.1.
//
Процедура Релиз1_0_2_1() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыУслуг.Ссылка
		|ИЗ
		|	Справочник.ВидыУслуг КАК ВидыУслуг";
		
	РезультатЗапроса = Запрос.Выполнить().Выбрать();		
	
	Пока РезультатЗапроса.Следующий() цикл
		
		Объект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		Объект.КонтрагентДляРасчетаПоЛьготам = Константы.УДАЛИТЬКонтрагентДляРасчетаПоЛьготам.Получить();
		Объект.ДоговорДляРасчетаПоЛьготам = Объект.КонтрагентДляРасчетаПоЛьготам.ДоговорПоУмолчанию;
		Объект.КонтрагентДляРасчетаПоСубсидиям = Константы.УДАЛИТЬКонтрагентДляРасчетаПоСубсидиям.Получить();
		Объект.ДоговорДляРасчетаПоСубсидиям = Объект.КонтрагентДляРасчетаПоСубсидиям.ДоговорПоУмолчанию;
		
		Попытка
			Объект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Процедура обновления резиза 1.0.2.2.
//
Процедура Релиз1_0_2_2() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыУслуг.Ссылка КАК ВидУслуги,
		|	ЕСТЬNULL(ВложенныйЗапрос.Услуга, ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)) КАК Услуга
		|ИЗ
		|	Справочник.ВидыУслуг КАК ВидыУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Услуги.Ссылка КАК Услуга
		|		ИЗ
		|			Справочник.Услуги КАК Услуги
		|		ГДЕ
		|			НЕ Услуги.ЭтоГруппа) КАК ВложенныйЗапрос
		|		ПО ВидыУслуг.Ссылка = ВложенныйЗапрос.Услуга.ВидУслуги
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыУслуг.Код,
		|	ВложенныйЗапрос.Услуга.Код
		|ИТОГИ ПО
		|	ВидУслуги,
		|	Услуга";
		
	ВыборкаВидУслуги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
	
	НомерСортировкиВидУслуги = 0;
	Пока ВыборкаВидУслуги.Следующий() цикл
		НомерСортировкиВидУслуги = НомерСортировкиВидУслуги +1;
		
		Если ЗначениеЗаполнено(ВыборкаВидУслуги.ВидУслуги) Тогда
			ОбъектВидУслуги = ВыборкаВидУслуги.ВидУслуги.ПолучитьОбъект();
			ОбъектВидУслуги.ПолеСортировки = НомерСортировкиВидУслуги;
			Попытка
				ОбъектВидУслуги.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		НомерСортировкиУслуги = 0;
		
		ВыборкаУслуга = ВыборкаВидУслуги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаУслуга.Следующий() Цикл
		
			НомерСортировкиУслуги = НомерСортировкиУслуги +1;
			Если НЕ ЗначениеЗаполнено(ВыборкаУслуга.Услуга) Тогда
				Продолжить;
			КонецЕсли; 
			ОбъектУслуга = ВыборкаУслуга.Услуга.ПолучитьОбъект();
			ОбъектУслуга.ПолеСортировки = НомерСортировкиУслуги;
			Попытка
				ОбъектУслуга.Записать();
			Исключение
			КонецПопытки;
			
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьДополнительныеОбработки()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаОбработок.Расширение КАК Расширение,
	|	ТаблицаОбработок.СтароеИмяФайла КАК СтароеИмяФайла,
	|	ТаблицаОбработок.ИмяМакета КАК ИмяМакета
	|ПОМЕСТИТЬ ТаблицаОбработок
	|ИЗ
	|	&ТаблицаОбработок КАК ТаблицаОбработок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОбработок.Расширение КАК Расширение,
	|	ТаблицаОбработок.ИмяМакета КАК ИмяМакета,
	|	ЕСТЬNULL(НайденПоИмениОбъекта.Ссылка, НайденПоИмениФайла.Ссылка) КАК Ссылка,
	|	ЕСТЬNULL(НайденПоИмениОбъекта.Версия, НайденПоИмениФайла.Версия) КАК Версия
	|ИЗ
	|	ТаблицаОбработок КАК ТаблицаОбработок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки КАК НайденПоИмениФайла
	|		ПО ТаблицаОбработок.СтароеИмяФайла = НайденПоИмениФайла.ИмяФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки КАК НайденПоИмениОбъекта
	|		ПО ТаблицаОбработок.ИмяМакета = НайденПоИмениОбъекта.ИмяОбъекта";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	ТаблицаОбработок = Новый ТаблицаЗначений();
	ТаблицаОбработок.Колонки.Добавить("Расширение",     Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(3, ДопустимаяДлина.Переменная)));
	ТаблицаОбработок.Колонки.Добавить("СтароеИмяФайла", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(260, ДопустимаяДлина.Переменная)));
	ТаблицаОбработок.Колонки.Добавить("ИмяМакета",      Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	
	// Текущее имя файла образовыватся от имени макета и расширения
	СтрокаТаблицы = ТаблицаОбработок.Добавить();
	СтрокаТаблицы.ИмяМакета      = "ВыгрузкаЛьготDBF";
	СтрокаТаблицы.СтароеИмяФайла = "ВыгрузкаЛьготDBF.epf";
	СтрокаТаблицы.Расширение     = "epf";
	
	СтрокаТаблицы = ТаблицаОбработок.Добавить();
	СтрокаТаблицы.ИмяМакета      = "ВыгрузкаНаТСО";
	СтрокаТаблицы.СтароеИмяФайла = "ВыгрузкаНаТСО.epf";
	СтрокаТаблицы.Расширение     = "epf";
	
	СтрокаТаблицы = ТаблицаОбработок.Добавить();
	СтрокаТаблицы.ИмяМакета      = "КлиентБанкУниверсальный";
	СтрокаТаблицы.СтароеИмяФайла = "КлиентБанкУниверсальный.epf";
	СтрокаТаблицы.Расширение     = "epf";
	
	СтрокаТаблицы = ТаблицаОбработок.Добавить();
	СтрокаТаблицы.ИмяМакета      = "ЗагрузкаСубсидийИзDBF";
	СтрокаТаблицы.СтароеИмяФайла = "ЗагрузкаСубсидийИзDBF.epf";
	СтрокаТаблицы.Расширение     = "epf";
	
	СтрокаТаблицы = ТаблицаОбработок.Добавить();
	СтрокаТаблицы.ИмяМакета      = "МонетизацияЛьготИСубсидий";
	СтрокаТаблицы.СтароеИмяФайла = "ЛьготыИСубсидии.epf";
	СтрокаТаблицы.Расширение     = "epf";
	
	Запрос.УстановитьПараметр("ТаблицаОбработок", ТаблицаОбработок);
	
	АдминистраторСистемы = Справочники.Пользователи.НайтиПоНаименованию("Администратор");
	Выборка = Запрос.Выполнить().Выбрать();
	Защита = Неопределено;
	Попытка
		Защита = Новый ("ОписаниеЗащитыОтОпасныхДействий");
		Защита.ПредупреждатьОбОпасныхДействиях = Ложь;
	Исключение
	КонецПопытки;
	
	Пока Выборка.Следующий() Цикл
		ДвоичныеДанные    = ПолучитьОбщийМакет(Выборка.ИмяМакета);
		АдресДанных       = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		Менеджер          = ?(Выборка.Расширение = "erf", ВнешниеОтчеты, ВнешниеОбработки);
		Если Защита = Неопределено Тогда
			ИмяОбъекта        = Менеджер.Подключить(АдресДанных, , Истина);
		Иначе		
			ИмяОбъекта        = Менеджер.Подключить(АдресДанных, , Истина,Защита);
		КонецЕсли;
		ОбработкаОбъект   = Менеджер.Создать(ИмяОбъекта,БезопасныйРежим());
		ОбработкаСведения = ОбработкаОбъект.СведенияОВнешнейОбработке();
		
		Если Выборка.Версия = ОбработкаСведения.Версия Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			СправочникОбъект = Справочники.ДополнительныеОтчетыИОбработки.СоздатьЭлемент();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СправочникОбъект, ОбработкаСведения, "Наименование, БезопасныйРежим, Версия, Информация");
		
		СправочникОбъект.Публикация = Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется;
		СправочникОбъект.Вид        = ДополнительныеОтчетыИОбработки.ПолучитьВидОбработкиПоСтроковомуПредставлениюВида(
			ОбработкаСведения.Вид
		);
		
		СправочникОбъект.ИспользоватьДляФормыОбъекта = Истина;
		СправочникОбъект.ИспользоватьДляФормыСписка  = Истина;
		СправочникОбъект.Ответственный               = АдминистраторСистемы;
		СправочникОбъект.ХранилищеОбработки          = Новый ХранилищеЗначения(ДвоичныеДанные);
		СправочникОбъект.ИмяОбъекта                  = Выборка.ИмяМакета;
		СправочникОбъект.ИмяФайла                    = Выборка.ИмяМакета + "." + Выборка.Расширение;
		
		СправочникОбъект.Команды.Очистить();
		СправочникОбъект.Назначение.Очистить();
		СправочникОбъект.Разделы.Очистить();
		
		Для Каждого ОписаниеКоманды Из ОбработкаСведения.Команды Цикл
			
			НоваяКоманда = СправочникОбъект.Команды.Добавить();
			
			Если ОписаниеКоманды.Использование = "ОткрытиеФормы" Тогда
				НоваяКоманда.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ОткрытиеФормы;
			ИначеЕсли ОписаниеКоманды.Использование = "ВызовКлиентскогоМетода" Тогда
				НоваяКоманда.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ВызовКлиентскогоМетода;
			ИначеЕсли ОписаниеКоманды.Использование = "ВызовСерверногоМетода" Тогда
				НоваяКоманда.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ВызовСерверногоМетода;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НоваяКоманда, ОписаниеКоманды, "Идентификатор, Модификатор, ПоказыватьОповещение, Представление");
			
		КонецЦикла;
		
		Если ДополнительныеОтчетыИОбработки.ПроверитьГлобальнаяОбработка(СправочникОбъект.Вид) Тогда
			Разделы = Новый Массив;
			Если СправочникОбъект.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка Тогда
				ДополнительныеОтчетыИОбработкиПереопределяемый.ОпределитьРазделыСДополнительнымиОбработками(Разделы);
			Иначе
				ДополнительныеОтчетыИОбработкиПереопределяемый.ОпределитьРазделыСДополнительнымиОтчетами(Разделы);
			КонецЕсли;
			
			Для Каждого Раздел Из Разделы Цикл
				НовыйРаздел = СправочникОбъект.Разделы.Добавить();
				Если Раздел = ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола() Тогда
					НовыйРаздел.Раздел = Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();
				Иначе
					НовыйРаздел.Раздел = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Раздел);
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого ОписаниеНазначения Из ОбработкаСведения.Назначение Цикл
				НовоеНазначение = СправочникОбъект.Назначение.Добавить();
				НовоеНазначение.ПолноеИмяОбъектаМетаданных = ОписаниеНазначения;
			КонецЦикла;
		КонецЕсли;
		
		СправочникОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Процедура обновления резиза 1.0.2.5.
//
Процедура Релиз1_0_2_5() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		|ИЗ
		|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета";
		
	ВыборкаЛицевыеСчета = Запрос.Выполнить().Выбрать();		
	
	ДопЧисло = 0;
	Пока ВыборкаЛицевыеСчета.Следующий() цикл
		
		ДопЧисло = ДопЧисло +1;
		ОбъектЛицевойСчет = ВыборкаЛицевыеСчета.ЛицевойСчет.ПолучитьОбъект();
		ОбъектЛицевойСчет.Идентификатор = ОСМДСервер.СгенерироватьИдентификатор(ДопЧисло);
		Попытка
			ОбъектЛицевойСчет.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Услуги.Ссылка КАК Услуга
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|ГДЕ
		|	НЕ Услуги.ЭтоГруппа";
		
	ВыборкаУслуги = Запрос.Выполнить().Выбрать();		
	
	ДопЧисло = 0;
	Пока ВыборкаУслуги.Следующий() цикл
		
		ДопЧисло = ДопЧисло +1;
		ОбъектУслуга = ВыборкаУслуги.Услуга.ПолучитьОбъект();
		ОбъектУслуга.Идентификатор = ОСМДСервер.СгенерироватьИдентификатор(ДопЧисло);
		Попытка
			ОбъектУслуга.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриборыУчета.Ссылка КАК ПриборУчета
		|ИЗ
		|	Справочник.ПриборыУчета КАК ПриборыУчета";
		
	ВыборкаПриборыУчета = Запрос.Выполнить().Выбрать();		
	
	ДопЧисло = 0;
	Пока ВыборкаПриборыУчета.Следующий() цикл
		
		ДопЧисло = ДопЧисло +1;
		ОбъектПриборУчета = ВыборкаПриборыУчета.ПриборУчета.ПолучитьОбъект();
		ОбъектПриборУчета.Идентификатор = ОСМДСервер.СгенерироватьИдентификатор(ДопЧисло);
		Попытка
			ОбъектПриборУчета.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура обновления резиза 1.0.2.6.
//
Процедура Релиз1_0_2_6() Экспорт
	
	ОбновитьДополнительныеОбработки();	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаменаПриборовУчетаОсновная.ПриборУчета КАК ПриборУчета,
		|	ЗаменаПриборовУчетаОсновная.ОбъектУстановки КАК ОбъектУстановки,
		|	ЗаменаПриборовУчетаОсновная.ПоказаниеПредыдущее,
		|	ЗаменаПриборовУчетаОсновная.Показание,
		|	ЗаменаПриборовУчетаОсновная.ПриборУчета.Услуга КАК Услуга,
		|	ЗаменаПриборовУчетаОсновная.Ссылка КАК Ссылка,
		|	ЗаменаПриборовУчетаОсновная.Ссылка.Дата КАК Период,
		|	ЗаменаПриборовУчетаОсновная.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.ЗаменаПриборовУчета.Основная КАК ЗаменаПриборовУчетаОсновная
		|ГДЕ
		|	ЗаменаПриборовУчетаОсновная.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтроки
		|ИТОГИ ПО
		|	Ссылка,
		|	ОбъектУстановки,
		|	ПриборУчета";
		
	РезультатЗапроса = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		ДокОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		
		ТаблицаНабораЗаписей = ДокОбъект.Движения.ЗаменыПриборовУчета.ВыгрузитьКолонки();
		
		ВыбокаЛицевойСчет = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыбокаЛицевойСчет.Следующий() Цикл
		
			ВыбокаПриборУчета = ВыбокаЛицевойСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыбокаПриборУчета.Следующий() Цикл
				
				ВыбокаДетальные = ВыбокаПриборУчета.Выбрать();
				Пока ВыбокаДетальные.Следующий() Цикл
					
					НоваяСтрока = ТаблицаНабораЗаписей.Добавить();
					НоваяСтрока.Активность = Истина;
					НоваяСтрока.ОбъектУстановки = ВыбокаДетальные.ОбъектУстановки;
					НоваяСтрока.ПриборУчета = ВыбокаДетальные.ПриборУчета;
					НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
					
					НоваяСтрока.Период = ВыбокаДетальные.Период;
					НоваяСтрока.Показание = ВыбокаДетальные.Показание;
					НоваяСтрока.ПоказаниеПредыдущее = ВыбокаДетальные.ПоказаниеПредыдущее;
					НоваяСтрока.Услуга = ВыбокаДетальные.Услуга;
				
				КонецЦикла; 
			
			КонецЦикла; 
		
		КонецЦикла; 
		
		ДвиженияЗаменыПриборовУчета = ДокОбъект.Движения.ЗаменыПриборовУчета;
		ДвиженияЗаменыПриборовУчета.Записывать = Истина;
		ДвиженияЗаменыПриборовУчета.Загрузить(ТаблицаНабораЗаписей);
		ДвиженияЗаменыПриборовУчета.Записать();
		
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УправлениеПриборамиУчетаПриборыУчета.Ссылка КАК Ссылка,
		|	УправлениеПриборамиУчетаПриборыУчета.НомерСтроки КАК НомерСтроки,
		|	УправлениеПриборамиУчетаПриборыУчета.ПриборУчета КАК ПриборУчета,
		|	УправлениеПриборамиУчетаПриборыУчета.КонечноеПоказание КАК Показание,
		|	УправлениеПриборамиУчетаПриборыУчета.ДатаОтключения КАК Период,
		|	УправлениеПриборамиУчетаПриборыУчета.ПриборУчета.Услуга КАК Услуга,
		|	УправлениеПриборамиУчетаПриборыУчета.Ссылка.ОбъектУстановки КАК ОбъектУстановки
		|ИЗ
		|	Документ.УправлениеПриборамиУчета.ПриборыУчета КАК УправлениеПриборамиУчетаПриборыУчета
		|ГДЕ
		|	УправлениеПриборамиУчетаПриборыУчета.Ссылка.Проведен
		|	И (УправлениеПриборамиУчетаПриборыУчета.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеПрибораУчета)
		|			ИЛИ УправлениеПриборамиУчетаПриборыУчета.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийУправленияПриборамиУчета.ОтключениеНаПоверку))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтроки
		|ИТОГИ ПО
		|	Ссылка,
		|	ОбъектУстановки,
		|	ПриборУчета";
		
		
	РезультатЗапроса = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		ДокОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		
		ТаблицаНабораЗаписей = ДокОбъект.Движения.ЗаменыПриборовУчета.ВыгрузитьКолонки();
		
		ВыбокаЛицевойСчет = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыбокаЛицевойСчет.Следующий() Цикл
		
			ВыбокаПриборУчета = ВыбокаЛицевойСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыбокаПриборУчета.Следующий() Цикл
				
				ВыбокаДетальные = ВыбокаПриборУчета.Выбрать();
				Пока ВыбокаДетальные.Следующий() Цикл
					
					НоваяСтрока = ТаблицаНабораЗаписей.Добавить();
					НоваяСтрока.Активность = Истина;
					НоваяСтрока.ОбъектУстановки = ВыбокаДетальные.ОбъектУстановки;
					НоваяСтрока.ПриборУчета = ВыбокаДетальные.ПриборУчета;
					НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
					
					НоваяСтрока.Период = ВыбокаДетальные.Период;
					НоваяСтрока.Показание = ВыбокаДетальные.Показание;
					НоваяСтрока.Услуга = ВыбокаДетальные.Услуга;
					
					ТаблицаПредыдущихПоказаний = РегистрыСведений.ПоказанияПриборовУчета.СрезПоследних(Новый Граница(НоваяСтрока.Период, ВидГраницы.Исключая), Новый Структура("ПриборУчета", НоваяСтрока.ПриборУчета));
					Если ТаблицаПредыдущихПоказаний.Количество() > 0 Тогда
						НоваяСтрока.ПоказаниеПредыдущее = ТаблицаПредыдущихПоказаний[0].Значение;
					КонецЕсли; 
					
				КонецЦикла; 
			
			КонецЦикла; 
		
		КонецЦикла; 
		
		ДвиженияЗаменыПриборовУчета = ДокОбъект.Движения.ЗаменыПриборовУчета;
		ДвиженияЗаменыПриборовУчета.Записывать = Истина;
		ДвиженияЗаменыПриборовУчета.Загрузить(ТаблицаНабораЗаписей);
		ДвиженияЗаменыПриборовУчета.Записать();
		
	КонецЦикла; 
		
КонецПроцедуры

// Процедура обновления резиза 1.0.2.7.
//
Процедура Релиз1_0_2_7() Экспорт
	
	Константы.ГраничнаяДатаСтимулирующегоТарифа.Установить(20);
	
КонецПроцедуры

// Процедура обновления резиза 1.0.3.1.
//
Процедура Релиз1_0_3_1() Экспорт
	
	ОбновитьДополнительныеОбработки();
	
КонецПроцедуры

// Процедура обновления резиза 1.0.4.1.
//
Процедура Релиз1_0_4_1() Экспорт
	
	СоответствиеПрофилей = Новый Соответствие;
	СоответствиеПрофилей.Вставить("Аварийно диспетчерская служба", Справочники.ПрофилиГруппДоступа.АварийноДиспетчерскаяСлужба);
	СоответствиеПрофилей.Вставить("Аварійно диспетчерська служба", Справочники.ПрофилиГруппДоступа.АварийноДиспетчерскаяСлужба);
	СоответствиеПрофилей.Вставить("Голосование", Справочники.ПрофилиГруппДоступа.Голосование);
	СоответствиеПрофилей.Вставить("Голосування", Справочники.ПрофилиГруппДоступа.Голосование);
	СоответствиеПрофилей.Вставить("Запасы", Справочники.ПрофилиГруппДоступа.Запасы);
	СоответствиеПрофилей.Вставить("Запаси", Справочники.ПрофилиГруппДоступа.Запасы);
	СоответствиеПрофилей.Вставить("Паспортный стол", Справочники.ПрофилиГруппДоступа.ПаспортныйСтол);
	СоответствиеПрофилей.Вставить("Паспортний стіл", Справочники.ПрофилиГруппДоступа.ПаспортныйСтол);
	СоответствиеПрофилей.Вставить("Расчетчик", Справочники.ПрофилиГруппДоступа.Расчетчик);
	СоответствиеПрофилей.Вставить("Розраховувач", Справочники.ПрофилиГруппДоступа.Расчетчик);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрофилиГруппДоступа.Ссылка
		|ИЗ
		|	Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
		|ГДЕ
		|	НЕ ПрофилиГруппДоступа.Предопределенный";
		
	МассивПрофилей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
	
	НайденныеСсылки = НайтиПоСсылкам(МассивПрофилей);
	
	НайденныеСсылки.Колонки[0].Имя = "Ссылка";
	НайденныеСсылки.Колонки[1].Имя = "Данные";
	НайденныеСсылки.Колонки[2].Имя = "Метаданные";

	Для Каждого Строка Из НайденныеСсылки Цикл
		
		ГруппыДоступаОбъект = Строка.Данные.ПолучитьОбъект();
		ГруппыДоступаОбъект.ОбменДанными.Загрузка = Истина;
		ГруппыДоступаОбъект.Профиль = СоответствиеПрофилей.Получить(Строка.Ссылка.Наименование);
		
		Для Каждого СтрокаТЧ Из ГруппыДоступаОбъект.Профиль.ВидыДоступа Цикл
			НоваяСтрока = ГруппыДоступаОбъект.ВидыДоступа.Добавить();
			НоваяСтрока.ВидДоступа      = СтрокаТЧ.ВидДоступа;
			НоваяСтрока.ДоступРазрешен  = СтрокаТЧ.ДоступРазрешен;
		КонецЦикла;
			
		Попытка
			ГруппыДоступаОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Для Каждого Профиль Из МассивПрофилей Цикл
		Попытка
			ПрофильОбъект = Профиль.ПолучитьОбъект();
			ПрофильОбъект.Удалить();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзменениеЛицевогоСчета.Ссылка,
		|	ИзменениеЛицевогоСчета.Проведен,
		|	ИзменениеЛицевогоСчета.УДАЛИТЬНомерМашиноМеста,
		|	ИзменениеЛицевогоСчета.УДАЛИТЬКоличествоМашиноМест
		|ИЗ
		|	Документ.ИзменениеЛицевогоСчета КАК ИзменениеЛицевогоСчета
		|ГДЕ
		|	ИзменениеЛицевогоСчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеМашиноМест)";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		Объект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		Объект.МашиноМеста.Очистить();
		НоваяСтрока = Объект.МашиноМеста.Добавить();
		НоваяСтрока.ВидМашиноМеста = Справочники.ВидыМашиноМест.Стандарт;
		НоваяСтрока.НомерМашиноМеста = Объект.УДАЛИТЬНомерМашиноМеста;
		НоваяСтрока.КоличествоМашиноМест = Объект.УДАЛИТЬКоличествоМашиноМест;
		
		Попытка
			Если РезультатЗапроса.Проведен Тогда
				Объект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				Объект.Записать();
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Услуги.Ссылка КАК Услуга
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|ГДЕ
		|	НЕ Услуги.ЭтоГруппа
		|	И Услуги.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияУслуг.ПоКоличествуМашиноМест)";
		
	РезультатЗапроса = Запрос.Выполнить().Выбрать();		
	
	Пока РезультатЗапроса.Следующий() цикл
		Объект = РезультатЗапроса.Услуга.ПолучитьОбъект();
		
		Объект.ВидМашиноМеста = Справочники.ВидыМашиноМест.Стандарт;
		
		Попытка
			Объект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Константы.ПровайдерSMS.Установить(Перечисления.ПровайдерыSMS.АльфаSMS);
	
КонецПроцедуры

// Процедура обновления резиза 1.0.5.1.
//
Процедура Релиз1_0_5_1() Экспорт
	
	УстановитьКодНаименованиеУзлаЭтойИБ();	
	
КонецПроцедуры

// Процедура обновления резиза 1.0.5.2.
//
Процедура Релиз1_0_5_2() Экспорт
	
КонецПроцедуры

// Процедура обновления резиза 1.0.5.3.
//
Процедура Релиз1_0_5_3() Экспорт
	
	Пользователи.СоздатьПользователяДляМобильногоПриложения(); //Создается пользователь для мобильного приложения 
	
	//Обработка документов "Управление составом жильцов"
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СведенияОПроживающихЖильцах.Период КАК Период,
	               |	СведенияОПроживающихЖильцах.Регистратор,
	               |	СведенияОПроживающихЖильцах.НомерСтроки,
	               |	СведенияОПроживающихЖильцах.Активность,
	               |	СведенияОПроживающихЖильцах.ЛицевойСчет,
	               |	СведенияОПроживающихЖильцах.Жилец,
	               |	СведенияОПроживающихЖильцах.Проживает
	               |ИЗ
	               |	РегистрСведений.СведенияОПроживающихЖильцах КАК СведенияОПроживающихЖильцах
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СведенияОПрописанныхЖильцах.Период КАК Период,
	               |	СведенияОПрописанныхЖильцах.Регистратор,
	               |	СведенияОПрописанныхЖильцах.НомерСтроки,
	               |	СведенияОПрописанныхЖильцах.Активность,
	               |	СведенияОПрописанныхЖильцах.ЛицевойСчет,
	               |	СведенияОПрописанныхЖильцах.Жилец,
	               |	СведенияОПрописанныхЖильцах.Прописан
	               |ИЗ
	               |	РегистрСведений.СведенияОПрописанныхЖильцах КАК СведенияОПрописанныхЖильцах
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаДвиженийПрописка = Результат[1].Выгрузить();
	ТаблицаДвиженийПоживающие = Результат[0].Выгрузить();
	
	Для каждого Строка Из ТаблицаДвиженийПрописка Цикл
		СсылкаДокумента = Строка.Регистратор;
		ОбъектДокумент = СсылкаДокумента.ПолучитьОбъект();
		
		СтрокаПоиск = ОбъектДокумент.Жильцы.Найти(Строка.Жилец,"Жилец");
		Если Строка.Прописан = Истина Тогда
			
			СтрокаПоиск.Прописан = Истина;
			СтрокаПоиск.ДатаНачалаДействия = Строка.Период;
		Иначе
			СтрокаПоиск.Прописан = Истина;
			СтрокаПоиск.ДатаОкончанияДействияПрописки = Строка.Период;
		КонецЕсли;
		ОбъектДокумент.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;	
	
	Для каждого Строка Из ТаблицаДвиженийПоживающие Цикл
		СсылкаДокумента = Строка.Регистратор;
		ОбъектДокумент = СсылкаДокумента.ПолучитьОбъект();
		СтрокаПоиск = ОбъектДокумент.Жильцы.Найти(Строка.Жилец,"Жилец");

		Если Строка.Проживает = Истина Тогда
			СтрокаПоиск.Проживает = Истина;
			СтрокаПоиск.ДатаНачалаПроживания = Строка.Период;
		Иначе
			СтрокаПоиск.Проживает = Истина;
			СтрокаПоиск.ДатаОкончанияПериодаПроживания = Строка.Период;
		КонецЕсли;
		ОбъектДокумент.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;

	
КонецПроцедуры

// Процедура обновления резиза 1.0.5.4.
//
Процедура Релиз1_0_5_4() Экспорт
	
КонецПроцедуры

// Процедура обновления резиза 1.0.5.5.
//
Процедура Релиз1_0_5_5() Экспорт
	
	УслугаРеструктуризации = Справочники.Услуги.РеструктуризацияДолга.ПолучитьОбъект();
	УслугаРеструктуризации.ПолноеНаименование = "Реструктуризація боргу";
	УслугаРеструктуризации.КраткоеНаименование = "Реструктуризація";
	УслугаРеструктуризации.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("грн");
	УслугаРеструктуризации.СпособНачисления = Перечисления.СпособыНачисленияУслуг.ФиксированноеНачисление;
	УслугаРеструктуризации.Записать();
	
КонецПроцедуры

// Процедура обновления резиза 1.0.5.6.
//
Процедура Релиз1_0_5_6() Экспорт
	
	ОбновитьДополнительныеОбработки();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	КорректировкаНачисленийЛицевыеСчета.Ссылка.Дата КАК Период,
	                |	КорректировкаНачисленийЛицевыеСчета.Ссылка КАК Регистратор,
	                |	КорректировкаНачисленийЛицевыеСчета.ЛицевойСчет,
	                |	-КорректировкаНачисленийЛицевыеСчета.СуммаКорректировки КАК Сумма,
	                |	КорректировкаНачисленийЛицевыеСчета.Услуга,
	                |	НАЧАЛОПЕРИОДА(КорректировкаНачисленийЛицевыеСчета.ПериодКорректировки, МЕСЯЦ) КАК МесяцНачисления,
	                |	КорректировкаНачисленийЛицевыеСчета.ВидНачисления,
	                |	КорректировкаНачисленийЛицевыеСчета.Льгота,
	                |	КорректировкаНачисленийЛицевыеСчета.Льготчик КАК ПотребительУслуг,
	                |	НАЧАЛОПЕРИОДА(КорректировкаНачисленийЛицевыеСчета.ПериодКорректировки, МЕСЯЦ) КАК ДатаНачалаПериода,
	                |	КОНЕЦПЕРИОДА(КорректировкаНачисленийЛицевыеСчета.ПериодКорректировки, МЕСЯЦ) КАК ДатаОкончанияПериода,
	                |	ИСТИНА КАК Корректировка,
	                |	КорректировкаНачисленийЛицевыеСчета.Ссылка.Организация,
	                |	КорректировкаНачисленийЛицевыеСчета.Услуга.ВидУслуги,
	                |	КорректировкаНачисленийЛицевыеСчета.Услуга.ВидУслуги.КонтрагентДляРасчетаПоЛьготам,
	                |	КорректировкаНачисленийЛицевыеСчета.Услуга.ВидУслуги.ДоговорДляРасчетаПоЛьготам,
	                |	КорректировкаНачисленийЛицевыеСчета.Услуга.ВидУслуги.КонтрагентДляРасчетаПоСубсидиям,
	                |	КорректировкаНачисленийЛицевыеСчета.Услуга.ВидУслуги.ДоговорДляРасчетаПоСубсидиям
	                |ПОМЕСТИТЬ Корректировки
	                |ИЗ
	                |	Документ.КорректировкаНачислений.ЛицевыеСчета КАК КорректировкаНачисленийЛицевыеСчета
	                |ГДЕ
	                |	КорректировкаНачисленийЛицевыеСчета.ВидНачисления <> ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	                |	И КорректировкаНачисленийЛицевыеСчета.Ссылка.Проведен = ИСТИНА
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	Корректировки.Период,
	                |	Корректировки.Регистратор КАК Регистратор,
	                |	Корректировки.ЛицевойСчет,
	                |	Корректировки.Сумма,
	                |	Корректировки.Услуга,
	                |	Корректировки.МесяцНачисления,
	                |	Корректировки.ВидНачисления,
	                |	Корректировки.Льгота,
	                |	Корректировки.ПотребительУслуг,
	                |	Корректировки.ДатаНачалаПериода,
	                |	Корректировки.ДатаОкончанияПериода,
	                |	Корректировки.Корректировка,
	                |	Корректировки.Организация
	                |ИЗ
	                |	Корректировки КАК Корректировки
	                |ГДЕ
	                |	Корректировки.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	                |ИТОГИ ПО
	                |	Регистратор
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	                |	Корректировки.ВидНачисления,
	                |	Корректировки.Организация,
	                |	СУММА(Корректировки.Сумма) КАК Сумма,
	                |	Корректировки.Период,
	                |	Корректировки.УслугаВидУслугиКонтрагентДляРасчетаПоЛьготам КАК Контрагент,
	                |	Корректировки.УслугаВидУслугиДоговорДляРасчетаПоЛьготам КАК ДоговорКонтрагента,
	                |	Корректировки.Регистратор КАК Регистратор,
	                |	Корректировки.УслугаВидУслуги КАК Услуга
	                |ИЗ
	                |	Корректировки КАК Корректировки
	                |ГДЕ
	                |	Корректировки.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	Корректировки.Организация,
	                |	Корректировки.ВидНачисления,
	                |	Корректировки.УслугаВидУслугиКонтрагентДляРасчетаПоЛьготам,
	                |	Корректировки.Период,
	                |	Корректировки.УслугаВидУслугиДоговорДляРасчетаПоЛьготам,
	                |	Корректировки.Регистратор,
	                |	Корректировки.УслугаВидУслуги
	                |ИТОГИ ПО
	                |	Регистратор
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	                |	Корректировки.Организация,
	                |	Корректировки.ВидНачисления,
	                |	СУММА(Корректировки.Сумма) КАК Сумма,
	                |	Корректировки.Период,
	                |	Корректировки.УслугаВидУслугиКонтрагентДляРасчетаПоСубсидиям КАК Контрагент,
	                |	Корректировки.УслугаВидУслугиДоговорДляРасчетаПоСубсидиям КАК ДоговорКонтрагента,
	                |	Корректировки.Регистратор КАК Регистратор,
	                |	Корректировки.УслугаВидУслуги КАК Услуга
	                |ИЗ
	                |	Корректировки КАК Корректировки
	                |ГДЕ
	                |	Корректировки.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	Корректировки.Организация,
	                |	Корректировки.ВидНачисления,
	                |	Корректировки.УслугаВидУслугиДоговорДляРасчетаПоСубсидиям,
	                |	Корректировки.УслугаВидУслугиКонтрагентДляРасчетаПоСубсидиям,
	                |	Корректировки.Период,
	                |	Корректировки.Регистратор,
	                |	Корректировки.УслугаВидУслуги
	                |ИТОГИ ПО
	                |	Регистратор
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	Корректировки.Период,
	                |	Корректировки.Регистратор КАК Регистратор,
	                |	Корректировки.ЛицевойСчет,
	                |	Корректировки.Услуга,
	                |	Корректировки.МесяцНачисления,
	                |	-Корректировки.Сумма КАК Сумма,
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	                |	Корректировки.Организация
	                |ИЗ
	                |	Корректировки КАК Корректировки
	                |ГДЕ
	                |	Корректировки.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	                |ИТОГИ ПО
	                |	Регистратор";
	Результат = Запрос.ВыполнитьПакет();
	
		
	//Расшифровка начслений льгот
	Выборка = Результат[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
	
		 Движения = РегистрыНакопления.РасшифровкаНачисленияЛьгот.СоздатьНаборЗаписей();
		 Движения.Отбор.Регистратор.Установить(Выборка.Регистратор);
		 Движения.Записывать = Истина;
		 Движения.Прочитать();
		 Движения.Очистить();
		 Движения.Записать();
		 		 
		 ВыборкаДетали = Выборка.Выбрать();
		 Пока ВыборкаДетали.Следующий() Цикл
			 Движение = Движения.Добавить();
			 ЗаполнитьЗначенияСвойств(Движение,ВыборкаДетали);
		 КонецЦикла;
		 Движения.Записать();
	
	 КонецЦикла;
	 
	 	
	Выборка = Результат[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
	
		 Движения = РегистрыНакопления.ВзаиморасчетыПоЛьготам.СоздатьНаборЗаписей();
		 Движения.Отбор.Регистратор.Установить(Выборка.Регистратор);
		 Движения.Записывать = Истина;
		 Движения.Прочитать();
		 Движения.Очистить();
		 Движения.Записать();
		
		 ВыборкаДетали = Выборка.Выбрать();
		 Пока ВыборкаДетали.Следующий() Цикл
			 Движение = Движения.Добавить();
			 ЗаполнитьЗначенияСвойств(Движение,ВыборкаДетали);
		 КонецЦикла;
		 Движения.Записать();
	
	 КонецЦикла; 
	 
	Выборка = Результат[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
	
		 Движения = РегистрыНакопления.ВзаиморасчетыПоСубсидиям.СоздатьНаборЗаписей();
		 Движения.Отбор.Регистратор.Установить(Выборка.Регистратор);
		 Движения.Записывать = Истина;
		 Движения.Прочитать();
		 Движения.Очистить();
		 Движения.Записать();
		
		 ВыборкаДетали = Выборка.Выбрать();
		 Пока ВыборкаДетали.Следующий() Цикл
			 Движение = Движения.Добавить();
			 ЗаполнитьЗначенияСвойств(Движение,ВыборкаДетали);
		 КонецЦикла;
		 Движения.Записать();
	
	 КонецЦикла;
	 
	 ВыборкаСубс = Результат[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	 Пока ВыборкаСубс.Следующий() Цикл
		 
		 Движения = РегистрыНакопления.РасчетыПоСубсидиям.СоздатьНаборЗаписей();
		 Движения.Отбор.Регистратор.Установить(ВыборкаСубс.Регистратор);
		 Движения.Записывать = Истина;
		 Движения.Прочитать();
		 Движения.Очистить();
		 Движения.Записать();
		 
		 ВыборкаДетали = ВыборкаСубс.Выбрать();
		 Пока ВыборкаДетали.Следующий() Цикл
			 Движение = Движения.Добавить();
			 ЗаполнитьЗначенияСвойств(Движение,ВыборкаДетали);
		 КонецЦикла;
		 Движения.Записать();
		 
	 КонецЦикла;

	 
	  ВыполнитьПроводкуПоРегиструСубсидий();
	
КонецПроцедуры

Процедура ВыполнитьПроводкуПоРегиструСубсидий()
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НачислениеПоЛС.Дата КАК Дата,
	|	НачислениеПоЛС.ПериодНачисления КАК ПериодНачисления,
	|	НачислениеПоЛС.Ссылка,
	|	НачислениеПоЛСУслуги.ЛицевойСчет,
	|	НачислениеПоЛСУслуги.Услуга,
	|	НачислениеПоЛСУслуги.СуммаНачислено КАК Сумма,
	|	НачислениеПоЛСУслуги.ВидНачисления,
	|	НачислениеПоЛС.Здание,
	|	НачислениеПоЛС.Организация
	|ПОМЕСТИТЬ ВТ_Начисления
	|ИЗ
	|	Документ.НачислениеПоЛС КАК НачислениеПоЛС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеПоЛС.Услуги КАК НачислениеПоЛСУслуги
	|		ПО НачислениеПоЛС.Ссылка = НачислениеПоЛСУслуги.Ссылка
	|ГДЕ
	|	НачислениеПоЛСУслуги.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	|	И НачислениеПоЛС.Проведен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоЛицевымСчетамОбороты.МесяцНачисления КАК ПериодНачисления
	|ИЗ
	|	РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты КАК РасчетыПоЛицевымСчетамОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоЛицевымСчетамОбороты.МесяцНачисления" ;
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НазначенныеСубсидии = Новый ТаблицаЗначений;
	НазначенныеСубсидии.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("СправочникСсылка.ЛицевыеСчета"));
	НазначенныеСубсидии.Колонки.Добавить("Услуга",Новый ОписаниеТипов("СправочникСсылка.Услуги"));
	НазначенныеСубсидии.Колонки.Добавить("СуммаСубсидии",Новый ОписаниеТипов("Число"));
	НазначенныеСубсидии.Колонки.Добавить("ПериодНачисления",Новый ОписаниеТипов("Дата"));
	
	
	
	ВыборкаПериодовСреза = Результат.Выбрать();
	
	Пока ВыборкаПериодовСреза.Следующий() Цикл
		ТаблицаСубсидий = РегистрыСведений.НазначенныеСубсидии.СрезПоследних(НачалоЧаса(КонецМесяца(ВыборкаПериодовСреза.ПериодНачисления)));
		Для Каждого Строка из ТаблицаСубсидий Цикл
			Если Строка.Действует Тогда
				НоваяСтрока = НазначенныеСубсидии.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
				НоваяСтрока.ПериодНачисления = КонецМесяца(ВыборкаПериодовСреза.ПериодНачисления);
			Иначе
				Сообщить(КонецМесяца(ВыборкаПериодовСреза.ПериодНачисления));
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла;
	
	НазначенныеСубсидии.Сортировать("ПериодНачисления Возр");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	ВТ_Начисления.Услуга,
	                |	ВТ_Начисления.ЛицевойСчет,
	                |	ВТ_Начисления.ПериодНачисления,
	                |	ВТ_Начисления.Здание,
	                |	ВТ_Начисления.Организация,
	                |	СУММА(ВТ_Начисления.Сумма) КАК СуммаНачислено,
	                |	ВТ_Начисления.Ссылка
	                |ПОМЕСТИТЬ Начисления
	                |ИЗ
	                |	ВТ_Начисления КАК ВТ_Начисления
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВТ_Начисления.ЛицевойСчет,
	                |	ВТ_Начисления.ПериодНачисления,
	                |	ВТ_Начисления.Здание,
	                |	ВТ_Начисления.Услуга,
	                |	ВТ_Начисления.Организация,
	                |	ВТ_Начисления.Ссылка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	Начисления.ЛицевойСчет,
	                |	НАЧАЛОПЕРИОДА(Начисления.ПериодНачисления, МЕСЯЦ) КАК МесяцНачисления,
	                |	Начисления.Здание,
	                |	Начисления.Организация,
	                |	СУММА(0) КАК Сумма,
	                |	НАЧАЛОПЕРИОДА(Начисления.ПериодНачисления, ЧАС) КАК Период,
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	                |	Начисления.Ссылка КАК Регистратор
	                |ИЗ
	                |	Начисления КАК Начисления
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	Начисления.Ссылка,
	                |	НАЧАЛОПЕРИОДА(Начисления.ПериодНачисления, ЧАС),
	                |	Начисления.Организация,
	                |	НАЧАЛОПЕРИОДА(Начисления.ПериодНачисления, МЕСЯЦ),
	                |	Начисления.Здание,
	                |	Начисления.ЛицевойСчет
	                |ИТОГИ ПО
	                |	Регистратор
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	Начисления.Услуга,
	                |	Начисления.ЛицевойСчет,
	                |	НАЧАЛОПЕРИОДА(Начисления.ПериодНачисления, МЕСЯЦ) КАК МесяцНачисления,
	                |	Начисления.Здание,
	                |	Начисления.Организация,
	                |	-Начисления.СуммаНачислено КАК Сумма,
	                |	Начисления.ПериодНачисления КАК Период,
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	                |	Начисления.Ссылка КАК Регистратор
	                |ИЗ
	                |	Начисления КАК Начисления
	                |ИТОГИ ПО
	                |	Регистратор";
	Запрос.УстановитьПараметр("Таблица",НазначенныеСубсидии);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаРегистратор = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРегистратор.Следующий() Цикл
		Движения = РегистрыНакопления.РасчетыПоСубсидиям.СоздатьНаборЗаписей();
		Движения.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
		
		ВыборкаДетали = ВыборкаРегистратор.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("ЛицевойСчет",ВыборкаДетали.ЛицевойСчет);
			СтруктураОтбора.Вставить("ПериодНачисления",КонецМесяца(ВыборкаДетали.МесяцНачисления));
			
			СтрокаНайденнойСубсидии = НазначенныеСубсидии.НайтиСтроки(СтруктураОтбора);
			Попытка
				Для Каждого строка из СтрокаНайденнойСубсидии Цикл
					Движение = Движения.Добавить();
					ЗаполнитьЗначенияСвойств(Движение,ВыборкаДетали);
					Движение.Сумма = Строка.СуммаСубсидии;
					Движение.Услуга = Строка.Услуга;
				КонецЦикла;
			Исключение
				Движения.Удалить(Движение);
			КонецПопытки;
			
		КонецЦикла;
		Движения.Записать();
	КонецЦикла;
	
	
	ВыборкаРасходРегистратор = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРасходРегистратор.Следующий() Цикл
		Движения = РегистрыНакопления.РасчетыПоСубсидиям.СоздатьНаборЗаписей();
		Движения.Отбор.Регистратор.Установить(ВыборкаРасходРегистратор.Регистратор);
		Движения.Прочитать();
		
		ВыборкаРасходДетали = ВыборкаРасходРегистратор.Выбрать();
		Пока ВыборкаРасходДетали.Следующий() Цикл
			Движение = Движения.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,ВыборкаРасходДетали);
		КонецЦикла;
		Движения.Записать();
	КонецЦикла; 
	
	ТаблицаПерерасчета = Новый ТаблицаЗначений;
	ТаблицаПерерасчета.Колонки.Добавить("Регистратор", Новый ОписаниеТипов("ДокументСсылка.ПерерасчетПоЛС"));
	ТаблицаПерерасчета.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("СправочникСсылка.ЛицевыеСчета"));
	ТаблицаПерерасчета.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаПерерасчета.Колонки.Добавить("Услуга", Новый ОписаниеТипов("СправочникСсылка.Услуги"));	
	ТаблицаПерерасчета.Колонки.Добавить("СуммаСубсидии", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15,2)));
	ТаблицаПерерасчета.Колонки.Добавить("МесяцНачисления", Новый ОписаниеТипов("Дата"));
	ТаблицаПерерасчета.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПерерасчетПоЛС.Ссылка,
	|	ПерерасчетПоЛС.Дата,
	|	ПерерасчетПоЛС.Здание,
	|	ПерерасчетПоЛС.Организация,
	|	ПерерасчетПоЛСПерерасчет.ЛицевойСчет,
	|	ЕСТЬNULL(ПерерасчетПоЛС.Услуга, ЗНАЧЕНИЕ(Справочник.услуги.ПустаяСсылка)) КАК УслугаДокумента,
	|	0 КАК Поле1
	|ПОМЕСТИТЬ ВТПерерасчет
	|ИЗ
	|	Документ.ПерерасчетПоЛС КАК ПерерасчетПоЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПерерасчетПоЛС.Перерасчет КАК ПерерасчетПоЛСПерерасчет
	|		ПО ПерерасчетПоЛС.Ссылка = ПерерасчетПоЛСПерерасчет.Ссылка
	|ГДЕ
	|	ПерерасчетПоЛС.Дата МЕЖДУ &Дата1 И &Дата2
	|
	|СГРУППИРОВАТЬ ПО
	|	ПерерасчетПоЛС.Ссылка,
	|	ПерерасчетПоЛСПерерасчет.ЛицевойСчет,
	|	ПерерасчетПоЛС.Дата,
	|	ПерерасчетПоЛС.Здание,
	|	ПерерасчетПоЛС.Организация,
	|	ЕСТЬNULL(ПерерасчетПоЛС.Услуга, ЗНАЧЕНИЕ(Справочник.услуги.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПерерасчет.Ссылка КАК Ссылка,
	|	ВТПерерасчет.Дата КАК Дата,
	|	ВТПерерасчет.Здание,
	|	ВТПерерасчет.Организация,
	|	ВТПерерасчет.ЛицевойСчет КАК ЛицевойСчет,
	|	ЕСТЬNULL(ВТПерерасчет.УслугаДокумента, ЗНАЧЕНИЕ(Справочник.услуги.ПустаяСсылка)) КАК УслугаДокумента
	|ИЗ
	|	ВТПерерасчет КАК ВТПерерасчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Дата1",Дата("20150901"));
	Запрос.УстановитьПараметр("Дата2",Дата("20150930235959"));
	Результат = Запрос.Выполнить();	
	
	
	Если НЕ Результат.Пустой() Тогда
		ВыборкаПерерасчетов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		
		Пока ВыборкаПерерасчетов.Следующий() Цикл                                                   
			ПериодНачисленияНачало = ВыборкаПерерасчетов.Ссылка.ПериодНачисленияНачало;
			ПериодНачисленияОкончание = ВыборкаПерерасчетов.Ссылка.ПериодНачисленияОкончание;
			УслугаДокумента = ВыборкаПерерасчетов.Ссылка.Услуга;
			Ссылка = ВыборкаПерерасчетов.Ссылка;
			МассивЛицевыхСчетов = Новый Массив;
			ВыборкаЛС = ВыборкаПерерасчетов.Выбрать();
			Пока ВыборкаЛС.Следующий() Цикл
				МассивЛицевыхСчетов.Добавить(ВыборкаЛС.ЛицевойСчет);
			КонецЦикла;	
			СтруктураДляРасчета = Новый Структура;
			
			СтруктураДляРасчета.Вставить("ЛицевыеСчета", МассивЛицевыхСчетов); 
			
			СтруктураДляРасчета.Вставить("ПериодНачисленияНачало", ПериодНачисленияНачало);
			СтруктураДляРасчета.Вставить("ПериодНачисленияОкончание", ПериодНачисленияОкончание);
			
			СтруктураДляРасчета.Вставить("Услуга", УслугаДокумента); 
			СтруктураДляРасчета.Вставить("Ссылка", Ссылка);
			
			ТаблицаПерерасчетаНовая = УчетКоммунальныхУслуг.РассчитатьСуммыПерерасчета(СтруктураДляРасчета);
			Для каждого строка Из ТаблицаПерерасчетаНовая Цикл
				Если строка.СуммаСубсидии <>0 тогда
					СтрокаТаб = ТаблицаПерерасчета.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаб,Строка);
					СтрокаТаб.Регистратор = ВыборкаПерерасчетов.Ссылка;
					СтрокаТаб.Период = ВыборкаПерерасчетов.Ссылка.Дата;
					СтрокаТаб.Организация = СтруктураДляРасчета.Ссылка.Организация;
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	ТаблицаСубсидий.Регистратор,
	|	ТаблицаСубсидий.ЛицевойСчет,
	|	ТаблицаСубсидий.МесяцНачисления,
	|	ТаблицаСубсидий.СуммаСубсидии,
	|	ТаблицаСубсидий.Период,
	|	ТаблицаСубсидий.Услуга,
	|	ТаблицаСубсидий.Организация
	|ПОМЕСТИТЬ ДокВТ
	|ИЗ
	|	&ТаблицаСубсидий КАК ТаблицаСубсидий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокВТ.Регистратор КАК Регистратор,
	|	ДокВТ.ЛицевойСчет КАК ЛицевойСчет,
	|	ДокВТ.МесяцНачисления КАК МесяцНачисления,
	|	СУММА(0) КАК Сумма,
	|	ДокВТ.Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ДокВТ.Организация,
	|	ЕСТЬNULL(РасчетыПоСубсидиямОстаткиИОбороты.СуммаПриход, 0) КАК Приход,
	|	ДокВТ.Услуга
	|ИЗ
	|	ДокВТ КАК ДокВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоСубсидиям.ОстаткиИОбороты(, , Регистратор, , ) КАК РасчетыПоСубсидиямОстаткиИОбороты
	|		ПО ДокВТ.Регистратор <> РасчетыПоСубсидиямОстаткиИОбороты.Регистратор
	|			И ДокВТ.ЛицевойСчет = РасчетыПоСубсидиямОстаткиИОбороты.ЛицевойСчет
	|			И ДокВТ.МесяцНачисления = РасчетыПоСубсидиямОстаткиИОбороты.МесяцНачисления
	|			И ДокВТ.Услуга = РасчетыПоСубсидиямОстаткиИОбороты.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокВТ.Период,
	|	ДокВТ.Регистратор,
	|	ДокВТ.ЛицевойСчет,
	|	ДокВТ.МесяцНачисления,
	|	ДокВТ.Организация,
	|	ЕСТЬNULL(РасчетыПоСубсидиямОстаткиИОбороты.СуммаПриход, 0),
	|	ДокВТ.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	МесяцНачисления
	|ИТОГИ ПО
	|	Регистратор,
	|	ЛицевойСчет,
	|	МесяцНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокВТ.Регистратор КАК Регистратор,
	|	ДокВТ.ЛицевойСчет КАК ЛицевойСчет,
	|	ДокВТ.МесяцНачисления,
	|	ДокВТ.СуммаСубсидии - ЕСТЬNULL(РасчетыПоСубсидиямОстаткиИОбороты.СуммаРасход, 0) КАК Сумма,
	|	ДокВТ.Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ДокВТ.Услуга,
	|	ДокВТ.Организация
	|ИЗ
	|	ДокВТ КАК ДокВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоСубсидиям.ОстаткиИОбороты(, , Регистратор, , ) КАК РасчетыПоСубсидиямОстаткиИОбороты
	|		ПО ДокВТ.Регистратор <> РасчетыПоСубсидиямОстаткиИОбороты.Регистратор
	|			И ДокВТ.ЛицевойСчет = РасчетыПоСубсидиямОстаткиИОбороты.ЛицевойСчет
	|			И ДокВТ.Услуга = РасчетыПоСубсидиямОстаткиИОбороты.Услуга
	|			И ДокВТ.МесяцНачисления = РасчетыПоСубсидиямОстаткиИОбороты.МесяцНачисления
	|ИТОГИ ПО
	|	Регистратор";
	
	Запрос.УстановитьПараметр("ТаблицаСубсидий",ТаблицаПерерасчета);
	
	Результат  = Запрос.ВыполнитьПакет();
	
	ВыборкаДляЗаписиВРегистрРегистратор = Результат[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДляЗаписиВРегистрРегистратор.Следующий() Цикл
		Движения = РегистрыНакопления.РасчетыПоСубсидиям.СоздатьНаборЗаписей();
		Движения.Отбор.Регистратор.Установить(ВыборкаДляЗаписиВРегистрРегистратор.Регистратор);
		
		ВыборкаДеталиВерх = ВыборкаДляЗаписиВРегистрРегистратор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДеталиВерх.Следующий() Цикл
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("ЛицевойСчет",ВыборкаДеталиВерх.ЛицевойСчет);
			
			ВыборкаДетали = ВыборкаДеталиВерх.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаДетали.Следующий() Цикл
				ТаблицаНайденнойСубсидии = РегистрыСведений.НазначенныеСубсидии.СрезПоследних(НАчалоЧаса(КонецМесяца(ВыборкаДетали.МесяцНачисления)),СтруктураОтбора);
				ВыборкаДанныхПоЛС = ВыборкаДетали.Выбрать();
				
				Пока ВыборкаДанныхПоЛС.Следующий() Цикл
					СтруктураПоискаЛС = Новый Структура;
					СтруктураПоискаЛС.Вставить("ЛицевойСчет",ВыборкаДанныхПоЛС.ЛицевойСчет);
					СтруктураПоискаЛС.Вставить("Услуга",ВыборкаДанныхПоЛС.Услуга);
					
					
					НайденныеСтрокиСубсидии = ТаблицаНайденнойСубсидии.НайтиСтроки(СтруктураПоискаЛС);
					Индекс = 0;
					Если НайденныеСтрокиСубсидии.Количество() <> 0 Тогда
						Пока Индекс <= НайденныеСтрокиСубсидии.ВГраница() Цикл
							Если НайденныеСтрокиСубсидии[Индекс].Действует тогда
								Сумма = НайденныеСтрокиСубсидии[Индекс].СуммаСубсидии - ВыборкаДанныхПоЛС.Приход ;
								Если Сумма <> 0 Тогда
									Движение = Движения.Добавить();
									ЗаполнитьЗначенияСвойств(Движение,ВыборкаДанныхПоЛС);
									Движение.Сумма = Сумма;
									Движение.Услуга = НайденныеСтрокиСубсидии[Индекс].Услуга;
								КонецЕсли;
							КонецЕсли;
							НайденныеСтрокиСубсидии.Удалить(Индекс);
							Индекс = Индекс+1;
						КонецЦикла;
					КонецЕсли;		
					
					Сч = 0; 
					Пока Сч <= НайденныеСтрокиСубсидии.ВГраница() Цикл
						
						Если НайденныеСтрокиСубсидии[Сч].Действует Тогда
							Движение = Движения.Добавить();
							ЗаполнитьЗначенияСвойств(Движение,ВыборкаДанныхПоЛС);
							Движение.Сумма = НайденныеСтрокиСубсидии[Сч].СуммаСубсидии;
							Движение.Услуга = НайденныеСтрокиСубсидии[Сч].Услуга;
						КонецЕсли;
						Сч = Сч+1;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла; 
			
		КонецЦикла;
		Попытка
			Движения.Записать();
		Исключение
			
		КонецПопытки;
	КонецЦикла;
	
	ВыборкаРасходРегистратор = Результат[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРасходРегистратор.Следующий() Цикл
		Движения = РегистрыНакопления.РасчетыПоСубсидиям.СоздатьНаборЗаписей();
		Движения.Отбор.Регистратор.Установить(ВыборкаРасходРегистратор.Регистратор);
		Движения.Прочитать();
		
		ВыборкаРасходДетали = ВыборкаРасходРегистратор.Выбрать();
		Пока ВыборкаРасходДетали.Следующий() Цикл
			Если ВыборкаРасходДетали.Сумма <> 0 Тогда
				Движение = Движения.Добавить();
				ЗаполнитьЗначенияСвойств(Движение,ВыборкаРасходДетали);
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			Движения.Записать();
		Исключение
			
		КонецПопытки;
	КонецЦикла; 

КонецПроцедуры

// Процедура обновления резиза 1.0.5.7.
//
Процедура Релиз1_0_5_7() Экспорт
	
	ОбновитьДополнительныеОбработки();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УправлениеПриборамиУчета.Ссылка
		|ИЗ
		|	Документ.УправлениеПриборамиУчета КАК УправлениеПриборамиУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаменаПриборовУчета.Ссылка
		|ИЗ
		|	Документ.ЗаменаПриборовУчета КАК ЗаменаПриборовУчета";

	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаУправленияПУ = Результат[0].Выбрать();
	ТаблицаЗаменыПУ = Результат[1].Выбрать();
	
	Пока ТаблицаЗаменыПУ.Следующий() Цикл
		ДокументОбъект =  ТаблицаЗаменыПУ.Ссылка.ПолучитьОбъект();
		Для Каждого Строка Из ДокументОбъект.Основная Цикл
			Строка.ВидТарифаПредыдущий  = Перечисления.ВидыТарифов.Общий;
			
			Строка.ВидТарифаНовый = Перечисления.ВидыТарифов.Общий;
		КонецЦикла;
		Попытка 
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Пока ТаблицаУправленияПУ.Следующий() Цикл
		ДокументОбъект =  ТаблицаУправленияПУ.Ссылка.ПолучитьОбъект();
		Для Каждого Строка Из ДокументОбъект.ПриборыУчета Цикл
			Строка.ВидТарифа  = Перечисления.ВидыТарифов.Общий;
			
		КонецЦикла;
		Попытка 
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			
		КонецПопытки;
	КонецЦикла;
	
		

	
	
КонецПроцедуры

// Процедура обновления резиза 1.0.5.8.
//
Процедура Релиз1_0_5_8() Экспорт
	
	ОбновитьДополнительныеОбработки();
	
	//Перенесем данные по расчетам льгот и субсидий в справочник организаций
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыУслуг.Ссылка КАК ВидУслуги,
	               |	ВидыУслуг.Наименование,
	               |	ВидыУслуг.КонтрагентДляРасчетаПоЛьготам КАК КонтрагентЛьгота,
	               |	ВидыУслуг.ДоговорДляРасчетаПоЛьготам КАК ДоговорЛьгота,
	               |	ВидыУслуг.КонтрагентДляРасчетаПоСубсидиям КАК КонтрагентСубсидия,
	               |	ВидыУслуг.ДоговорДляРасчетаПоСубсидиям КАК ДоговорСубсидия
	               |ИЗ
	               |	Справочник.ВидыУслуг КАК ВидыУслуг";
	Результат = Запрос.Выполнить().выгрузить();	
	
	ВыборкаОрганизации = Справочники.Организации.Выбрать();
	Пока ВыборкаОрганизации.Следующий() Цикл
		ОбъектОрганизация = ВыборкаОрганизации.Ссылка.ПолучитьОбъект();
		ОбъектОрганизация.ТабличнаяКонтрагентовДляСубсидийИЛьгот.Очистить();
		ОбъектОрганизация.ТабличнаяКонтрагентовДляСубсидийИЛьгот.Загрузить(Результат);
		ОбъектОрганизация.Записать();
	КонецЦикла; 	
	
	
		
КонецПроцедуры

// Процедура обновления резиза 1.0.5.9.
//
Процедура Релиз1_0_5_9() Экспорт
	
	ОбновитьДополнительныеОбработки();
			
КонецПроцедуры

// Процедура обновления резиза 1.0.6.1.
//
Процедура Релиз1_0_6_1() Экспорт
	
	ОбновитьДополнительныеОбработки();
	
	КлавиатураВозврат = Справочники.КлавиатурыTelegram.ВозвратВСтартru.ПолучитьОбъект();
	КнопкаВозврат = КлавиатураВозврат.Состав.Добавить();
	КнопкаВозврат.Текст = "Вернуться в главное меню";
	КнопкаВозврат.ВозвращаемоеЗначение = "/start";
	КлавиатураВозврат.Записать();
	
	КлавиатураМеню = Справочники.КлавиатурыTelegram.МенюStartru.ПолучитьОбъект(); 
	КнопкаМеню1 = КлавиатураМеню.Состав.Добавить();
	КнопкаМеню1.Текст = "Долги";
	КнопкаМеню1.ВозвращаемоеЗначение = "hv_debts";
	КнопкаМеню2 = КлавиатураМеню.Состав.Добавить();
	КнопкаМеню2.Текст = "Голосование";
	КнопкаМеню2.ВозвращаемоеЗначение = "hv_voting";
	КнопкаМеню3 = КлавиатураМеню.Состав.Добавить();
	КнопкаМеню3.Текст = "Счетчики";
	КнопкаМеню3.ВозвращаемоеЗначение = "hv_give_indications";
	КлавиатураМеню.Записать();
	
	КлавиатураРег = Справочники.КлавиатурыTelegram.УспешнаяРегистрацияru.ПолучитьОбъект();
	КнопкаРег = КлавиатураРег.Состав.Добавить();
	КнопкаРег.Текст = "Продолжить";
	КнопкаРег.ВозвращаемоеЗначение = "/start";
	КлавиатураРег.Записать();

КонецПроцедуры

// Процедура обновления резиза 1.0.6.2.
//
Процедура Релиз1_0_6_2() Экспорт
	
	
	ОбновитьДополнительныеОбработки();

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗданияИСооружения.Ссылка КАК Здание,
		|	ЗданияИСооружения.ДатаВводаВЭксплуатацию,
		|	ЗданияИСооружения.Наименование КАК ЗданиеАдрес
		|ИЗ
		|	Справочник.ЗданияИСооружения КАК ЗданияИСооружения
		|ГДЕ
		|	ЗданияИСооружения.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗданиеОбъект  = ВыборкаДетальныеЗаписи.Здание.ПолучитьОбъект();
		ЗданиеОбъект.ДатаНачалаУчета = ВыборкаДетальныеЗаписи.ДатаВводаВЭксплуатацию;
		Попытка
		
			ЗданиеОбъект.Записать();
		
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Не удалось установить дату начала учета для здания "+ВыборкаДетальныеЗаписи.ЗданиеАдрес+"! Установите вручную';
			|uk = 'Не вдалося встановити дату початку обліку для будівлі "+ВыборкаДетальныеЗаписи.ЗданиеАдрес+"! Встановіть вручну'");
			Сообщение.Сообщить(); 
		КонецПопытки;
	КонецЦикла;
	
	
	ТаблицаПерерасчета = Новый ТаблицаЗначений;
	ТаблицаПерерасчета.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("СправочникСсылка.ЛицевыеСчета"));	
	ТаблицаПерерасчета.Колонки.Добавить("Услуга", Новый ОписаниеТипов("СправочникСсылка.Услуги"));	
	ТаблицаПерерасчета.Колонки.Добавить("СуммаНачислено", Новый ОписаниеТипов("Число"));	
	ТаблицаПерерасчета.Колонки.Добавить("СуммаТекущийРасчет", Новый ОписаниеТипов("Число"));	
	ТаблицаПерерасчета.Колонки.Добавить("СуммаПерерасчета", Новый ОписаниеТипов("Число"));
	ТаблицаПерерасчета.Колонки.Добавить("СуммаСубсидии", Новый ОписаниеТипов("Число"));
	ТаблицаПерерасчета.Колонки.Добавить("СуммаЛьготы", Новый ОписаниеТипов("Число"));
	ТаблицаПерерасчета.Колонки.Добавить("ПредыдущаяСуммаЛьготы", Новый ОписаниеТипов("Число"));
	ТаблицаПерерасчета.Колонки.Добавить("МесяцНачисления", Новый ОписаниеТипов("Дата"));
	ТаблицаПерерасчета.Колонки.Добавить("ВидНачисления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНачислений"));
	
	ТаблицаПериодыПерерасчета = Новый ТаблицаЗначений;
	ТаблицаПериодыПерерасчета.Колонки.Добавить("ПериодНачисления", Новый ОписаниеТипов("Дата"));
	
	ПервыйДокумент = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПерерасчетПоЛСПерерасчет.Ссылка.ПериодНачисленияНачало КАК ПериодНачисленияНачало,
	|	ПерерасчетПоЛСПерерасчет.Ссылка.ПериодНачисленияОкончание КАК ПериодНачисленияОкончание,
	|	ПерерасчетПоЛСПерерасчет.Ссылка КАК Ссылка,
	|	ПерерасчетПоЛСПерерасчет.Услуга,
	|	ПерерасчетПоЛСПерерасчет.ЛицевойСчет,
	|	ПерерасчетПоЛСПерерасчет.СуммаНачислено КАК СуммаНачислено,
	|	ПерерасчетПоЛСПерерасчет.СуммаТекущийРасчет,
	|	ПерерасчетПоЛСПерерасчет.ВидНачисления КАК ВидНачисления,
	|	ПерерасчетПоЛСПерерасчет.СуммаПерерасчета КАК СуммаПерерасчета,
	|	ПерерасчетПоЛСПерерасчет.МесяцНачисления
	|ИЗ
	|	Документ.ПерерасчетПоЛС.Перерасчет КАК ПерерасчетПоЛСПерерасчет
	|ГДЕ
	|	ПерерасчетПоЛСПерерасчет.Ссылка.Проведен = ИСТИНА
	|	И ПерерасчетПоЛСПерерасчет.Ссылка.ВидОперации <> &ВидОперации
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПерерасчетПоЛСПерерасчет.Ссылка.Дата
	|ИТОГИ
	|	МАКСИМУМ(ПериодНачисленияНачало),
	|	МАКСИМУМ(ПериодНачисленияОкончание),
	|	МАКСИМУМ(ВидНачисления),
	|	СУММА(СуммаПерерасчета)
	|ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийПерерасчетПоЛС.ИнвентаризацияАвансов);
	//Запрос.УстановитьПараметр("Ссылка", ДокПерерасчет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		
		Если ВыборкаСсылка.ВидНачисления = Перечисления.ВидыНачислений.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыНакопления.РасчетыПоЛицевымСчетам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаСсылка.Ссылка);
		НаборЗаписей.Отбор.Регистратор.Использование = Истина;
		
		ИтогДокумента = ВыборкаСсылка.СуммаПерерасчета; 
		
		НачалоПериода = НачалоМесяца(ВыборкаСсылка.ПериодНачисленияНачало);	
		КонецПериода = КонецМесяца(ВыборкаСсылка.ПериодНачисленияОкончание);	
		ТаблицаПериодыПерерасчета.Очистить();
		ТаблицаПерерасчета.Очистить();
		
		
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			 
			Если ВыборкаДетальныеЗаписи.ВидНачисления = Перечисления.ВидыНачислений.Перерасчет и Не ПервыйДокумент Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаПерерасчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
			ПервыйДокумент = Ложь;
		КонецЦикла;
		
		ТаблицаПерерасчета.Сортировать("ЛицевойСчет");
		
		Если НЕ ПервыйДокумент Тогда
			
			ТекДата = НачалоПериода;
			Пока ТекДата < КонецПериода Цикл
				НоваяСтрока = ТаблицаПериодыПерерасчета.Добавить();
				НоваяСтрока.ПериодНачисления = ТекДата;
				ТекДата = ДобавитьМесяц(ТекДата, 1);
			КонецЦикла;
			
			ТаблицаПоЛС = ТаблицаПерерасчета.Скопировать(,"ЛицевойСчет");
			ТаблицаПоЛС.Свернуть("ЛицевойСчет");
			
			МассивЛС = ТаблицаПоЛС.ВыгрузитьКолонку("ЛицевойСчет");
			
			Перерасчеты = 0;
			
			Для каждого СтрокаТаб Из ТаблицаПериодыПерерасчета Цикл
				
				СтруктураДляРасчета = Новый Структура;
				
				СтруктураДляРасчета.Вставить("ЛицевыеСчета", МассивЛС); 
				СтруктураДляРасчета.Вставить("ПериодНачисления", СтрокаТаб.ПериодНачисления);
				СтруктураДляРасчета.Вставить("Услуга", ВыборкаСсылка.ссылка.Услуга); 
				СтруктураДляРасчета.Вставить("Ссылка", ВыборкаСсылка.ссылка); 
				
				ТаблицаНачисленийСтарые = ПолучитьСтарыеСуммыНачислений(СтруктураДляРасчета);
				
				ТаблицаНачисленийСтарые.Свернуть("ЛицевойСчет,Услуга,МесяцНачисления,ВидНачисления,ВидНачисленияПерерасчет","СуммаНачислено");
				Перерасчеты = Перерасчеты + ТаблицаНачисленийСтарые.Итог("СуммаНачислено");
				
				Для Каждого СтрокаТабПерерасчет из ТаблицаНачисленийСтарые Цикл
					Если СтрокаТабПерерасчет.ВидНачисленияПерерасчет <> Перечисления.ВидыНачислений.Перерасчет Тогда
						Продолжить;
					КонецЕсли;
					НоваяСтрока = ТаблицаПерерасчета.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТабПерерасчет);
					
					НоваяСтрока.СуммаПерерасчета = НоваяСтрока.СуммаТекущийРасчет - НоваяСтрока.СуммаНачислено;
				КонецЦикла; 	
				
				
			КонецЦикла; 
			
		КонецЕсли;	
		
		
		
		Запрос = Новый Запрос;
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц =  МенеджерВременныхТаблиц;
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаПерерасчета.ЛицевойСчет,
		|	ТаблицаПерерасчета.Услуга,
		|	ТаблицаПерерасчета.МесяцНачисления,
		|	&Организация КАК Организация,
		|	ТаблицаПерерасчета.СуммаПерерасчета КАК Сумма,
		|	&Период КАК Период,
		|	ТаблицаПерерасчета.ВидНачисления
		|ПОМЕСТИТЬ ВременнаяТаблицаПерерасчет
		|ИЗ
		|	&ТаблицаПерерасчета КАК ТаблицаПерерасчета";
		Запрос.УстановитьПараметр("ТаблицаПерерасчета",ТаблицаПерерасчета);
		Запрос.УстановитьПараметр("Организация",ВыборкаСсылка.Ссылка.Организация);
		Запрос.УстановитьПараметр("Период", ВыборкаСсылка.Ссылка.МоментВремени().Дата);
		Запрос.Выполнить();	
		
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Перерасчет.Организация КАК Организация,
		|	Перерасчет.ЛицевойСчет,
		|	Перерасчет.Услуга,
		|	Перерасчет.МесяцНачисления,
		|	Перерасчет.Сумма КАК Сумма,
		|	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток,
		|	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) + ЕСТЬNULL(Перерасчет.Сумма, 0) КАК СуммаАванс,
		|	&Период КАК Период,
		|	&Регистратор
		|ПОМЕСТИТЬ ВременнаяТаблицаАвансы
		|ИЗ
		|	ВременнаяТаблицаПерерасчет КАК Перерасчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(&Период, ) КАК РасчетыПоЛицевымСчетамОстатки
		|		ПО Перерасчет.Организация = РасчетыПоЛицевымСчетамОстатки.Организация
		|			И Перерасчет.ЛицевойСчет = РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет
		|			И Перерасчет.Услуга = РасчетыПоЛицевымСчетамОстатки.Услуга
		|			И Перерасчет.МесяцНачисления = РасчетыПоЛицевымСчетамОстатки.МесяцНачисления
		|ГДЕ
		|	Перерасчет.Сумма < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаАвансы.Организация КАК Организация,
		|	ВременнаяТаблицаАвансы.ЛицевойСчет КАК ЛицевойСчет,
		|	ВременнаяТаблицаАвансы.Услуга КАК Услуга,
		|	ВременнаяТаблицаАвансы.МесяцНачисления КАК МесяцНачисления,
		|	ВременнаяТаблицаАвансы.СуммаАванс КАК Сумма,
		|	ВременнаяТаблицаАвансы.Период КАК Период,
		|	NULL КАК ВидНачисления,
		|	ВременнаяТаблицаАвансы.Регистратор,
		|	NULL КАК ВидНачисленияПерерасчет
		|ИЗ
		|	ВременнаяТаблицаАвансы КАК ВременнаяТаблицаАвансы
		|ГДЕ
		|	ВременнаяТаблицаАвансы.СуммаАванс < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ВременнаяТаблицаАвансы.Организация,
		|	ВременнаяТаблицаАвансы.ЛицевойСчет,
		|	ВременнаяТаблицаАвансы.Услуга,
		|	NULL,
		|	-ВременнаяТаблицаАвансы.СуммаАванс,
		|	ВременнаяТаблицаАвансы.Период,
		|	NULL,
		|	ВременнаяТаблицаАвансы.Регистратор,
		|	NULL
		|ИЗ
		|	ВременнаяТаблицаАвансы КАК ВременнаяТаблицаАвансы
		|ГДЕ
		|	ВременнаяТаблицаАвансы.СуммаАванс < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ВременнаяТаблицаПерерасчет.Организация,
		|	ВременнаяТаблицаПерерасчет.ЛицевойСчет,
		|	ВременнаяТаблицаПерерасчет.Услуга,
		|	ВременнаяТаблицаПерерасчет.МесяцНачисления,
		|	ВременнаяТаблицаПерерасчет.Сумма,
		|	ВременнаяТаблицаПерерасчет.Период,
		|	ВременнаяТаблицаПерерасчет.ВидНачисления,
		|	&Регистратор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
		|ИЗ
		|	ВременнаяТаблицаПерерасчет КАК ВременнаяТаблицаПерерасчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаАвансы";
		
		Запрос.УстановитьПараметр("Период", ВыборкаСсылка.Ссылка.МоментВремени().Дата);
		Запрос.УстановитьПараметр("Регистратор", ВыборкаСсылка.Ссылка);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ДляДвижения = РезультатЗапроса[1].Выгрузить();
		
		Для каждого СтрокаДвижения Из ДляДвижения Цикл
			
			Если  СтрокаДвижения.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;	
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,СтрокаДвижения);
		
			
		КонецЦикла; 
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	ЗапросТариф = Новый Запрос;
	ЗапросТариф.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                     |	УправлениеТарифами.Ссылка
	                     |ИЗ
	                     |	Документ.УправлениеТарифами КАК УправлениеТарифами
	                     |ГДЕ
	                     |	УправлениеТарифами.Проведен = ИСТИНА";
	РезультатТариф = ЗапросТариф.Выполнить();
	Если Не РезультатТариф.Пустой() Тогда
		ВыборкаТариф = РезультатТариф.Выбрать();
		Пока ВыборкаТариф.Следующий() Цикл
			НаборЗаписейТариф = РегистрыСведений.Тарифы.СоздатьНаборЗаписей();
			НаборЗаписейТариф.Отбор.Регистратор.Установить(ВыборкаТариф.Ссылка);
			НаборЗаписейТариф.Отбор.Регистратор.Использование = Истина;
			НаборЗаписейТариф.Прочитать();
			
			Для каждого Запись Из НаборЗаписейТариф Цикл
			
				Запись.ЗначениеТарифаЛьгота = Запись.ЗначениеТарифа;
				Запись.ЗначениеТарифаПоНормеЛьгота = Запись.ЗначениеТарифаПоНорме;
			
			КонецЦикла; 
	        НаборЗаписейТариф.Записать();
		КонецЦикла;
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Организация
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОрганизации = РезультатЗапроса.Выбрать();
	
	Если ВыборкаОрганизации.Количество() = 1 Тогда
		ВыборкаОрганизации.Следующий();
	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Кассы.Ссылка КАК Касса
			|ИЗ
			|	Справочник.Кассы КАК Кассы
			|ГДЕ
			|	Кассы.ПометкаУдаления = ЛОЖЬ";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				КАсса = ВыборкаДетальныеЗаписи.Касса.ПолучитьОбъект();
				КАсса.Организация = ВыборкаОрганизации.Организация;
				КАсса.Ответственный = Пользователи.АвторизованныйПользователь();
				КАсса.Записать();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;


	
КонецПроцедуры

// Процедура обновления резиза 1.0.6.3.
//
Процедура Релиз1_0_6_3() Экспорт
	
	ОбновитьДополнительныеОбработки();

КонецПроцедуры

// Процедура обновления резиза 1.0.6.4.
//
Процедура Релиз1_0_6_4() Экспорт
	
	ОбновитьДополнительныеОбработки();	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
		|	ЛицевыеСчета.Идентификатор
		|ИЗ
		|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЛицевойСчетОбъект  = ВыборкаДетальныеЗаписи.ЛицевойСчет.ПолучитьОбъект();
		ЛицевойСчетОбъект.ПарольДоступа = ВыборкаДетальныеЗаписи.Идентификатор;
		ЛицевойСчетОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			ЛицевойСчетОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Шаблон = Справочники.ШаблоныТекстовПисем.ШаблонРассылкиДоступовНаСайтХВОЯ.ПолучитьОбъект();
	Шаблон.ТемаПисьма =  НСтр("ru='Параметры подключения к услуге ""ХВОЯ:Сайт ЖКХ""';uk='Параметри підключення до послуги ""ХВОЯ: Сайт ЖКГ""'");

	Шаблон.ТекстПисьма = НСтр("ru='
				|Адрес сайта: " + "[АдресСайта]" + "
				|Логин: " + "[ЛогинДоступа]" + "
				|Пароль:  " + "[ПарольДоступа]" + "'");
	Шаблон.Записать();

	
КонецПроцедуры

// Процедура обновления резиза 1.0.7.1.
//
Процедура Релиз1_0_7_1() Экспорт
	
	ОбновитьДополнительныеОбработки();
	//+Петров
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиТелеграмм.idПользователя,
		|	ПользователиТелеграмм.КодЯзыка
		|ИЗ
		|	РегистрСведений.ПользователиТелеграмм КАК ПользователиТелеграмм";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.КодЯзыка) Тогда
			НаборЗаписи = РегистрыСведений.ПользователиТелеграмм.СоздатьНаборЗаписей();
			НаборЗаписи.Отбор.idПользователя.Установить(ВыборкаДетальныеЗаписи.idПользователя);
			НаборЗаписи.Прочитать();
			Если НаборЗаписи.Количество() > 0 Тогда
				Для каждого ЗаписьНабора из НаборЗаписи Цикл
				    ЗаписьНабора.КодЯзыка = "ru";
				КонецЦикла;
			НаборЗаписи.Записать();
			КонецЕсли
		КонецЕсли;
	КонецЦикла;
	
	КлавиатураВозвратru = Справочники.КлавиатурыTelegram.ВозвратВСтартru.ПолучитьОбъект();
	КлавиатураВозвратru.Состав.Очистить();
	КнопкаВозвратru = КлавиатураВозвратru.Состав.Добавить();
	КнопкаВозвратru.Текст = "Вернуться в главное меню";
	КнопкаВозвратru.ВозвращаемоеЗначение = "/start";
	КлавиатураВозвратru.Записать();
	
	КлавиатураВозвратuk = Справочники.КлавиатурыTelegram.ВозвратВСтартuk.ПолучитьОбъект();
	КлавиатураВозвратuk.Состав.Очистить();
	КнопкаВозвратuk = КлавиатураВозвратuk.Состав.Добавить();
	КнопкаВозвратuk.Текст = "Повернутися до головного меню";
	КнопкаВозвратuk.ВозвращаемоеЗначение = "/start";
	КлавиатураВозвратuk.Записать();
	
	КлавиатураМенюru = Справочники.КлавиатурыTelegram.МенюStartru.ПолучитьОбъект(); 
	КлавиатураМенюru.Состав.Очистить();
	КнопкаМеню1ru = КлавиатураМенюru.Состав.Добавить();
	КнопкаМеню1ru.Текст = "Долги";
	КнопкаМеню1ru.ВозвращаемоеЗначение = "/hv_debts";
	КнопкаМеню2ru = КлавиатураМенюru.Состав.Добавить();
	КнопкаМеню2ru.Текст = "Голосование";
	КнопкаМеню2ru.ВозвращаемоеЗначение = "/hv_voting";
	КнопкаМеню3ru = КлавиатураМенюru.Состав.Добавить();
	КнопкаМеню3ru.Текст = "Счетчики";
	КнопкаМеню3ru.ВозвращаемоеЗначение = "/hv_indication";
	КнопкаМеню4ru = КлавиатураМенюru.Состав.Добавить();
	КнопкаМеню4ru.Текст = "Язык";
	КнопкаМеню4ru.ВозвращаемоеЗначение = "/hv_language";
	КлавиатураМенюru.Записать();
	
	КлавиатураМенюuk = Справочники.КлавиатурыTelegram.МенюStartuk.ПолучитьОбъект(); 
	КлавиатураМенюuk.Состав.Очистить();
	КнопкаМеню1uk = КлавиатураМенюuk.Состав.Добавить();
	КнопкаМеню1uk.Текст = "Борги";
	КнопкаМеню1uk.ВозвращаемоеЗначение = "/hv_debts";
	КнопкаМеню2uk = КлавиатураМенюuk.Состав.Добавить();
	КнопкаМеню2uk.Текст = "Голосування";
	КнопкаМеню2uk.ВозвращаемоеЗначение = "/hv_voting";
	КнопкаМеню3uk = КлавиатураМенюuk.Состав.Добавить();
	КнопкаМеню3uk.Текст = "Лічильники";
	КнопкаМеню3uk.ВозвращаемоеЗначение = "/hv_indication";
	КнопкаМеню4uk = КлавиатураМенюuk.Состав.Добавить();
	КнопкаМеню4uk.Текст = "Мова";
	КнопкаМеню4uk.ВозвращаемоеЗначение = "/hv_language";
	КлавиатураМенюuk.Записать();
	
	КлавиатураРегru = Справочники.КлавиатурыTelegram.УспешнаяРегистрацияru.ПолучитьОбъект();
	КлавиатураРегru.Состав.Очистить();
	КнопкаРегru = КлавиатураРегru.Состав.Добавить();
	КнопкаРегru.Текст = "Продолжить";
	КнопкаРегru.ВозвращаемоеЗначение = "/start";
	КлавиатураРегru.Записать();
	
	КлавиатураРегuk = Справочники.КлавиатурыTelegram.УспешнаяРегистрацияuk.ПолучитьОбъект();
	КлавиатураРегuk.Состав.Очистить();
	КнопкаРегuk = КлавиатураРегuk.Состав.Добавить();
	КнопкаРегuk.Текст = "Продовжити";
	КнопкаРегuk.ВозвращаемоеЗначение = "/start";
	КлавиатураРегuk.Записать();
	
	КлавиатураВводаПоказаний = Справочники.КлавиатурыTelegram.КнопкаВводаПоказаний.ПолучитьОбъект();
	КлавиатураВводаПоказаний.Состав.Очистить();
	КнопкаВводаПоказаний = КлавиатураВводаПоказаний.Состав.Добавить();
	КнопкаВводаПоказаний.Текст = "Ввести показання по приладу";
	КнопкаВводаПоказаний.ВозвращаемоеЗначение = "/virtual_button";
	КлавиатураВводаПоказаний.Записать();

	КлавиатураСчётчикиru = Справочники.КлавиатурыTelegram.Счетчикиru.ПолучитьОбъект(); 
	КлавиатураСчётчикиru.Состав.Очистить();
	КнопкаСчётчики1ru = КлавиатураСчётчикиru.Состав.Добавить();
	КнопкаСчётчики1ru.Текст = "Показания счётчиков";
	КнопкаСчётчики1ru.ВозвращаемоеЗначение = "/hv_show_indication";
	КнопкаСчётчики2ru = КлавиатураСчётчикиru.Состав.Добавить();
	КнопкаСчётчики2ru.Текст = "Ввод показаний счётчиков";
	КнопкаСчётчики2ru.ВозвращаемоеЗначение = "/hv_input_indication";
	КнопкаСчётчики3ru = КлавиатураСчётчикиru.Состав.Добавить();
	КнопкаСчётчики3ru.Текст = "Вернуться в главное меню";
	КнопкаСчётчики3ru.ВозвращаемоеЗначение = "/start";
	КлавиатураСчётчикиru.Записать();
	
	КлавиатураСчётчикиuk = Справочники.КлавиатурыTelegram.Счетчикиuk.ПолучитьОбъект(); 
	КлавиатураСчётчикиuk.Состав.Очистить();
	КнопкаСчётчики1uk = КлавиатураСчётчикиuk.Состав.Добавить();
	КнопкаСчётчики1uk.Текст = "Показання Лічильників";
	КнопкаСчётчики1uk.ВозвращаемоеЗначение = "/hv_show_indication";
	КнопкаСчётчики2uk = КлавиатураСчётчикиuk.Состав.Добавить();
	КнопкаСчётчики2uk.Текст = "Введення показань лічильників";
	КнопкаСчётчики2uk.ВозвращаемоеЗначение = "/hv_input_indication";
	КнопкаСчётчики3uk = КлавиатураСчётчикиuk.Состав.Добавить();
	КнопкаСчётчики3uk.Текст = "Повернутися до головного меню";
	КнопкаСчётчики3uk.ВозвращаемоеЗначение = "/start";
	КлавиатураСчётчикиuk.Записать();
	
	КлавиатураЯзыкПользователяТелеграмм = Справочники.КлавиатурыTelegram.ЯзыкПользователяТелеграмм.ПолучитьОбъект();
	КлавиатураЯзыкПользователяТелеграмм.Состав.Очистить();
	КнопкаВводаЯзыкаПользователяТелеграмм1 = КлавиатураЯзыкПользователяТелеграмм.Состав.Добавить();
	КнопкаВводаЯзыкаПользователяТелеграмм1.Текст = "Русский";
	КнопкаВводаЯзыкаПользователяТелеграмм1.ВозвращаемоеЗначение = "/ru_language";
	КнопкаВводаЯзыкаПользователяТелеграмм2 = КлавиатураЯзыкПользователяТелеграмм.Состав.Добавить();
	КнопкаВводаЯзыкаПользователяТелеграмм2.Текст = "Український";
	КнопкаВводаЯзыкаПользователяТелеграмм2.ВозвращаемоеЗначение = "/uk_language";
	КлавиатураЯзыкПользователяТелеграмм.Записать();
	//-Петров

	
КонецПроцедуры

// Процедура обновления резиза 1.0.7.2.
//
Процедура Релиз1_0_7_2() Экспорт
	
	ОбновитьДополнительныеОбработки();
	
КонецПроцедуры

// Процедура обновления резиза 1.0.8.1.
//
Процедура Релиз1_0_8_1() Экспорт
	
	ОбновитьДополнительныеОбработки();
	
	НаборЗаписей = РегистрыСведений.СостоянияОбменовДаннымиХвояСайтЖКХ.СоздатьНаборЗаписей();	
	НаборЗаписей.Прочитать();
			
	Для Каждого СтрокаНабораЗаписей Из НаборЗаписей Цикл 
		СтрокаНабораЗаписей.Организация = СтрокаНабораЗаписей.ЛицевойСчет.Владелец.Организация;
	КонецЦикла;
		
	НаборЗаписей.Записать();
	
	
	СтруктураНастройки = Константы.НастройкаОбменДаннымиХвояСайтЖКХ.Получить().Получить();
	Если ТипЗнч(СтруктураНастройки) = Тип("Структура") Тогда
		
		ТаблицаНастройки = Новый ТаблицаЗначений;
		ТаблицаНастройки.Колонки.Добавить("ФТППароль", Новый ОписаниеТипов("Строка"));	
		ТаблицаНастройки.Колонки.Добавить("ФТПЛогин", Новый ОписаниеТипов("Строка"));	
		ТаблицаНастройки.Колонки.Добавить("ФТПСервер", Новый ОписаниеТипов("Строка"));	
		ТаблицаНастройки.Колонки.Добавить("ФТППассивныйРежим", Новый ОписаниеТипов("Булево"));	
		ТаблицаНастройки.Колонки.Добавить("ДатаНачалаВыгрузкиНаСайт", Новый ОписаниеТипов("Дата"));	
		ТаблицаНастройки.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));	
		ТаблицаНастройки.Колонки.Добавить("ФТПУдаленныйКаталог", Новый ОписаниеТипов("Строка"));	
		ТаблицаНастройки.Колонки.Добавить("АдресСайта", Новый ОписаниеТипов("Строка"));	
		ТаблицаНастройки.Колонки.Добавить("КоличесвоЛицевыхСчетовВПакете", Новый ОписаниеТипов("Число"));	
		
		НоваяСтрока = ТаблицаНастройки.Добавить();
		
		НоваяСтрока.ФТППароль = СтруктураНастройки.Пароль;	
		НоваяСтрока.ФТПЛогин = СтруктураНастройки.Логин;	
		НоваяСтрока.ФТПСервер = СтруктураНастройки.Сервер;	
		НоваяСтрока.ФТППассивныйРежим = СтруктураНастройки.ПассивныйРежим;
		НоваяСтрока.ДатаНачалаВыгрузкиНаСайт = СтруктураНастройки.ДатаНачалаВыгрузкиНаСайт;
		НоваяСтрока.Организация = СтруктураНастройки.Организация;
		Попытка
		НоваяСтрока.ФТПУдаленныйКаталог = СтруктураНастройки.УдаленныйКаталог;	
		Исключение
		КонецПопытки;
		Попытка
		НоваяСтрока.АдресСайта = СтруктураНастройки.АдресСайта;	
		Исключение
		КонецПопытки;
		Попытка
		НоваяСтрока.КоличесвоЛицевыхСчетовВПакете = СтруктураНастройки.КоличесвоЛицевыхСчетовВПакете;	
		Исключение
		КонецПопытки;
		
		Константы.НастройкаОбменДаннымиХвояСайтЖКХ.Установить(Новый ХранилищеЗначения(ТаблицаНастройки));
		
	КонецЕсли;
	
	ЭлектроннаяПочта.ЗаполнитьНовыеРеквизитыУчетныхЗаписей();
	
	//Обновление коэффициентов для вторичных услуг по ПУ
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УслугиСоставныеУслуги.Ссылка КАК УслугаОсновная
		|ИЗ
		|	Справочник.Услуги.СоставныеУслуги КАК УслугиСоставныеУслуги
		|ГДЕ
		|	УслугиСоставныеУслуги.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		УслугаОбъект = ВыборкаДетальныеЗаписи.УслугаОсновная.ПолучитьОбъект();
		Для каждого Строка Из УслугаОбъект.СоставныеУслуги Цикл
			
			Строка.Коэффициент = 1;
			
		КонецЦикла; 
		УслугаОбъект.Записать();
		
	КонецЦикла;
	
	////
	
	
	
КонецПроцедуры

// Процедура обновления резиза 1.0.9.1.
//
Процедура Релиз1_0_9_1() Экспорт
	
	ОбновитьДополнительныеОбработки();	
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПотребителиУслуг.Ссылка,
		|	ПотребителиУслуг.Пароль,
		|	ПотребителиУслуг.Логин
		|ИЗ
		|	Справочник.ПотребителиУслуг КАК ПотребителиУслуг
		|ГДЕ
		|	ПотребителиУслуг.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если  СокрЛП(ВыборкаДетальныеЗаписи.Логин)  = "" ИЛИ СокрЛП(ВыборкаДетальныеЗаписи.Пароль) = "" Тогда
			
			ОбъектПотребитель = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект();
			ЛогинПароль = Прав(ОбъектПотребитель.Код,5);
			ОбъектПотребитель.Логин = ЛогинПароль;
			ОбъектПотребитель.Пароль = ЛогинПароль;
			ОбъектПотребитель.Записать();

		КонецЕсли;
		
	КонецЦикла;
	
	

	
	
КонецПроцедуры

// Процедура обновления резиза 1.0.9.2.
//
Процедура Релиз1_0_9_2() Экспорт
	
	ОбновитьДополнительныеОбработки();	
	
	
КонецПроцедуры


Функция ПолучитьСтарыеСуммыНачислений(СтруктураДляРасчета) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыПоЛицевымСчетам.ЛицевойСчет,
	|	РасчетыПоЛицевымСчетам.Услуга,
	|	РасчетыПоЛицевымСчетам.МесяцНачисления,
	|	СУММА(РасчетыПоЛицевымСчетам.Сумма) КАК СуммаНачислено,
	|	РасчетыПоЛицевымСчетам.ВидНачисления,
	|	РасчетыПоЛицевымСчетам.ВидНачисленияПерерасчет
	|ИЗ
	|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	|ГДЕ
	|	РасчетыПоЛицевымСчетам.Период >= &ДатаНач
	|	И РасчетыПоЛицевымСчетам.Период <= &ДатаКон
	|	И РасчетыПоЛицевымСчетам.ЛицевойСчет В(&спЛицевыеСчета)
	|	И (РасчетыПоЛицевымСчетам.Услуга = &Услуга
	|			ИЛИ &Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка))
	|	И РасчетыПоЛицевымСчетам.МесяцНачисления = &ДатаНач
	|	И (РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	|			ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	|			ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	|			ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет))
	|	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И РасчетыПоЛицевымСчетам.Регистратор <> &Ссылка
	|	И РасчетыПоЛицевымСчетам.Сумма <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоЛицевымСчетам.ЛицевойСчет,
	|	РасчетыПоЛицевымСчетам.Услуга,
	|	РасчетыПоЛицевымСчетам.МесяцНачисления,
	|	РасчетыПоЛицевымСчетам.ВидНачисления,
	|	РасчетыПоЛицевымСчетам.ВидНачисленияПерерасчет";
	
	
	Запрос.УстановитьПараметр("ДатаНач",		НачалоМесяца(СтруктураДляРасчета.ПериодНачисления));
	Запрос.УстановитьПараметр("ДатаКон",		ТекущаяДата());
	Запрос.УстановитьПараметр("СпЛицевыеСчета", СтруктураДляРасчета.ЛицевыеСчета);
	Запрос.УстановитьПараметр("Услуга",			СтруктураДляРасчета.Услуга);
	Запрос.УстановитьПараметр("МесяцНачисления",СтруктураДляРасчета.ПериодНачисления);
	Запрос.УстановитьПараметр("Ссылка",			СтруктураДляРасчета.Ссылка);
	Запрос.УстановитьПараметр("ВидНачисленияПерерасчет",			Перечисления.ВидыНачислений.Перерасчет);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции


