////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КаталогДляСохраненияДанныхПечати = УправлениеПечатью.ПолучитьЛокальныйКаталогФайловПечати();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ПутьККаталогуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ДиалогОткрытияФайла.ПолноеИмяФайла = "";
		ДиалогОткрытияФайла.Каталог = КаталогДляСохраненияДанныхПечати;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите путь к каталогу для файлов печати.';uk='Виберіть шлях до каталогу для файлів печатки.'");
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			КаталогДляСохраненияДанныхПечати = ДиалогОткрытияФайла.Каталог + "\";
		КонецЕсли;
	Иначе
		Предупреждение(НСтр("ru='Для выбора каталога необходимо установить расширение для работы с файлами в Веб-клиенте.';uk=' Для вибору каталогу необхідно встановити розширення для роботи з файлами у Веб-клієнтові.'"));
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	УправлениеПечатью.СохранитьЛокальныйКаталогФайловПечати(КаталогДляСохраненияДанныхПечати);
	Закрыть(КаталогДляСохраненияДанныхПечати);
	
КонецПроцедуры
