Перем ЭтоНовый; // В переменной хранится признак нового элемента.

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ПриЗаписи.
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	// Заполним договор по умолчанию для нового контрагента, если он не заполнен.
	Если ЭтоНовый
	И НЕ ЭтоГруппа
	И НЕ ЗначениеЗаполнено(ДоговорПоУмолчанию) Тогда
		
		ЭтоНовый = Ложь;
		
		НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		
		НовыйДоговор.Наименование = "Основной договор";
		НовыйДоговор.Владелец = Ссылка;
		НовыйДоговор.Организация = ОСМДПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнаяОрганизация");
		НовыйДоговор.УстановитьНовыйКод();
		НовыйДоговор.ОбменДанными.Загрузка = Истина;
		
		НовыйДоговор.Записать();
		
		ДоговорПоУмолчанию = НовыйДоговор.Ссылка;
		Записать();
		
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ЭтоГруппа Тогда
		БанковскийСчетПоУмолчанию = Неопределено;
		ДоговорПоУмолчанию = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
