Процедура СменитьСтол(ВидРабочегоСтола = Неопределено) Экспорт
			
	Если ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.НачальныйРабочийСтол ИЛИ ВидРабочегоСтола = Неопределено Тогда 
		ЗаписатьПараметрыРабочегоСтола(Истина,,,,,,);
	ИначеЕсли ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.ГоризонтальныйРабочийСтол Тогда
		ЗаписатьПараметрыРабочегоСтола(,Истина,,,,,);
	ИначеЕсли ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.СтараяНачальнаяФорма Тогда
		ЗаписатьПараметрыРабочегоСтола(,,Истина,,,,);
	ИначеЕсли ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.РабочийСтолДиспетчера Тогда
		ЗаписатьПараметрыРабочегоСтола(,,,Истина,,,);
	ИначеЕсли ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.УправлениеВзаимодействиями Тогда
		ЗаписатьПараметрыРабочегоСтола(,,,,Истина,,);
	ИначеЕсли ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.РабочийСтлоПаспортиста Тогда
		ЗаписатьПараметрыРабочегоСтола(,,,,,Истина,);
	ИначеЕсли ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.СтолСправок Тогда
		ЗаписатьПараметрыРабочегоСтола(,,,,,,Истина);
	КонецЕсли;
	
	ЗаписатьНастройки(ВидРабочегоСтола);
КонецПроцедуры

Процедура ЗаписатьНастройки (ВидРабочегоСтола) Экспорт
	
	Если ВидРабочегоСтола =Неопределено Тогда
		ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.НачальныйРабочийСтол;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Пользователь.Использование = Истина;
	НаборЗаписей.Отбор.Пользователь.Значение      = Пользователи.АвторизованныйПользователь();
	НаборЗаписей.Отбор.Настройка.Использование = Истина;
	НаборЗаписей.Отбор.Настройка.Значение = ПланыВидовХарактеристик.НастройкиПользователей.РабочийСтол;
	
	Запись = НаборЗаписей.Добавить();

	Запись.Пользователь = Пользователи.АвторизованныйПользователь();
	Запись.Настройка    = ПланыВидовХарактеристик.НастройкиПользователей.РабочийСтол;
	Запись.Значение     = ВидРабочегоСтола;

			
	НаборЗаписей.Записать();
	
	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры

Функция  ПолучитьНастройкиСтола(ВидРабочегоСтола = Неопределено) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НастройкиПользователей.Пользователь,
	               |	НастройкиПользователей.Настройка,
	               |	ЕСТЬNULL(НастройкиПользователей.Значение, """") КАК Значение
	               |ИЗ
	               |	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	               |ГДЕ
	               |	НастройкиПользователей.Пользователь = &Пользователь
	               |	И НастройкиПользователей.Настройка = &Настройка";
	               
	Запрос.УстановитьПараметр("Пользователь",Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиПользователей.РабочийСтол);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	
	Возврат Результат.Значение

	

КонецФункции // ВозобновитьНастройкиСтола()


Процедура ЗаписатьПараметрыРабочегоСтола(НачальныйРабочийСтол = Ложь, РабочийСтолРасчетчика = Ложь, УстаревшийРабочийСтол = Ложь, РабочийСтолДиспетчера = Ложь, УправлениеВзаимодействиями = Ложь, РабочийСтолПаспортиста = Ложь, СтолСправок = Ложь)

	НаборЗаписей = РегистрыСведений.ХранилищеРабочихСтолов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Пользователь.Использование = Истина;
	НаборЗаписей.Отбор.Пользователь.Значение      = Пользователи.АвторизованныйПользователь();
	
	Запись = НаборЗаписей.Добавить();
	
	Запись.Пользователь = Пользователи.АвторизованныйПользователь();
	Запись.НачальныйРабочийСтол = НачальныйРабочийСтол;
	Запись.УстаревшийНачальныйСтол = УстаревшийРабочийСтол;
	Запись.РабочийСтолРасчетчика = РабочийСтолРасчетчика;
	Запись.РабочийСтолДиспетчера = РабочийСтолДиспетчера;
	Запись.РабочийСтолПаспортиста = РабочийСтолПаспортиста;
	Запись.УправлениеВзаимодействиями = УправлениеВзаимодействиями;
	Запись.СтолСправок = СтолСправок;
	
	НаборЗаписей.Записать();
	

КонецПроцедуры // ЗаписатьПараметрыРабочегоСтола()
