
&НаСервере
Процедура СформироватьОтчетНаСервере(ТабДок)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!
	
	Макет = Отчеты.ОтчетВодаКанализация.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредства.Сумма
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
		|ГДЕ
		|	ДенежныеСредства.Период МЕЖДУ &НачПериода И &КонПериода";
	
	Запрос.УстановитьПараметр("КонПериода", КонецДня(Отчет.КонПериода));
	Запрос.УстановитьПараметр("НачПериода", Отчет.НачПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ОбластьЗаголовок.Параметры.НачПериода = Отчет.НачПериода;
	ОбластьЗаголовок.Параметры.КонПериода = Отчет.КонПериода;
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ОбщаяСумма = 0;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбщаяСумма = ОбщаяСумма + ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	КвоКубов = ОбщаяСумма / 28.764;
	ОбластьДетальныхЗаписей.Параметры.СуммаВодоснабжение = КвоКубов * 12.192;
	ОбластьДетальныхЗаписей.Параметры.СуммаВодоотведение = ОбщаяСумма - (КвоКубов * 12.192);
	ТабДок.Вывести(ОбластьДетальныхЗаписей);
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ОбластьПодвалТаблицы.Параметры.Итог = ОбластьДетальныхЗаписей.Параметры.СуммаВодоснабжение + ОбластьДетальныхЗаписей.Параметры.СуммаВодоотведение;
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	ТабДок = Новый ТабличныйДокумент;
	СформироватьОтчетНаСервере(ТабДок);
	ТабДок.Показать();
КонецПроцедуры
