
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРасчетыПоЛицевымСчетам(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаРасшифровкаПлатежа.Период,
		|	ВременнаяТаблицаРасшифровкаПлатежа.Организация,
		|	ВременнаяТаблицаРасшифровкаПлатежа.ЛицевойСчет,
		|	ВременнаяТаблицаРасшифровкаПлатежа.Услуга,
		|	ВременнаяТаблицаРасшифровкаПлатежа.Сумма,
		|	ВременнаяТаблицаРасшифровкаПлатежа.МесяцНачисления,
		|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации
		|ИЗ
		|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
		|ГДЕ
		|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеВКассу.ОтЛицевогоСчета)";	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЛицевымСчетам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетыПоЛицевымСчетам()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуДенежныеСредстваВКассахККМ(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДенежныеСредстваВКассеККМ.Период КАК Период,
		|	ДенежныеСредстваВКассеККМ.Организация КАК Организация,
		|	ДенежныеСредстваВКассеККМ.КассаККМ КАК КассаККМ,
		|	СУММА(ДенежныеСредстваВКассеККМ.Сумма) КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблицаШапка.Период КАК Период,
		|		ВременнаяТаблицаШапка.Организация КАК Организация,
		|		ВременнаяТаблицаШапка.КассаККМ КАК КассаККМ,
		|		ВременнаяТаблицаШапка.СуммаДокумента КАК Сумма
		|	ИЗ
		|		ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВременнаяТаблицаОплатаПлатежнымиКартами.Период,
		|		ВременнаяТаблицаОплатаПлатежнымиКартами.Организация,
		|		ВременнаяТаблицаОплатаПлатежнымиКартами.КассаККМ,
		|		-ВременнаяТаблицаОплатаПлатежнымиКартами.Сумма
		|	ИЗ
		|		ВременнаяТаблицаОплатаПлатежнымиКартами КАК ВременнаяТаблицаОплатаПлатежнымиКартами) КАК ДенежныеСредстваВКассеККМ
		|
		|СГРУППИРОВАТЬ ПО
		|	ДенежныеСредстваВКассеККМ.Период,
		|	ДенежныеСредстваВКассеККМ.Организация,
		|	ДенежныеСредстваВКассеККМ.КассаККМ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваВКассахККМ", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуДенежныеСредстваВКассахККМ()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРасчетыПоЭквайрингу(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.Период,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.Организация,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.ЭквайринговыйТерминал,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.ВидПлатежнойКарты,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.НомерПлатежнойКарты,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.Сумма,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.Валюта,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.ДатаПлатежа,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.ТипДенежныхСредств,
		|	ВременнаяТаблицаОплатаПлатежнымиКартами.ЛицевойСчет
		|ИЗ
		|	ВременнаяТаблицаОплатаПлатежнымиКартами КАК ВременнаяТаблицаОплатаПлатежнымиКартами";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЭквайрингу", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетыПоЭквайрингу()

Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеВКассуРасшифровкаПлатежа.Ссылка.Дата КАК Период,
		|	ПоступлениеВКассуРасшифровкаПлатежа.Ссылка.Организация,
		|	ПоступлениеВКассуРасшифровкаПлатежа.Ссылка.ЛицевойСчет,
		|	ПоступлениеВКассуРасшифровкаПлатежа.Услуга,
		|	ПоступлениеВКассуРасшифровкаПлатежа.МесяцНачисления,
		|	ПоступлениеВКассуРасшифровкаПлатежа.Сумма,
		|	ПоступлениеВКассуРасшифровкаПлатежа.Ссылка.ВидОперации
		|ПОМЕСТИТЬ ВременнаяТаблицаРасшифровкаПлатежа
		|ИЗ
		|	Документ.ЧекККМ.РасшифровкаПлатежа КАК ПоступлениеВКассуРасшифровкаПлатежа
		|ГДЕ
		|	ПоступлениеВКассуРасшифровкаПлатежа.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеВКассу.Организация,
		|	ПоступлениеВКассу.ВидОперации,
		|	ПоступлениеВКассу.КассаККМ,
		|	ПоступлениеВКассу.ЛицевойСчет,
		|	ПоступлениеВКассу.СуммаДокумента,
		|	ПоступлениеВКассу.Дата КАК Период
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.ЧекККМ КАК ПоступлениеВКассу
		|ГДЕ
		|	ПоступлениеВКассу.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЧекККМОплатаПлатежнымиКартами.Ссылка.Организация,
		|	ЧекККМОплатаПлатежнымиКартами.Ссылка.КассаККМ,
		|	ЧекККМОплатаПлатежнымиКартами.Ссылка.ЭквайринговыйТерминал,
		|	ЧекККМОплатаПлатежнымиКартами.ВидПлатежнойКарты,
		|	ЧекККМОплатаПлатежнымиКартами.НомерПлатежнойКарты,
		|	ЧекККМОплатаПлатежнымиКартами.Сумма,
		|	ЧекККМОплатаПлатежнымиКартами.Ссылка.Валюта,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредствПоЭквайрингу.ПоступлениеПоПлатежнойКарте) КАК ТипДенежныхСредств,
		|	ЧекККМОплатаПлатежнымиКартами.Ссылка.Дата КАК Период,
		|	ЧекККМОплатаПлатежнымиКартами.Ссылка.Дата КАК ДатаПлатежа,
		|	ЧекККМОплатаПлатежнымиКартами.Ссылка.ЛицевойСчет
		|ПОМЕСТИТЬ ВременнаяТаблицаОплатаПлатежнымиКартами
		|ИЗ
		|	Документ.ЧекККМ.ОплатаПлатежнымиКартами КАК ЧекККМОплатаПлатежнымиКартами
		|ГДЕ
		|	ЧекККМОплатаПлатежнымиКартами.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЧекККМ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицуРасчетыПоЛицевымСчетам(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);
	СформироватьТаблицуДенежныеСредстваВКассахККМ(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);	
	СформироватьТаблицуРасчетыПоЭквайрингу(ДокументСсылкаЧекККМ, СтруктураДополнительныеСвойства);	
	
КонецПроцедуры

