
//////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает текущую версия механизма интеграции с сайтом.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьТекущуюВерсиюМеханизмаИнтеграции()
	
	Возврат "3";
	
КонецФункции // ПолучитьТекущуюВерсиюМеханизмаИнтеграции()

// Формирует текстовый файл и записывает в него строковое представление xml-файла.
//
// Параметры:
//  СтроковоеПредставление - Строка - строковое представление xml-файла.
//
// Возвращаемое значение:
//  Строка
//
Функция СформироватьТекстовыйФайл(СтроковоеПредставление)
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	
	ТекстовыйФайл = Новый ТекстовыйДокумент;
	ТекстовыйФайл.ДобавитьСтроку(СтроковоеПредставление);
	ТекстовыйФайл.Записать(ИмяФайла);
	
	Возврат ИмяФайла;
	
КонецФункции // СформироватьXMLФайл()

/////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ РЕГЛАМЕНТНЫХ ЗАДАНИЙ

// Процедура - обработчик регламентного задания "Обмен данными с сайтом".
//
// Параметры:
//  КодОбмена - СправочникСсылка.ВариантыОбменаДаннымиССайтом - вариант обмена.
//
Процедура ОбменДаннымиССайтом(КодОбмена) Экспорт
	
	Если КодОбмена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючВозврата = Неопределено;
	
	ВариантОбмена = Справочники.ВариантыОбменаДаннымиССайтом.НайтиПоКоду(КодОбмена);
	
	Если ВариантОбмена = Справочники.ВариантыОбменаДаннымиССайтом.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(ДатыЗапретаИзменения.ДатаЗапрета) КАК ДатаЗапрета
		|ИЗ
		|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения";
		
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		ДатаОбмена = НачалоМесяца(РезультатЗапроса.ДатаЗапрета);
	Иначе
		Возврат;
	КонецЕсли;
	
	ДатаОбмена = НачалоМесяца(РезультатЗапроса.ДатаЗапрета);
	
	Пока ДатаОбмена < ТекущаяДата() Цикл
		
		Если ДатаОбмена = НачалоМесяца(ТекущаяДата()) Тогда
			КлючВозврата = ВыполнитьОбменДаннымиССайтом(ВариантОбмена, , ТекущаяДата());
		Иначе
			КлючВозврата = ВыполнитьОбменДаннымиССайтом(ВариантОбмена, , КонецМесяца(ДатаОбмена));
		КонецЕсли;
		
		ДатаОбмена = ДобавитьМесяц(ДатаОбмена, 1);
		
	КонецЦикла;
	
	//Возврат КлючВозврата;
	
КонецПроцедуры // ОбменДаннымиССайтом()

// Процедура - обработчик регламентного задания "Обмен данными ХВОЯ: Сайт ЖКХ".
//
//
Процедура ОбменДаннымиХвояСайтЖКХ() Экспорт
	
	ТаблицаНастройки = Константы.НастройкаОбменДаннымиХвояСайтЖКХ.Получить().Получить();
	
	Если НЕ ТипЗнч(ТаблицаНастройки) = Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицаНастройки Из ТаблицаНастройки Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицаНастройки.ФТПСервер) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураНастройки = Новый Структура;
		СтруктураНастройки.Вставить("Пароль", СокрЛП(СтрокаТаблицаНастройки.ФТППароль));
		СтруктураНастройки.Вставить("Логин", СокрЛП(СтрокаТаблицаНастройки.ФТПЛогин));
		СтруктураНастройки.Вставить("Сервер", СокрЛП(СтрокаТаблицаНастройки.ФТПСервер));
		СтруктураНастройки.Вставить("УдаленныйКаталог", СокрЛП(СтрокаТаблицаНастройки.ФТПУдаленныйКаталог));
		СтруктураНастройки.Вставить("ПассивныйРежим", СтрокаТаблицаНастройки.ФТППассивныйРежим);
		СтруктураНастройки.Вставить("АдресСайта", СокрЛП(СтрокаТаблицаНастройки.АдресСайта));
		СтруктураНастройки.Вставить("ДатаНачалаВыгрузкиНаСайт", СтрокаТаблицаНастройки.ДатаНачалаВыгрузкиНаСайт);
		СтруктураНастройки.Вставить("Организация", СтрокаТаблицаНастройки.Организация);
		СтруктураНастройки.Вставить("КоличесвоЛицевыхСчетовВПакете", СтрокаТаблицаНастройки.КоличесвоЛицевыхСчетовВПакете);
		
		ПодготовкаВыгрузкиИстории(СтруктураНастройки);
		ОбменДаннымиХвояСайтЖКХ_Версия2(СтруктураНастройки);
		ОтметкаВыгрузкиИстории(СтруктураНастройки);
		
		
	КонецЦикла;
	
КонецПроцедуры // ОбменДаннымиХвояСайтЖКХ()

/////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОБМЕНА ДАННЫМИ ХВОЯ:Сайт ЖКХ

// Формирует массив всех л/с , действующих на выбранную дату.
//
Функция ПолучитьМассивЛицевыхСчетов(Организация, ДатаОбмена, МассивЗданий = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета.СрезПоследних(
		|			&ДатаКон,
		|			ЛицевойСчет.Владелец.Организация = &Организация
		|				И ВЫБОР
		|					КОГДА &Все
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛицевойСчет.Владелец В (&МассивЗданий)
		|				КОНЕЦ) КАК ЛицевыеСчетаСрезПоследних
		|ГДЕ
		|	ЛицевыеСчетаСрезПоследних.Действует
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета.Код";
		
	Запрос.УстановитьПараметр("ДатаКон",     КонецДня(ДатаОбмена));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("МассивЗданий", МассивЗданий);
	Если МассивЗданий = Неопределено Тогда
		Запрос.УстановитьПараметр("Все", Истина);
	Иначе
		Запрос.УстановитьПараметр("Все", Ложь);
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.ВыгрузитьКолонку("ЛицевойСчет");
	
КонецФункции // ПолучитьМассивЛицевыхСчетов()

Процедура ОбменДаннымиХвояСайтЖКХ_Версия2(СтруктураНастройки)
	
	ДатаВыгрузкиНаСайт = НачалоДня(ТекущаяДата());
	
	КодПоЕДРПОУ = СокрЛП(СтруктураНастройки.Организация.КодПоЕДРПОУ);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостоянияОбменовДаннымиХвояСайтЖКХ.ЛицевойСчет
		|ИЗ
		|	РегистрСведений.СостоянияОбменовДаннымиХвояСайтЖКХ КАК СостоянияОбменовДаннымиХвояСайтЖКХ
		|ГДЕ
		|	СостоянияОбменовДаннымиХвояСайтЖКХ.ДатаВыгрузки = &ДатаВыгрузки
		|	И СостоянияОбменовДаннымиХвояСайтЖКХ.Организация = &Организация";
		
	Запрос.УстановитьПараметр("ДатаВыгрузки", ДатаВыгрузкиНаСайт);
	Запрос.УстановитьПараметр("Организация", СтруктураНастройки.Организация);
	
	ЭтоНачалоВыгрузки = Запрос.Выполнить().Пустой();
	ВыгрузкаЗавершена = Истина;
	
	Попытка
		ПодключениеКФТП = Новый FTPСоединение(СтруктураНастройки.Сервер, , СтруктураНастройки.Логин, СтруктураНастройки.Пароль, , СтруктураНастройки.ПассивныйРежим, 0);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru='Обмен данными ХВОЯ:Сайт ЖКХ';uk='Обмін даними ХВОЯ: Сайт ЖКГ'"), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	МассивФайлов = ПодключениеКФТП.НайтиФайлы("/" +СтруктураНастройки.УдаленныйКаталог + "/export" + КодПоЕДРПОУ + ".txt");

	Если МассивФайлов.Количество() > 0 Тогда
		ФайлЛокальныйПриборыУчета = КаталогВременныхФайлов() + "export" + КодПоЕДРПОУ + ".txt";
		Попытка
			ПодключениеКФТП.Получить(МассивФайлов[0].ПолноеИмя, ФайлЛокальныйПриборыУчета);	
			Если ЗагрузитьДанныеПриборовУчета_Версия2(ФайлЛокальныйПриборыУчета) Тогда
				ПодключениеКФТП.Удалить("/" + СтруктураНастройки.УдаленныйКаталог + "/export" + КодПоЕДРПОУ + ".txt");	
			КонецЕсли;
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru='Обмен данными ХВОЯ:Сайт ЖКХ';uk='Обмін даними ХВОЯ: Сайт ЖКГ'"), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;
	
	МассивФайлов = ПодключениеКФТП.НайтиФайлы("/" + СтруктураНастройки.УдаленныйКаталог + "/","import" + КодПоЕДРПОУ + "*.txt");
	
	Если МассивФайлов.Количество() > 0 И НЕ ЭтоНачалоВыгрузки Тогда
		// не успели. Продолжим в следующем цикле
		Возврат;
		
	ИначеЕсли МассивФайлов.Количество() > 0 И ЭтоНачалоВыгрузки Тогда
		
		// не завершена предыдущая загрузка. Сообщить об ошибках
		
		ВыгрузкаЗавершена = Ложь;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыЗапретаИзменения.ДатаЗапрета КАК Период,
		|	ДатыЗапретаИзменения.Объект КАК Здание
		|ИЗ
		|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
		|ГДЕ
		|	ДатыЗапретаИзменения.Объект.Организация = &Организация
		|	И ДатыЗапретаИзменения.Раздел = &Раздел
		|	И НЕ ДатыЗапретаИзменения.Объект.ПометкаУдаления";
		
	Запрос.УстановитьПараметр("Организация", СтруктураНастройки.Организация);
	Запрос.УстановитьПараметр("Раздел", ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.Здания);
	
	ТаблицаЗдания = Запрос.Выполнить().Выгрузить();
	
	МассивЗданий_1 = ТаблицаЗдания.Скопировать(Новый Структура("Период",НачалоДня(КонецМесяца(ДобавитьМесяц(НачалоМесяца(ДатаВыгрузкиНаСайт), -1))))).ВыгрузитьКолонку("Здание");
	МассивЗданий_2 = ТаблицаЗдания.Скопировать(Новый Структура("Период",НачалоДня(КонецМесяца(ДобавитьМесяц(НачалоМесяца(ДатаВыгрузкиНаСайт), -2))))).ВыгрузитьКолонку("Здание");

	Если МассивЗданий_1.Количество() = 0 И МассивЗданий_2.Количество() = 0 Тогда
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Обмен данными ХВОЯ:Сайт ЖКХ';uk='Обмін даними ХВОЯ: Сайт ЖКГ'"), УровеньЖурналаРегистрации.Предупреждение,,, НСтр("ru='Нет данных для выгрузки.';uk='Немає даних для вивантаження.'"));
		Возврат;
		
	КонецЕсли;
	
	МассивЗданийИстории = Новый Массив;
	Для Каждого ЭлементМассива Из МассивЗданий_1 Цикл
		МассивЗданийИстории.Добавить(ЭлементМассива);	
	КонецЦикла;
	Для Каждого ЭлементМассива Из МассивЗданий_2 Цикл
		МассивЗданийИстории.Добавить(ЭлементМассива);	
	КонецЦикла;
	
	Если ЭтоНачалоВыгрузки И ВыгрузкаЗавершена Тогда
		НаборЗаписей = РегистрыСведений.СостоянияОбменовДаннымиХвояСайтЖКХ.СоздатьНаборЗаписей();	
		НаборЗаписей.Отбор.Организация.Установить(СтруктураНастройки.Организация);
		НаборЗаписей.Записать();
		ТаблицаЛицевыеСчета = НаборЗаписей.Выгрузить(,);
		
		Если НЕ МассивЗданий_2.Количество() = 0 Тогда
			
			МассивПериоды = Новый Массив;
			МассивПериоды.Добавить(ДобавитьМесяц(НачалоМесяца(ДатаВыгрузкиНаСайт), -2));
			МассивПериоды.Добавить(ДобавитьМесяц(НачалоМесяца(ДатаВыгрузкиНаСайт), -1));
			МассивПериоды.Добавить(НачалоМесяца(ДатаВыгрузкиНаСайт));
			
			Для Каждого Период Из МассивПериоды Цикл
				МассивЛС = ПолучитьМассивЛицевыхСчетов(СтруктураНастройки.Организация, КонецМесяца(Период), МассивЗданий_2);
				Для Каждого ЛС Из МассивЛС Цикл
					НоваяСтрока = ТаблицаЛицевыеСчета.Добавить();
				    НоваяСтрока.Организация = СтруктураНастройки.Организация;
				    НоваяСтрока.ЛицевойСчет = ЛС;
				    НоваяСтрока.ПериодВыгрузки = Период;
				    НоваяСтрока.ДатаВыгрузки = ДатаВыгрузкиНаСайт;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ МассивЗданий_1.Количество() = 0 Тогда
			МассивПериоды = Новый Массив;
			МассивПериоды.Добавить(ДобавитьМесяц(НачалоМесяца(ДатаВыгрузкиНаСайт), -1));
			МассивПериоды.Добавить(НачалоМесяца(ДатаВыгрузкиНаСайт));
			
			Для Каждого Период Из МассивПериоды Цикл
				МассивЛС = ПолучитьМассивЛицевыхСчетов(СтруктураНастройки.Организация, КонецМесяца(Период), МассивЗданий_1);
				Для Каждого ЛС Из МассивЛС Цикл
					НоваяСтрока = ТаблицаЛицевыеСчета.Добавить();
				    НоваяСтрока.Организация = СтруктураНастройки.Организация;
				    НоваяСтрока.ЛицевойСчет = ЛС;
				    НоваяСтрока.ПериодВыгрузки = Период;
				    НоваяСтрока.ДатаВыгрузки = ДатаВыгрузкиНаСайт;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	СостояниеВыгрузкиИсторииСайтЖКХ.ПериодВыгрузки
			|ИЗ
			|	РегистрСведений.СостояниеВыгрузкиИсторииСайтЖКХ КАК СостояниеВыгрузкиИсторииСайтЖКХ
			|ГДЕ
			|	СостояниеВыгрузкиИсторииСайтЖКХ.Организация = &Организация
			|	И НЕ СостояниеВыгрузкиИсторииСайтЖКХ.Подтверждено";
			
		Запрос.УстановитьПараметр("Организация", СтруктураНастройки.Организация);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		МассивПериоды = Новый Массив;
		
		Пока Результат.Следующий() Цикл
			МассивПериоды.Добавить(Результат.ПериодВыгрузки);
		КонецЦикла;
		
		Для Каждого Период Из МассивПериоды Цикл
			
			НайденныеСтроки = ТаблицаЛицевыеСчета.НайтиСтроки(Новый Структура("ПериодВыгрузки", Период));
			Если НайденныеСтроки.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			МассивЛС = ПолучитьМассивЛицевыхСчетов(СтруктураНастройки.Организация, КонецМесяца(Период), МассивЗданийИстории);
			Для Каждого ЛС Из МассивЛС Цикл
				НоваяСтрока = ТаблицаЛицевыеСчета.Добавить();
			    НоваяСтрока.Организация = СтруктураНастройки.Организация;
			    НоваяСтрока.ЛицевойСчет = ЛС;
			    НоваяСтрока.ПериодВыгрузки = Период;
			    НоваяСтрока.ДатаВыгрузки = ДатаВыгрузкиНаСайт;
			КонецЦикла;
		КонецЦикла;
		
		
		НаборЗаписей = РегистрыСведений.СостоянияОбменовДаннымиХвояСайтЖКХ.СоздатьНаборЗаписей();	
		НаборЗаписей.Прочитать();
		
		Для Каждого СтрокаТаблицаЛицевыеСчета Из ТаблицаЛицевыеСчета Цикл
			НоваяСтрока = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицаЛицевыеСчета);
		КонецЦикла;
		НаборЗаписей.Записать();
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияОбменовДаннымиХвояСайтЖКХ.Организация КАК Организация,
		|	СостоянияОбменовДаннымиХвояСайтЖКХ.ЛицевойСчет КАК ЛицевойСчет,
		|	СостоянияОбменовДаннымиХвояСайтЖКХ.ПериодВыгрузки КАК ПериодВыгрузки,
		|	СостоянияОбменовДаннымиХвояСайтЖКХ.ДатаВыгрузки
		|ИЗ
		|	РегистрСведений.СостоянияОбменовДаннымиХвояСайтЖКХ КАК СостоянияОбменовДаннымиХвояСайтЖКХ
		|ГДЕ
		|	СостоянияОбменовДаннымиХвояСайтЖКХ.Выгружено
		|	И НЕ СостоянияОбменовДаннымиХвояСайтЖКХ.Подтверждено
		|	И СостоянияОбменовДаннымиХвояСайтЖКХ.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодВыгрузки,
		|	ЛицевойСчет";
		
	Запрос.УстановитьПараметр("Организация", СтруктураНастройки.Организация);
		
	Результат = Запрос.Выполнить().Выбрать();	
	
	НаборЗаписей = РегистрыСведений.СостоянияОбменовДаннымиХвояСайтЖКХ.СоздатьНаборЗаписей();	
	
	Пока Результат.Следующий() Цикл
		
		НаборЗаписей.Отбор.Организация.Установить(Результат.Организация);
		НаборЗаписей.Отбор.ЛицевойСчет.Установить(Результат.ЛицевойСчет);
		НаборЗаписей.Отбор.ПериодВыгрузки.Установить(Результат.ПериодВыгрузки);
		НаборЗаписей.Отбор.ДатаВыгрузки.Установить(Результат.ДатаВыгрузки);
		
		НаборЗаписей.Прочитать();
			
		Если НаборЗаписей.Количество() = 1 Тогда
			НаборЗаписей[0].Подтверждено = Истина;	
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтруктураНастройки.Свойство("КоличесвоЛицевыхСчетовВПакете") Тогда
		РазмерПакета = СтруктураНастройки.КоличесвоЛицевыхСчетовВПакете;
		Если РазмерПакета = 0 Тогда
			РазмерПакета = 2000;	
		КонецЕсли;
	Иначе
		РазмерПакета = 2000;	
	КонецЕсли;
	ТекстРазмерПакета = Формат(РазмерПакета, "ЧГ=0");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ " + ТекстРазмерПакета + "
		|	СостоянияОбменовДаннымиХвояСайтЖКХ.ЛицевойСчет КАК ЛицевойСчет,
		|	СостоянияОбменовДаннымиХвояСайтЖКХ.ПериодВыгрузки КАК ПериодВыгрузки,
		|	СостоянияОбменовДаннымиХвояСайтЖКХ.ДатаВыгрузки
		|ИЗ
		|	РегистрСведений.СостоянияОбменовДаннымиХвояСайтЖКХ КАК СостоянияОбменовДаннымиХвояСайтЖКХ
		|ГДЕ
		|	НЕ СостоянияОбменовДаннымиХвояСайтЖКХ.Выгружено
		|	И НЕ СостоянияОбменовДаннымиХвояСайтЖКХ.Подтверждено
		|	И СостоянияОбменовДаннымиХвояСайтЖКХ.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодВыгрузки УБЫВ,
		|	ЛицевойСчет";
		
	Запрос = Новый Запрос(ТекстЗапроса);
		
	Запрос.УстановитьПараметр("Организация", СтруктураНастройки.Организация);
		
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаРезультат = Результат.Выбрать();
	МассивЛицевыхСчетов = Новый Массив;
	ПериодВыгрузки = '00010101';
	ДатаВыгрузки = '00010101';
	
	Пока ВыборкаРезультат.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ПериодВыгрузки) Тогда
			ПериодВыгрузки = ВыборкаРезультат.ПериодВыгрузки;	
		КонецЕсли;
		МассивЛицевыхСчетов.Добавить(ВыборкаРезультат.ЛицевойСчет);
		ДатаВыгрузки = ВыборкаРезультат.ДатаВыгрузки;	
		
		Если НЕ ПериодВыгрузки = ВыборкаРезультат.ПериодВыгрузки Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ВременныйКаталог = КаталогВременныхФайлов();
	ИмяФайлаДанных = ВременныйКаталог + "import" + КодПоЕДРПОУ + ".txt";
	
	ПодготовкаФайлаВыгрузки_Версия2(ИмяФайлаДанных, СтруктураНастройки.Организация, МассивЛицевыхСчетов, ПериодВыгрузки);	
	
	Попытка
		ПодключениеКФТП.Записать(ИмяФайлаДанных,"/" + СтруктураНастройки.УдаленныйКаталог + "/import" + КодПоЕДРПОУ + ".txt");
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru='Обмен данными ХВОЯ:Сайт ЖКХ';uk='Обмін даними ХВОЯ: Сайт ЖКГ'"), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	
	НаборЗаписей = РегистрыСведений.СостоянияОбменовДаннымиХвояСайтЖКХ.СоздатьНаборЗаписей();	
	
	Для Каждого ЛицевойСчет Из МассивЛицевыхСчетов Цикл
		
		НаборЗаписей.Отбор.Организация.Установить(СтруктураНастройки.Организация);
		НаборЗаписей.Отбор.ЛицевойСчет.Установить(ЛицевойСчет);
		НаборЗаписей.Отбор.ПериодВыгрузки.Установить(ПериодВыгрузки);
		НаборЗаписей.Отбор.ДатаВыгрузки.Установить(ДатаВыгрузки);
		
		НаборЗаписей.Прочитать();
			
		Если НаборЗаписей.Количество() = 1 Тогда
			НаборЗаписей[0].Выгружено = Истина;	
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ОбменДаннымиХвояСайтЖКХ()

Функция СформироватьфайлДляВыгрузки_Версия2(СписокЛицевыхСчетов, ПериодВыгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасчетПоказанийПриборовУчетаОстаткиИОбороты.ПриборУчета КАК ПриборУчета
	               |ПОМЕСТИТЬ ОПУ
	               |ИЗ
	               |	РегистрНакопления.РасчетПоказанийПриборовУчета.ОстаткиИОбороты(, , Авто, , ОбъектУстановки В (&ЛицевыеСчета)) КАК РасчетПоказанийПриборовУчетаОстаткиИОбороты
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета
	               |ИЗ
	               |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&ДатаОкончания, ОбъектУстановки В (&ЛицевыеСчета)) КАК УстановленныеПриборыУчетаСрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПриборУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	               |	СУММА(ПоказанияПриборовУчетаСрезПоследних.Значение) КАК ТекущиеПоказания,
	               |	СУММА(0) КАК ПредыдущиеПоказания,
	               |	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа КАК ВидТарифа
	               |ПОМЕСТИТЬ ПУ
	               |ИЗ
	               |	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(
	               |			&ДатаОкончания,
	               |			ПриборУчета В
	               |				(ВЫБРАТЬ
	               |					ОПУ.ПриборУчета
	               |				ИЗ
	               |					ОПУ КАК ОПУ)) КАК ПоказанияПриборовУчетаСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	               |	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	               |	СУММА(0),
	               |	СУММА(ПоказанияПриборовУчетаСрезПоследних.Значение),
	               |	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа
	               |ИЗ
	               |	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(
	               |			ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ, -1),
	               |			ПриборУчета В
	               |				(ВЫБРАТЬ
	               |					ОПУ.ПриборУчета
	               |				ИЗ
	               |					ОПУ КАК ОПУ)) КАК ПоказанияПриборовУчетаСрезПоследних
	               |ГДЕ
	               |	ПоказанияПриборовУчетаСрезПоследних.Период < КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	               |	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПриборУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетам.Услуга КАК Услуга,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	               |					ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РазовоеНачисление)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Начисление,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Пени)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Пени,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Субсидия,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Льгота,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Перерасчет,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Корректировка)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Корректировка,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РегиональнаяСубсидия)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК РегиональнаяСубсидия,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	               |					ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РазовоеНачисление)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Количество,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.ПустаяСсылка)
	               |					И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |					И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.ДоговорРеструктуризацииДолга)
	               |				ТОГДА -РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Оплачено,
	               |	МАКСИМУМ(РасчетыПоЛицевымСчетам.Тариф) КАК Тариф,
	               |	РасчетыПоЛицевымСчетам.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец КАК ЛицевойСчетВладелец,
	               |	РасчетыПоЛицевымСчетам.Услуга.ПолеСортировки КАК УслугаПолеСортировки
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет В(&ЛицевыеСчета)
	               |	И РасчетыПоЛицевымСчетам.Период >= &ДатаНачала
	               |	И РасчетыПоЛицевымСчетам.Период <= &ДатаОкончания
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетам.Услуга,
	               |	РасчетыПоЛицевымСчетам.Услуга.ЕдиницаИзмерения,
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец,
	               |	РасчетыПоЛицевымСчетам.Услуга.ПолеСортировки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛицевойСчет,
	               |	УслугаПолеСортировки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	               |					ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РазовоеНачисление)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Начисление,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Пени)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Пени,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Субсидия,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Льгота,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Перерасчет,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Корректировка)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Корректировка,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РегиональнаяСубсидия)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК РегиональнаяСубсидия,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	               |					ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РазовоеНачисление)
	               |				ТОГДА РасчетыПоЛицевымСчетам.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Количество,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.ПустаяСсылка)
	               |					И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |					И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) <> ТИП(Документ.ДоговорРеструктуризацииДолга)
	               |				ТОГДА -РасчетыПоЛицевымСчетам.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Оплачено
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет В(&ЛицевыеСчета)
	               |	И РасчетыПоЛицевымСчетам.Период >= &ДатаНачала
	               |	И РасчетыПоЛицевымСчетам.Период <= &ДатаОкончания
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	               |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
	               |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток,
	               |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход) КАК СуммаПриход,
	               |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход) КАК СуммаРасход
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Месяц, , ЛицевойСчет В (&ЛицевыеСчета)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	               |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
	               |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток,
	               |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход) КАК СуммаПриход,
	               |	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход) КАК СуммаРасход,
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ЕСТЬNULL(РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга.Организация.БанковскийСчетПоУмолчанию, РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация.БанковскийСчетПоУмолчанию), ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация.БанковскийСчетПоУмолчанию
	               |		ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга.Организация.БанковскийСчетПоУмолчанию, РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация.БанковскийСчетПоУмолчанию), ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка))
	               |	КОНЕЦ КАК БанковскийСчетПоУмолчанию
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Месяц, , ЛицевойСчет В (&ЛицевыеСчета)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ЕСТЬNULL(РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга.Организация.БанковскийСчетПоУмолчанию, РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация.БанковскийСчетПоУмолчанию), ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	               |			ТОГДА РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация.БанковскийСчетПоУмолчанию
	               |		ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга.Организация.БанковскийСчетПоУмолчанию, РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация.БанковскийСчетПоУмолчанию), ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка))
	               |	КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга.Организация.БанковскийСчетПоУмолчанию, УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.Владелец.Организация.БанковскийСчетПоУмолчанию), ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	               |			ТОГДА УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.Владелец.Организация.БанковскийСчетПоУмолчанию
	               |		ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга.Организация.БанковскийСчетПоУмолчанию, УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.Владелец.Организация.БанковскийСчетПоУмолчанию), ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка))
	               |	КОНЕЦ
	               |ИЗ
	               |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&ДатаОкончания, ОбъектУстановки В (&ЛицевыеСчета)) КАК УстановленныеПриборыУчетаСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга.Организация.БанковскийСчетПоУмолчанию, УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.Владелец.Организация.БанковскийСчетПоУмолчанию), ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	               |			ТОГДА УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.Владелец.Организация.БанковскийСчетПоУмолчанию
	               |		ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга.Организация.БанковскийСчетПоУмолчанию, УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.Владелец.Организация.БанковскийСчетПоУмолчанию), ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка))
	               |	КОНЕЦ,
	               |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
	               |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасшифровкаНачисленияЛьготОбороты.ЛицевойСчет,
	               |	РасшифровкаНачисленияЛьготОбороты.Услуга,
	               |	РасшифровкаНачисленияЛьготОбороты.Льгота,
	               |	СУММА(РасшифровкаНачисленияЛьготОбороты.СуммаОборот) КАК СуммаОборот
	               |ИЗ
	               |	РегистрНакопления.РасшифровкаНачисленияЛьгот.Обороты(&ДатаНачала, &ДатаОкончания, Месяц, ЛицевойСчет В (&ЛицевыеСчета)) КАК РасшифровкаНачисленияЛьготОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасшифровкаНачисленияЛьготОбороты.ЛицевойСчет,
	               |	РасшифровкаНачисленияЛьготОбороты.Услуга,
	               |	РасшифровкаНачисленияЛьготОбороты.Льгота
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоСубсидиямОстаткиИОбороты.ЛицевойСчет,
	               |	РасчетыПоСубсидиямОстаткиИОбороты.Услуга,
	               |	СУММА(РасчетыПоСубсидиямОстаткиИОбороты.СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
	               |	СУММА(РасчетыПоСубсидиямОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток,
	               |	СУММА(РасчетыПоСубсидиямОстаткиИОбороты.СуммаПриход) КАК СуммаПриход,
	               |	СУММА(РасчетыПоСубсидиямОстаткиИОбороты.СуммаРасход) КАК СуммаРасход
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоСубсидиям.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Месяц, , ЛицевойСчет В (&ЛицевыеСчета)) КАК РасчетыПоСубсидиямОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоСубсидиямОстаткиИОбороты.ЛицевойСчет,
	               |	РасчетыПоСубсидиямОстаткиИОбороты.Услуга
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
	               |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
	               |	СУММА(ЕСТЬNULL(ПУ.ТекущиеПоказания, 0)) КАК ТекущиеПоказания,
	               |	СУММА(ЕСТЬNULL(ПУ.ПредыдущиеПоказания, 0)) КАК ПредыдущиеПоказания,
	               |	ПУ.ПриборУчета.Коэффициент,
	               |	КОЛИЧЕСТВО(УстановленныеПриборыУчетаСрезПоследних.ПриборУчета) КАК КоличествоПиборовНаУслуге,
	               |	ПУ.ПриборУчета.Услуга КАК Услуга,
	               |	ПУ.ПриборУчета.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ОбъектУстановки В (&ЛицевыеСчета)) КАК УстановленныеПриборыУчетаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПУ КАК ПУ
	               |		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПУ.ПриборУчета
	               |ГДЕ
	               |	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
	               |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
	               |	ПУ.ПриборУчета.Коэффициент,
	               |	ПУ.ПриборУчета.Услуга,
	               |	ПУ.ПриборУчета.ЕдиницаИзмерения
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗаменыПриборовУчета.ОбъектУстановки,
	               |	ЗаменыПриборовУчета.ПриборУчета,
	               |	ЗаменыПриборовУчета.Показание,
	               |	ЗаменыПриборовУчета.ПоказаниеПредыдущее,
	               |	ЗаменыПриборовУчета.ПриборУчета.Коэффициент,
	               |	0,
	               |	ЗаменыПриборовУчета.Услуга,
	               |	ЗаменыПриборовУчета.ПриборУчета.ЕдиницаИзмерения
	               |ИЗ
	               |	РегистрНакопления.ЗаменыПриборовУчета КАК ЗаменыПриборовУчета
	               |ГДЕ
	               |	ЗаменыПриборовУчета.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	               |	И ЗаменыПриборовУчета.ОбъектУстановки В(&ЛицевыеСчета)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Услуга УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛицевыеСчетаСрезПоследних.КоличествоПрописанных,
	               |	ЛицевыеСчетаСрезПоследних.КоличествоПроживающих,
	               |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет
	               |ИЗ
	               |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&ДатаОкончания, ЛицевойСчет В (&ЛицевыеСчета)) КАК ЛицевыеСчетаСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОбороты.Период,
	               |	РасчетыПоЛицевымСчетамОбороты.СуммаРасход
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ЛицевойСчет В (&ЛицевыеСчета)) КАК РасчетыПоЛицевымСчетамОбороты
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетамОбороты.Регистратор) <> ТИП(Документ.ДоговорРеструктуризацииДолга)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетамОбороты.Период,
	               |	РасчетыПоЛицевымСчетамОбороты.СуммаРасход
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявкаНаПроведениеРемонта.ЛицевойСчет,
	               |	ЗаявкаНаПроведениеРемонта.Ссылка,
	               |	ЗаявкаНаПроведениеРемонта.Номер,
	               |	ЗаявкаНаПроведениеРемонта.Дата,
	               |	ЗаявкаНаПроведениеРемонта.ВидЗаявки,
	               |	ЗаявкаНаПроведениеРемонта.СтатусЗаявки,
	               |	ЗаявкаНаПроведениеРемонта.ТекстЗаявки,
	               |	ЗаявкаНаПроведениеРемонта.Телефон,
	               |	ЗаявкаНаПроведениеРемонта.ВремяУдобноеДляЗаказчика,
	               |	ЗаявкаНаПроведениеРемонта.ВремяФактическогоВыполнения,
	               |	ЗаявкаНаПроведениеРемонта.Работы.(
	               |		Ссылка,
	               |		ВидРабот,
	               |		Цена,
	               |		КоличествоФакт,
	               |		СуммаФакт,
	               |		ВидРабот.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |	),
	               |	ЗаявкаНаПроведениеРемонта.Запасы.(
	               |		Ссылка,
	               |		Номенклатура,
	               |		Цена,
	               |		КоличествоФакт,
	               |		СуммаФакт,
	               |		Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |	),
	               |	ЗаявкаНаПроведениеРемонта.ОценкаПроведенияРемонта,
	               |	ЗаявкаНаПроведениеРемонта.КомментарийПоВыполнениюЗаявки
	               |ИЗ
	               |	Документ.ЗаявкаНаПроведениеРемонта КАК ЗаявкаНаПроведениеРемонта
	               |ГДЕ
	               |	ЗаявкаНаПроведениеРемонта.Дата >= &ДатаНачала
	               |	И ЗаявкаНаПроведениеРемонта.Дата <= &ДатаОкончания
	               |	И ЗаявкаНаПроведениеРемонта.Проведен
	               |	И ЗаявкаНаПроведениеРемонта.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаявокНаПроведениеРемонта.ПроведениеРаботПоЛицевомуСчету)
	               |	И ЗаявкаНаПроведениеРемонта.ЛицевойСчет В(&ЛицевыеСчета)";

	                           
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ПериодВыгрузки));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодВыгрузки));
	Запрос.УстановитьПараметр("ЛицевыеСчета", СписокЛицевыхСчетов);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат Результат;
	
КонецФункции

Процедура ПодготовкаФайлаВыгрузки_Версия2(ИмяФайлаДанных, Организация, МассивЛицевыхСчетов, ПериодВыгрузки)
	
	ДатаНачисления = ПериодВыгрузки;
	РезультатЗапроса =  СформироватьфайлДляВыгрузки_Версия2(МассивЛицевыхСчетов, ДатаНачисления);
	
	// 2 - инфо по услугам и начислениям
	// 3 - инфо по ЛС и начислениям
	
	// 4 - инфо по услугам и остаткам
	// 5 - инфо по ЛС и остаткам
	
	// 6 - инфо по льготам
	// 7 - инфо по субсидиям
	// 8 - инфо по приборам учета
	// 9 - инфо по кво проживающих
	// 10 - инфо по оплатам
	// 11 - аварийно-диспечерская служба

	Таблица2 = РезультатЗапроса[2].Выгрузить();
	Таблица3 = РезультатЗапроса[3].Выгрузить();
	Таблица4 = РезультатЗапроса[4].Выгрузить();
	Таблица5 = РезультатЗапроса[5].Выгрузить();
	Таблица6 = РезультатЗапроса[6].Выгрузить();
	Таблица7 = РезультатЗапроса[7].Выгрузить();
	Таблица8 = РезультатЗапроса[8].Выгрузить();
	Таблица9 = РезультатЗапроса[9].Выгрузить();
	Таблица10 = РезультатЗапроса[10].Выгрузить();
	Таблица11 = РезультатЗапроса[11].Выгрузить();
	
	ТаблицаРС = Таблица5.Скопировать( , "БанковскийСчетПоУмолчанию");
    ТаблицаРС.Свернуть("БанковскийСчетПоУмолчанию",);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.ОткрытьФайл(ИмяФайлаДанных, , , ПараметрыЗаписиJSON);
	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("ORG");
	
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
			ЗаписьJSON.ЗаписатьИмяСвойства("id");
			ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(Организация));
			ЗаписьJSON.ЗаписатьИмяСвойства("inn");
			ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(Организация.ИНН));
			ЗаписьJSON.ЗаписатьИмяСвойства("КодПоЕДРПОУ");
			ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(Организация.КодПоЕДРПОУ));
			ЗаписьJSON.ЗаписатьИмяСвойства("name");
			ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(Организация.ПолноеНаименование()));
	
			//////////////////////////////////////////////////////////
			ЗаписьJSON.ЗаписатьИмяСвойства("BeneficiaryBank");       // расчетные счета организации
			ЗаписьJSON.ЗаписатьНачалоМассива();
			
			Для Каждого СтрокаРС Из ТаблицаРС Цикл
				ЗаписьJSON.ЗаписатьНачалоОбъекта();
				
				ЗаписьJSON.ЗаписатьИмяСвойства("id_bank_accоunt");
				ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаРС.БанковскийСчетПоУмолчанию));
				ЗаписьJSON.ЗаписатьИмяСвойства("Receiver");
				ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаРС.БанковскийСчетПоУмолчанию.Банк.Наименование));
				ЗаписьJSON.ЗаписатьИмяСвойства("Code");
				ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаРС.БанковскийСчетПоУмолчанию.Банк.КодПоЕДРПОУ));
				ЗаписьJSON.ЗаписатьИмяСвойства("AccountNumber");
				ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаРС.БанковскийСчетПоУмолчанию.НомерСчета));
				ЗаписьJSON.ЗаписатьИмяСвойства("MFI_Bank");
				ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаРС.БанковскийСчетПоУмолчанию.Банк.Код));
				
				ЗаписьJSON.ЗаписатьКонецОбъекта();
				
			КонецЦикла;
			
			ЗаписьJSON.ЗаписатьКонецМассива();
			
			//////////////////////////////////////////////////////////
			ЗаписьJSON.ЗаписатьИмяСвойства("PersAcc");       // лицевые счета
			ЗаписьJSON.ЗаписатьНачалоМассива();
			
				
				Для Каждого ЛицевойСчет Из МассивЛицевыхСчетов Цикл
					
					ВыбранныеСтрокиЛС = Таблица3.НайтиСтроки(Новый Структура("ЛицевойСчет", ЛицевойСчет));
					ВыбранныеСтрокиОстаткиЛС = Таблица4.НайтиСтроки(Новый Структура("ЛицевойСчет", ЛицевойСчет));
					ВыбранныеСтрокиЖильцыЛС = Таблица9.НайтиСтроки(Новый Структура("ЛицевойСчет", ЛицевойСчет));
					
					Адрес = ЛицевойСчет.Владелец.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗданияИСооружения,"Вид").ЗначенияПолей;
					АдресЛС = НайтиЗначениеАдреса(Адрес, "Город=") + "," + НайтиЗначениеАдреса(Адрес, "Улица=") + "," + НайтиЗначениеАдреса(Адрес, "Дом=") + "," + ЛицевойСчет.ОбъектЛицевогоСчета.Наименование;
					
					ОтборПлощади = Новый Структура("Помещение", ЛицевойСчет.ОбъектЛицевогоСчета);    
					ВыборкаПлощади = РегистрыСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(КонецМесяца(ДатаНачисления),ОтборПлощади);
					
					Для Каждого Строка Из ВыборкаПлощади Цикл
						Если Строка.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
							ПлощадьОтоп = Строка.Площадь;
						ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
							ПлощадьВся = Строка.Площадь;
						ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ЖилаяПолощадь Тогда
							ЖилаяПлощадь = Строка.Площадь;
						КонецЕсли;
					КонецЦикла;
					
					ЛогинДоступа = СокрЛП(ЛицевойСчет.Наименование); //Прав(ЛицевойСчет.Владелец.Код, 2) + Формат(ЛицевойСчет.Код, "ЧГ=0; ЧЦ=4; ЧВН="); 
					
					ВыборкаОтветственныйВладелец = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(КонецМесяца(ДатаНачисления),Новый Структура("ЛицевойСчет",ЛицевойСчет));
					Если ВыборкаОтветственныйВладелец.Количество() > 0 Тогда
						ОтветственныйВладелец = ВыборкаОтветственныйВладелец[0].ОтветственныйВладелец;
						
					Иначе
						ОтветственныйВладелец = "";	
						
					КонецЕсли;
					
					ЗаписьJSON.ЗаписатьНачалоОбъекта();
					
					ЗаписьJSON.ЗаписатьИмяСвойства("date");
					ЗаписьJSON.ЗаписатьЗначение(Формат(НачалоМесяца(ДатаНачисления),"ДЛФ=Д"));
					ЗаписьJSON.ЗаписатьИмяСвойства("id");
					ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ЛицевойСчет));
					ЗаписьJSON.ЗаписатьИмяСвойства("Address");
					ЗаписьJSON.ЗаписатьЗначение(АдресЛС);
					ЗаписьJSON.ЗаписатьИмяСвойства("commonarea");
					ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ПлощадьВся));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("НачОстаток");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиОстаткиЛС.Количество()>0,XMLСтрока(ВыбранныеСтрокиОстаткиЛС[0].СуммаНачальныйОстаток),""));
					ЗаписьJSON.ЗаписатьИмяСвойства("КонОстаток");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиОстаткиЛС.Количество()>0,XMLСтрока(ВыбранныеСтрокиОстаткиЛС[0].СуммаКонечныйОстаток),""));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("Оплачено");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиЛС.Количество()>0,XMLСтрока(ВыбранныеСтрокиЛС[0].Оплачено),""));
					ЗаписьJSON.ЗаписатьИмяСвойства("Начисление");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиЛС.Количество()>0,XMLСтрока(ВыбранныеСтрокиЛС[0].Начисление),""));
					ЗаписьJSON.ЗаписатьИмяСвойства("Пени");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиЛС.Количество()>0,XMLСтрока(ВыбранныеСтрокиЛС[0].Пени),""));
					ЗаписьJSON.ЗаписатьИмяСвойства("Субсидия");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиЛС.Количество()>0,XMLСтрока(ВыбранныеСтрокиЛС[0].Субсидия),""));
					ЗаписьJSON.ЗаписатьИмяСвойства("Льгота");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиЛС.Количество()>0,XMLСтрока(ВыбранныеСтрокиЛС[0].Льгота),""));
					ЗаписьJSON.ЗаписатьИмяСвойства("Перерасчет");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиЛС.Количество()>0,XMLСтрока(ВыбранныеСтрокиЛС[0].Перерасчет),""));
					ЗаписьJSON.ЗаписатьИмяСвойства("Корректировка");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиЛС.Количество()>0,XMLСтрока(ВыбранныеСтрокиЛС[0].Корректировка),""));
					ЗаписьJSON.ЗаписатьИмяСвойства("РегиональнаяСубсидия");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиЛС.Количество()>0,XMLСтрока(ВыбранныеСтрокиЛС[0].РегиональнаяСубсидия),""));
					
					
					ЗаписьJSON.ЗаписатьИмяСвойства("email");
					//ЗаписьJSON.ЗаписатьЗначение(ЛицевойСчет.ЭлПочта);
					ЗаписьJSON.ЗаписатьЗначение(ОтветственныйВладелец.ЕлектроннаяПочта);
					ЗаписьJSON.ЗаписатьИмяСвойства("habarea");
					ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ЖилаяПлощадь));
					ЗаписьJSON.ЗаписатьИмяСвойства("kod_ls");
					ЗаписьJSON.ЗаписатьЗначение(ЛицевойСчет.Наименование);
					ЗаписьJSON.ЗаписатьИмяСвойства("name");
					ЗаписьJSON.ЗаписатьЗначение(ОтветственныйВладелец.Наименование);
					////
					ЗаписьJSON.ЗаписатьИмяСвойства("phone");
					ЗаписьJSON.ЗаписатьЗначение(ОтветственныйВладелец.МобДляСайта);
					ЗаписьJSON.ЗаписатьИмяСвойства("updatepass");
					ЗаписьJSON.ЗаписатьЗначение(?(ОтветственныйВладелец.ОбновитьПароль = Истина,"1","0"));
					ЗаписьJSON.ЗаписатьИмяСвойства("userlogin");
					//Если Сокрлп(ОтветственныйВладелец.МобДляСайта) = "" Тогда
					//	ЗаписьJSON.ЗаписатьЗначение(Сокрлп(ОтветственныйВладелец.МобДляСайта));
					//Иначе	
					ЗаписьJSON.ЗаписатьЗначение(ОтветственныйВладелец.Логин);
					//КонецЕсли;
					ЗаписьJSON.ЗаписатьИмяСвойства("userpassword");
					ЗаписьJSON.ЗаписатьЗначение(ОтветственныйВладелец.Пароль);
					////
					ЗаписьJSON.ЗаписатьИмяСвойства("name_ls");
					ЗаписьJSON.ЗаписатьЗначение(ЛицевойСчет.Наименование);
					ЗаписьJSON.ЗаписатьИмяСвойства("login");
					ЗаписьJSON.ЗаписатьЗначение(ЛогинДоступа);
					ЗаписьJSON.ЗаписатьИмяСвойства("password");
					ЗаписьJSON.ЗаписатьЗначение(ЛицевойСчет.ПарольДоступа);
					ЗаписьJSON.ЗаписатьИмяСвойства("people_Living");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиЖильцыЛС.Количество()>0,XMLСтрока(ВыбранныеСтрокиЖильцыЛС[0].КоличествоПроживающих),""));
					ЗаписьJSON.ЗаписатьИмяСвойства("people_Prescription");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиЖильцыЛС.Количество()>0,XMLСтрока(ВыбранныеСтрокиЖильцыЛС[0].КоличествоПрописанных),""));
				
					ЗаписьJSON.ЗаписатьИмяСвойства("item");       // услуги
					ЗаписьJSON.ЗаписатьНачалоМассива();
				
					//ВыбранныеСтрокиУслугиЛС = Таблица2.НайтиСтроки(Новый Структура("ЛицевойСчет", ЛицевойСчет));
					ВыбранныеСтрокиУслугиЛС = Таблица5.НайтиСтроки(Новый Структура("ЛицевойСчет", ЛицевойСчет));

				
				Для каждого УслугаЛС Из ВыбранныеСтрокиУслугиЛС Цикл
					
					ВыбранныеСтрокиОстаткиУслугиЛС = Таблица5.НайтиСтроки(Новый Структура("ЛицевойСчет, Услуга", ЛицевойСчет, УслугаЛС.Услуга));
					ВыбранныеСтрокиОборотыУслугиЛС = Таблица2.НайтиСтроки(Новый Структура("ЛицевойСчет, Услуга", ЛицевойСчет, УслугаЛС.Услуга));

					
					ЗаписьJSON.ЗаписатьНачалоОбъекта();
					
					ЗаписьJSON.ЗаписатьИмяСвойства("ammount");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиОборотыУслугиЛС.Количество()>0, XMLСтрока(ВыбранныеСтрокиОборотыУслугиЛС[0].Количество),""));
					
					Если ЗначениеЗаполнено(УслугаЛС.Услуга) Тогда
						ЗаписьJSON.ЗаписатьИмяСвойства("edizm");
						ЗаписьJSON.ЗаписатьЗначение(УслугаЛС.Услуга.ЕдиницаИзмерения.Наименование);
						ЗаписьJSON.ЗаписатьИмяСвойства("id");
						ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(УслугаЛС.Услуга));
						ЗаписьJSON.ЗаписатьИмяСвойства("Name");
						ЗаписьJSON.ЗаписатьЗначение(УслугаЛС.Услуга.Наименование);
					Иначе
						ЗаписьJSON.ЗаписатьИмяСвойства("edizm");
						ЗаписьJSON.ЗаписатьЗначение("грн.");
						ЗаписьJSON.ЗаписатьИмяСвойства("id");
						ЗаписьJSON.ЗаписатьЗначение("00000000-0000-0000-0000-000000000000");
						ЗаписьJSON.ЗаписатьИмяСвойства("Name");
						ЗаписьJSON.ЗаписатьЗначение("Аванс");
					КонецЕсли;
					
					ЗаписьJSON.ЗаписатьИмяСвойства("id_bank_accоunt");
					ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(УслугаЛС.БанковскийСчетПоУмолчанию));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("norm");
					ЗаписьJSON.ЗаписатьЗначение("");
					
					ЗаписьJSON.ЗаписатьИмяСвойства("НачОстаток");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиОстаткиУслугиЛС.Количество()>0,XMLСтрока(ВыбранныеСтрокиОстаткиУслугиЛС[0].СуммаНачальныйОстаток),""));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("КонОстаток");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиОстаткиУслугиЛС.Количество()>0,XMLСтрока(ВыбранныеСтрокиОстаткиУслугиЛС[0].СуммаКонечныйОстаток),""));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("Оплачено");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиОборотыУслугиЛС.Количество()>0, XMLСтрока(ВыбранныеСтрокиОборотыУслугиЛС[0].Оплачено),""));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("Начисление");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиОборотыУслугиЛС.Количество()>0, XMLСтрока(ВыбранныеСтрокиОборотыУслугиЛС[0].Начисление),""));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("Пени");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиОборотыУслугиЛС.Количество()>0, XMLСтрока(ВыбранныеСтрокиОборотыУслугиЛС[0].Пени),""));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("Субсидия");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиОборотыУслугиЛС.Количество()>0, XMLСтрока(ВыбранныеСтрокиОборотыУслугиЛС[0].Субсидия),""));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("Льгота");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиОборотыУслугиЛС.Количество()>0, XMLСтрока(ВыбранныеСтрокиОборотыУслугиЛС[0].Льгота),""));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("Перерасчет");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиОборотыУслугиЛС.Количество()>0, XMLСтрока(ВыбранныеСтрокиОборотыУслугиЛС[0].Перерасчет),""));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("Корректировка");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиОборотыУслугиЛС.Количество()>0, XMLСтрока(ВыбранныеСтрокиОборотыУслугиЛС[0].Корректировка),""));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("РегиональнаяСубсидия");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиОборотыУслугиЛС.Количество()>0, XMLСтрока(ВыбранныеСтрокиОборотыУслугиЛС[0].РегиональнаяСубсидия),""));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("tarif");
					ЗаписьJSON.ЗаписатьЗначение(?(ВыбранныеСтрокиОборотыУслугиЛС.Количество()>0, XMLСтрока(ВыбранныеСтрокиОборотыУслугиЛС[0].Тариф),""));
					
					// А.И.
					ДатаЗакрытияПериода = ПолучитьДатуЗакрытияПериода(ЛицевойСчет);
					ЗаписьJSON.ЗаписатьИмяСвойства("meter_disable_date");  
					ЗаписьJSON.ЗаписатьЗначение(Формат(ДатаЗакрытияПериода,"ДФ=dd.MM.yyyy"));
					// А.И.
					
					ЗаписьJSON.ЗаписатьИмяСвойства("meter");       // счетчики
					ЗаписьJSON.ЗаписатьНачалоМассива();
					
					ВыбранныеСтрокиСчетчики = Таблица8.НайтиСтроки(Новый Структура("ОбъектУстановки, Услуга", ЛицевойСчет, УслугаЛС.Услуга));
					
					Для Каждого СтрокаВыбранныеСтрокиСчетчики Из ВыбранныеСтрокиСчетчики цикл	
						//Если НЕ СтрокаВыбранныеСтрокиСчетчики.ПриборУчета.Тарифность = Перечисления.ТарифностьСчетчиков.Однотарифный Тогда
						//	Продолжить;
						//КонецЕсли;
						
						ТаблицаПоказанийСчетчиков = ПолучитьПоказанияСчетчиков(ДатаЗакрытияПериода, СтрокаВыбранныеСтрокиСчетчики.ПриборУчета);
						
						Для Каждого СтрокаТаблицыПоказанийСчетчиков Из ТаблицаПоказанийСчетчиков цикл	
							
							ЗаписьJSON.ЗаписатьНачалоОбъекта();
							
							ЗаписьJSON.ЗаписатьИмяСвойства("value_count");
							ЗаписьJSON.ЗаписатьЗначение("1");
							ЗаписьJSON.ЗаписатьИмяСвойства("indicbef1");
							ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаТаблицыПоказанийСчетчиков.ПредыдущиеПоказания));
							ЗаписьJSON.ЗаписатьИмяСвойства("indiccur1");
							ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаТаблицыПоказанийСчетчиков.ТекущиеПоказания));
							ЗаписьJSON.ЗаписатьИмяСвойства("id");
							ЗаписьJSON.ЗаписатьЗначение(СтрокаТаблицыПоказанийСчетчиков.id);
							ЗаписьJSON.ЗаписатьИмяСвойства("name");
							ЗаписьJSON.ЗаписатьЗначение(СтрокаТаблицыПоказанийСчетчиков.ЗаводскойНомер);
							
							ЗаписьJSON.ЗаписатьИмяСвойства("meter_data_history");       // история счетчиков
							ЗаписьJSON.ЗаписатьНачалоМассива();
							
							ТаблицаИстории = СтрокаТаблицыПоказанийСчетчиков.ТаблицаИстории;
							Для Каждого СтрокаТаблицыИстории Из ТаблицаИстории цикл	
								
								ЗаписьJSON.ЗаписатьНачалоОбъекта();
								
								ЗаписьJSON.ЗаписатьИмяСвойства("date");
								ЗаписьJSON.ЗаписатьЗначение(Формат(СтрокаТаблицыИстории.Период,"ДФ=dd.MM.yyyy"));
								ЗаписьJSON.ЗаписатьИмяСвойства("value");
								ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаТаблицыИстории.Значение));
								ЗаписьJSON.ЗаписатьИмяСвойства("source");
								ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаТаблицыИстории.ИсточникПоказаний));
								
								ЗаписьJSON.ЗаписатьКонецОбъекта();
								
							КонецЦикла;
							ЗаписьJSON.ЗаписатьКонецМассива();
							
							ЗаписьJSON.ЗаписатьКонецОбъекта();
							
						КонецЦикла;	
					КонецЦикла;
					ЗаписьJSON.ЗаписатьКонецМассива();
					
					
					//////////////////////////////////////////////////////////
					ЗаписьJSON.ЗаписатьИмяСвойства("subsidies");       // субсидии
					ЗаписьJSON.ЗаписатьНачалоМассива();
					
					ВыбранныеСтрокиСубсидии = Таблица7.НайтиСтроки(Новый Структура("ЛицевойСчет, Услуга", ЛицевойСчет, УслугаЛС.Услуга));
					
					Для Каждого СтрокаВыбранныеСтрокиСубсидии Из ВыбранныеСтрокиСубсидии Цикл
						ЗаписьJSON.ЗаписатьНачалоОбъекта();
						
						ЗаписьJSON.ЗаписатьИмяСвойства("summa");
						ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаВыбранныеСтрокиСубсидии.СуммаРасход));
						ЗаписьJSON.ЗаписатьИмяСвойства("summaend");
						ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаВыбранныеСтрокиСубсидии.СуммаКонечныйОстаток));
						
						ЗаписьJSON.ЗаписатьКонецОбъекта();
						
				    КонецЦикла;
					ЗаписьJSON.ЗаписатьКонецМассива();
					
					
					//////////////////////////////////////////////////////////
					ЗаписьJSON.ЗаписатьИмяСвойства("privileges");       // льготы
					ЗаписьJSON.ЗаписатьНачалоМассива();
					
					ВыбранныеСтрокиЛьготы = Таблица6.НайтиСтроки(Новый Структура("ЛицевойСчет, Услуга", ЛицевойСчет, УслугаЛС.Услуга));
					
					Для Каждого СтрокаВыбранныеСтрокиЛьготы Из ВыбранныеСтрокиЛьготы Цикл
						
						ЗаписьJSON.ЗаписатьНачалоОбъекта();
						
						ЗаписьJSON.ЗаписатьИмяСвойства("name");
						ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаВыбранныеСтрокиЛьготы.Льгота.Наименование));
						ЗаписьJSON.ЗаписатьИмяСвойства("percent");
						ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаВыбранныеСтрокиЛьготы.Льгота.ПроцентЛьготы));
						
						ЗаписьJSON.ЗаписатьКонецОбъекта();
						
				    КонецЦикла;
					ЗаписьJSON.ЗаписатьКонецМассива();
					
				ЗаписьJSON.ЗаписатьКонецОбъекта();

			    КонецЦикла;
				
				ЗаписьJSON.ЗаписатьКонецМассива();
				
				//////////////////////////////////////////////////////////
				ЗаписьJSON.ЗаписатьИмяСвойства("оплаты");       // оплаты
				ЗаписьJSON.ЗаписатьНачалоМассива();
				
				ВыбранныеСтрокиОплаты = Таблица10.НайтиСтроки(Новый Структура("ЛицевойСчет", ЛицевойСчет));
				
				Для Каждого СтрокаВыбранныеСтрокиОплаты Из ВыбранныеСтрокиОплаты Цикл	
					ЗаписьJSON.ЗаписатьНачалоОбъекта();
					
					ЗаписьJSON.ЗаписатьИмяСвойства("date");
					ЗаписьJSON.ЗаписатьЗначение(Формат(СтрокаВыбранныеСтрокиОплаты.Период,"ДЛФ=Д"));
					ЗаписьJSON.ЗаписатьИмяСвойства("summa");
					ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаВыбранныеСтрокиОплаты.СуммаРасход));
					
					ЗаписьJSON.ЗаписатьКонецОбъекта();
					
			    КонецЦикла;
				ЗаписьJSON.ЗаписатьКонецМассива();
				
				//////////////////////////////////////////////////////////
				ЗаписьJSON.ЗаписатьИмяСвойства("ADS");       // АДС
				ЗаписьJSON.ЗаписатьНачалоМассива();
				
				ВыбранныеСтрокиАДС = Таблица11.НайтиСтроки(Новый Структура("ЛицевойСчет", ЛицевойСчет));
				
				Для Каждого СтрокаВыбранныеСтрокиАДС Из ВыбранныеСтрокиАДС Цикл	
					ЗаписьJSON.ЗаписатьНачалоОбъекта();
					
					ЗаписьJSON.ЗаписатьИмяСвойства("docID");
					ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаВыбранныеСтрокиАДС.Ссылка));
					ЗаписьJSON.ЗаписатьИмяСвойства("docnum");
					ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаВыбранныеСтрокиАДС.Номер));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("docdate");
					ЗаписьJSON.ЗаписатьЗначение(Формат(СтрокаВыбранныеСтрокиАДС.Дата,"ДЛФ=Д"));
					ЗаписьJSON.ЗаписатьИмяСвойства("docsort");
					ЗаписьJSON.ЗаписатьЗначение(Строка(СтрокаВыбранныеСтрокиАДС.ВидЗаявки));
					ЗаписьJSON.ЗаписатьИмяСвойства("docstatus");
					ЗаписьJSON.ЗаписатьЗначение(Строка(СтрокаВыбранныеСтрокиАДС.СтатусЗаявки));
					ЗаписьJSON.ЗаписатьИмяСвойства("phone");
					ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаВыбранныеСтрокиАДС.Телефон));
					ЗаписьJSON.ЗаписатьИмяСвойства("userdate");
					ЗаписьJSON.ЗаписатьЗначение(Формат(СтрокаВыбранныеСтрокиАДС.ВремяУдобноеДляЗаказчика,"ДЛФ=Д"));
					ЗаписьJSON.ЗаписатьИмяСвойства("enddate");
					ЗаписьJSON.ЗаписатьЗначение(Формат(СтрокаВыбранныеСтрокиАДС.ВремяФактическогоВыполнения,"ДЛФ=Д"));
					ЗаписьJSON.ЗаписатьИмяСвойства("doctext");
					ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаВыбранныеСтрокиАДС.ТекстЗаявки));
					ЗаписьJSON.ЗаписатьИмяСвойства("docresume");
					ЗаписьJSON.ЗаписатьЗначение(Строка(СтрокаВыбранныеСтрокиАДС.ОценкаПроведенияРемонта));
					ЗаписьJSON.ЗаписатьИмяСвойства("docnote");
					ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СтрокаВыбранныеСтрокиАДС.КомментарийПоВыполнениюЗаявки));
					
					ЗаписьJSON.ЗаписатьИмяСвойства("works");       // работы
					ЗаписьJSON.ЗаписатьНачалоМассива();
					Для каждого РаботаАДС Из СтрокаВыбранныеСтрокиАДС.Работы Цикл
						
						ЗаписьJSON.ЗаписатьНачалоОбъекта();
						
						ЗаписьJSON.ЗаписатьИмяСвойства("workname");
						ЗаписьJSON.ЗаписатьЗначение(Строка(РаботаАДС.ВидРабот));
						ЗаписьJSON.ЗаписатьИмяСвойства("workedizm");
						ЗаписьJSON.ЗаписатьЗначение(Строка(РаботаАДС.ЕдиницаИзмерения));
						ЗаписьJSON.ЗаписатьИмяСвойства("workprice");
						ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(РаботаАДС.Цена));
						ЗаписьJSON.ЗаписатьИмяСвойства("workcount");
						ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(РаботаАДС.КоличествоФакт));
						ЗаписьJSON.ЗаписатьИмяСвойства("worksum");
						ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(РаботаАДС.СуммаФакт));
						
						ЗаписьJSON.ЗаписатьКонецОбъекта();
						
					КонецЦикла;
					ЗаписьJSON.ЗаписатьКонецМассива();
					
					ЗаписьJSON.ЗаписатьИмяСвойства("goods");       // запасы
					ЗаписьJSON.ЗаписатьНачалоМассива();
					Для каждого ЗапасыАДС Из СтрокаВыбранныеСтрокиАДС.Запасы Цикл
						
						ЗаписьJSON.ЗаписатьНачалоОбъекта();
						
						ЗаписьJSON.ЗаписатьИмяСвойства("goodsname");
						ЗаписьJSON.ЗаписатьЗначение(Строка(ЗапасыАДС.Номенклатура));
						ЗаписьJSON.ЗаписатьИмяСвойства("goodsedizm");
						ЗаписьJSON.ЗаписатьЗначение(Строка(ЗапасыАДС.ЕдиницаИзмерения));
						ЗаписьJSON.ЗаписатьИмяСвойства("goodsprice");
						ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ЗапасыАДС.Цена));
						ЗаписьJSON.ЗаписатьИмяСвойства("goodscount");
						ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ЗапасыАДС.КоличествоФакт));
						ЗаписьJSON.ЗаписатьИмяСвойства("goodssum");
						ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ЗапасыАДС.СуммаФакт));
						
						ЗаписьJSON.ЗаписатьКонецОбъекта();
						
					КонецЦикла;
					ЗаписьJSON.ЗаписатьКонецМассива();
					
					ЗаписьJSON.ЗаписатьКонецОбъекта();
					
			    КонецЦикла;
				ЗаписьJSON.ЗаписатьКонецМассива();
				
				ЗаписьJSON.ЗаписатьКонецОбъекта();
				
			КонецЦикла;
			
		ЗаписьJSON.ЗаписатьКонецМассива();
			
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	ЗаписьJSON.Закрыть();	
	
	
	
КонецПроцедуры

Функция ПолучитьПоказанияСчетчиков(ДатаЗакрытияПериода, ПриборУчета)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа,
	 |	ПоказанияПриборовУчетаСрезПоследних.Значение КАК ПредыдущиеПоказания,
	 |	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	 |	НЕОПРЕДЕЛЕНО КАК ТаблицаИстории,
	 |	""                               "" КАК ЗаводскойНомер,
	 |	""                                                                  "" КАК id,
	 |	0 КАК ТекущиеПоказания
	 |ИЗ
	 |	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&ДатаЗакрытияПериода, ПриборУчета = &ПриборУчета) КАК ПоказанияПриборовУчетаСрезПоследних
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВложенныйЗапрос.Период КАК Период,
	 |	ВложенныйЗапрос.ПриборУчета,
	 |	ВложенныйЗапрос.ВидТарифа,
	 |	ВложенныйЗапрос.Значение,
	 |	ВложенныйЗапрос.ИсточникПоказаний
	 |ИЗ
	 |	(ВЫБРАТЬ
	 |		ПоказанияПриборовУчетаССайта.Период КАК Период,
	 |		ПоказанияПриборовУчетаССайта.ПриборУчета КАК ПриборУчета,
	 |		ПоказанияПриборовУчетаССайта.ВидТарифа КАК ВидТарифа,
	 |		ПоказанияПриборовУчетаССайта.Значение КАК Значение,
	 |		""сайт"" КАК ИсточникПоказаний
	 |	ИЗ
	 |		РегистрСведений.ПоказанияПриборовУчетаССайта КАК ПоказанияПриборовУчетаССайта
	 |	ГДЕ
	 |		ПоказанияПриборовУчетаССайта.Период > &ДатаЗакрытияПериода
	 |		И ПоказанияПриборовУчетаССайта.ПриборУчета = &ПриборУчета
	 |	
	 |	ОБЪЕДИНИТЬ ВСЕ
	 |	
	 |	ВЫБРАТЬ
	 |		СнятыеПоказанияПриборовУчета.Период,
	 |		СнятыеПоказанияПриборовУчета.ПриборУчета,
	 |		ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Общий),
	 |		СнятыеПоказанияПриборовУчета.Значение,
	 |		""мобильный_контролер""
	 |	ИЗ
	 |		РегистрСведений.СнятыеПоказанияПриборовУчета КАК СнятыеПоказанияПриборовУчета
	 |	ГДЕ
	 |		СнятыеПоказанияПриборовУчета.Период > &ДатаЗакрытияПериода
	 |		И СнятыеПоказанияПриборовУчета.ПриборУчета = &ПриборУчета
	 |	
	 |	ОБЪЕДИНИТЬ ВСЕ
	 |	
	 |	ВЫБРАТЬ
	 |		ПоказанияПриборовУчетаИзТелеграмм.Период,
	 |		ПоказанияПриборовУчетаИзТелеграмм.ПриборУчета,
	 |		ПоказанияПриборовУчетаИзТелеграмм.ВидТарифа,
	 |		ПоказанияПриборовУчетаИзТелеграмм.Значение,
	 |		""телеграмм""
	 |	ИЗ
	 |		РегистрСведений.ПоказанияПриборовУчетаИзТелеграмм КАК ПоказанияПриборовУчетаИзТелеграмм
	 |	ГДЕ
	 |		ПоказанияПриборовУчетаИзТелеграмм.Период > &ДатаЗакрытияПериода
	 |		И ПоказанияПриборовУчетаИзТелеграмм.ПриборУчета = &ПриборУчета
	 |	
	 |	ОБЪЕДИНИТЬ ВСЕ
	 |	
	 |	ВЫБРАТЬ
	 |		ПоказанияПУИзВнешнихИсточников.Период,
	 |		ПоказанияПУИзВнешнихИсточников.ПриборУчета,
	 |		ПоказанияПУИзВнешнихИсточников.ВидТарифа,
	 |		ПоказанияПУИзВнешнихИсточников.Значение,
	 |		""контролер""
	 |	ИЗ
	 |		РегистрСведений.ПоказанияПУИзВнешнихИсточников КАК ПоказанияПУИзВнешнихИсточников
	 |	ГДЕ
	 |		ПоказанияПУИзВнешнихИсточников.Период > &ДатаЗакрытияПериода
	 |		И ПоказанияПУИзВнешнихИсточников.ПриборУчета = &ПриборУчета) КАК ВложенныйЗапрос
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	Период";
	
	
	Запрос.УстановитьПараметр("ДатаЗакрытияПериода", ДатаЗакрытияПериода);
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	
	Результат = Запрос.ВыполнитьПакет();
	
	
	ТаблицаПоказаний = Результат[0].Выгрузить();
	ТаблицаИстории = Результат[1].Выгрузить();
	
	Для Каждого СтрокаТаблицаПоказаний Из ТаблицаПоказаний Цикл
		
		ТаблицаИсторииОтбор = ТаблицаИстории.Скопировать(Новый Структура("ПриборУчета, ВидТарифа", СтрокаТаблицаПоказаний.ПриборУчета, СтрокаТаблицаПоказаний.ВидТарифа),);	
		СтрокаТаблицаПоказаний.ТаблицаИстории = ТаблицаИсторииОтбор;
		Если ТаблицаИсторииОтбор.Количество() = 0 Тогда
			СтрокаТаблицаПоказаний.ТекущиеПоказания = СтрокаТаблицаПоказаний.ПредыдущиеПоказания; 
		Иначе
			СтрокаТаблицаПоказаний.ТекущиеПоказания = ТаблицаИсторииОтбор[ТаблицаИсторииОтбор.Количество() - 1].Значение; 
		КонецЕсли;
		
		Если СтрокаТаблицаПоказаний.ВидТарифа = Перечисления.ВидыТарифов.Общий Тогда
			СтрокаТаблицаПоказаний.id = СокрЛП(XMLСтрока(СтрокаТаблицаПоказаний.ПриборУчета));
			СтрокаТаблицаПоказаний.ЗаводскойНомер = СокрЛП(СтрокаТаблицаПоказаний.ПриборУчета.ЗаводскойНомер); 
		Иначе
			СтрокаТаблицаПоказаний.id = СокрЛП(XMLСтрока(СтрокаТаблицаПоказаний.ПриборУчета) + Перечисления.ВидыТарифов.Индекс(СтрокаТаблицаПоказаний.ВидТарифа));
			СтрокаТаблицаПоказаний.ЗаводскойНомер = СокрЛП(СтрокаТаблицаПоказаний.ПриборУчета.ЗаводскойНомер + "_" + Строка(СтрокаТаблицаПоказаний.ВидТарифа)); 
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаПоказаний;
	
КонецФункции

Функция ПолучитьДатуЗакрытияПериода(ЛицевойСчет)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыЗапретаИзменения.ДатаЗапрета
		|ИЗ
		|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
		|ГДЕ
		|	ДатыЗапретаИзменения.Объект = &Здание
		|	И ДатыЗапретаИзменения.Раздел = &Раздел";
		
	Запрос.УстановитьПараметр("Здание", ЛицевойСчет.Владелец);
	Запрос.УстановитьПараметр("Раздел", ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.Здания);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.ДатаЗапрета;
	Иначе
		Возврат ЛицевойСчет.Владелец.ДатаНачалаУчета;
	КонецЕсли;
	
КонецФункции

Функция НайтиЗначениеАдреса(Адрес, Значение)
	
	ЗначениеАдреса = "";
	Для Счет = 1 По СтрЧислоСтрок(Адрес) Цикл
		Строка = СтрПолучитьСтроку(Адрес, Счет);
		Если СтрЧислоВхождений(Строка, Значение)>0 Тогда
			Позиция = Найти(Строка, "=");
			ЗначениеАдреса = Прав(Строка,СтрДлина(Строка)-Позиция);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначениеАдреса;
	
КонецФункции 

Функция ЗагрузитьДанныеПриборовУчета_Версия2(ФайлПриборовУчета)
	
	ИмяСвойства = "";
	ТаблицаПриборыУчета = Новый ТаблицаЗначений;
	ТаблицаПриборыУчета.Колонки.Добавить("Дата");
	ТаблицаПриборыУчета.Колонки.Добавить("ЛицевойСчет");
	ТаблицаПриборыУчета.Колонки.Добавить("Услуга");
	ТаблицаПриборыУчета.Колонки.Добавить("ПриборУчета");
	ТаблицаПриборыУчета.Колонки.Добавить("ВидТарифа");
	ТаблицаПриборыУчета.Колонки.Добавить("Показание");
	ТаблицаПриборыУчета.Колонки.Добавить("ПоказаниеПредыдущее");
	
	Попытка
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл(ФайлПриборовУчета);
	
	Пока ЧтениеJSON.Прочитать() Цикл
		ТипJSON = ЧтениеJSON.ТипТекущегоЗначения;
		Если ТипJSON = ТипЗначенияJSON.Число Или ТипJSON = ТипЗначенияJSON.Строка
			Или ТипJSON = ТипЗначенияJSON.Булево ИЛИ ТипJSON = ТипЗначенияJSON.Null Тогда
			
			Если ИмяСвойства = "date" Тогда
				Значение = ЧтениеJSON.ТекущееЗначение;
				НоваяСтрока = ТаблицаПриборыУчета.Добавить();
				НоваяСтрока.Дата = Дата(СокрЛП(Значение) + " 00:00:00");
			ИначеЕсли ИмяСвойства = "PersAcc_id" Тогда
				Значение = ЧтениеJSON.ТекущееЗначение;
				НоваяСтрока.ЛицевойСчет = Справочники.ЛицевыеСчета.ПолучитьСсылку(Новый УникальныйИдентификатор(Значение));
				
			ИначеЕсли ИмяСвойства = "id" Тогда
				Значение = ЧтениеJSON.ТекущееЗначение;
				Если СтрДлина(СокрЛП(Значение)) = 36 Тогда
					НоваяСтрока.ПриборУчета = Справочники.ПриборыУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(Значение));
					НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
				Иначе
					
					idПрибораУчета = Сред(Значение, 1, 36);
					НоваяСтрока.ПриборУчета = Справочники.ПриборыУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(idПрибораУчета));
					Попытка
						idВидаТарифа =  Число(Сред(Значение, 37, 1));
						НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов[idВидаТарифа];
					Исключение
						НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;	
					КонецПопытки;
					
				КонецЕсли;
				
			ИначеЕсли ИмяСвойства = "item_id" Тогда
				Значение = ЧтениеJSON.ТекущееЗначение;
				НоваяСтрока.Услуга = Справочники.Услуги.ПолучитьСсылку(Новый УникальныйИдентификатор(Значение));
				
			ИначеЕсли ИмяСвойства = "indicbef1" Тогда
				Значение = ЧтениеJSON.ТекущееЗначение;
				НоваяСтрока.ПоказаниеПредыдущее = Число(СтрЗаменить(Значение,",","."));
			ИначеЕсли ИмяСвойства = "indiccur1" Тогда
				Значение = ЧтениеJSON.ТекущееЗначение;
				НоваяСтрока.Показание = Число(СтрЗаменить(Значение,",","."));
			Иначе
				Значение = ЧтениеJSON.ТекущееЗначение;
			КонецЕсли;
			
		ИначеЕсли ТипJSON = ТипЗначенияJSON.Комментарий Тогда
			
			Комментарий = ЧтениеJSON.ТекущееЗначение;
			
		ИначеЕсли ТипJSON = ТипЗначенияJSON.ИмяСвойства Тогда
			
			ИмяСвойства = ЧтениеJSON.ТекущееЗначение;
			
		ИначеЕсли ТипJSON = ТипЗначенияJSON.НачалоОбъекта Или ТипJSON = ТипЗначенияJSON.КонецОбъекта
			Или ТипJSON = ТипЗначенияJSON.НачалоМассива ИЛИ ТипJSON = ТипЗначенияJSON.КонецМассива ИЛИ ТипJSON = ТипЗначенияJSON.Ничего Тогда
			
		
		КонецЕсли;
	КонецЦикла;
	
	ЧтениеJSON.Закрыть();
	
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru='Обмен данными ХВОЯ:Сайт ЖКХ';uk='Обмін даними ХВОЯ: Сайт ЖКГ'"), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	
	КонецПопытки;
	
	НаборССайта = РегистрыСведений.ПоказанияПриборовУчетаССайта.СоздатьНаборЗаписей();
	
	Для Каждого СтрокаПриборыУчета Из ТаблицаПриборыУчета Цикл
		
		НаборССайта.Отбор.ПриборУчета.Установить(СтрокаПриборыУчета.ПриборУчета);
		НаборССайта.Отбор.ЛицевойСчет.Установить(СтрокаПриборыУчета.ЛицевойСчет);
		НаборССайта.Отбор.Период.Установить(СтрокаПриборыУчета.Дата);
		
		НаборССайта.Прочитать();
			
		Если НаборССайта.Количество() > 0 Тогда
			НоваяСтрока = НаборССайта[0];
		Иначе
			НоваяСтрока = НаборССайта.Добавить();
		КонецЕсли;
		
		НоваяСтрока.ЛицевойСчет = СтрокаПриборыУчета.ЛицевойСчет;
		НоваяСтрока.ПриборУчета = СтрокаПриборыУчета.ПриборУчета;
		НоваяСтрока.ВидТарифа = СтрокаПриборыУчета.ВидТарифа;
		НоваяСтрока.Значение = СтрокаПриборыУчета.Показание;
		НоваяСтрока.Период = СтрокаПриборыУчета.Дата;
							
		НаборССайта.Записать();
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Процедура ПодготовкаВыгрузкиИстории(СтруктураНастройки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостояниеВыгрузкиИсторииСайтЖКХ.ПериодВыгрузки
		|ИЗ
		|	РегистрСведений.СостояниеВыгрузкиИсторииСайтЖКХ КАК СостояниеВыгрузкиИсторииСайтЖКХ
		|ГДЕ
		|	СостояниеВыгрузкиИсторииСайтЖКХ.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СостояниеВыгрузкиИсторииСайтЖКХ.ПериодВыгрузки
		|ИЗ
		|	РегистрСведений.СостояниеВыгрузкиИсторииСайтЖКХ КАК СостояниеВыгрузкиИсторииСайтЖКХ
		|ГДЕ
		|	СостояниеВыгрузкиИсторииСайтЖКХ.Организация = &Организация
		|	И НЕ СостояниеВыгрузкиИсторииСайтЖКХ.Подтверждено";
		
	Запрос.УстановитьПараметр("Организация", СтруктураНастройки.Организация);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ЭтоНачалоВыгрузкиИстории = МассивРезультатов[0].Пустой();
	ЭтоОкончаниеВыгрузкиИстории = МассивРезультатов[1].Пустой();
	
	Если ЗначениеЗаполнено(СтруктураНастройки.ДатаНачалаВыгрузкиНаСайт) Тогда
		
		Если ЭтоНачалоВыгрузкиИстории Тогда
			
			НаборЗаписей = РегистрыСведений.СостояниеВыгрузкиИсторииСайтЖКХ.СоздатьНаборЗаписей();	
			НаборЗаписей.Прочитать();
			ТаблицаВыгрузкиИстории = НаборЗаписей.Выгрузить();
			
			МесяцТекущейДаты = НачалоМесяца(ТекущаяДата());
			ПериодВыгрузки = НачалоМесяца(СтруктураНастройки.ДатаНачалаВыгрузкиНаСайт);
			
			Пока ПериодВыгрузки < МесяцТекущейДаты Цикл
				
				НоваяСтрока = ТаблицаВыгрузкиИстории.Добавить();
				НоваяСтрока.Организация = СтруктураНастройки.Организация;
				НоваяСтрока.ПериодВыгрузки = ПериодВыгрузки;
				
				ПериодВыгрузки = ДобавитьМесяц(ПериодВыгрузки, 1);
			КонецЦикла;
			
			НаборЗаписей.Загрузить(ТаблицаВыгрузкиИстории);
			НаборЗаписей.Записать();
		
		ИначеЕсли ЭтоОкончаниеВыгрузкиИстории Тогда
			
			НаборЗаписей = РегистрыСведений.СостояниеВыгрузкиИсторииСайтЖКХ.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Организация.Установить(СтруктураНастройки.Организация);
			НаборЗаписей.Записать();
			
			ТаблицаНастройки = Константы.НастройкаОбменДаннымиХвояСайтЖКХ.Получить().Получить();
			
			НайденныеСтроки = ТаблицаНастройки.НайтиСтроки(Новый Структура("Организация", СтруктураНастройки.Организация));
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденныеСтроки[0].ДатаНачалаВыгрузкиНаСайт = '00010101';
				Константы.НастройкаОбменДаннымиХвояСайтЖКХ.Установить(Новый ХранилищеЗначения(ТаблицаНастройки));
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОтметкаВыгрузкиИстории(СтруктураНастройки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияОбменовДаннымиХвояСайтЖКХ.ПериодВыгрузки КАК ПериодВыгрузки
		|ИЗ
		|	РегистрСведений.СостоянияОбменовДаннымиХвояСайтЖКХ КАК СостоянияОбменовДаннымиХвояСайтЖКХ
		|ГДЕ
		|	НЕ СостоянияОбменовДаннымиХвояСайтЖКХ.Подтверждено
		|	И СостоянияОбменовДаннымиХвояСайтЖКХ.ЛицевойСчет.Владелец.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	СостоянияОбменовДаннымиХвояСайтЖКХ.ПериодВыгрузки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодВыгрузки";
		
	Запрос.УстановитьПараметр("Организация", СтруктураНастройки.Организация);		
	ТаблицаНеОбработанныхПериодов = Запрос.Выполнить().Выгрузить();	
	
	
	НаборЗаписей = РегистрыСведений.СостояниеВыгрузкиИсторииСайтЖКХ.СоздатьНаборЗаписей();	
	
	НаборЗаписей.Отбор.Организация.Установить(СтруктураНастройки.Организация);
	НаборЗаписей.Прочитать();
			
	Для Каждого СтрокаНабораЗаписей Из НаборЗаписей Цикл 
		НайденныеСтроки = ТаблицаНеОбработанныхПериодов.НайтиСтроки(Новый Структура("ПериодВыгрузки", СтрокаНабораЗаписей.ПериодВыгрузки));
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаНабораЗаписей.Подтверждено = Истина;	
		Иначе
			СтрокаНабораЗаписей.Подтверждено = Ложь;	
		КонецЕсли;
	КонецЦикла;
		
	НаборЗаписей.Записать();

КонецПроцедуры


/////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОБМЕНА ДАННЫМИ

// Анализирует вариант обмена данными и выполнять соответствующие ему виды обмена.
//
// Параметры:
//  ВариантОбмена - СправочникСсылка.ВариантыОбменаДаннымиССайтом - вариант обмена.
//
Функция ВыполнитьОбменДаннымиССайтом(ВариантОбмена, Пароль = Неопределено, ДатаОбмена) Экспорт
	
	КлючВозврата = Неопределено;
	
	Если Пароль = Неопределено Тогда
		Пароль = ВариантОбмена.НастройкаДоступа.Пароль;
	КонецЕсли;
	
	Если ВариантОбмена.ВыгрузкаДанныхПоЛС Тогда
		КлючВозврата = ВыполнитьВыгрузкуДанныхПоЛС(ВариантОбмена, Пароль, ДатаОбмена);
	КонецЕсли;
	
	Если ВариантОбмена.ЗагрузкаПоказанийПУ Тогда
		ВыполнитьЗагрузкуПоказанийПоПУ(ВариантОбмена, Пароль);
	КонецЕсли;
	
	Если ВариантОбмена.ЗагрузкаРеестраПлатежей Тогда
		ВыполнитьЗагрузкуРеестраПлатежей(ВариантОбмена, Пароль);
	КонецЕсли;
	
	Если ВариантОбмена.ЗагрузкаСведенийОбАккаунтах Тогда
		ВыполнитьЗагрузкуСведенияОбАккаунтах(ВариантОбмена.НастройкаДоступа, Пароль, ВариантОбмена);
	КонецЕсли;
	
	Возврат КлючВозврата;
	
КонецФункции // ВыполнитьОбменДаннымиССайтом()

// Выполняет выгрузку на сайт параметров доступа по л/с.
//
// Параметры:
//  НастройкаДоступа - СправочникСсылка.НастройкиДоступаКСайту - настройка доступа
//  ТаблицаЛС - ТаблицаЗначений - таблица с параметрами доступа
//  ВсеПараметрыПереданы - Булево - признак того, что все параметры переданы на сайт
//  ВариантОбмена - СправочникСсылка.ВариантыОбменаДаннымиССайтом - вариант обмена
//
Функция ВыполнитьВыгрузкуПараметровДоступаПоЛС(НастройкаДоступа, ТаблицаЛС, ВсеПараметрыПереданы, 
												 ВариантОбмена = Неопределено, Пароль = Неопределено,
												 ОбновлятьПараметрыДоступа = Ложь) Экспорт
	
	СведенияОбОшибке = "";
	КлючВозврата = Неопределено;
	// Подготавливаем данные для формирования файла обмена.
	СтруктураПараметров = ПолучитьДанныеДляВыгрузки("access", НастройкаДоступа, ТаблицаЛС,,НастройкаДоступа.ВидШаблонаСайта);
	
	Если СтруктураПараметров = Неопределено Тогда
		СведенияОбОшибке = "Неизвестный формат файла обмена";
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(СведенияОбОшибке);
		
		Возврат Неопределено;
	КонецЕсли;
	
	ФайлВыгрузки = СформироватьФайлXML(СтруктураПараметров, ОбновлятьПараметрыДоступа, НастройкаДоступа.ВидШаблонаСайта);
	
	Если НастройкаДоступа.ТипОбмена = Перечисления.ТипыОбменаССайтом.Напрямую Тогда
		Ответ = ПередатьДанныеНаСайт(ФайлВыгрузки,
									  "accounts",
									  НастройкаДоступа.АдресСайта,
									  НастройкаДоступа.Логин,
									  ?(Пароль = Неопределено, НастройкаДоступа.Пароль, Пароль),
									  НастройкаДоступа.Организация.ИНН,
									  СведенияОбОшибке,
									  НастройкаДоступа.ВидШаблонаСайта);
		
		ВсеПараметрыПереданы = ?(Ответ = Неопределено, Ложь, Истина);
	Иначе
		
		//КопироватьФайл(ФайлВыгрузки, НастройкаДоступа.ФайловыйРесурс+"\ПараметровДоступаПоЛС.xml");
		//ПолноеИмяФайла = КаталогВременныхФайлов() + ФайлВыгрузки;
		КлючВозврата = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлВыгрузки));
		ВсеПараметрыПереданы = Истина;
	КонецЕсли;
	
	СоздатьЗаписьЖурналаРегистрации(НастройкаДоступа,
								  СведенияОбОшибке,
								  Перечисления.ВидыОбменаССайтом.ВыгрузкаДанныхЛС,
								  ВариантОбмена);
	Возврат КлючВозврата;								  
	
КонецФункции // ВыполнитьВыгрузкуПараметровДоступаПоЛС()

// Выполняет выгрузку на сайт основных учетных данных (начисления, показания по ПУ и пр.).
//
// Параметры:
//  ВариантОбмена - СправочникСсылка.ВариантыОбменаДаннымиССайтом - вариант обмена
//
Функция  ВыполнитьВыгрузкуДанныхПоЛС(ВариантОбмена, Пароль, ДатаОбмена)
	
	НастройкаДоступа  = ВариантОбмена.НастройкаДоступа;
	СведенияОбОшибке = "";
	КлючВозврата = Неопределено;
	
	СтруктураПараметров = ПолучитьДанныеДляВыгрузки("calculations", НастройкаДоступа, , ДатаОбмена);
	
	Если СтруктураПараметров = Неопределено Тогда
		СведенияОбОшибке = НСтр("ru='Не удалось сформировать файл обмена: неизвестный формат обмена.';uk='Не вдалося сформувати файл обміну: невідомий формат обміну.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
		
		Возврат Неопределено;
	КонецЕсли;
	
	ФайлВыгрузки = СформироватьФайлXML(СтруктураПараметров);
	Если ФайлВыгрузки = Неопределено Тогда
		СведенияОбОшибке = НСтр("ru='Не удалось сформировать файл обмена: неизвестный формат обмена.';uk='Не вдалося сформувати файл обміну: невідомий формат обміну.'");
		
		Возврат Неопределено;
	КонецЕсли;
	
	Если НастройкаДоступа.ТипОбмена = Перечисления.ТипыОбменаССайтом.Напрямую Тогда
		Ответ = ПередатьДанныеНаСайт(ФайлВыгрузки,
								  "accounts",
								  НастройкаДоступа.АдресСайта,
								  НастройкаДоступа.Логин,
								  Пароль,
								  НастройкаДоступа.Организация.ИНН,
								  СведенияОбОшибке,
								  НастройкаДоступа.ВидШаблонаСайта);
																			  
	Иначе
		
		//КопироватьФайл(ФайлВыгрузки, НастройкаДоступа.ФайловыйРесурс+"\ВыгрузкуДанныхПоЛС.xml");
		КлючВозврата = ПоместитьВоВременноеХранилище(ФайлВыгрузки);
	КонецЕсли;
	
	СоздатьЗаписьЖурналаРегистрации(ВариантОбмена.НастройкаДоступа,
								  СведенияОбОшибке,
								  Перечисления.ВидыОбменаССайтом.ВыгрузкаДанныхЛС,
								  ВариантОбмена);
								  
	Возврат КлючВозврата;							  
	
КонецФункции // ВыполнитьВыгрузкуДанныхПоЛС()

// Выполняет загрузку с сайта показания по ИПУ.
//
// Параметры:
//  ВариантОбмена - СправочникСсылка.ВариантыОбменаДаннымиССайтом - вариант обмена
//
Процедура ВыполнитьЗагрузкуПоказанийПоПУ(ВариантОбмена, Пароль)
	
	НастройкаДоступа = ВариантОбмена.НастройкаДоступа;
	СведенияОбОшибке = "";
	
	Если ВариантОбмена.НастройкаДоступа.ТипОбмена = Перечисления.ТипыОбменаССайтом.Напрямую Тогда
		ФайлЗагрузки = ЗагрузитьДанныеССайта("meters",
									   		  НастройкаДоступа.АдресСайта,
									   		  НастройкаДоступа.Логин,
									   		  Пароль,
									   		  НастройкаДоступа.Организация.ИНН,
									   		  СведенияОбОшибке,,
											  НастройкаДоступа.ВидШаблонаСайта);
																					  
		
	Иначе
		// Временная заглушка.
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ФайлЗагрузки = Неопределено Тогда
		СтруктураДанных = ПолучитьДанныеИзXML(ФайлЗагрузки, НастройкаДоступа, СведенияОбОшибке);
		
		ЗагрузитьДанныеВБазу(СтруктураДанных, НастройкаДоступа, СведенияОбОшибке);
	КонецЕсли;
	
	СоздатьЗаписьЖурналаРегистрации(ВариантОбмена.НастройкаДоступа,
								  СведенияОбОшибке,
								  Перечисления.ВидыОбменаССайтом.ЗагрузкаПоказанийПУ,
								  ВариантОбмена);
	
КонецПроцедуры // ВыполнитьЗагрузкуПоказанийПоПУ

// Выполняет загрузку с сайта реестра платежей.
//
// Параметры:
//  ВариантОбмена - СправочникСсылка.ВариантыОбменаДаннымиССайтом - вариант обмена
//
Процедура ВыполнитьЗагрузкуРеестраПлатежей(ВариантОбмена, Пароль)
	
	НастройкаДоступа = ВариантОбмена.НастройкаДоступа;
	СведенияОбОшибке = "";
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("НачальнаяДата", ПолучитьДатуПоследнейЗагрузкиРестраПлатежей(НастройкаДоступа));
	ДопПараметры.Вставить("КонечнаяДата",  ТекущаяДата());
	
	Если ВариантОбмена.НастройкаДоступа.ТипОбмена = Перечисления.ТипыОбменаССайтом.Напрямую Тогда
		ФайлЗагрузки = ЗагрузитьДанныеССайта("monetapayments",
									   		  НастройкаДоступа.АдресСайта,
									   		  НастройкаДоступа.Логин,
									   		  Пароль,
									   		  НастройкаДоступа.Организация.ИНН,
									   		  СведенияОбОшибке,
											  ДопПараметры,
											  НастройкаДоступа.ВидШаблонаСайта);
																					  
																					  
	Иначе
		// Временная заглушка.
		Возврат;
	КонецЕсли;
	
	Если НЕ ФайлЗагрузки = Неопределено Тогда
		СтруктураДанных = ПолучитьДанныеИзXML(ФайлЗагрузки, НастройкаДоступа, СведенияОбОшибке);
		
		ЗагрузитьДанныеВБазу(СтруктураДанных, НастройкаДоступа, СведенияОбОшибке);
		
		ДатаОбмена = СтруктураДанных.filedate;
	Иначе
		ДатаОбмена = ТекущаяДата();
	КонецЕсли;
	
	СоздатьЗаписьЖурналаРегистрации(ВариантОбмена.НастройкаДоступа,
								  СведенияОбОшибке,
								  Перечисления.ВидыОбменаССайтом.ЗагрузкаРеестраПлатежей,
								  ВариантОбмена,
								  ДатаОбмена);
	
КонецПроцедуры // ВыполнитьЗагрузкуРеестраПлатежей

// Выполнить загрузку с сайта сведений об аккаунтах.
//
// Параметры:
//  НастройкаДоступа - СправочникСсылка.НастройкиДоступаКСайту - настройка доступа
//  ВариантОбмена - СправочникСсылка.ВариантыОбменаДаннымиССайтом - вариант обмена
//  ФайлОбмена - Строка - путь к файлу обмена, выбранному пользователем
//
Процедура ВыполнитьЗагрузкуСведенияОбАккаунтах(НастройкаДоступа, Пароль, ВариантОбмена = Неопределено) Экспорт
	
	СведенияОбОшибке = "";
	
	ФайлОбмена = ЗагрузитьДанныеССайта("accexistence",
										НастройкаДоступа.АдресСайта,
										НастройкаДоступа.Логин,
										Пароль,
										НастройкаДоступа.Организация.ИНН,
										СведенияОбОшибке,
										НастройкаДоступа.ВидШаблонаСайта);
	
	Если НЕ ФайлОбмена = Неопределено Тогда
		СтруктураСведений = ПолучитьДанныеИзXML(ФайлОбмена, НастройкаДоступа, СведенияОбОшибке,НастройкаДоступа.ВидШаблонаСайта);
		
		ЗагрузитьДанныеВБазу(СтруктураСведений, НастройкаДоступа, СведенияОбОшибке);
	КонецЕсли;
	
	СоздатьЗаписьЖурналаРегистрации(НастройкаДоступа,
								  СведенияОбОшибке,
								  Перечисления.ВидыОбменаССайтом.ЗагрузкаСведенийОбАккаунтах,
								  ВариантОбмена);
КонецПроцедуры // ВыполнитьЗагрузкуСведенияОбАккаунтах()

// Данный общий модуль предназначен для хранения изменяемых механизмов, которые отвечают за сбор и запись
// данных в БД.
// Детальное описание форматов сбора/записи можно найти в комментариях к процедурам и функциям.


///////////////////////////////////////////////////////////////////////////////
// ЖУРНАЛ РЕГИСТРАЦИИ

// Создает запись в журнале регистрации.
//
// Параметры:
//  ВариантОбмена - СправочникСсылка.ВариантыОбменаДаннымиССайтом - вариант обмена данными
//  СведенияОбОшибке - Строка - сведения об ошибке (если такова имеется)
//  ВидОбмена - ПеречислениеСсылка.ВидыОбменаССайтом - вид обмена данными
//  ДатаОбмена - Дата - дата совершения обмена
//
Процедура СоздатьЗаписьЖурналаРегистрации(НастройкаДоступа, СведенияОбОшибке, ВидОбмена, ВариантОбмена = Неопределено, ДатаОбмена = Неопределено)
	
	НаборЗаписей = РегистрыСведений.ЖурналОбменаССайтом.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НастройкаДоступа.Установить(НастройкаДоступа);
	НаборЗаписей.Прочитать();
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.НастройкаДоступа = НастройкаДоступа;
	НоваяЗапись.ВариантОбмена    = ?(ВариантОбмена = Неопределено, Справочники.ВариантыОбменаДаннымиССайтом.ПустаяСсылка(), ВариантОбмена);
	НоваяЗапись.ВидОбмена        = ВидОбмена;
	НоваяЗапись.Дата             = ?(ДатаОбмена = Неопределено, ТекущаяДата(), ДатаОбмена);
	НоваяЗапись.Статус           = ?(ПустаяСтрока(СведенияОбОшибке), Истина, Ложь);
	НоваяЗапись.Ошибка           = СведенияОбОшибке;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры // СоздатьЗаписьЖурналаРегистрации()

///////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ СБОРА ДАННЫХ ДЛЯ ВЫГРУЗКИ

// Формирует структуру, содержащую сведения для выгрузки в XML.
// 
// Параметры:
//  ВариантВыгрузки - строка, содержащая наименование варианта выгрузки.
//                    Может принимать следующие значения:
//                     "Access"  - выгрузка параметров доступа л/с. Формируется
//                                  на основании аргумента <МассивЛС>.
//                     "Calculations" - выгрузка полной информации об организация,
//                                  начислениях на л/с, счетчиках, поставщиках услуг.
//                                  Аргумент <МассивЛС> не используется. Выгрузка
//                                  логинов л/с не осуществляется.
//                     "Accounts" - аналогично с вариантом "Расчеты", но с выгрузкой
//                                  логинов л/с.
//  НастройкаДоступа - ссылка на элемент справочника "Настройки доступа к сайту".
//  ТаблицаЛС - таблица с параметрам доступа по л/с. Используется только при варианте выгрузки "Access".
// 
// Возвращаемое значение:
//  Структура - содержит данные для выгрузки в XML.
//  Неопределено - в случае некорректных значений аргументов <ВариантВыгрузки> или <НастройкиОбмена>.
//
// Примечание:
// Выгрузка может производиться в соответствии со следующими вариантами:
// - "access" - выгружаются параметры доступа л/с.
// - "calculations" - выгружаются сведения о взаиморасчетах по л/с.
// - "accounts" - выгружаются сведения о взаиморасчетах по л/с, а также логины л/с для доступа на сайт.
//
// Данные для выгрузки представлены в виде структуры, все поля которой, содержат значения строкового типа, за исключением полей, хранящих таблицы значений и массивы (значения полей таблиц значений и массивов так же должны быть строковыми).
// Незаполненному значению поля соответствует пустая строка ("").
// Данная структура содержит следующие поля:
//
// 1) Для выгрузки параметров доступа л/с (Вариант выгрузки "Access"):
//
// filedate // Дата начала месяца выгрузки в формате "дд.ММ.гггг".
// name     // Наименование организации.
// inn      // ИНН.
// filetype // Тип файла ("Access").
// version  // версия механизма обмена ("3").
// \PersAcc     // Таблица л/с (таблица значений, заполняется на основании аргумента "ТаблицаЛС"), содержащая колонки:
//     kod_ls   // Идентификатор л/с.
//     login    // Логин л/с.
//     password // Пароль л/с.
//
// 2) Для выгрузки сведений о расчетах (Варианты выгрузки "Calculations" и "Accounts"):
//
// filedate // Дата формирования выгрузки.
// name     // Наименование организации.
// inn      // ИНН.
// filetype // Тип файла (Соответсвует наименованию варианта выгрузки: "Calculations" или "Accounts").
// version  // версия механизма обмена ("3").
// kpp      // КПП.
// bank     // Полное наименование банка.
// rs       // рассчетный счет.
// ks       // коррсчет.
// bik      // БИК.
// \contractors  // Таблица поставщиков (таблица значений), содержащая колонки:
//     id        // Код поставщика.
//     name      // Наименование поставщика.
//     executor  // Исполнитель ("1" для выбранной организации, для других поставщиков услуг не заполняется).
//     address   // Адрес, заполняется только для выбранной организации.
//     phone     // Телефон/факс, заполняется только для выбранной организации.
//     services  // Услуги, предоставляемые поставщиком. Если поставщик предоставляет несколько услуг, для каждой будет создана отдельная строка. Не заполняется для выбранной организации.
//     textValue // Текстовое содержимое, содержит платежные реквизиты поставщика услуг.
// \hmeters        // Таблица ОПУ (таблица значений), содержащая колонки:
//     value_count // Количество видов тарифов счетчика.
//     indiccur1   // Последнее учтенное дневное показание счетчика.
//     indiccur2   // Последнее учтенное ночное показание счетчика.
//     indiccur3   // Последнее учтенное пиковое показание счетчика.
//     kod         // Код счетчика.
//     name        // Наименование счетчика.
//     service     // Услуга, на которую установлен счетчик.
// \PersAcc              // Таблица л/с(таблица значений), содержащая колонки:
//     kod_ls            // Идентификатор л/с.
//     login             // Логин л/с. Заполняется только при варианте выгрузки "Accounts".
//     password          // Не заполняется.
//     AddressCity       // Адрес, город.
//     AddressDistrict   // Адрес, район города.
//     AddressFlat       // Адрес, квартира.
//     FlatAbbr          // Краткое обозначение типа помещения (кв., пом., каб. и т. п.) Если не указано, используется обозначение "кв.".
//     AddressHouse      // Адрес, дом.
//     AddressRegion     // Адрес, регион.
//     AddressSettlement // Адрес, населенный пункт.
//     AddressStreet     // Адрес, улица.
//     Barcode           // Штрихкод (для вывода в квитанциях).
//     commonarea        // Общая площадь помещения.
//     habarea           // Жилая площадь помещения.
//     debtbeg           // Задолженность на начало расчетного периода (период с начала месяца, на который происходит выгрузка, по окончание текущего дня).
//     debtend           // Задолженность на конец расчетного периода.
//     debtprev          // Задолженность за предыдущие периоды.
//     prepayment        // Аванс на начало расчетного периода.
//     sumtopay          // Итоговая сумма к оплате за расчетный период.
//     lastPaymentDate   // Дата последнего платежа.
//     email             // E-mail пользователя на сайте.
//     name              // ФИО владельца л/с.
//     name_ls           // Номер лицевого счета (Наименование).
//     people            // Количество проживающих.
//     num_of_reg        // Количество зарегистрированных.
//     \item            // Таблица начислений по услугам за расчетный период (таблица значений), содержащая колонки:
//         ammount      // объем потребления услуги (индивидуальный + общедомовой).
//         correction   // Сумма перерасчетов за расчетный период.
//         edizm        // Единица измерения.
//         kod          // Код услуги.
//         name         // Наименование услуги.
//         norm         // Норма потребления (полностью).
//         peni         // Пени, начисленные за расчетный период.
//         sum          // Сумма начисления (полностью).
//         sumpayed     // Сумма оплат, внесенных за расчетный период.
//         compensation // Сумма начисленных льгот.
//         sumtopay     // Сумма к оплате.
//         debtbeg      // Задолженность на начало расчетного период.
//         debtend      // Задолженность на конец отчетного периода.
//         hmeter       // Массив, содержащий коды ОПУ, установленных на услугу текущей строки таблицы.
//         hammount     // Объем потребления услуги (общедомовой).
//         hnorm        // Норма потребления (общедомовая).
//         hsum         // Сумма начисления (общедомовая).
//         hsumtopay    // Сумма к оплате (общедомовая).
//         volumeh      // Общий объем ОДН для здания.
//         tarif1       // Дневной тариф.
//         tarif2       // Ночной тариф. Заполняется только если услуга имеет 2 и более тарифов.
//         tarif3       // Пиковый тариф. Заполняется только если услуга имеет 2 и более тарифов.
//     \meter            // Таблица показаний ИПУ (таблица значений), содержащая колонки:
//         value_count   // Количество тарифов.
//         indicbef1     // Последнее учтенное показание на начало расчетного периода (Дневное). Не заполняется при совпадении date_indicbef и date_indiccur.
//         indicbef2     // Последнее учтенное показание на начало расчетного периода (Ночное). Не заполняется при совпадении date_indicbef и date_indiccur.
//         indicbef3     // Последнее учтенное показание на начало расчетного периода (Пиковое). Не заполняется при совпадении date_indicbef и date_indiccur.
//         date_indicbef // Дата последнего учтенного показания на начало расчетного периода. Не заполняется при совпадении date_indicbef и date_indiccur.
//         indiccur1     // Последнее учтенное показание на конец отчетного период (Дневное).
//         indiccur2     // Последнее учтенное показание на конец отчетного период (Ночное).
//         indiccur3     // Последнее учтенное показание на конец отчетного период (Пиковое).
//         date_indiccur // Дата последнего учтенного показания на начало расчетного периода.
//         kod           // Код счетчика.
//         name          // Наименование счетчика.
//         service       // Наименование услуги.
//     \contractor // Таблица поставщиков услуг, назначенных на л/с (таблица значений), содержащая колонки:
//         id      // Код поставщика.        
//         summ    // Итоговая сумма к оплате поставщику.
//
Функция ПолучитьДанныеДляВыгрузки(ВариантВыгрузки, НастройкаДоступа, ТаблицаЛС = Неопределено, ДатаОбмена = Неопределено,Шаблон = Неопределено)
	
	Если ДатаОбмена = Неопределено Тогда
		ДатаОбмена = ТекущаяДата();
	КонецЕсли;
	
	// Проверка настроек обмена.
	Если НЕ ЗначениеЗаполнено(НастройкаДоступа)
	 ИЛИ НЕ ЗначениеЗаполнено(НастройкаДоступа.Организация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
	// Начальные значения переменных.
	ТипФайла           = "";
	ВыгружатьВсеДанные = Ложь; // Выгружать все сведения об организации, начислениях и л/с.
	ВыгружатьЛогины    = Ложь; // Выгружать логины (для вариантов "Calculations" и "Accounts").
	Организация        = НастройкаДоступа.Организация;
	ПрефиксЛС          = ПолучитьПрефикс(Организация); // Префикс, добавляемый к коду л/с.
	ВариантВыгрузки    = НРег(ВариантВыгрузки);
	
	// Определение переменных.
	Если ВариантВыгрузки = "access" Тогда
		ТипФайла           = "access";
	ИначеЕсли ВариантВыгрузки = "calculations" Тогда
		ТипФайла           = "calculations";
		ВыгружатьВсеДанные = Истина;
		МассивЛС           = ПолучитьМассивЛицевыхСчетовОрганизации(Организация, ДатаОбмена);
	ИначеЕсли ВариантВыгрузки = "accounts" Тогда
		ТипФайла           = "accounts";
		ВыгружатьВсеДанные = Истина;
		ВыгружатьЛогины    = Истина;
		МассивЛС           = ПолучитьМассивЛицевыхСчетовОрганизации(Организация, ДатаОбмена);
	Иначе
		// Если неверный вариант выгрузки.
		Возврат Неопределено;
	КонецЕсли;
	
	//////// Сбор данных ////////
	
	// Сведения об организации.
	СведенияОбОрганизации = ПолучитьСведенияОбОрганизации(Организация, ТипФайла, ВыгружатьВсеДанные, ДатаОбмена);
	
	// Сбор сведений для полной выгрузки.
	Если ВыгружатьВсеДанные Тогда
		ТаблицаНачисленийОбщая         = ПолучитьТаблицуНачислений(Организация, МассивЛС, ДатаОбмена);
		ТаблицаИПУОбщая                = ПолучитьСведенияОбИПУ(МассивЛС, ДатаОбмена);
		ТаблицаЛицевыхСчетовОбщая      = ПолучитьСведенияОЛицевыхСчетах(МассивЛС, ТаблицаНачисленийОбщая, ВыгружатьЛогины, ДатаОбмена);
	КонецЕсли;
	
	//////// Формирование структуры выгрузки ////////
	
	СтруктураВыгрузки = Новый Структура;
	
	// Общие данные организации
	СтруктураВыгрузки.Вставить("filedate", Формат(НачалоМесяца(СведенияОбОрганизации.filedate),"ДЛФ=Д"));
	СтруктураВыгрузки.Вставить("name",     СведенияОбОрганизации.name);
	СтруктураВыгрузки.Вставить("inn",      СведенияОбОрганизации.inn);
	СтруктураВыгрузки.Вставить("filetype", СведенияОбОрганизации.filetype);
	СтруктураВыгрузки.Вставить("version",  СведенияОбОрганизации.version);
	
	// Дополнительные данные организации
	Если ВыгружатьВсеДанные Тогда
		
		// Реквизиты организации
		СтруктураВыгрузки.Вставить("kpp",  СведенияОбОрганизации.kpp);
		СтруктураВыгрузки.Вставить("bank", СведенияОбОрганизации.bank);
		СтруктураВыгрузки.Вставить("rs",   СведенияОбОрганизации.rs);
		СтруктураВыгрузки.Вставить("ks",   СведенияОбОрганизации.ks);
		СтруктураВыгрузки.Вставить("bik",  СведенияОбОрганизации.bik);
		
	КонецЕсли;
	
	//////// ЛИЦЕВЫЕ СЧЕТА ////////
	
	// Общие данные
	СтруктураВыгрузки.Вставить("PersAcc", Новый ТаблицаЗначений);
	СтруктураВыгрузки.PersAcc.Колонки.Добавить("kod_ls");
	СтруктураВыгрузки.PersAcc.Колонки.Добавить("login");
	СтруктураВыгрузки.PersAcc.Колонки.Добавить("password");
	СтруктураВыгрузки.PersAcc.Колонки.Добавить("email");
	
	Если ВыгружатьВсеДанные Тогда
		
		// Структуры отборов.
		ОтборПоЛС     = Новый Структура("ЛицевойСчет");
		ОтборПоЗданию = Новый Структура("Здание");
		ОтборПоУслуге = Новый Структура("Услуга");
		
		// Создаем таблицу л/с
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("AddressCity");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("AddressDistrict");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("AddressFlat");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("FlatAbbr");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("AddressHouse");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("AddressRegion");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("AddressSettlement");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("AddressStreet");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("Barcode");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("commonarea");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("debtbeg");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("debtend");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("debtprev");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("prepayment");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("sumtopay");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("lastPaymentDate");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("habarea");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("name");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("name_ls");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("people");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("num_of_reg");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("item");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("meter");
		СтруктураВыгрузки.PersAcc.Колонки.Добавить("contractor");
		
		// Заполняем таблицу л/с
		Для каждого ТекЛС из ТаблицаЛицевыхСчетовОбщая Цикл

			НоваяСтрока = СтруктураВыгрузки.PersAcc.Добавить();
			
			НоваяСтрока.AddressCity       = СокрЛП(ТекЛС.AddressCity);
			НоваяСтрока.AddressDistrict   = СокрЛП(ТекЛС.AddressDistrict);
			НоваяСтрока.AddressFlat       = Строка(ТекЛС.AddressFlat);
			НоваяСтрока.FlatAbbr 		  = ?(ЗначениеЗаполнено(ТекЛС.FlatAbbr), Строка(ТекЛС.FlatAbbr) + " " + Строка(ТекЛС.AddressFlat) , "");
			НоваяСтрока.AddressHouse      = Строка(ТекЛС.AddressHouse) + ?(ЗначениеЗаполнено(ТекЛС.Корпус), "/" + Строка(ТекЛС.Корпус), "");
			НоваяСтрока.AddressRegion     = СокрЛП(ТекЛС.AddressRegion);
			НоваяСтрока.AddressSettlement = СокрЛП(ТекЛС.AddressSettlement);
			НоваяСтрока.AddressStreet     = СокрЛП(ТекЛС.AddressStreet);
			НоваяСтрока.Barcode           = ПолучитьШтрихКод(ТекЛС.ЛицевойСчет, НастройкаДоступа.Организация, ТекЛС.sumtopay);
			НоваяСтрока.commonarea        = Строка(ТекЛС.commonarea);
			НоваяСтрока.debtbeg           = Строка(ТекЛС.debtbeg);
			НоваяСтрока.debtend           = Строка(ТекЛС.debtend);
			НоваяСтрока.debtprev          = Строка(ТекЛС.debtprev);
			НоваяСтрока.prepayment        = Строка(ТекЛС.prepayment);
			НоваяСтрока.sumtopay          = Строка(ТекЛС.sumtopay);
			НоваяСтрока.lastPaymentDate   = Строка(Формат(ТекЛС.lastPaymentDate, "ДФ=дд.ММ.гггг"));
			НоваяСтрока.email             = СокрЛП(ТекЛС.email);
			НоваяСтрока.habarea           = Строка(ТекЛС.habarea);
			Если Шаблон = Перечисления.ВариантыСайта.СИНГРИ Тогда
				НоваяСтрока.kod_ls            = СокрЛП(ТекЛС.login);
			Иначе
				НоваяСтрока.kod_ls            = ПрефиксЛС + СокрЛП(ТекЛС.kod_ls);
			КонецЕсли;
			НоваяСтрока.name              = Строка(ТекЛС.name1);
			НоваяСтрока.name_ls           = Строка(ТекЛС.name_ls);
			НоваяСтрока.people            = Строка(ТекЛС.people);
			НоваяСтрока.num_of_reg        = Строка(ТекЛС.num_of_reg);
			НоваяСтрока.login             = ?(ВыгружатьЛогины, СокрЛП(ТекЛС.login), "");
			НоваяСтрока.password          = "";
			
			// Отборы для таблиц услуг, пу, поставщиков.
			ОтборПоЛС.ЛицевойСчет = ТекЛС.ЛицевойСчет;
			ОтборПоЗданию.Здание  = ТекЛС.Здание;
			
			// Отбор нужных улсуг, счетчиков и поставщиков
			СтрокиНачислений  = ТаблицаНачисленийОбщая.НайтиСтроки(ОтборПоЛС);
			СтрокиИПУ         = ТаблицаИПУОбщая.НайтиСтроки(ОтборПоЛС);
			
			// НАЧИСЛЕНИЯ
			Если НЕ СтрокиНачислений.Количество() = 0 Тогда
				
				НоваяСтрока.item = Новый ТаблицаЗначений;
				НоваяСтрока.item.Колонки.Добавить("ammount");
				НоваяСтрока.item.Колонки.Добавить("correction");
				НоваяСтрока.item.Колонки.Добавить("edizm");
				НоваяСтрока.item.Колонки.Добавить("kod");
				НоваяСтрока.item.Колонки.Добавить("name");
				НоваяСтрока.item.Колонки.Добавить("norm");
				НоваяСтрока.item.Колонки.Добавить("peni");
				НоваяСтрока.item.Колонки.Добавить("sum");
				НоваяСтрока.item.Колонки.Добавить("sumpayed");
				НоваяСтрока.item.Колонки.Добавить("compensation");
				НоваяСтрока.item.Колонки.Добавить("sumtopay");
				НоваяСтрока.item.Колонки.Добавить("debtbeg");
				НоваяСтрока.item.Колонки.Добавить("debtend");
				НоваяСтрока.item.Колонки.Добавить("hmeter");
				НоваяСтрока.item.Колонки.Добавить("hammount");
				НоваяСтрока.item.Колонки.Добавить("hnorm");
				НоваяСтрока.item.Колонки.Добавить("hsum");
				НоваяСтрока.item.Колонки.Добавить("hsumtopay");
				НоваяСтрока.item.Колонки.Добавить("volumeh");
				НоваяСтрока.item.Колонки.Добавить("tarif1");
				НоваяСтрока.item.Колонки.Добавить("tarif2");
				НоваяСтрока.item.Колонки.Добавить("tarif3");
				
				Для каждого ТекНачисление из СтрокиНачислений Цикл
					
					// Создание новой строки начислений.
					СтрокаУслуга = НоваяСтрока.item.Добавить();
					
					СтрокаУслуга.ammount      = Строка(ТекНачисление.ammount);
					СтрокаУслуга.correction   = Строка(ТекНачисление.correction);
					СтрокаУслуга.edizm        = Строка(ТекНачисление.edizm);
					СтрокаУслуга.kod          = Строка(ТекНачисление.kod);
					СтрокаУслуга.name         = Строка(ТекНачисление.Name);
					СтрокаУслуга.norm         = Строка(ТекНачисление.norm);
					СтрокаУслуга.peni         = Строка(ТекНачисление.peni);
					СтрокаУслуга.sum          = Строка(ТекНачисление.sum);
					СтрокаУслуга.sumpayed     = Строка(ТекНачисление.sumpayed);
					СтрокаУслуга.compensation = Строка(-ТекНачисление.compensation);
					
					Если ТекНачисление.ЭтоАванс Тогда
						СтрокаУслуга.sumtopay     = Строка(-ТекНачисление.sumpayed);
						
					Иначе
						СтрокаУслуга.sumtopay     = Строка(ТекНачисление.sum);
					КонецЕсли;
					
					СтрокаУслуга.debtbeg      = Строка(ТекНачисление.debtbeg);
					СтрокаУслуга.debtend      = Строка(ТекНачисление.debtend);
					
					// Тарифы.
					СтрокаУслуга.tarif1 = Строка(ТекНачисление.tarif1);
					Если ТекНачисление.Многотарифная Тогда
						СтрокаУслуга.tarif2 = Строка(ТекНачисление.tarif2);
						СтрокаУслуга.tarif3 = Строка(ТекНачисление.tarif3);
					Иначе
						СтрокаУслуга.tarif2 = "";
						СтрокаУслуга.tarif3 = "";
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
			// ИПУ
			Если НЕ СтрокиИПУ.Количество() = 0 Тогда
				
				НоваяСтрока.meter = Новый ТаблицаЗначений;
				НоваяСтрока.meter.Колонки.Добавить("value_count");
				НоваяСтрока.meter.Колонки.Добавить("indicbef1");
				НоваяСтрока.meter.Колонки.Добавить("indicbef2");
				НоваяСтрока.meter.Колонки.Добавить("indicbef3");
				НоваяСтрока.meter.Колонки.Добавить("date_indicbef");
				НоваяСтрока.meter.Колонки.Добавить("indiccur1");
				НоваяСтрока.meter.Колонки.Добавить("indiccur2");
				НоваяСтрока.meter.Колонки.Добавить("indiccur3");
				НоваяСтрока.meter.Колонки.Добавить("date_indiccur");
				НоваяСтрока.meter.Колонки.Добавить("kod");
				НоваяСтрока.meter.Колонки.Добавить("name");
				НоваяСтрока.meter.Колонки.Добавить("service");
				
				// Записываем и заполняем элементы "meter" для текущего элемента "PersAcc".
				Для Каждого ТекСчетчик Из СтрокиИПУ Цикл
					
					//meter - данные по индивидуальным счетчикам.
					СтрокаСчетчик = НоваяСтрока.meter.Добавить();
					
					СтрокаСчетчик.value_count   = Строка(ТекСчетчик.value_count);
					СтрокаСчетчик.kod           = Строка(ТекСчетчик.kod);
					СтрокаСчетчик.name          = Строка(ТекСчетчик.MName);
					СтрокаСчетчик.service       = Строка(ТекСчетчик.service);
					СтрокаСчетчик.indiccur1     = Строка(ТекСчетчик.indiccur1);
					СтрокаСчетчик.indiccur2     = Строка(ТекСчетчик.indiccur2);
					СтрокаСчетчик.indiccur3     = Строка(ТекСчетчик.indiccur3);
					СтрокаСчетчик.date_indiccur = Строка(ТекСчетчик.date_indiccur);
					
					// Даты показаний.
					Если ЗначениеЗаполнено(ТекСчетчик.date_indicbef) И НЕ ТекСчетчик.date_indicbef = ТекСчетчик.date_indiccur Тогда
						СтрокаСчетчик.indicbef1     = Строка(ТекСчетчик.indicbef1);
						СтрокаСчетчик.indicbef2     = Строка(ТекСчетчик.indicbef2);
						СтрокаСчетчик.indicbef3     = Строка(ТекСчетчик.indicbef3);
						СтрокаСчетчик.date_indicbef = Строка(ТекСчетчик.date_indicbef);
					Иначе
						СтрокаСчетчик.indicbef1     = "";
						СтрокаСчетчик.indicbef2     = "";
						СтрокаСчетчик.indicbef3     = "";
						СтрокаСчетчик.date_indicbef = "";
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		// Параметры доступа
		Для каждого СтрокаЛС из ТаблицаЛС Цикл
			
			Если СтрокаЛС = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = СтруктураВыгрузки.PersAcc.Добавить();
			НоваяСтрока.kod_ls   = ПрефиксЛС + СокрЛП(СтрокаЛС.ЛицевойСчет.Идентификатор);
			НоваяСтрока.login    = Строка(СтрокаЛС.Логин);
			НоваяСтрока.password = Строка(СтрокаЛС.Пароль);
			НоваяСтрока.email   = СокрЛП(СтрокаЛС.ЛицевойСчет.ЭлПочта);
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураВыгрузки;
	
КонецФункции

// Формирует массив всех л/с выбранной организации, действующих на текущую дату.
// 
// Параметры:
//  Организация - выбранная организация
// 
// Возвращаемое значение:
//  Массив - массив л/с
//
// Примечание:
//  Функция должна возвращать массив со всеми лицевыми счетами, сведения о которых планируется передать
//  на сайт в ходе обмена основными учетными данными (начисления, показания по ПУ и т. д.).
//
Функция ПолучитьМассивЛицевыхСчетовОрганизации(Организация, ДатаОбмена, МассивЗданий = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОНаличииПараметровДоступа.ЛицевойСчет
		|ПОМЕСТИТЬ втЛССПараметрами
		|ИЗ
		|	РегистрСведений.СведенияОНаличииПараметровДоступа КАК СведенияОНаличииПараметровДоступа
		|ГДЕ
		|	СведенияОНаличииПараметровДоступа.НаличиеПараметров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета.СрезПоследних(
		|			&ДатаКон,
		|			ЛицевойСчет.Владелец.Организация = &Организация
		|				И ВЫБОР
		|					КОГДА &МассивЗданий = НЕОПРЕДЕЛЕНО
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛицевойСчет.Владелец В (&МассивЗданий)
		|				КОНЕЦ) КАК ЛицевыеСчетаСрезПоследних
		|ГДЕ
		|	ЛицевыеСчетаСрезПоследних.Действует
		|	И ЛицевыеСчетаСрезПоследних.ЛицевойСчет В
		|				(ВЫБРАТЬ
		|					втЛССПараметрами.ЛицевойСчет
		|				ИЗ
		|					втЛССПараметрами КАК втЛССПараметрами)";
		
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаКон",     КонецДня(ДатаОбмена));
	Запрос.УстановитьПараметр("МассивЗданий", МассивЗданий);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.ВыгрузитьКолонку("ЛицевойСчет");
	
КонецФункции // ПолучитьМассивЛицевыхСчетовОрганизации()

// Формирует структуру, содержащую сведения об организации.
// 
// Параметры:
//  Организация - выбранная организация
//  ТипФайла    - строка, определяет значение поля "filetype" выходной структуры.
//  ВыгружатьВсеДанные - булево, определяет, добавить ли в выходную структуру
//    сведения о банковском счете организации.
// 
// Возвращаемое значение:
//  Структура - содержит сведения о выбранной организации.
//
// Примечание:
//  Данная структура будет использоваться для формирования файла обмена.
//  Поэтому наличие и наименования ключей структуры должно быть неизменно.
//
Функция ПолучитьСведенияОбОрганизации(Организация, ТипФайла, ВыгружатьВсеДанные = Ложь, ДатаОбмена)
	
	СтруктураОрганизации = Новый Структура("name, inn, filedate, filetype, version",
								Организация.Наименование, // name
								Организация.ИНН,          // inn
								ДатаОбмена,            // filedate
								ТипФайла,                 // filetype
								ПолучитьТекущуюВерсиюМеханизмаИнтеграции()); // version
	
	Если ВыгружатьВсеДанные Тогда
		СтруктураОрганизации.Вставить("kpp",  Организация.ИНН); // КПП
		СтруктураОрганизации.Вставить("bank", Организация.БанковскийСчетПоУмолчанию.Банк.Наименование); // банк
		СтруктураОрганизации.Вставить("bik",  Организация.БанковскийСчетПоУмолчанию.Банк.Код); // БИК
		СтруктураОрганизации.Вставить("ks",   Организация.БанковскийСчетПоУмолчанию.Банк.КоррСчет); // Коррсчет
		СтруктураОрганизации.Вставить("rs",   Организация.БанковскийСчетПоУмолчанию.НомерСчета); // Расчетный счет
	КонецЕсли;
	
	Возврат СтруктураОрганизации;
	
КонецФункции // ПолучитьСведенияОбОрганизации()

// Формирует таблицу начислений.
// 
// Параметры:
//  Организация - выбранная организация
//  МассивЛС    - массив л/с
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица начислений
//
// Примечание:
//  Данные текущей таблицы значений будут использоваться для формирования файл обмена.
//  Поэтому наличие и наименование колонок таблицы должно быть неизменно.
//  
//  Колонки:
//   ЛицевойСчет - ссылка на лицевой счет
//   Услуга - ссылка на услугу
//   SName - наименование услуги
//   VidName - наименование вида услуги
//   kod - код услуги
//   edizm - единица измерения услуги
//   tarif1 - размер дневного вида тарифа по услуге
//   tarif2 - размер ночного вида тарифа по услуге
//   tarif3 - размер пикового вида тарифа по услуге
//   Многотарифная - факт того, что услуга является многотарифной
//   ammount - суммарный объем потребления услуги лицевым счетом
//   hammount - общедомовой объем потребления услуги лицевым счетом
//   sum - сумма начисления на лицевой счет по услуге без учета перерасчетов, пеней и льгот
//   hsum - ОДН на лицевой счет по услуге
//   sumpayed - сумма оплат, внесенных лицевым счетом по услуге
//   ДатаПоследнейОплаты - дата последней поступившей оплаты от лицевого счета по услуге
//   correction - сумма перерасчетов по услуге
//   peni - сумма пеней, начисленных на лицевой счет по услуге
//   compensation - сумма льгот, начисленных на лицевой счет по услуге
//   msumtopay - сумма начисления на лицевой счет по услуге с учетом перерасчетов, пеней и льгот
//   hsumtopay - ОДН на лицевой счет по услуге с учетом перерасчетов, пеней и льгот
//   debtbeg - начальное сальдо по лицевому счету - услуге
//   debtend - конечное сальдо по лицевому счету - услуге
//   norm - размер нормы, установленной на лицевой счет по услуге
//   hnorm - размер нормы, установленной на здание по услуге
//   РасходИПУОбщ - суммарный объем индивидуальный потребления услуги всеми лицевыми счетами здания
//   volumeh - суммарный объем потребления услуги всеми лицевыми счетами здания, пошедший на ОДН
//   CONId - код поставщика услуги
//   summ - итоговая сумма начисления на лицевой счет по всем услугам текущего поставщика услуг
//   DebtPrev - сумма задолженности лицевого счета за предыдущие периоды по услуге: [Начальное сальдо] - [Внесенные оплаты]
//   SumToPay - итоговая сумма к оплате по лицевому счету - услуге
//
Функция ПолучитьТаблицуНачислений(Организация, МассивЛС, ДатаОбмена)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет,
		|	РасчетыПоЛицевымСчетамОбороты.Услуга,
		|	СУММА(РасчетыПоЛицевымСчетамОбороты.СуммаПриход) КАК sum,
		|	СУММА(РасчетыПоЛицевымСчетамОбороты.СуммаРасход) КАК sumpayed,
		|	РасчетыПоЛицевымСчетамОбороты.Услуга.Наименование КАК name,
		|	РасчетыПоЛицевымСчетамОбороты.Услуга.Идентификатор КАК kod,
		|	РасчетыПоЛицевымСчетамОбороты.Услуга.ЕдиницаИзмерения КАК edizm,
		|	РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет.Владелец КАК Здание,
		|	РасчетыПоЛицевымСчетамОбороты.Услуга.ПолеСортировки,
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетамОбороты.МесяцНачисления = &ПустаяДата
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоАванс
		|ПОМЕСТИТЬ втОборотыЛС
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(
		|			&ДатаНач,
		|			&ДатаКон,
		|			Месяц,
		|			ЛицевойСчет В (&МассивЛС)
		|				И Организация = &Организация) КАК РасчетыПоЛицевымСчетамОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет,
		|	РасчетыПоЛицевымСчетамОбороты.Услуга,
		|	РасчетыПоЛицевымСчетамОбороты.Услуга.Наименование,
		|	РасчетыПоЛицевымСчетамОбороты.Услуга.Идентификатор,
		|	РасчетыПоЛицевымСчетамОбороты.Услуга.ЕдиницаИзмерения,
		|	РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет.Владелец,
		|	РасчетыПоЛицевымСчетамОбороты.Услуга.ПолеСортировки,
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетамОбороты.МесяцНачисления = &ПустаяДата
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыСрезПоследних.Услуга,
		|	ВЫБОР
		|		КОГДА ТарифыСрезПоследних.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Общий)
		|				ИЛИ ТарифыСрезПоследних.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Дневной)
		|			ТОГДА ТарифыСрезПоследних.ЗначениеТарифа
		|	КОНЕЦ КАК tarif1,
		|	ТарифыСрезПоследних.НормаПотребления,
		|	ТарифыСрезПоследних.ЗначениеТарифаПоНорме,
		|	ТарифыСрезПоследних.Здание,
		|	ВЫБОР
		|		КОГДА ТарифыСрезПоследних.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Ночной)
		|			ТОГДА ТарифыСрезПоследних.ЗначениеТарифа
		|	КОНЕЦ КАК tarif2,
		|	ВЫБОР
		|		КОГДА ТарифыСрезПоследних.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Пиковый)
		|			ТОГДА ТарифыСрезПоследних.ЗначениеТарифа
		|	КОНЕЦ КАК tarif3
		|ПОМЕСТИТЬ втТарифы
		|ИЗ
		|	РегистрСведений.Тарифы.СрезПоследних(&ДатаКон, Организация = &Организация) КАК ТарифыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет,
		|	РасчетыПоЛицевымСчетам.Услуга,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Пени)
		|				ТОГДА РасчетыПоЛицевымСчетам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК peni,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
		|					ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
		|				ТОГДА РасчетыПоЛицевымСчетам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК compensation,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
		|				ТОГДА РасчетыПоЛицевымСчетам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК correction,
		|	0 КАК norm,
		|	0 КАК ammount,
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетам.МесяцНачисления = &ПустаяДата
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоАванс
		|ПОМЕСТИТЬ втЛьготы
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		|ГДЕ
		|	РасчетыПоЛицевымСчетам.Период >= &ДатаНач
		|	И РасчетыПоЛицевымСчетам.Период <= &ДатаКон
		|	И РасчетыПоЛицевымСчетам.Организация = &Организация
		|	И РасчетыПоЛицевымСчетам.ЛицевойСчет В(&МассивЛС)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет,
		|	РасчетыПоЛицевымСчетам.Услуга,
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетам.МесяцНачисления = &ПустаяДата
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОборотыЛС.ЛицевойСчет КАК ЛицевойСчет,
		|	втОборотыЛС.Услуга,
		|	МАКСИМУМ(втОборотыЛС.sum) КАК sum,
		|	МАКСИМУМ(втОборотыЛС.sumpayed) КАК sumpayed,
		|	втОборотыЛС.name,
		|	втОборотыЛС.kod,
		|	втОборотыЛС.edizm,
		|	МАКСИМУМ(втЛьготы.peni) КАК peni,
		|	МАКСИМУМ(втЛьготы.compensation) КАК compensation,
		|	МАКСИМУМ(ЕСТЬNULL(втТарифы.tarif1, 0)) КАК tarif1,
		|	МАКСИМУМ(втЛьготы.correction) КАК correction,
		|	ЛОЖЬ КАК Многотарифная,
		|	МАКСИМУМ(ЕСТЬNULL(втТарифы.tarif2, 0)) КАК tarif2,
		|	МАКСИМУМ(ЕСТЬNULL(втТарифы.tarif3, 0)) КАК tarif3,
		|	СУММА(0) КАК hammount,
		|	СУММА(0) КАК hsum,
		|	СУММА(0) КАК msumtopay,
		|	СУММА(0) КАК hsumtopay,
		|	СУММА(0) КАК debtbeg,
		|	СУММА(0) КАК debtend,
		|	СУММА(0) КАК hnorm,
		|	МАКСИМУМ(втЛьготы.norm) КАК norm,
		|	МАКСИМУМ(втЛьготы.ammount) КАК ammount,
		|	втЛьготы.ЭтоАванс
		|ИЗ
		|	втОборотыЛС КАК втОборотыЛС
		|		ЛЕВОЕ СОЕДИНЕНИЕ втТарифы КАК втТарифы
		|		ПО втОборотыЛС.Услуга = втТарифы.Услуга
		|			И втОборотыЛС.Здание = втТарифы.Здание
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЛьготы КАК втЛьготы
		|		ПО втОборотыЛС.ЛицевойСчет = втЛьготы.ЛицевойСчет
		|			И втОборотыЛС.Услуга = втЛьготы.Услуга
		|			И втОборотыЛС.ЭтоАванс = втЛьготы.ЭтоАванс
		|
		|СГРУППИРОВАТЬ ПО
		|	втЛьготы.ЭтоАванс,
		|	втОборотыЛС.ЛицевойСчет,
		|	втОборотыЛС.Услуга,
		|	втОборотыЛС.edizm,
		|	втОборотыЛС.kod,
		|	втОборотыЛС.name
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет,
		|	втОборотыЛС.Услуга.ВидУслуги.ПолеСортировки";	
		
		
	Запрос.УстановитьПараметр("ДатаНач",     НачалоМесяца(ДатаОбмена));
	Запрос.УстановитьПараметр("ДатаКон",     КонецДня(ДатаОбмена));
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("МассивЛС",    МассивЛС);
	Запрос.УстановитьПараметр("ПустаяДата",  '00010101');
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТаблицуНачислений()

// Формирует таблицу сведений о ИПУ.
// 
// Параметры:
//  МассивЛС - массив л/с
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица сведений о ИПУ
//
// Примечание:
//  Данные текущей таблицы значений будут использоваться для формирования файл обмена.
//  Поэтому наличие и наименования колонок таблицы должно быть неизменно.
//  
//  Колонки:
//   ЛицевойСчет - ссылка на лицевой счет
//   service - наименование услуги
//   SName - наименование вида услуги
//   MName - наименование счетчика
//   kod - код счетчика
//   value_count - тарифность счетчика (число)
//   indicbef1 - предыдущие показания счетчика по дневному тарифу
//   indicbef2 - предыдущие показания счетчика по ночному тарифу
//   indicbef3 - предыдущие показания счетчика по пиковому тарифу
//   indiccur1 - текущие показания счетчика по дневному тарифу
//   indiccur2 - текущие показания счетчика по ночному тарифу
//   indiccur3 - текущие показания счетчика по пиковому тарифу
//   date_indicbef - дата предыдущих показаний счетчика
//   date_indiccur - дата текущих показаний счетчика
//
Функция ПолучитьСведенияОбИПУ(МассивЛС, ДатаОбмена)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		|ПОМЕСТИТЬ втЛицевыеСчета
		|ИЗ
		|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
		|ГДЕ
		|	ЛицевыеСчета.Ссылка В(&МассивЛС)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЛицевыеСчета.ЛицевойСчет,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга КАК Услуга,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета КАК Счетчик
		|ПОМЕСТИТЬ втСчетчики
		|ИЗ
		|	втЛицевыеСчета КАК втЛицевыеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&ДатаНач, ) КАК УстановленныеПриборыУчетаСрезПоследних
		|		ПО втЛицевыеСчета.ЛицевойСчет = УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки
		|ГДЕ
		|	УстановленныеПриборыУчетаСрезПоследних.Действует
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втЛицевыеСчета.ЛицевойСчет,
		|	УстановленныеПриборыУчета.ПриборУчета.Услуга,
		|	УстановленныеПриборыУчета.ПриборУчета
		|ИЗ
		|	втЛицевыеСчета КАК втЛицевыеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета КАК УстановленныеПриборыУчета
		|		ПО втЛицевыеСчета.ЛицевойСчет = УстановленныеПриборыУчета.ОбъектУстановки
		|ГДЕ
		|	УстановленныеПриборыУчета.Действует
		|	И УстановленныеПриборыУчета.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И УстановленныеПриборыУчета.ОбъектУстановки = втЛицевыеСчета.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСчетчики.ЛицевойСчет,
		|	втСчетчики.Услуга,
		|	втСчетчики.Счетчик,
		|	ВЫБОР
		|		КОГДА ПоказанияСчетчиков.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Общий)
		|				ИЛИ ПоказанияСчетчиков.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Дневной)
		|			ТОГДА ЕСТЬNULL(ПоказанияСчетчиков.Значение, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДневноеПоказание,
		|	ПоказанияСчетчиков.Период,
		|	ВЫБОР
		|		КОГДА ПоказанияСчетчиков.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Ночной)
		|			ТОГДА ЕСТЬNULL(ПоказанияСчетчиков.Значение, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НочноеПоказание,
		|	ВЫБОР
		|		КОГДА ПоказанияСчетчиков.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Пиковый)
		|			ТОГДА ЕСТЬNULL(ПоказанияСчетчиков.Значение, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПиковоеПоказание
		|ПОМЕСТИТЬ втВсеПоказания
		|ИЗ
		|	втСчетчики КАК втСчетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета КАК ПоказанияСчетчиков
		|		ПО втСчетчики.Счетчик = ПоказанияСчетчиков.ПриборУчета
		|ГДЕ
		|	ПоказанияСчетчиков.Период МЕЖДУ &ДатаНач И &ДатаКон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втВсеПоказания.ЛицевойСчет,
		|	втВсеПоказания.Услуга,
		|	втВсеПоказания.Счетчик,
		|	МАКСИМУМ(втВсеПоказания.Период) КАК Период
		|ПОМЕСТИТЬ втПериодыПоследнихПоказаний
		|ИЗ
		|	втВсеПоказания КАК втВсеПоказания
		|
		|СГРУППИРОВАТЬ ПО
		|	втВсеПоказания.ЛицевойСчет,
		|	втВсеПоказания.Услуга,
		|	втВсеПоказания.Счетчик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПериодыПоследнихПоказаний.ЛицевойСчет,
		|	втПериодыПоследнихПоказаний.Услуга,
		|	втПериодыПоследнихПоказаний.Счетчик,
		|	втВсеПоказания.ДневноеПоказание,
		|	втПериодыПоследнихПоказаний.Период,
		|	втВсеПоказания.НочноеПоказание,
		|	втВсеПоказания.ПиковоеПоказание
		|ПОМЕСТИТЬ втТекущиеПоказания
		|ИЗ
		|	втПериодыПоследнихПоказаний КАК втПериодыПоследнихПоказаний
		|		ЛЕВОЕ СОЕДИНЕНИЕ втВсеПоказания КАК втВсеПоказания
		|		ПО втПериодыПоследнихПоказаний.ЛицевойСчет = втВсеПоказания.ЛицевойСчет
		|			И втПериодыПоследнихПоказаний.Услуга = втВсеПоказания.Услуга
		|			И втПериодыПоследнихПоказаний.Счетчик = втВсеПоказания.Счетчик
		|			И втПериодыПоследнихПоказаний.Период = втВсеПоказания.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСчетчики.ЛицевойСчет,
		|	втСчетчики.Услуга,
		|	втСчетчики.Счетчик,
		|	ВЫБОР
		|		КОГДА ПоказанияСчетчиков.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Общий)
		|				ИЛИ ПоказанияСчетчиков.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Дневной)
		|			ТОГДА ЕСТЬNULL(ПоказанияСчетчиков.Значение, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДневноеПоказание,
		|	ПоказанияСчетчиков.Период,
		|	ВЫБОР
		|		КОГДА ПоказанияСчетчиков.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Ночной)
		|			ТОГДА ЕСТЬNULL(ПоказанияСчетчиков.Значение, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НочноеПоказание,
		|	ВЫБОР
		|		КОГДА ПоказанияСчетчиков.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Пиковый)
		|			ТОГДА ЕСТЬNULL(ПоказанияСчетчиков.Значение, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПиковоеПоказание
		|ПОМЕСТИТЬ втПредПоказания
		|ИЗ
		|	втСчетчики КАК втСчетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&ДатаНач, ) КАК ПоказанияСчетчиков
		|		ПО втСчетчики.Счетчик = ПоказанияСчетчиков.ПриборУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСчетчики.ЛицевойСчет КАК ЛицевойСчет,
		|	втСчетчики.Услуга.Наименование КАК service,
		|	втСчетчики.Счетчик.Наименование КАК MName,
		|	ВЫБОР
		|		КОГДА втСчетчики.Счетчик.Тарифность = ЗНАЧЕНИЕ(Перечисление.ТарифностьСчетчиков.Однотарифный)
		|			ТОГДА 1
		|		КОГДА втСчетчики.Счетчик.Тарифность = ЗНАЧЕНИЕ(Перечисление.ТарифностьСчетчиков.Двухтарифный)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК value_count,
		|	СУММА(ЕСТЬNULL(втПредПоказания.ДневноеПоказание, 0)) КАК indicbef1,
		|	СУММА(ЕСТЬNULL(втПредПоказания.НочноеПоказание, 0)) КАК indicbef2,
		|	СУММА(ЕСТЬNULL(втПредПоказания.ПиковоеПоказание, 0)) КАК indicbef3,
		|	СУММА(ЕСТЬNULL(втТекущиеПоказания.ДневноеПоказание, ЕСТЬNULL(втПредПоказания.ДневноеПоказание, 0))) КАК indiccur1,
		|	СУММА(ЕСТЬNULL(втТекущиеПоказания.НочноеПоказание, ЕСТЬNULL(втПредПоказания.НочноеПоказание, 0))) КАК indiccur2,
		|	СУММА(ЕСТЬNULL(втТекущиеПоказания.ПиковоеПоказание, ЕСТЬNULL(втПредПоказания.ПиковоеПоказание, 0))) КАК indiccur3,
		|	ЕСТЬNULL(втПредПоказания.Период, &ПустаяДата) КАК date_indicbef,
		|	ЕСТЬNULL(втТекущиеПоказания.Период, втПредПоказания.Период) КАК date_indiccur,
		|	втСчетчики.Счетчик.Код КАК kod
		|ИЗ
		|	втСчетчики КАК втСчетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПредПоказания КАК втПредПоказания
		|		ПО втСчетчики.ЛицевойСчет = втПредПоказания.ЛицевойСчет
		|			И втСчетчики.Услуга = втПредПоказания.Услуга
		|			И втСчетчики.Счетчик = втПредПоказания.Счетчик
		|		ЛЕВОЕ СОЕДИНЕНИЕ втТекущиеПоказания КАК втТекущиеПоказания
		|		ПО втСчетчики.ЛицевойСчет = втТекущиеПоказания.ЛицевойСчет
		|			И втСчетчики.Услуга = втТекущиеПоказания.Услуга
		|			И втСчетчики.Счетчик = втТекущиеПоказания.Счетчик
		|
		|СГРУППИРОВАТЬ ПО
		|	втСчетчики.Услуга.Наименование,
		|	втСчетчики.ЛицевойСчет,
		|	втСчетчики.Счетчик.Наименование,
		|	ЕСТЬNULL(втПредПоказания.Период, &ПустаяДата),
		|	втСчетчики.Счетчик.Код,
		|	ЕСТЬNULL(втТекущиеПоказания.Период, втПредПоказания.Период),
		|	ВЫБОР
		|		КОГДА втСчетчики.Счетчик.Тарифность = ЗНАЧЕНИЕ(Перечисление.ТарифностьСчетчиков.Однотарифный)
		|			ТОГДА 1
		|		КОГДА втСчетчики.Счетчик.Тарифность = ЗНАЧЕНИЕ(Перечисление.ТарифностьСчетчиков.Двухтарифный)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет";
		
	Запрос.УстановитьПараметр("ДатаНач",  НачалоМесяца(ДатаОбмена));
	Запрос.УстановитьПараметр("ДатаКон",  КонецДня(ДатаОбмена));
	Запрос.УстановитьПараметр("МассивЛС", МассивЛС);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьСведенияОбИПУ()

// Формирует таблицу сведений о лицевых счетах.
// 
// Параметры:
//  МассивЛС - массив л/с
//  ТаблицаНачислений - таблица значений с данными о начислениях
//  ВыгружатьЛогины - булево, указывает, нужно ли выгружать логины л/с
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица лицевых счетов
//
// Примечание:
//  Данные текущей таблицы значений будут использоваться для формирования файл обмена.
//  Поэтому наличие и наименования колонок таблицы должно быть неизменно.
//  
//  Колонки:
//   ЛицевойСчет - ссылка на лицевой счет
//   Здание - ссылка на здание
//   AddressCity - город, к которому относится лицевой счет
//   AddressDistrict - район, к которому относится лицевой счет
//   AddressFlat - номер помещения лицевого счета
//   FlatAbbr - представление помещения лицевого счета (напр, "кв.1", "оф.2")
//   AddressHouse - номер здания лицевого счета
//   AddressRegion - регион, к которому относится лицевой счет
//   AddressSettlement - населенный пункт, к которому относится лицевой счет
//   AddressStreet - улица лицевого счета
//   commonarea - размер общей площади помещения лицевого счета
//   debtbeg - начальное сальдо по лицевому счету
//   debtend - конечное сальдо по лицевому счету
//   debtprev - задолженность (положительное сальдо) лицевого счета на начало месяца
//   prepayment - аванс (абсолютное значение отрицательного сальдо) лицевого счета на начало месяца
//   sumtopay - итоговая сумма к оплате по лицевому счету
//   lastPaymentDate - дата последней оплаты, поступившей от лицевого счета
//   email - электронный адрес лицевого счета
//   habarea - размер жилой площади помещения лицевого счета
//   kod_ls - идентификатор лицевого счета
//   name1 - ФИО ответственного собственника, нанимателя по лицевоум счету
//   name_ls - наименование лицевого счета
//   people - количество проживающих по лицевому счету
//   num_of_reg - количество зарегистрированных по лицевому счету
//   Корпус - корпус здания лицевого счета
//
Функция ПолучитьСведенияОЛицевыхСчетах(МассивЛС, ТаблицаНачислений = Неопределено, ВыгружатьЛогины = Ложь, ДатаОбмена)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛицевыеСчета.Владелец КАК Здание
		|ИЗ
		|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
		|ГДЕ
		|	ЛицевыеСчета.Ссылка В(&МассивЛС)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛицевыеСчета.Владелец";	
		
	Запрос.УстановитьПараметр("МассивЛС",          МассивЛС);
	ТаблицаЗданий = Запрос.Выполнить().Выгрузить();	
	ТаблицаЗданий.Колонки.Добавить("AddressCity", Новый ОписаниеТипов("Строка"));
	ТаблицаЗданий.Колонки.Добавить("AddressDistrict", Новый ОписаниеТипов("Строка"));
	ТаблицаЗданий.Колонки.Добавить("AddressHouse", Новый ОписаниеТипов("Строка"));
	ТаблицаЗданий.Колонки.Добавить("AddressRegion", Новый ОписаниеТипов("Строка"));
	ТаблицаЗданий.Колонки.Добавить("AddressStreet", Новый ОписаниеТипов("Строка"));
	ТаблицаЗданий.Колонки.Добавить("Корпус", Новый ОписаниеТипов("Строка"));
	
	
	Для Каждого СтрокаЗдания Из ТаблицаЗданий Цикл
		
		КонтактнаяИнформация = СтрокаЗдания.Здание.КонтактнаяИнформация.Выгрузить(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
		
		Если КонтактнаяИнформация.Количество() > 0 Тогда
			СписокПолей = УправлениеКонтактнойИнформацией.ПреобразоватьСтрокуВСписокПолей(КонтактнаяИнформация[0].ЗначенияПолей);
			
			Для а=0 По СписокПолей.Количество() - 1 Цикл
				Если СписокПолей[а].Представление = "Город" Тогда
					СтрокаЗдания.AddressCity = СписокПолей[а].Значение;	
				ИначеЕсли СписокПолей[а].Представление = "Район" Тогда
					СтрокаЗдания.AddressDistrict = СписокПолей[а].Значение;	
				ИначеЕсли СписокПолей[а].Представление = "Улица" Тогда
					СтрокаЗдания.AddressStreet = СписокПолей[а].Значение;	
				ИначеЕсли СписокПолей[а].Представление = "Дом" Тогда
					СтрокаЗдания.AddressHouse = СписокПолей[а].Значение;	
				ИначеЕсли СписокПолей[а].Представление = "Корпус" Тогда
					СтрокаЗдания.Корпус = СписокПолей[а].Значение;	
				ИначеЕсли СписокПолей[а].Представление = "Регион" Тогда
					СтрокаЗдания.AddressRegion = СписокПолей[а].Значение;	
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛицевыеСчетаСрезПоследних.КоличествоПрописанных,
		|	ЛицевыеСчетаСрезПоследних.КоличествоПроживающих,
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета КАК Помещение,
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Идентификатор КАК ИдентификаторЛС,
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ЛогинДоступа,
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ЭлПочта,
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец КАК Здание,
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет,
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Наименование
		|ПОМЕСТИТЬ втЛицевойСчетБазовая
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета.СрезПоследних(&ДатаКон, ЛицевойСчет В (&МассивЛС)) КАК ЛицевыеСчетаСрезПоследних
		|ГДЕ
		|	ЛицевыеСчетаСрезПоследних.Действует
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаЗданий.Здание,
		|	ТаблицаЗданий.AddressCity,
		|	ТаблицаЗданий.AddressDistrict,
		|	ТаблицаЗданий.AddressHouse,
		|	ТаблицаЗданий.AddressRegion,
		|	ТаблицаЗданий.AddressStreet,
		|	ТаблицаЗданий.Корпус
		|ПОМЕСТИТЬ втТаблицаЗданий
		|ИЗ
		|	&ТаблицаЗданий КАК ТаблицаЗданий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение,
		|	СУММА(ВЫБОР
		|			КОГДА ПлощадьОбъектовЛицевыхСчетовСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Справочник.ВидыПлощадей.ОбщаяПлощадь)
		|				ТОГДА ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбщаяПлощадь,
		|	СУММА(ВЫБОР
		|			КОГДА ПлощадьОбъектовЛицевыхСчетовСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Справочник.ВидыПлощадей.ЖилаяПолощадь)
		|				ТОГДА ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ЖилаяПлощадь,
		|	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение.Код КАК НомерКвартиры,
		|	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение.Суффикс КАК Суффикс,
		|	ВЫБОР
		|		КОГДА ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение.ЖилойФонд = ЗНАЧЕНИЕ(Перечисление.ЖилойНеЖилойФонд.Жилой)
		|			ТОГДА """"
		|		ИНАЧЕ ""оф.""
		|	КОНЕЦ КАК FlatAbbr
		|ПОМЕСТИТЬ втПлощадиПомещений
		|ИЗ
		|	РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&ДатаКон, ) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение,
		|	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение.Код,
		|	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение.Суффикс,
		|	ВЫБОР
		|		КОГДА ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение.ЖилойФонд = ЗНАЧЕНИЕ(Перечисление.ЖилойНеЖилойФонд.Жилой)
		|			ТОГДА """"
		|		ИНАЧЕ ""оф.""
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет,
		|	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
		|	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток,
		|	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход) КАК СуммаПриход
		|ПОМЕСТИТЬ втОстаткиЛС
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Месяц, , ЛицевойСчет В (&МассивЛС)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.Наименование
		|ПОМЕСТИТЬ втОтветственныйВладелец
		|ИЗ
		|	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&ДатаКон, ЛицевойСчет В (&МассивЛС)) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(РасчетыПоЛицевымСчетам.Период) КАК ДатаПоследенейОплаты,
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет
		|ПОМЕСТИТЬ втДатаПоследнейОплаты
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		|ГДЕ
		|	РасчетыПоЛицевымСчетам.Период >= &ДатаНач
		|	И РасчетыПоЛицевымСчетам.Период <= &ДатаКон
		|	И РасчетыПоЛицевымСчетам.ЛицевойСчет В(&МассивЛС)
		|	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЛицевойСчетБазовая.ЛицевойСчет,
		|	втЛицевойСчетБазовая.Здание,
		|	втТаблицаЗданий.AddressCity,
		|	втТаблицаЗданий.AddressDistrict,
		|	втПлощадиПомещений.НомерКвартиры КАК AddressFlat,
		|	втПлощадиПомещений.Суффикс КАК СуффиксКвартиры,
		|	втПлощадиПомещений.FlatAbbr,
		|	втТаблицаЗданий.AddressHouse,
		|	втТаблицаЗданий.AddressRegion,
		|	втТаблицаЗданий.AddressStreet,
		|	втЛицевойСчетБазовая.КоличествоПрописанных КАК people,
		|	втЛицевойСчетБазовая.КоличествоПроживающих КАК num_of_reg,
		|	втЛицевойСчетБазовая.ИдентификаторЛС КАК kod_ls,
		|	втЛицевойСчетБазовая.ЛицевойСчетНаименование КАК name_ls,
		|	втЛицевойСчетБазовая.ЛицевойСчетЛогинДоступа КАК login,
		|	втЛицевойСчетБазовая.ЛицевойСчетЭлПочта КАК email,
		|	втОстаткиЛС.СуммаНачальныйОстаток КАК debtbeg,
		|	втОстаткиЛС.СуммаКонечныйОстаток КАК debtend,
		|	втОтветственныйВладелец.ОтветственныйВладелецНаименование КАК name1,
		|	втПлощадиПомещений.ОбщаяПлощадь КАК commonarea,
		|	втПлощадиПомещений.ЖилаяПлощадь КАК habarea,
		|	втТаблицаЗданий.Корпус,
		|	0 КАК debtprev,
		|	0 КАК prepayment,
		|	"""" КАК AddressSettlement,
		|	втДатаПоследнейОплаты.ДатаПоследенейОплаты КАК lastPaymentDate,
		|	втОстаткиЛС.СуммаПриход КАК sumtopay
		|ИЗ
		|	втЛицевойСчетБазовая КАК втЛицевойСчетБазовая
		|		ЛЕВОЕ СОЕДИНЕНИЕ втТаблицаЗданий КАК втТаблицаЗданий
		|		ПО втЛицевойСчетБазовая.Здание = втТаблицаЗданий.Здание
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПлощадиПомещений КАК втПлощадиПомещений
		|		ПО втЛицевойСчетБазовая.Помещение = втПлощадиПомещений.Помещение
		|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиЛС КАК втОстаткиЛС
		|		ПО втЛицевойСчетБазовая.ЛицевойСчет = втОстаткиЛС.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ втОтветственныйВладелец КАК втОтветственныйВладелец
		|		ПО втЛицевойСчетБазовая.ЛицевойСчет = втОтветственныйВладелец.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ втДатаПоследнейОплаты КАК втДатаПоследнейОплаты
		|		ПО втЛицевойСчетБазовая.ЛицевойСчет = втДатаПоследнейОплаты.ЛицевойСчет";	
		
		
	Запрос.УстановитьПараметр("ДатаНач",           НачалоМесяца(ДатаОбмена));
	Запрос.УстановитьПараметр("ДатаКон",           КонецМесяца(ДатаОбмена));
	Запрос.УстановитьПараметр("МассивЛС",          МассивЛС);
	Запрос.УстановитьПараметр("ВыгружатьЛогины",   ВыгружатьЛогины);
	Запрос.УстановитьПараметр("ТаблицаЗданий",   ТаблицаЗданий);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьСведенияОЛицевыхСчетах()

// Формирует текст штрих-кода для вывода в квитанцию.
//
// Параметры
//  Объект       – текущий лицевой счет
//  Организация - выбранная организация
//  СуммаОплаты – сумма к оплате
//
// Возвращаемое значение:
//  Строка – текст штрих-кода
//
Функция ПолучитьШтрихКод(Объект, Организация, СуммаОплаты)
	
	ТекстКода = "";
	
	Возврат ТекстКода;
	
КонецФункции // ПолучитьШтрихКод()

// Формирует таблицу со сведениями по лицевым счетам.
//
// Параметры:
//  МассивЛС - Массив - массив с лицевыми счетами
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
// Примечание:
//  Данные текущей таблицы значений будут использоваться для формирования файл обмена.
//  Поэтому наличие и наименования колонок таблицы должно быть неизменно.
//  
//  Колонки:
//   ЛицевойСчет - ссылка на лицевой счет
//   Владелец - ссылка на  ответственного собственника, нанимателя по лицевому счету
//   Район - район, к которому относится лицевой счет
//   Улица - улица лицевого счета
//   Дом - номер здания лицевого счета
//   Корпус - корпус здания лицевого счета
//   Помещение - наименование помещения лицевого счета (напр., "кв.1", "оф.1")
//   Логин - логин доступа лицевого счета к аккаунту на сайте
//   Пароль - пустая строка
//   Карточка распечата - Ложь
//
Функция ПолучитьДанныеПоЛС(МассивЛС, ДатаОбмена = Неопределено) Экспорт
	
	Если ДатаОбмена = Неопределено Тогда
		ДатаОбмена = ТекущаяДата();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК Владелец,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.Владелец.Наименование КАК Адрес,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.ЛогинДоступа КАК Логин,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета.Наименование КАК Квартира,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.Владелец КАК Здание
		|ИЗ
		|	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Дата, ЛицевойСчет В (&МассивЛС)) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	Здание,
		|	Квартира";
		
	Запрос.УстановитьПараметр("МассивЛС", МассивЛС);
	Запрос.УстановитьПараметр("Дата",     ДатаОбмена);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка ИЗ Таблица Цикл
		
		Строка.Адрес = Строка.Адрес + " " + Строка.Квартира;
			
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции // ПолучитьДанныеПоЛС()

// Ищет в БД лицевые счета, которые не имеют параметры доступа на сайт.
// (факты наличия параметров доступа фиксируются в РС "Сведения о наличии параметров доступа")
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
// Примечание:
//  Данные текущей таблицы будут загружены в табличну часть формы "Работа с лицевыми счетами".
//  Поэтому наличие и наименования колонок таблицы должно быть неизменно.
//
//  Колонки:
//   ЛицевойСчет - ссылка на лицевой счет
//   Владелец - ссылка на ответственного собственника, нанимателя по лицевому счету
//   Адрес - представление адреса лицевого счета
//   Логин - логин доступа лицевого счета к аккаунту на сайте
//   Пароль - пустая строка
//   Карточка распечата - Ложь
//
Функция ПолучитьЛСНеИмеющиеПараметровДоступа() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СведенияОНаличииПараметровДоступа.ЛицевойСчет
	|ПОМЕСТИТЬ втЛССПараметрами
	|ИЗ
	|	РегистрСведений.СведенияОНаличииПараметровДоступа КАК СведенияОНаличииПараметровДоступа
	|ГДЕ
	|	СведенияОНаличииПараметровДоступа.НаличиеПараметров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	РегистрСведений.ЛицевыеСчета.СрезПоследних() КАК ЛицевыеСчетаСрезПоследних
	|ГДЕ
	|	ЛицевыеСчетаСрезПоследних.Действует
	|	И НЕ ЛицевыеСчетаСрезПоследних.ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					втЛССПараметрами.ЛицевойСчет
	|				ИЗ
	|					втЛССПараметрами КАК втЛССПараметрами)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		МассивЛС = Новый Массив;
	Иначе
		МассивЛС = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ЛицевойСчет");
	КонецЕсли;
	
	Возврат ПолучитьДанныеПоЛС(МассивЛС);
	
КонецФункции // ПолучитьЛСНеИмеющиеПараметровДоступа()

// Определяет, когда была совершена последняя удачная загрузка реестра платежей.
//
// Параметры:
//  НастройкаДоступа - СправочникСсылка.НастройкиДоступаКСайту - настройка доступа
//
// Вовзращаемое значение:
//  Дата
//
Функция ПолучитьДатуПоследнейЗагрузкиРестраПлатежей(НастройкаДоступа)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ЖурналОбменаССайтом.Дата) КАК Дата
	|ИЗ
	|	РегистрСведений.ЖурналОбменаССайтом КАК ЖурналОбменаССайтом
	|ГДЕ
	|	ЖурналОбменаССайтом.НастройкаДоступа = &НастройкаДоступа
	|	И ЖурналОбменаССайтом.ВидОбмена = ЗНАЧЕНИЕ(Перечисление.ВидыОбменаССайтом.ЗагрузкаРеестраПлатежей)";
	Запрос.УстановитьПараметр("НастройкаДоступа", НастройкаДоступа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Дата;
	КонецЕсли;
	
	Возврат Дата('00010101');
	
КонецФункции // ПолучитьДатуПоследнейЗагрузкиРестраПлатежей()

////////////////////////////////////////////////////////////////////////////////
// ЗАГРУЗКА ДАННЫХ ИЗ XML

// Загружает данные из XML-файла в структуру.
//
// Параметры
//  ИмяФайлаXML – наименование загружаемого файла.
//  НастройкиОбмена - ссылка на элемент справочника "Настройки обмена данными с сайтом".
//  СведенияОбОшибке - Строка - описание проблем при обмене
//
// Возвращаемое значение:
//  Структура – структура, содержащая загруженные из файла данные.
//
//
// Детальное описание функции:
//
// При загрузке данных из XML файла формируется структура, содержащая выгружаемые из файла данные.
// В зависимости от варианта загрузки (значения атрибута "filetype" узла "ORG") могут быть
// сформированы структуры, содержащие следующие поля:
//
// 1) Для варианта "access" (параметры доступа):
//
// filetype // "access"
// inn      // ИНН организации.
// \PersAcc   // Таблица значений. Хранит соответствие л/с и логинов.
//     kod_ls // Код л/с (Идентификатор).
//     login  // Новый логин л/с.
//     email  // Электронный ящик л/с. Необязательный атрибут.
//
// 2) Для варианта "meters" (реестр показаний ИПУ):
//
// filetype // "meters"
// name     // Наименование организации.
// inn      // ИНН организации.
// filedate // Дата формирования файла.
// \meters       // Таблица значений. Хранит показания ИПУ в разрезе л/с.
//     kod_ls    // Код л/с (Идентификатор).
//     indicbef1 // Предыдущее дневное показание.
//     indicbef2 // Предыдущее ночное показание.
//     indiccur1 // Текущее дневное показание.
//     indiccur2 // Текущее ночное показание.
//     kod       // Код ПУ.
//     name      // Наименование ПУ.
//     date      // Дата текущих показаний.
//
// 3) Для варианта "monetapayments" (реестр платежей):
//
// filetype // "monetapayments"
// inn      // ИНН организации.
// filedate // Дата формирования файла.
// \payments     // Таблица значений. Хранит оплаты в разрезе л/с.
//     kod_ls    // Код л/с (Идентификатор).
//     date      // Дата оплаты.
//     summ      // Сумма оплаты.
//
Функция ПолучитьДанныеИзXML(ИмяФайлаXML, НастройкаДоступа, СведенияОбОшибке,ВидШаблона = Неопределено)
	
	// Структура для выгрузки
	СтруктураДанных = Новый Структура;
	
	Попытка
		// Открытие и считывание данных из файла
		Файл = Новый ЧтениеXML;
		Файл.ОткрытьФайл(ИмяФайлаXML);
		
		Построитель = Новый ПостроительDOM;
		ДокDOM = Построитель.Прочитать(Файл);
		
		Файл.Закрыть();
	Исключение
		// Ошибка при открытии.
		СведенияОбОшибке = ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
		
		Возврат Неопределено;
	КонецПопытки;
	
	Попытка
		
		// Префикс, добавляемый к л/с.
		ПрефиксЛС           = ПолучитьПрефикс(НастройкаДоступа.Организация);
		ДлинаПрефикса       = СтрДлина(ПрефиксЛС);
		ИспользуетсяПрефикс = НЕ ДлинаПрефикса = 0;
		
		// Узел ORG
		УзелОрганизация = ДокDOM.ПервыйДочерний;
		
		Если ВидШаблона = Перечисления.ВариантыСайта.ВДГБ Тогда
			ВерсияСайт = УзелОрганизация.Атрибуты.ПолучитьИменованныйЭлемент("version").Значение;
			ВерсияПП   = ПолучитьТекущуюВерсиюМеханизмаИнтеграции();
		
			Если ВерсияСайт <> ВерсияПП Тогда
				СообщенияОбОшибке = НСтр("ru='Версия механизма обмена в учетной программе устарела. Необходимо обновиться.';uk='Версія механізму обміну в обліковій програмі застаріла. Необхідно оновитися.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщенияОбОшибке);
				Возврат Неопределено;
				
			КонецЕсли;
		КонецЕсли;
		// Тип файла
		ТипФайла = НРег(УзелОрганизация.Атрибуты.ПолучитьИменованныйЭлемент("filetype").Значение);
		
		// Формирование структуры данных
		Если ТипФайла = "meters" Тогда
			
			СтруктураДанных.Вставить("name",     УзелОрганизация.Атрибуты.ПолучитьИменованныйЭлемент("name").Значение);
			СтруктураДанных.Вставить("inn",      УзелОрганизация.Атрибуты.ПолучитьИменованныйЭлемент("inn").Значение);
			СтруктураДанных.Вставить("filedate", УзелОрганизация.Атрибуты.ПолучитьИменованныйЭлемент("filedate").Значение);
			СтруктураДанных.Вставить("filetype", ТипФайла);
			
			// Таблица л/с
			СтруктураДанных.Вставить("meters", Новый ТаблицаЗначений);
			СтруктураДанных.meters.Колонки.Добавить("kod_ls",    Новый ОписаниеТипов("Строка"));
			СтруктураДанных.meters.Колонки.Добавить("indicbef1", Новый ОписаниеТипов("Число"));
			СтруктураДанных.meters.Колонки.Добавить("indicbef2", Новый ОписаниеТипов("Число"));
			СтруктураДанных.meters.Колонки.Добавить("indiccur1", Новый ОписаниеТипов("Число"));
			СтруктураДанных.meters.Колонки.Добавить("indiccur2", Новый ОписаниеТипов("Число"));
			СтруктураДанных.meters.Колонки.Добавить("kod",       Новый ОписаниеТипов("Строка"));
			СтруктураДанных.meters.Колонки.Добавить("name",      Новый ОписаниеТипов("Строка"));
			СтруктураДанных.meters.Колонки.Добавить("date",      Новый ОписаниеТипов("Дата"));
			
			// Дочерними являются только узлы "PersAssoc", проходим по ним всем в цикле.
			Для Каждого ТекУзел ИЗ УзелОрганизация.ДочерниеУзлы Цикл
				
				// Формируем код л/с.
				КодЛС = ТекУзел.Атрибуты.ПолучитьИменованныйЭлемент("kod_ls").Значение;
				
				Если ИспользуетсяПрефикс И Лев(КодЛС, ДлинаПрефикса) = ПрефиксЛС Тогда
					КодЛС = Прав(КодЛС, СтрДлина(КодЛС) - ДлинаПрефикса);
				КонецЕсли;
				
				// Заполняем ПУ л/с
				Для Каждого ТекПУ ИЗ ТекУзел.ДочерниеУзлы Цикл
					СтрокаПУ = СтруктураДанных.meters.Добавить();
					
					// л/с
					СтрокаПУ.kod_ls = КодЛС;
				
					// ПУ
					СтрокаПУ.indicbef1 = ТекПУ.Атрибуты.ПолучитьИменованныйЭлемент("indicbef1").Значение;
					СтрокаПУ.indicbef2 = ТекПУ.Атрибуты.ПолучитьИменованныйЭлемент("indicbef2").Значение;
					СтрокаПУ.indiccur1 = ТекПУ.Атрибуты.ПолучитьИменованныйЭлемент("indiccur1").Значение;
					СтрокаПУ.indiccur2 = ТекПУ.Атрибуты.ПолучитьИменованныйЭлемент("indiccur2").Значение;
					СтрокаПУ.kod       = ТекПУ.Атрибуты.ПолучитьИменованныйЭлемент("kod").Значение;
					СтрокаПУ.name      = ТекПУ.Атрибуты.ПолучитьИменованныйЭлемент("name").Значение;
					СтрокаПУ.date      = ТекПУ.Атрибуты.ПолучитьИменованныйЭлемент("date").Значение;
				КонецЦикла;
			КонецЦикла;
			
		ИначеЕсли ТипФайла = "accexistence" Тогда
			
			СтруктураДанных.Вставить("inn",      УзелОрганизация.Атрибуты.ПолучитьИменованныйЭлемент("inn").Значение);
			СтруктураДанных.Вставить("filetype", ТипФайла);
			
			// Таблица л/с
			СтруктураДанных.Вставить("PersAcc", Новый ТаблицаЗначений);
			СтруктураДанных.PersAcc.Колонки.Добавить("kod_ls", Новый ОписаниеТипов("Строка"));
			СтруктураДанных.PersAcc.Колонки.Добавить("login",  Новый ОписаниеТипов("Строка"));
			СтруктураДанных.PersAcc.Колонки.Добавить("email",  Новый ОписаниеТипов("Строка"));
			
			// Дочерними являются только узлы "PersAcc", проходим по ним всем в цикле.
			Для Каждого ТекУзел ИЗ УзелОрганизация.ДочерниеУзлы Цикл
				СтрокаЛС = СтруктураДанных.PersAcc.Добавить();
				
				// Формируем код л/с.
				КодЛС = ТекУзел.Атрибуты.ПолучитьИменованныйЭлемент("kod_ls").Значение;
				
				Если ИспользуетсяПрефикс И Лев(КодЛС, ДлинаПрефикса) = ПрефиксЛС Тогда
					КодЛС = Прав(КодЛС, СтрДлина(КодЛС) - ДлинаПрефикса);
				КонецЕсли;
				
				// Заполняем данные л/с
				СтрокаЛС.kod_ls = КодЛС;
				СтрокаЛС.login  = ТекУзел.Атрибуты.ПолучитьИменованныйЭлемент("login").Значение;
				
				Если ТекУзел.ЕстьАтрибут("email") Тогда
					СтрокаЛС.email = ТекУзел.Атрибуты.ПолучитьИменованныйЭлемент("email").Значение;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ТипФайла = "monetapayments" Тогда
			
			СтруктураДанных.Вставить("inn",      УзелОрганизация.Атрибуты.ПолучитьИменованныйЭлемент("inn").Значение);
			СтруктураДанных.Вставить("filedate", УзелОрганизация.Атрибуты.ПолучитьИменованныйЭлемент("filedate").Значение);
			СтруктураДанных.Вставить("filetype", ТипФайла);
			
			СтруктураДанных.Вставить("payments", Новый ТаблицаЗначений);
			СтруктураДанных.payments.Колонки.Добавить("kod_ls", Новый ОписаниеТипов("Строка"));
			СтруктураДанных.payments.Колонки.Добавить("date",   Новый ОписаниеТипов("Дата"));
			СтруктураДанных.payments.Колонки.Добавить("summ",   Новый ОписаниеТипов("Число"));
			СтруктураДанных.payments.Колонки.Добавить("fee",    Новый ОписаниеТипов("Число"));
			
			Для Каждого ТекУзел ИЗ УзелОрганизация.ДочерниеУзлы Цикл
				СтрокаОплаты = СтруктураДанных.payments.Добавить();
				
				КодЛС = ТекУзел.Атрибуты.ПолучитьИменованныйЭлемент("kod_ls").Значение;
				Если ИспользуетсяПрефикс И Лев(КодЛС, ДлинаПрефикса) = ПрефиксЛС Тогда
					КодЛС = Прав(КодЛС, СтрДлина(КодЛС) - ДлинаПрефикса);
				КонецЕсли;
				
				СтрокаОплаты.kod_ls = КодЛС;
				СтрокаОплаты.date   = ТекУзел.Атрибуты.ПолучитьИменованныйЭлемент("date").Значение;
				СтрокаОплаты.summ   = ТекУзел.Атрибуты.ПолучитьИменованныйЭлемент("summ").Значение;
				СтрокаОплаты.fee    = ТекУзел.Атрибуты.ПолучитьИменованныйЭлемент("fee").Значение;
			КонецЦикла;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Исключение
		// Ошибка при чтении
		СообщенияОбОшибке = НСтр("ru='Неверный формат файла.';uk='Невірний формат файлу.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщенияОбОшибке);
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат СтруктураДанных;
	
КонецФункции // ПолучитьДанныеИзXML()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАГРУЗКИ ДАННЫХ В БАЗУ

// Загружает данные из сформированной ранее структуры данных.
//
// Параметры
//  СтруктураДанных – структура, хранящая данные для загрузки.
//  НастройкиОбмена - элемент справочника "Настройки обмена данными с сайтом".
//  СведенияОбОшибке - Строка - описание проблем при обмене
//
//  Примечание:
//   accexistence - данные о наличии аккаунтов на сайте
//   meters - показания по счетчикам
//   monetapayments - платежи, проведенные через Монета.ру
//
Процедура ЗагрузитьДанныеВБазу(СтруктураДанных, НастройкиОбмена, СведенияОбОшибке)
	
	ТипЗагрузки = НРег(СтруктураДанных.filetype);
	
	Если ТипЗагрузки = "accexistence" Тогда
		// Параметры доступа
		ЗагрузитьПараметрыДоступа(СтруктураДанных, НастройкиОбмена);
		
	ИначеЕсли ТипЗагрузки = "meters" Тогда
		// Счетчики
		ЗагрузитьПоказанияСчетчиковВБазу(СтруктураДанных);
		
	Иначе
		СведенияОбОшибке = НСтр("ru='Неизвестный формат файла.';uk='Невідомий формат файлу.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
	КонецЕсли;
	
КонецПроцедуры // ЗагрузитьДанныеВБазу()

// Загружает параметры доступа.
//
// Параметры
//  СтруктураДанных – структура, хранящая данные о параметрах доступа.
//  НастройкиОбмена - элемент справочника "Настройки обмена данными с сайтом".
//
// Примечание:
//  Описание структуры загрузки см. в функции ПолучитьДанныеИзXML().
//
Процедура ЗагрузитьПараметрыДоступа(СтруктураДанных, НастройкиОбмена)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаЛС.kod_ls КАК СТРОКА(100)) КАК ИдентификаторЛС,
	|	ТаблицаЛС.login КАК НовыйЛогин,
	|	ТаблицаЛС.email
	|ПОМЕСТИТЬ втТаблицаЛС
	|ИЗ
	|	&ТаблицаЛС КАК ТаблицаЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	втТаблицаЛС.НовыйЛогин,
	|	втТаблицаЛС.email КАК ЭлЯщик
	|ИЗ
	|	втТаблицаЛС КАК втТаблицаЛС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|		ПО втТаблицаЛС.ИдентификаторЛС = ЛицевыеСчета.Идентификатор";
	
	Запрос.УстановитьПараметр("ТаблицаЛС", СтруктураДанных.PersAcc);
	
	ТаблицаЛС = Запрос.Выполнить().Выгрузить();
	
	МенеджерЗаписи = РегистрыСведений.СведенияОНаличииПараметровДоступа.СоздатьМенеджерЗаписи();
	
	Для каждого ТекСтрока из ТаблицаЛС Цикл
		
		// Элемент справочника "Лицевые счета".
		ОбъектЛС = ТекСтрока.ЛицевойСчет.ПолучитьОбъект();
		ОбъектЛС.ЛогинДоступа    = ТекСтрока.НовыйЛогин;
		Если ЗначениеЗаполнено(ТекСтрока.ЭлЯщик) Тогда
			ОбъектЛС.ЭлПочта = ТекСтрока.ЭлЯщик;
		КонецЕсли;
		// Поиск записи в регистре.
		МенеджерЗаписи.ЛицевойСчет      = ТекСтрока.ЛицевойСчет;
		МенеджерЗаписи.НастройкаДоступа = НастройкиОбмена;
		МенеджерЗаписи.Прочитать();
		
		Попытка
			// Запись л/с
			ОбъектЛС.Записать();
			
			// Запись регистра
			Если МенеджерЗаписи.Выбран() Тогда
				Если НЕ МенеджерЗаписи.НаличиеПараметров Тогда
					МенеджерЗаписи.НаличиеПараметров = Истина;
					МенеджерЗаписи.Записать();
				КонецЕсли;
			Иначе
				МенеджерЗаписи.ЛицевойСчет       = ОбъектЛС.Ссылка;
				МенеджерЗаписи.НастройкаДоступа  = НастройкиОбмена;
				МенеджерЗаписи.НаличиеПараметров = Истина;
				
				МенеджерЗаписи.Записать();
			КонецЕсли;
		Исключение
			Сообщить("Не удалось записать параметры доступа для лицевого счета:" + ОбъектЛС.Наименование);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьПараметрыДоступа()

// Загружает показания счетчиков (ИПУ).
//
// Параметры
//  СтруктураДанных – структура, хранящая сведения о показаниях ИПУ.
//  НастройкиОбмена - элемент справочника "Настройки обмена данными с сайтом".
//
// Примечание:
//  Описание структуры загрузки см. в функции ПолучитьДанныеИзXML().
//
Процедура ЗагрузитьПоказанияСчетчиковВБазу(СтруктураДанных)
	
	
	НаборССайта = РегистрыСведений.ПоказанияПриборовУчетаССайта.СоздатьНаборЗаписей();
	
	ТаблицаТарифовСчетчиков = ПолучитьТаблицуТарифовПУ(СтруктураДанных.meters.ВыгрузитьКолонку("kod"));
	
	Для Каждого СтрокаСчетчиков Из СтруктураДанных.meters Цикл
		
		ТекСчетчик = Справочники.ПриборыУчета.НайтиПоКоду(СтрокаСчетчиков.kod);
		ТекЛС = Справочники.ЛицевыеСчета.НайтиПоРеквизиту("Идентификатор", СтрокаСчетчиков.kod_ls);
		
		Если ЗначениеЗаполнено(ТекСчетчик) тогда
			
			НаборССайта.Отбор.ПриборУчета.Установить(ТекСчетчик);
			НаборССайта.Отбор.ЛицевойСчет.Установить(ТекЛС);
			НаборССайта.Отбор.Период.Установить(СтрокаСчетчиков.date);
			
			НаборССайта.Прочитать();
			
			
			Если ТекСчетчик.Тарифность <> Перечисления.ТарифностьСчетчиков.Однотарифный Тогда
				ТарифностьЧисло = ?(ТекСчетчик.Тарифность = Перечисления.ТарифностьСчетчиков.Двухтарифный,2,3);
				НайденыеСтроки = ТаблицаТарифовСчетчиков.НайтиСтроки(Новый Структура("ПриборУчета", ТекСчетчик));
			
				Если ТарифностьЧисло > НайденыеСтроки.Количество() Тогда
					НайденыеСтроки = ТекСчетчик.Услуга.ВидыТарифов.Выгрузить();
				КонецЕсли;	
				Сч = 1;
				Пока Сч <= ТарифностьЧисло  Цикл
					Если НаборССайта.Количество() >= Сч Тогда
						НоваяСтрока = НаборССайта[Сч-1];
					Иначе	
						НоваяСтрока = НаборССайта.Добавить();
					КонецЕсли;
					НоваяСтрока.ЛицевойСчет = ТекЛС;
					НоваяСтрока.ПриборУчета = ТекСчетчик;
					Попытка
						НоваяСтрока.ВидТарифа = НайденыеСтроки[Сч-1].ВидТарифа;
					Исключение
						А= 1;
					КонецПопытки;	
					НоваяСтрока.Значение = СтрокаСчетчиков["indiccur"+Строка(Сч)];
					НоваяСтрока.Период = СтрокаСчетчиков.date;
					Сч = Сч +1;
				КонецЦикла; 	
					
			Иначе		
				Если НаборССайта.Количество() > 0 Тогда
					НоваяСтрока = НаборССайта[0];
				Иначе
					НоваяСтрока = НаборССайта.Добавить();
				КонецЕсли;
				
				НоваяСтрока.ЛицевойСчет = ТекЛС;
				НоваяСтрока.ПриборУчета = ТекСчетчик;
				НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
				НоваяСтрока.Значение = СтрокаСчетчиков.indiccur1;
				НоваяСтрока.Период = СтрокаСчетчиков.date;
							
				
			КонецЕсли;
			
			НаборССайта.Записать();
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры // ЗагрузитьПоказанияСчетчиковВБазу()

// Записывает параметры доступа в справочник "Лицевые счета" и
// регистр сведений "Сведения о наличии параметров доступа".
//
// Параметры:
//  ТаблицаЛС - таблица с параметрами доступа
//  ОбновлятьПД - признак того, что надо заменять старые параметры доступа
//  НастройкаДоступа - текущая настройка доступа
//
// Возвращаемое значение:
//  Булево - удалось записать все параметры
//
Функция ЗаписатьПараметрыДоступаНаСервере(ТаблицаЛС, ОбновлятьПД, НастройкаДоступа) Экспорт
	
	КоличествоЗаписанныхПД = 0;
	
	Для Каждого СтрокаТЧ Из ТаблицаЛС Цикл
		// Производим запись только при условии изменения данных в строке.
		Если СтрокаТЧ.ПДИзменены = Истина Тогда
			
			ОбъектЛС               = СтрокаТЧ.ЛицевойСчет.ПолучитьОбъект();
			ОбъектЛС.ЛогинДоступа  = СтрокаТЧ.Логин;
			
			Если ЗаписатьОбъект(ОбъектЛС) Тогда
				КоличествоЗаписанныхПД = КоличествоЗаписанныхПД + 1;
			Иначе
				Продолжить;
			КонецЕсли;
			
			ПараметрыДоступа                   = РегистрыСведений.СведенияОНаличииПараметровДоступа.СоздатьМенеджерЗаписи();
			ПараметрыДоступа.ЛицевойСчет       = СтрокаТЧ.ЛицевойСчет;
			ПараметрыДоступа.НаличиеПараметров = Истина;
			ПараметрыДоступа.НастройкаДоступа  = НастройкаДоступа;
			
			ПараметрыДоступа.Записать();
			
			СтрокаТЧ.ДанныеЗаписаны = Истина;
			СтрокаТЧ.ПДИзменены     = Ложь;
		Иначе
			
			// Если данные не были изменены, то записывать их не нужно. Прибавляем счетчик записанных и ставим флаг.
			КоличествоЗаписанныхПД = КоличествоЗаписанныхПД + 1;
			СтрокаТЧ.ДанныеЗаписаны = Истина;
			
		КонецЕсли;
	КонецЦикла;
		
	Если КоличествоЗаписанныхПД = ТаблицаЛС.Количество() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ЗаписатьПараметрыДоступаНаСервере()

///////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Проверяет имеются ли зафиксированные в БД параметры доступа в разрезе настройки доступа.
// Если не имееются, подразумевается, что ранее механизмы обмена данными с сайтом не использовались.
//
// Параметры:
//  НастройкаДоступа - СправочникСсылка.НастройкиДоступаКСайту - настройка доступа
//
// Возвращаемое значение:
//  Булево
//
Функция УстановитьФактПервогоОткрытия(НастройкаДоступа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СведенияОНаличииПараметровДоступа.ЛицевойСчет,
	|	СведенияОНаличииПараметровДоступа.НаличиеПараметров
	|ИЗ
	|	РегистрСведений.СведенияОНаличииПараметровДоступа КАК СведенияОНаличииПараметровДоступа
	|ГДЕ
	|	СведенияОНаличииПараметровДоступа.НастройкаДоступа = &НастройкаДоступа";
	Запрос.УстановитьПараметр("НастройкаДоступа", НастройкаДоступа);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Пустой();
	
КонецФункции // УстановитьФактПервогоОткрытия()

// Проверяет, необходимо ли добавлять префикс к коду л/с.
// Префикс необходимо добавлять, если учет в 1С ведется в разрезе нескольких организаций.
// 
// Возвращаемое значение:
//  булево - Истина - добавлять префикс, Ложь - не добавлять.
//
Функция ПроверитьНеобходимостьПрефикса()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	КВП_НазначенныеНачисления.Организация,
	//|	КОЛИЧЕСТВО(КВП_НазначенныеНачисления.Регистратор) КАК КолвоРегистраторов
	//|ПОМЕСТИТЬ втЕстьРегистраторы
	//|ИЗ
	//|	РегистрСведений.КВП_НазначенныеНачисления КАК КВП_НазначенныеНачисления
	//|ГДЕ
	//|	КВП_НазначенныеНачисления.Действует
	//|	И НЕ КВП_НазначенныеНачисления.Организация.ПометкаУдаления
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	КВП_НазначенныеНачисления.Организация
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	втЕстьРегистраторы.Организация КАК Организация,
	//|	втЕстьРегистраторы.КолвоРегистраторов
	//|ПОМЕСТИТЬ втОтобранныеОрганизации
	//|ИЗ
	//|	втЕстьРегистраторы КАК втЕстьРегистраторы
	//|ГДЕ
	//|	НЕ втЕстьРегистраторы.КолвоРегистраторов = 0
	//|;
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	КОЛИЧЕСТВО(втОтобранныеОрганизации.Организация) КАК КолвоОрганизаций
	//|ИЗ
	//|	втОтобранныеОрганизации КАК втОтобранныеОрганизации";
	//
	//Результат = Запрос.Выполнить().Выгрузить();
	//
	//Если НЕ Результат.Количество() = 0 И Результат[0].КолвоОрганизаций > 1 Тогда
	//	Возврат Истина;
	//Иначе
	//	Возврат Ложь;
	//КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ПроверитьНеобходимостьПрефикса()

// Формирует префикс, добавляемый к коду л/с при выгрузке.
// 
// Параметры:
//  Организация - ссылка на элемент справочника "Организации".
//
// Возвращаемое значение:
//  строка - содержит префикс.
//
Функция ПолучитьПрефикс(Организация)
	
	// Устанавливаем префикс, если это необходимо.
	Если ПроверитьНеобходимостьПрефикса() Тогда
		КодЛС = СтрЗаменить(Организация.Код, Организация.Префикс, "");
		Попытка
			КодЛС = СокрЛП(Формат(Число(КодЛС) - 1, "ЧГ = 0"));
		Исключение
			
		КонецПопытки;
		ПрефиксЛС = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(КодЛС, "0");
	Иначе
		ПрефиксЛС = "";
	КонецЕсли;
	
	Возврат ПрефиксЛС;
	
КонецФункции // ПолучитьПрефикс()

// Формирует представление адреса лицевого счета.
//
// Параметры:
//  Строка - СтрокаТаблицыЗначений - строка, содержащая сведения об адресе
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьПредставлениеАдреса(Строка)
	
	Адрес = "";
	Адрес = ?(ПустаяСтрока(Строка.Район), Адрес, Адрес + Строка.Район);
	Адрес = ?(ПустаяСтрока(Строка.Улица), Адрес, ?(ПустаяСтрока(Адрес), Строка.Улица, Адрес + ", " + Строка.Улица));
	Адрес = ?(ПустаяСтрока(Строка.Дом), Адрес, ?(ПустаяСтрока(Адрес), Строка.Дом, Адрес + ", " + Строка.Дом));
	Адрес = ?(ПустаяСтрока(Строка.Корпус), Адрес, ?(ПустаяСтрока(Адрес), Строка.Корпус, Адрес + "/" + Строка.Корпус));
	Адрес = ?(ПустаяСтрока(Адрес), Строка.Помещение, Адрес + ", " + Строка.Помещение);
	
	Возврат Адрес;
	
КонецФункции // ПолучитьПредставлениеАдреса()

// Пытается записать указанный объект.
//
// Параметры
//  Объект       - объект, который нужно записать
//  Параметр     - параметр записи
//
// Возвращаемое значение:
//  Булево - удалось ли произвести запись
//
Функция ЗаписатьОбъект(Объект, Параметр = Неопределено)

	Записан = Ложь;
	Попытка
		Если Параметр = Неопределено Тогда
			Объект.Записать();
		Иначе
			Объект.Записать(Параметр);
		КонецЕсли;
		Записан = Истина;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запись объекта " + Объект + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;

	Возврат Записан;

КонецФункции // ЗаписатьОбъект()
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЭКСПОРТА

// Отправляет на сайт запрос на передачу файла.
//
// Параметры:
//  HTTPСоединение - COMОбъект
//  ТипДанных - Строка - идентификатор передаваемых данных
//  АдресСайта - Строка - адрес сайта
//  Логин - Строка - логин доступа к админской части сайта
//  Пароль - Строка - пароль доступа к админской части сайта
//  ФайлВыгрузки - Строка - полный путь к файлу выгрузки
//  РазрешенныйРазмер - Число - максимальный возможный объем данных, который можно передать за 1 раз
//  Куки - Структура - Cookie сайта
//  ТипДанных - Строка - идентификатор передаваемых данных
//  ИННОрганизации - Строка - ИНН организации, на сайт которой передаем файл
//  СведенияОбОшибке - Строка - сведения об ошибке
//
// Возвращаемое значение:
//  Строка, Неопределено
//
Функция ПередатьФайлНаСайт(мHTTPСоединение, АдресСайта, Логин, Пароль, ФайлВыгрузки, РазрешенныйРазмер, 
						   Куки, ТипДанных, ИННОрганизации, СведенияОбОшибке = "", ВидШаблона)
	
	РазмерПереданныхДанных = 0;
	
	ПередаваемыйФайл = Новый Файл(ФайлВыгрузки);
	ИмяФайла         = ПередаваемыйФайл.Имя;
	ТекстФайла       = Новый ЧтениеТекста(ФайлВыгрузки);
	СтрокаПередачи   = ТекстФайла.Прочитать() + Символы.ПС;
	ТекстФайла.Закрыть();
	
	РазмерФайла   = СтрДлина(СтрокаПередачи);
	ТекущийРазмер = ?(РазмерФайла <= РазрешенныйРазмер, РазмерФайла, РазрешенныйРазмер);
	
	// Т.к. на сайте имеется ограничение на объем передаваемых данных, передаем файл частями.
	Пока РазмерПереданныхДанных < РазмерФайла Цикл
		СтрокаТекста = Лев(СтрокаПередачи, ТекущийРазмер);
		Попытка
			Если ВидШаблона = Перечисления.ВариантыСайта.ВДГБ Тогда
				мHTTPСоединение.open("POST", "http://" + UrlEncode(АдресСайта) + "/bitrix/admin/tszh_exchange.php?mode=file&type=" +
				UrlEncode(ТипДанных) + "&filename=" + UrlEncode(ИмяФайла), Ложь, Логин, Пароль);
			Иначе
				
				
				
				Если Найти(СтрокаПередачи, "calculations") <> 0 Тогда
					
					мHTTPСоединение.open("POST", "http://" + UrlEncode(АдресСайта) + "/connect/housing_exchange.php?mode=file&type=" +
					UrlEncode(ТипДанных) + "&filename=" + UrlEncode(ИмяФайла)+"&reg=calc", Ложь, Логин, Пароль);
				Иначе
					мHTTPСоединение.open("POST", "http://" + UrlEncode(АдресСайта) + "/connect/housing_exchange.php?mode=file&type=" +
					
					UrlEncode(ТипДанных) + "&filename=" + UrlEncode(ИмяФайла), Ложь, Логин, Пароль);
				КонецЕсли;
			КонецЕсли;
			мHTTPСоединение.setRequestHeader("Host",           АдресСайта);
			мHTTPСоединение.setRequestHeader("User-Agent",     "Mozilla/5.0");
			мHTTPСоединение.setRequestHeader("Cookie",         Куки.Имя + "=" + Куки.Cookie);
			мHTTPСоединение.setRequestHeader("Content-Type",   "text/plain");
			мHTTPСоединение.setRequestHeader("Content-Length", XMLСтрока(СтрДлина(СтрокаТекста)));
			мHTTPСоединение.send(СтрокаТекста);
		
			Ответ = мHTTPСоединение.responseText;
			
			Если Лев(Ответ, 7) = "success" Тогда
				РазмерПереданныхДанных = РазмерПереданныхДанных + ТекущийРазмер;
				СтрокаПередачи         = Сред(СтрокаПередачи, ТекущийРазмер + 1, РазмерФайла - РазмерПереданныхДанных);
				ТекущийРазмер          = РазмерФайла - РазмерПереданныхДанных;
				Если ТекущийРазмер > РазрешенныйРазмер Тогда
					ТекущийРазмер = РазрешенныйРазмер;
				КонецЕсли;
			Иначе
				СведенияОбОшибке = НСтр("ru='Не удалось загрузить файл на сайт: неверные параметры запроса.';uk='Не вдалося завантажити файл на сайт: невірні параметри запиту.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
				Возврат Неопределено;
			КонецЕсли;
		Исключение
			СведенияОбОшибке = НСтр("ru='Не удалось загрузить файл на сайт: неверные параметры запроса.';uk='Не вдалося завантажити файл на сайт: невірні параметри запиту.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
			Возврат Неопределено;
		КонецПопытки;
	КонецЦикла;
		
	Если НЕ Лев(Ответ, 7) = "success" Тогда
		СведенияОбОшибке = НСтр("ru='Не удалось загрузить файл на сайт: неверные параметры запроса.';uk='Не вдалося завантажити файл на сайт: невірні параметри запиту.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
		Возврат Неопределено;
	Иначе
		Ответ = ЗапросНаЭкспортФайла(мHTTPСоединение, АдресСайта, Логин, Пароль, ТипДанных, ФайлВыгрузки, Куки,
									 ИННОрганизации, СведенияОбОшибке,,ВидШаблона);
		Если НЕ Лев(Ответ, 7) = "success" Тогда
			Возврат Неопределено;
		Иначе
			Сообщить("Данные загружены.");
			Возврат Ответ;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции // ПередатьФайлНаСайт()

// Передает на сайт файл с данными.
//
// Параметры:
//  ФайлВыгрузки - Строка - полный путь к файлу с данными
//  ТипДанных - Строка - идентификатор передаваемых данных
//  АдресСайта - Строка - адрес сайта
//  Логин - Строка - логин доступа к админской части сайта
//  Пароль - Строка - пароль доступа к админской части сайта
//  ИННОрганизации - Строка - ИНН организации, на сайт которой передаем файл
//
// Возвращаемое значение:
//  Строка, Неопределено
//
Функция ПередатьДанныеНаСайт(ФайлВыгрузки, ТипДанных, АдресСайта, Логин, Пароль, ИННОрганизации, СведенияОбОшибке = "", ВидШаблона = Неопределено)
	
	// Устанавливаем соединение.
	Попытка
		мHTTPСоединение = Новый COMОбъект("MSXML2.XMLHTTP");
	Исключение
		СведенияОбОшибке = НСтр("ru='Не зарегистрирован объект MSXML2.XMLHTTP';uk=""Не зареєстрований об'єкт MSXML2.XMLHTTP""");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
		Возврат Неопределено;
	КонецПопытки;
	
	// Получаем Cookie сайта.
	Куки = УстановитьСоединениеССайтом(мHTTPСоединение, АдресСайта, Логин, Пароль, СведенияОбОшибке,ВидШаблона);
	
	Если Куки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Определяем максимально возмодный объем данных, который можно передать за 1 раз.
	РазрешенныйРазмер = ПолучитьРазрешенныйРазмерФайлаОбмена(мHTTPСоединение, АдресСайта, Логин, Пароль,
															 Куки, СведенияОбОшибке,ВидШаблона);
	
	Если РазрешенныйРазмер = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Получаем ответ на запрос передачи файла.
	Возврат ПередатьФайлНаСайт(мHTTPСоединение, АдресСайта, Логин, Пароль, ФайлВыгрузки, РазрешенныйРазмер,
							   Куки, ТипДанных, ИННОрганизации, СведенияОбОшибке, ВидШаблона);
	
КонецФункции // ПередатьНаСайтДанныеДляДоступа

// Экспорт файла на сайт.
//
// Параметры:
//  HTTPСоединение - COMОбъект
//  ТипДанных - Строка - идентификатор передаваемых данных
//  АдресСайта - Строка - адрес сайта
//  Логин - Строка - логин доступа к админской части сайта
//  Пароль - Строка - пароль доступа к админской части сайта
//  ФайлВыгрузки - Строка - полный путь к файлу с данными
//  Куки - Структура - Cookie сайта
//  ТипДанных - Строка - идентификатор передаваемых данных
//  ИННОрганизации - Строка - ИНН организации, на сайт которой передаем файл
//  КоличествоПопыток - Число - количество попыток передачи файла
//
// Возвращаемое значение:
//  Строка, Неопределено
//
Функция ЗапросНаЭкспортФайла(мHTTPСоединение, АдресСайта, Логин, Пароль, ТипДанных, ФайлВыгрузки, Куки, 
							 ИННОрганизации, СведенияОбОшибке, КоличествоПопыток = 3000,ВидШаблона) Экспорт
	
	ПередаваемыйФайл = Новый Файл(ФайлВыгрузки);
	ИмяФайла         = ПередаваемыйФайл.Имя;
	
	ном = 1;
	
	Пока ном <= КоличествоПопыток Цикл
		Попытка
			Если ВидШаблона = Перечисления.ВариантыСайта.ВДГБ Тогда
				мHTTPСоединение.open ("GET", "http://" + UrlEncode(АдресСайта) + "/bitrix/admin/tszh_exchange.php?mode=import&type=" +
						UrlEncode(ТипДанных) + "&filename=" + UrlEncode(ИмяФайла) + "&inn=" + UrlEncode(ИННОрганизации), Ложь, Логин, Пароль);
			Иначе
				мHTTPСоединение.open ("GET", "http://" + UrlEncode(АдресСайта) + "/connect/housing_exchange.php?mode=import&type=" +
						UrlEncode(ТипДанных) + "&filename=" + UrlEncode(ИмяФайла) + "&inn=" + UrlEncode(ИННОрганизации), Ложь, Логин, Пароль);
			КонецЕсли;
			мHTTPСоединение.setRequestHeader("Host",       АдресСайта);
			мHTTPСоединение.setRequestHeader("User-Agent", "Mozilla/5.0");
			мHTTPСоединение.setRequestHeader("Cookie",     Куки.Имя + "=" + Куки.Cookie);
			мHTTPСоединение.send();
		
			Ответ = мHTTPСоединение.responseText;
			Если Лев(Ответ, 7) = "success" Тогда
				Возврат Ответ;
				//ном = КоличествоПопыток + 1;
			ИначеЕсли Лев(Ответ, 8) = "progress" Тогда
				ном = ном + 1;
			Иначе
				СведенияОбОшибке = НСтр("ru='Не удалось загрузить файл на сайт: неверные параметры запроса.';uk='Не вдалося завантажити файл на сайт: невірні параметри запиту.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
				Возврат Неопределено;
			КонецЕсли;
		Исключение
			СведенияОбОшибке = НСтр("ru='Не удалось загрузить файл на сайт: неверные параметры запроса.';uk='Не вдалося завантажити файл на сайт: невірні параметри запиту.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
			Возврат Неопределено;
		КонецПопытки;
	КонецЦикла;

	Возврат Ответ;
	
КонецФункции // ЗапросНаЭкспортФайла()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ИМПОРТА

// Подключается к сайту и получает Cookie.
// Параметры:
//  HTTPСоединение - COMОбъект
//  АдресСайта - Строка - адрес сайта
//  Логин - Строка - логин доступа к админской части сайта
//  Пароль - Строка - пароль доступа к админской части сайта
//
// Возвращаемое значение:
//  Структура
//
Функция УстановитьСоединениеССайтом(мHTTPСоединение, АдресСайта, Логин, Пароль, СведенияОбОшибке = "",ВидШаблона)
	
	// Формируем файл, необходимый для подключения.
	ИмяФайла = ПолучитьИмяВременногоФайла();
   	ФайлОтправки = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.ANSI);
	ФайлОтправки.Записать(Логин + ":" + Пароль);
	ФайлОтправки.Закрыть();
	Двоичные = Новый ДвоичныеДанные(ИмяФайла);
	СтрокаBase64 = Base64Строка(Двоичные);
	
	// Отправляем запрос на получение Cookie.
	Попытка

	Если ВидШаблона = Перечисления.ВариантыСайта.ВДГБ Тогда
		мHTTPСоединение.open ("GET", "http://" + UrlEncode(АдресСайта) + "/bitrix/admin/tszh_exchange.php?mode=checkauth", Ложь, Логин, Пароль);
	ИНаче
		мHTTPСоединение.open ("GET", "http://" + UrlEncode(АдресСайта) + "/connect/housing_exchange.php?mode=checkauth", Ложь, Логин, Пароль);
	КонецЕсли;
		мHTTPСоединение.setRequestHeader("Authorization", "Basic " + СтрокаBase64);
		мHTTPСоединение.setRequestHeader("Host", АдресСайта);
	    мHTTPСоединение.setRequestHeader("User-Agent", "Mozilla/5.0");
		мHTTPСоединение.send();
		Ответ = мHTTPСоединение.responseText;
	Исключение
		СведенияОбОшибке = НСтр("ru='Неудачная авторизация: ошибка при получении ответа от сайта';uk='Невдала авторизація: помилка при отриманні відповіді від сайту'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
		Возврат Неопределено;
	КонецПопытки;
	
	// При удачной авторизации получим ответ "success".
	Если НЕ Лев(Ответ, 7) = "success" Тогда
		СведенияОбОшибке = НСтр("ru='Неудачная авторизация: ошибка при получении ответа от сайта';uk='Невдала авторизація: помилка при отриманні відповіді від сайту'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
		Возврат Неопределено;
	КонецЕсли;
	
	Ответ = Прав(Ответ, СтрДлина(Ответ) - 8);
	ПозПС = Найти(Ответ, Символы.ПС);
	Если ПозПС = 0 Тогда
		
		Если ВидШаблона = Перечисления.ВариантыСайта.ВДГБ Тогда
			СведенияОбОшибке = НСтр("ru='Неудачная авторизация: ошибка при получении ответа от сайта';uk='Невдала авторизація: помилка при отриманні відповіді від сайту'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
			Возврат Неопределено;
		Иначе
			Куки = Новый Структура("Имя", Ответ);
			Куки.Вставить("Cookie",Ответ);
			Возврат Куки;
		КонецЕсли;
	КонецЕсли;
	
	Куки = Новый Структура("Имя", Лев(Ответ, ПозПС - 1));
	Ответ = Прав(Ответ, СтрДлина(Ответ) - ПозПС);
	Куки.Вставить("Cookie", Лев(Ответ, СтрДлина(Ответ) - 1));
	
	Возврат Куки;
	
КонецФункции // УстановитьСоединениеССайтом()

// Проверяет подключение к сайту по переданным параметрам доступа.
//
// Параметры:
//  АдресСайта - Строка - адрес сайта
//  Логин - Строка - логин доступа к админской части сайта
//  Пароль - Строка - пароль доступа к админской части сайта
//
// Возвращаемое значение:
//  Булево
//
Функция ПроверитьПодключениеКСайту(АдресСайта, Логин, Пароль, СведенияОбОшибке = "",ВидШаблона) Экспорт
	
	Попытка
		мHTTPСоединение = Новый COMОбъект("MSXML2.XMLHTTP");
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не зарегистрирован объект MSXML2.XMLHTTP"));
		Возврат Ложь;
	КонецПопытки;
	
	Возврат ?(УстановитьСоединениеССайтом(мHTTPСоединение, АдресСайта, Логин, Пароль,,ВидШаблона) = Неопределено, Ложь, Истина);
	
КонецФункции // ПроверитьПодключениеКСайту()

// Получает максимально объем данных, который можно передать на сайт за 1 раз.
//
// Параметры:
//  HTTPСоединение - COMОбъект
//  АдресСайта - Строка - адрес сайта
//  Логин - Строка - логин доступа к админской части сайта
//  Пароль - Строка - пароль доступа к админской части сайта
//  Куки - Структура - Cookie сайта
//
// Возвращаемое значение:
//  Число
//
Функция ПолучитьРазрешенныйРазмерФайлаОбмена(мHTTPСоединение, АдресСайта, Логин, Пароль, Куки, СведенияОбОшибке,ВидШаблона = Неопределено)
	
	Попытка
		Если ВидШаблона = Перечисления.ВариантыСайта.ВДГБ Тогда
			мHTTPСоединение.open ("GET", "http://" +UrlEncode(АдресСайта) + "/bitrix/admin/tszh_exchange.php?mode=init", Ложь, Логин, Пароль);
		Иначе	
			мHTTPСоединение.open ("GET", "http://" +UrlEncode(АдресСайта) + "/connect/housing_exchange.php?mode=init", Ложь, Логин, Пароль);
		КонецЕсли;
		мHTTPСоединение.setRequestHeader ("Host",       АдресСайта);
		мHTTPСоединение.setRequestHeader ("User-Agent", "Mozilla/5.0");
		мHTTPСоединение.setRequestHeader ("Cookie",     Куки.Имя + "=" + Куки.Cookie);
		мHTTPСоединение.send();
		Ответ = мHTTPСоединение.responseText;
	Исключение
		СведенияОбОшибке = НСтр("ru='Не удалось получить параметры загрузки данных на сайт.';uk='Не вдалося отримати параметри завантаження даних на сайт.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
		Возврат 0;
	КонецПопытки;
	
	Если Лев(Ответ, 11) <> "file_limit=" Тогда
		СведенияОбОшибке = НСтр("ru='Не удалось получить параметры загрузки данных на сайт.';uk='Не вдалося отримати параметри завантаження даних на сайт.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
		Возврат 0;
	КонецЕсли;
	
	Ответ = Сред(Ответ, 12, СтрДлина(Ответ) - 11);
	Попытка
		Возврат Число(Ответ);
	Исключение
		СведенияОбОшибке = НСтр("ru='Не удалось получить параметры загрузки данных на сайт.';uk='Не вдалося отримати параметри завантаження даних на сайт.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
		Возврат 0;
	КонецПопытки;
	
КонецФункции // ПолучитьРазрешенныйРазмерФайлаОбмена()

// Выгружает файл с сайта.
//
// Параметры:
//  ТипДанных - Строка - идентификатор загружаемых данных
//  АдресСайта - Строка - адрес сайта
//  Логин - Строка - логин доступа к админской части сайта
//  Пароль - Строка - пароль доступа к админской части сайта
//  ИННОрганизации - Строка - ИНН организации, на сайт которой передаем файл
//
// Возвращаемое значение:
//  Строка, Неопределено
//
Функция ЗагрузитьДанныеССайта(ТипДанных, АдресСайта, Логин, Пароль, ИННОрганизации, СведенияОбОшибке = "", ДопПараметры = Неопределено, ВидШаблона = Неопределено)
	
	Попытка
		мHTTPСоединение = Новый COMОбъект("MSXML2.XMLHTTP");
	Исключение
		СведенияОбОшибке = НСтр("ru='Не зарегистрирован объект MSXML2.XMLHTTP';uk=""Не зареєстрований об'єкт MSXML2.XMLHTTP""");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
		
		Возврат Неопределено;
	КонецПопытки;
	
	Куки = УстановитьСоединениеССайтом(мHTTPСоединение, АдресСайта, Логин, Пароль, СведенияОбОшибке,ВидШаблона);
	
	Если Куки = Неопределено Тогда
		СведенияОбОшибке = НСтр("ru='Неудачное соединение с сервером ЖКХ.';uk=""Невдале з'єднання з сервером ЖКГ.""");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
		
		Возврат Неопределено;
	КонецЕсли;
	
	Ответ = ПолучитьФайлССайта(мHTTPСоединение, ТипДанных, Куки, АдресСайта, Логин, Пароль, ИННОрганизации, СведенияОбОшибке, ДопПараметры, ВидШаблона);
	
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СформироватьТекстовыйФайл(Ответ);
	
КонецФункции // ЗагрузитьДанныеССайта()

// Отправляет на сайт запрос на получение файла.
//
// Параметры:
//  HTTPСоединение - COMОбъект
//  ТипДанных - Строка - идентификатор передаваемых данных
//  Куки - Структура - Cookie сайта
//  АдресСайта - Строка - адрес сайта
//  Логин - Строка - логин доступа к админской части сайта
//  Пароль - Строка - пароль доступа к админской части сайта
//  ИННОрганизации - Строка - ИНН организации, на сайт которой передаем файл
//  СведенияОбОшибке - Строка - строка, содержащаясведения об ошибке
//  ДопПараметры - структура с параметрами для запроса на загрузку реестра платажей
//
// Возвращаемое значение:
//  Строка, Неопределено
//
Функция ПолучитьФайлССайта(мHTTPСоединение, ТипДанных, Куки, АдресСайта, Логин, Пароль, ИННОрганизации, СведенияОбОшибке, ДопПараметры,ВидШаблона)
	
	Если ТипДанных = "meters" ИЛИ ТипДанных = "accexistence" Тогда
		Если ВидШаблона = Перечисления.ВариантыСайта.ВДГБ Тогда
			ТекстЗапроса = "http://" + UrlEncode(АдресСайта) + "/bitrix/admin/tszh_exchange.php?mode=export&type=" +
			UrlEncode(ТипДанных) + "&inn=" + UrlEncode(ИННОрганизации);
		Иначе
			ТекстЗапроса = "http://" + UrlEncode(АдресСайта) + "/connect/housing_exchange.php?mode=export&type=" +
			UrlEncode(ТипДанных) + "&inn=" + UrlEncode(ИННОрганизации);
		КонецЕсли;
		
	ИначеЕсли ТипДанных = "monetapayments" Тогда
		Если НЕ ДопПараметры.Свойство("НачальнаяДата") ИЛИ НЕ ДопПараметры.Свойство("КонечнаяДата") Тогда
			СведенияОбОшибке = НСтр("ru='Не заданы параметры обмена.';uk='Не задані параметри обміну.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
			
			Возврат Неопределено;
		КонецЕсли;
		
		Если ВидШаблона = Перечисления.ВариантыСайта.ВДГБ Тогда
			ТекстЗапроса = "http://" + UrlEncode(АдресСайта) + "/bitrix/admin/tszh_exchange.php?mode=export&type=" +UrlEncode(ТипДанных) + "&inn=" + UrlEncode(ИННОрганизации) + "&datebeg=" + UrlEncode(ДопПараметры.НачальнаяДата) + 
			"&dateend=" + UrlEncode(ДопПараметры.КонечнаяДата)
		Иначе
			ТекстЗапроса = "http://" + UrlEncode(АдресСайта) + "/connect/housing_exchange.php?mode=export&type=" +
			UrlEncode(ТипДанных) + "&inn=" + UrlEncode(ИННОрганизации) + "&datebeg=" + UrlEncode(ДопПараметры.НачальнаяДата) + 
			"&dateend=" + UrlEncode(ДопПараметры.КонечнаяДата);
		КонецЕсли;
		
	Иначе
		СведенияОбОшибке = НСтр("ru='Ошибка получения файла с сайта: неизвестный формат обмена.';uk='Помилка отримання файла з сайту: невідомий формат обміну.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СведенияОбОшибке);
		
		Возврат Неопределено;
	КонецЕсли;
	
	мHTTPСоединение.open("GET", ТекстЗапроса, Ложь, Логин, Пароль);
	мHTTPСоединение.setRequestHeader("Host",       АдресСайта);
	мHTTPСоединение.setRequestHeader("User-Agent", "Mozilla/5.0");
	мHTTPСоединение.setRequestHeader("Cookie",     Куки.Имя + "=" + Куки.Cookie);
	мHTTPСоединение.send();
	
	Ответ = мHTTPСоединение.responseText;
	
	Если ЛЕВ(Ответ, 7) = "failure" Тогда
		Ответ = СтрЗаменить(Ответ,"failure", НСтр("ru='Ошибка.';uk='Помилка.'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ответ);
		Возврат Неопределено;
	Иначе
		Возврат Ответ;
	КонецЕсли;
	
КонецФункции // ПолучитьФайлССайта()

// Формирует ссылку на необходимую страницу сайта.
//
// Параметры:
//  РедактироватьНовости - Булево - признак того, что требуется открыть страницу редактирования новостей
//  АдресСайта - Строка - адрес сайта
//  Логин - Строка - логин доступа к админской части сайта
//  Пароль - Строка - пароль доступа к админской части сайта
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьАдресСтраницы(РедактироватьНовости, АдресСайта, Логин, Пароль) Экспорт
	
//{{MRG[ <-> ]
	Возврат "http://" + UrlEncode(АдресСайта) + ?(РедактироватьНовости, "/bitrix/tools/citrus_tszh_1c_auth.php?login=" +
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	Возврат "http://" + UrlEncode(АдресСайта) + ?(РедактироватьНовости, "/connect/tools/citrus_tszh_1c_auth.php?login=" +
//}}MRG[ <-> ]
												  UrlEncode(Логин) + "&password=" + UrlEncode(Пароль), "");
	
КонецФункции // ПолучитьАдресСтраницы()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Возвращает строку urlencoded.
//
// Параметры:
//  стр - Строка - строка, которую требуется закодировать
//
// Возвращаемое значение:
//  Строка
//
Функция UrlEncode(стр)
	
	HEX = Новый Массив();
	Для сч = 48 По 57 Цикл 
		HEX.Добавить(Символ(сч));
	КонецЦикла;
	
	Для сч = 65 По 70 Цикл 
		HEX.Добавить(Символ(сч));
	КонецЦикла;
	
	рез="";
	Для сч = 1 По СтрДлина(стр) Цикл
		чар = Сред(стр, сч, 1);
		Если (чар >= "a") И (чар <= "z") Тогда рез = рез + чар; Продолжить; КонецЕсли;
		Если (чар >= "A") И (чар <= "Z") Тогда рез = рез + чар; Продолжить; КонецЕсли;
		Если (чар >= "0") И (чар <= "9") Тогда рез = рез + чар; Продолжить; КонецЕсли;
		Если чар = "-" Тогда рез = рез + чар; Продолжить; КонецЕсли;
		Если чар = "_" Тогда рез = рез + чар; Продолжить; КонецЕсли;
		Если чар = "=" Тогда рез = рез + чар; Продолжить; КонецЕсли;
		Если чар = "&" Тогда рез = рез + чар; Продолжить; КонецЕсли;
		Если чар = "." Тогда рез = рез + чар; Продолжить; КонецЕсли;
		Если чар = "!" Тогда рез = рез + чар; Продолжить; КонецЕсли;
		//Если чар = "#" Тогда рез = рез + %23; Продолжить; КонецЕсли;
		кс = КодСимволаASCII(чар);
		рез = рез+ "%" + HEX[Цел(кс/16)] + HEX[Цел(кс % 16)];
	КонецЦикла;
	
	Возврат рез;
	
КонецФункции // UrlEncode()

// Возвращает код символа в ASCII
//
// Параметры:
//  Символ - Строка - симовол, код которого необходимо получить
//
// Возвращаемое значение:
//  Число
//
Функция КодСимволаASCII(Символ)
	
   КодUNICODE = КодСимвола(Символ);
   
   Если ((КодUNICODE > 1039) И (КодUNICODE < 1104)) Тогда
       Возврат (КодUNICODE - 848);
   ИначеЕсли КодUNICODE = 8470 Тогда
       Возврат 185;
   ИначеЕсли КодUNICODE = 1105 Тогда
       Возврат 184;
   ИначеЕсли КодUNICODE = 1025 Тогда
       Возврат 168;
   Иначе
       Возврат КодUNICODE;
   КонецЕсли;
   
КонецФункции // КодСимволаASCII()

// Записывает данные во временный XML файл и возвращает имя сформированного файла.
//
// Параметры:
//  СтруктураВыгрузки - Структура - содержит выгружаемые данные.
//
// Возвращаемое значение:
//  Строка - имя файла выгрузки.
//
Функция СформироватьФайлXML(СтруктураВыгрузки, ОбновлятьПараметрыДоступа = Ложь, Шаблон = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(СтруктураВыгрузки) ИЛИ НЕ ТипЗнч(СтруктураВыгрузки) = Тип("Структура") Тогда
		// Если неопределенное значение.
		Возврат Неопределено;
	КонецЕсли;
	
	// Попытка на случай если передали что-то совсем неправильное
	Попытка
		Если СтруктураВыгрузки.filetype = "access" Тогда
			ВыгружатьВсеДанные = Ложь;
		ИначеЕсли СтруктураВыгрузки.filetype = "calculations"
			  ИЛИ СтруктураВыгрузки.filetype = "accounts" Тогда
			ВыгружатьВсеДанные = Истина;
		Иначе
			// Неверные данные
			Возврат Неопределено;
		КонецЕсли;
	Исключение
		// Неверные данные
		Возврат Неопределено;
	КонецПопытки;
	
	// Получаем имя временного файла.
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	
	// Создаем XML файл.
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла);
	
	// Записываем сведения об организации в элемент "ORG".
	ДокументDOM = Новый ДокументDOM("", "ORG");
	КорневойЭлемент = ДокументDOM.ЭлементДокумента;
	
	// Общие данные организации
	КорневойЭлемент.УстановитьАтрибут("filedate", СтруктураВыгрузки.filedate);
	КорневойЭлемент.УстановитьАтрибут("name",     СтруктураВыгрузки.name);
	КорневойЭлемент.УстановитьАтрибут("inn",      СтруктураВыгрузки.inn);
	КорневойЭлемент.УстановитьАтрибут("filetype", СтруктураВыгрузки.filetype);
	КорневойЭлемент.УстановитьАтрибут("version",  СтруктураВыгрузки.version);
	
	// Выгрузка в файл
	Если ВыгружатьВсеДанные Тогда
		
		// Банковский счет организации
		КорневойЭлемент.УстановитьАтрибут("kpp",  СтруктураВыгрузки.kpp);
		КорневойЭлемент.УстановитьАтрибут("bank", СтруктураВыгрузки.bank);
		КорневойЭлемент.УстановитьАтрибут("rs",   СтруктураВыгрузки.rs);
		КорневойЭлемент.УстановитьАтрибут("ks",   СтруктураВыгрузки.ks);
		КорневойЭлемент.УстановитьАтрибут("bik",  СтруктураВыгрузки.bik);
		
		// Лицевые счета
		Если ЗначениеЗаполнено(СтруктураВыгрузки.PersAcc) Тогда
			Для каждого ТекСтрокаЛС из СтруктураВыгрузки.PersAcc Цикл
				
				ТекЛС = ДокументDOM.СоздатьЭлемент("PersAcc");
				КорневойЭлемент.ДобавитьДочерний(ТекЛС);
				Если Шаблон = Перечисления.ВариантыСайта.СИНГРИ Тогда
					ТекЛС.УстановитьАтрибут("kod_ls",            ТекСтрокаЛС.login);
				Иначе	
					ТекЛС.УстановитьАтрибут("kod_ls",            ТекСтрокаЛС.kod_ls);
				КонецЕсли;
				ТекЛС.УстановитьАтрибут("login",             ТекСтрокаЛС.login);
				ТекЛС.УстановитьАтрибут("password",          ТекСтрокаЛС.password);
				ТекЛС.УстановитьАтрибут("AddressCity",       ТекСтрокаЛС.AddressCity);
				ТекЛС.УстановитьАтрибут("AddressDistrict",   ТекСтрокаЛС.AddressDistrict);
				ТекЛС.УстановитьАтрибут("AddressFlat",       ТекСтрокаЛС.AddressFlat);
				ТекЛС.УстановитьАтрибут("FlatAbbr",          ТекСтрокаЛС.FlatAbbr);
				ТекЛС.УстановитьАтрибут("AddressHouse",      ТекСтрокаЛС.AddressHouse);
				ТекЛС.УстановитьАтрибут("AddressRegion",     ТекСтрокаЛС.AddressRegion);
				ТекЛС.УстановитьАтрибут("AddressSettlement", ТекСтрокаЛС.AddressSettlement);
				ТекЛС.УстановитьАтрибут("AddressStreet",     ТекСтрокаЛС.AddressStreet);
				ТекЛС.УстановитьАтрибут("Barcode",           ТекСтрокаЛС.Barcode);
				ТекЛС.УстановитьАтрибут("commonarea",        ТекСтрокаЛС.commonarea);
				ТекЛС.УстановитьАтрибут("debtbeg",           ТекСтрокаЛС.debtbeg);
				ТекЛС.УстановитьАтрибут("debtend",           ТекСтрокаЛС.debtend);
				ТекЛС.УстановитьАтрибут("debtprev",          ТекСтрокаЛС.debtprev);
				ТекЛС.УстановитьАтрибут("prepayment",        ТекСтрокаЛС.prepayment);
				ТекЛС.УстановитьАтрибут("sumtopay",          ТекСтрокаЛС.sumtopay);
				ТекЛС.УстановитьАтрибут("lastPaymentDate",   ТекСтрокаЛС.lastPaymentDate);
				ТекЛС.УстановитьАтрибут("email",             ТекСтрокаЛС.email);
				ТекЛС.УстановитьАтрибут("habarea",           ТекСтрокаЛС.habarea);
				ТекЛС.УстановитьАтрибут("name",              ТекСтрокаЛС.name);
				ТекЛС.УстановитьАтрибут("name_ls",           ТекСтрокаЛС.name_ls);
				ТекЛС.УстановитьАтрибут("people",            ТекСтрокаЛС.people);
				ТекЛС.УстановитьАтрибут("num_of_reg",        ТекСтрокаЛС.num_of_reg);
				
				// Начисления
				Если ЗначениеЗаполнено(ТекСтрокаЛС.item) Тогда
					Для каждого ТекСтрокаНачисления из ТекСтрокаЛС.item Цикл
						
						ТекНачисление = ДокументDOM.СоздатьЭлемент("item");
						ТекЛС.ДобавитьДочерний(ТекНачисление);
						
						ТекНачисление.УстановитьАтрибут("ammount",      ТекСтрокаНачисления.ammount);
						ТекНачисление.УстановитьАтрибут("correction",   ТекСтрокаНачисления.correction);
						ТекНачисление.УстановитьАтрибут("edizm",        ТекСтрокаНачисления.edizm);
						ТекНачисление.УстановитьАтрибут("kod",          ТекСтрокаНачисления.kod);
						ТекНачисление.УстановитьАтрибут("name",         ТекСтрокаНачисления.name);
						ТекНачисление.УстановитьАтрибут("norm",         ТекСтрокаНачисления.norm);
						ТекНачисление.УстановитьАтрибут("peni",         ТекСтрокаНачисления.peni);
						ТекНачисление.УстановитьАтрибут("sum",          ТекСтрокаНачисления.sum);
						ТекНачисление.УстановитьАтрибут("sumpayed",     ТекСтрокаНачисления.sumpayed);
						ТекНачисление.УстановитьАтрибут("compensation", ТекСтрокаНачисления.compensation);
						ТекНачисление.УстановитьАтрибут("sumtopay",     ТекСтрокаНачисления.sumtopay);
						ТекНачисление.УстановитьАтрибут("debtbeg",      ТекСтрокаНачисления.debtbeg);
						ТекНачисление.УстановитьАтрибут("debtend",      ТекСтрокаНачисления.debtend);
						
						// Начисления ОПУ
						Если ЗначениеЗаполнено(ТекСтрокаНачисления.hmeter) Тогда
							
							ЭтоПервый = Истина;
							Сч = 2;
							Для каждого ТекОПУ из ТекСтрокаНачисления.hmeter Цикл
								Если ЭтоПервый Тогда
									ТекНачисление.УстановитьАтрибут("hmeter", ТекОПУ);
									ЭтоПервый = Ложь;
								Иначе
									ТекНачисление.УстановитьАтрибут("hmeter" + Строка(Сч), ТекОПУ);
									Сч = Сч + 1;
								КонецЕсли;
							КонецЦикла;
						
							ТекНачисление.УстановитьАтрибут("hammount",  ТекСтрокаНачисления.hammount);
							ТекНачисление.УстановитьАтрибут("hnorm",     ТекСтрокаНачисления.hnorm);
							ТекНачисление.УстановитьАтрибут("hsum",      ТекСтрокаНачисления.hsum);
							ТекНачисление.УстановитьАтрибут("hsumtopay", ТекСтрокаНачисления.hsumtopay);
							ТекНачисление.УстановитьАтрибут("volumeh",   ТекСтрокаНачисления.volumeh);
						КонецЕсли;
						
						// Тарифы
						ТекНачисление.УстановитьАтрибут("tarif1", ТекСтрокаНачисления.tarif1);
						
						Если НЕ ТекСтрокаНачисления.tarif2 = "" ИЛИ НЕ ТекСтрокаНачисления.tarif3 = "" Тогда
							ТекНачисление.УстановитьАтрибут("tarif2", ТекСтрокаНачисления.tarif2);
							ТекНачисление.УстановитьАтрибут("tarif3", ТекСтрокаНачисления.tarif3);
						КонецЕсли;
						
					КонецЦикла;
				КонецЕсли;
					
				// ИПУ
				Если ЗначениеЗаполнено(ТекСтрокаЛС.meter) Тогда
					Для каждого ТекСтрокаИПУ из ТекСтрокаЛС.meter Цикл
						
						ТекИПУ = ДокументDOM.СоздатьЭлемент("meter");
						ТекЛС.ДобавитьДочерний(ТекИПУ);
						
						ТекИПУ.УстановитьАтрибут("value_count", ТекСтрокаИПУ.value_count);
						ТекИПУ.УстановитьАтрибут("kod",         ТекСтрокаИПУ.kod);
						ТекИПУ.УстановитьАтрибут("name",        ТекСтрокаИПУ.name);
						ТекИПУ.УстановитьАтрибут("service",     ТекСтрокаИПУ.service);
						
						// Показания ИПУ
						Если ЗначениеЗаполнено(ТекСтрокаИПУ.date_indiccur) Тогда
							
							// Текущие
							ТекИПУ.УстановитьАтрибут("date_indiccur", ТекСтрокаИПУ.date_indiccur);
							ТекИПУ.УстановитьАтрибут("indiccur1",     ТекСтрокаИПУ.indiccur1);
							
							Если ТекСтрокаИПУ.value_count = "2" Тогда
								ТекИПУ.УстановитьАтрибут("indiccur2", ТекСтрокаИПУ.indiccur2);
							ИначеЕсли ТекСтрокаИПУ.value_count = "3" Тогда
								ТекИПУ.УстановитьАтрибут("indiccur2", ТекСтрокаИПУ.indiccur2);
								ТекИПУ.УстановитьАтрибут("indiccur3", ТекСтрокаИПУ.indiccur3);
							КонецЕсли;
							
							// Показания на начало месяца
							Если ЗначениеЗаполнено(ТекСтрокаИПУ.date_indicbef) Тогда
								
								ТекИПУ.УстановитьАтрибут("date_indicbef", ТекСтрокаИПУ.date_indicbef);
								ТекИПУ.УстановитьАтрибут("indicbef1", ТекСтрокаИПУ.indicbef1);
								
								Если ТекСтрокаИПУ.value_count = "2" Тогда
									ТекИПУ.УстановитьАтрибут("indicbef2", ТекСтрокаИПУ.indicbef2);
								ИначеЕсли ТекСтрокаИПУ.value_count = "3" Тогда
									ТекИПУ.УстановитьАтрибут("indicbef2", ТекСтрокаИПУ.indicbef2);
									ТекИПУ.УстановитьАтрибут("indicbef3", ТекСтрокаИПУ.indicbef3);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	Иначе
		// Вариант выгрузки "Access".
		Если ЗначениеЗаполнено(СтруктураВыгрузки.PersAcc) Тогда
			Для каждого ТекСтрока из СтруктураВыгрузки.PersAcc Цикл
				
				СтрокаЛС = ДокументDOM.СоздатьЭлемент("PersAcc");
				КорневойЭлемент.ДобавитьДочерний(СтрокаЛС);
				Если Шаблон = Перечисления.ВариантыСайта.СИНГРИ Тогда
					СтрокаЛС.УстановитьАтрибут("kod_ls",            ТекСтрока.login);
				Иначе	
					СтрокаЛС.УстановитьАтрибут("kod_ls",            ТекСтрока.kod_ls);
				КонецЕсли;
				СтрокаЛС.УстановитьАтрибут("login",    ТекСтрока.login);
				СтрокаЛС.УстановитьАтрибут("password", ТекСтрока.password);
				СтрокаЛС.УстановитьАтрибут("email",	   ТекСтрока.email);
				
				Если ОбновлятьПараметрыДоступа Тогда
					СтрокаЛС.УстановитьАтрибут("rewrite", "true");
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьDOM = Новый ЗаписьDOM();
	ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
		
	ЗаписьXML.Закрыть();

	Возврат ИмяВременногоФайла;
	
КонецФункции

// Получим балицу тарифов ПУ 
// Параметры МассивКодовПУ - Массив
Функция ПолучитьТаблицуТарифовПУ(МассивКодовПУ)

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
		|	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа КАК ВидТарифа
		|ИЗ
		|	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(, ПриборУчета.Код В (&КодыПУ)) КАК ПоказанияПриборовУчетаСрезПоследних
		|ГДЕ
		|	ПоказанияПриборовУчетаСрезПоследних.Отключен = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриборУчета,
		|	ВидТарифа";
	
	Запрос.УстановитьПараметр("КодыПУ", МассивКодовПУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Возврат РезультатЗапроса.Выгрузить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;


КонецФункции

Процедура ДозаписатьОтветственногоВладельца(Лицо,ЛицевойСчет) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Лицо.Пароль) 
		или ЗначениеЗаполнено(Лицо.Логин) Тогда
		ЛицоОбъект = Лицо.ПолучитьОбъект();
		ЛицоОбъект.Пароль = ПРАВ(ЛицоОбъект.Код,5);
		ЛицоОбъект.Логин = ПРАВ(ЛицоОбъект.Код,5);
		
		Если НЕ ЗначениеЗаполнено(ЛицоОбъект.МобДляСайта) Тогда
			ЛицоОбъект.МобДляСайта = ЛицевойСчет.МобТелефон;
		КонецЕсли;
		
		
		Если НЕ ЗначениеЗаполнено(ЛицоОбъект.ЕлектроннаяПочта) Тогда
			ЛицоОбъект.ЕлектроннаяПочта = ЛицевойСчет.ЭлПочта;
		КонецЕсли;
		ЛицоОбъект.Записать();
	КонецЕсли;	
КонецПроцедуры





																			  
