////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтносительныйРазмер = Параметры.ОтносительныйРазмер;
	МинимальныйЭффект = Параметры.МинимальныйЭффект;
	Элементы.МинимальныйЭффект.Видимость = Параметры.РежимПерестроения;
	Заголовок = ?(Параметры.РежимПерестроения,
	              НСтр("ru='Параметры перестроения';uk='Параметри перебудування'"),
	              НСтр("ru='Параметр расчета оптимальных агрегатов';uk='Параметр розрахунків оптимальних агрегатів'"));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Структура("ОтносительныйРазмер, МинимальныйЭффект");
	Результат.ОтносительныйРазмер = ОтносительныйРазмер;
	Результат.МинимальныйЭффект = МинимальныйЭффект;
	
	Закрыть(Результат);
	
КонецПроцедуры
