//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ   
//

// Процедура - обработчик события формы "ПриЗагрузкеДанныхИзНастроекНаСервере".
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		
		Элементы.ГруппаОтборы.Видимость = Ложь;
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Здание",	Параметры.Отбор.Владелец,	ЗначениеЗаполнено(Параметры.Отбор.Владелец));
		
	Иначе
		
		ОтборОрганизация	 		= Настройки.Получить("ОтборОрганизация");
		ОтборЗдание		 			= Настройки.Получить("ОтборЗдание");
	
		ОтборПодъезд	 			= Настройки.Получить("ОтборПодъезд");
		ОтборЖилойФонд				= Настройки.Получить("ОтборЖилойФонд");
		
		УстановитьСвязиПараметровВыбора();
		
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Здание",			ОтборЗдание,		ЗначениеЗаполнено(ОтборЗдание));
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Организация",		ОтборОрганизация,	ЗначениеЗаполнено(ОтборОрганизация));
		
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Подъезд",			ОтборПодъезд,		ЗначениеЗаполнено(ОтборПодъезд));
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ЖилойФонд",			ОтборЖилойФонд,		ЗначениеЗаполнено(ОтборЖилойФонд));
	
	КонецЕсли;
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура УстановитьОтбор()
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Здание", ОтборЗдание, ЗначениеЗаполнено(ОтборЗдание));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Подъезд", ОтборПодъезд, ЗначениеЗаполнено(ОтборПодъезд));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗданиеПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодъездПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЖилойФондПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ЖилойФонд", ОтборЖилойФонд, ЗначениеЗаполнено(ОтборЖилойФонд));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбора()
	
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Организация", "ОтборОрганизация", РежимИзмененияСвязанногоЗначения.НеИзменять);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		Элементы.ОтборЗдание.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
		Если ОтборЗдание.Организация <> ОтборОрганизация Тогда
			ОтборЗдание = Справочники.ЗданияИСооружения.ПустаяСсылка();
			ОтборПодъезд = Справочники.Подъезды.ПустаяСсылка();
		КонецЕсли;
	Иначе		
		Элементы.ОтборЗдание.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив());
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
		
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Здание", ОтборЗдание);
	Если Копирование Тогда
		СтруктураПараметров.Вставить("ЗначениеКопирования", Элемент.ТекущаяСтрока);
	КонецЕсли; 	
		
	ОткрытьФорму("Справочник.ОбъектыЛицевыхСчетов.ФормаОбъекта", СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

