
&НаКлиенте
Процедура ФайлЕксельНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ФайлЕксель;
	Фильтр = "Электронная таблица Excel(*.xlsx)|*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ФайлЕксель = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Путь = Объект.ФайлЕксель;
	Если НЕ ЗначениеЗаполнено(Объект.ФайлЕксель) Тогда
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
	КонецЕсли;
	Если Объект.ТабличнаяЧасть.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	Объект.ТабличнаяЧасть.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.ActiveSheet.UsedRange.Rows.Count();//Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик = 2 По КоличествоСтрок Цикл
		НоваяСтрока                  = Объект.ТабличнаяЧасть.Добавить();
		НоваяСтрока.Услуга           = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.Тариф            = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.ТарифЛьготы      = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.НормаПотребления = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.ТарифПоНорме     = Excel.Cells(Счетчик, 5).Value;
		НоваяСтрока.ТарифПоНормеЛьгота = Excel.Cells(Счетчик, 6).Value;
	КонецЦикла;
	Excel.Workbooks.Close();
	Excel.Quit();
КонецПроцедуры

&НаСервере
Процедура УстановитьТарифНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.ТарифНаДату) Тогда
		Сообщить("Не заповнена дата початку дії тарифу! Заповніть дату!");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Сообщить("Не заповнено поле організація! Заповніть поле!");
		Возврат;
	КонецЕсли;
	
	// Выберем здания
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗданияИСооружения.Ссылка
		|ИЗ
		|	Справочник.ЗданияИСооружения КАК ЗданияИСооружения
		|ГДЕ
		|	ЗданияИСооружения.ПометкаУдаления = ЛОЖЬ";
	
	Здания = Запрос.Выполнить().Выгрузить();
	
	Для Каждого стр Из Здания Цикл
	    Док = Документы.УправлениеТарифами.СоздатьДокумент();
		Док.Автор = ПараметрыСеанса.ТекущийПользователь;
		Док.Дата = НачалоДня(Объект.ТарифНаДату);
		Док.Здание = стр.Ссылка;
		Док.Комментарий = "Створено обробкою ""Введення тарифів"".";
		Док.Организация = Объект.Организация;
		Для Каждого стрТЧ Из Объект.ТабличнаяЧасть Цикл
			НовСтр                     = Док.Тарифы.Добавить();
			НовСтр.ВидТарифа           = Перечисления.ВидыТарифов.Общий;
			Попытка
			    НовСтр.Услуга              = Справочники.Услуги.НайтиПоНаименованию(стрТЧ.Услуга);
			Исключение
				Сообщить("Тарифу не знайдено: " + стрТЧ.Услуга + "  Рядок " + стрТЧ.НомерСтроки);
				Возврат;
			КонецПопытки;
			НовСтр.ЗначениеТарифа      = стрТЧ.Тариф;    
			НовСтр.ЗначениеТарифаЛьгота = стрТЧ.ТарифЛьготы;
			НовСтр.НормаПотребления     = стрТЧ.НормаПотребления;
			НовСтр.ЗначениеТарифаПоНорме = стрТЧ.ТарифПоНорме;
			НовСтр.ЗначениеТарифаПоНормеЛьгота = стрТЧ.ТарифПоНормеЛьгота;
		КонецЦикла;
		Попытка
		    Док.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			Док.Записать();
			Сообщить("Не вдалося провести документ №" + Док.Номер);
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТариф(Команда)
	УстановитьТарифНаСервере();
КонецПроцедуры
