&НаКлиенте
Перем ТекущийНомерСтраницы;

&НаКлиенте
Перем КнопкиМастера;

&НаКлиенте
Перем СтраницыМастера;

&НаКлиенте
Процедура КомандаГотово(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ИмяФайлаДанных) Тогда
		Сообщение=НСтр("ru=""Не выбран файл для выгрузки.""; uk=""Не вибраний файл для вивантаження""");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение,, "Объект.ИмяФайлаДанных",,);
		Возврат;
	КонецЕсли;
	
	ИмяФайла = Объект.ИмяФайлаДанных;
	
	ПутьКаталога = 	ПолучитьПутьКаталога(Объект.ИмяФайлаДанных);
	СоздатьКаталог(ПутьКаталога);
	
	ЗаписьХМЛ = Новый ЗаписьXML;
	
	ЗаписьХМЛ.ОткрытьФайл(ИмяФайла);
	ЗаписьХМЛ.ЗаписатьОбъявлениеXML();
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("ORG");
	
		//Получить данные на сервере об организации
		ДанныеОрганизации = ДанныеХМЛБлокаОрганизации(Объект.Организация);
		
		ЗаписьХМЛ.ЗаписатьАтрибут("ID", ДанныеОрганизации.Ссылка);
		ЗаписьХМЛ.ЗаписатьАтрибут("filedate",Строка(Формат(НачалоМесяца(Объект.ПериодПросмотра),"ДЛФ=Д")));
		ЗаписьХМЛ.ЗаписатьАтрибут("inn", ДанныеОрганизации.ИНН);
		ЗаписьХМЛ.ЗаписатьАтрибут("name", ДанныеОрганизации.НаименованиеПолное);
		
		//Получить реквизиты банка на сервере
		БанкДляРасчета = ПолучитьРеквизитыБанкаНаСервере(Объект.РасчетныйСчетОрганизации);
				
		ЗаписьХМЛ.ЗаписатьНачалоЭлемента("BeneficiaryBank");
			ЗаписьХМЛ.ЗаписатьАтрибут("Receiver", БанкДляРасчета.Receiver);
			ЗаписьХМЛ.ЗаписатьАтрибут("Code", БанкДляРасчета.Code);
			ЗаписьХМЛ.ЗаписатьАтрибут("AccountNumber", БанкДляРасчета.AccountNumber);
			ЗаписьХМЛ.ЗаписатьАтрибут("MFI_Bank", БанкДляРасчета.MFI_Bank);
		ЗаписьХМЛ.ЗаписатьКонецЭлемента();
		
		//Формируем файл выгрузки
		МассивЛицСчетов = СформироватьфайлДляВыгрузки();
		
		Для каждого ЛС Из МассивЛицСчетов Цикл
			ЛицевойСчет = ЛС.Значение;
			ЗаписьХМЛ.ЗаписатьНачалоЭлемента("PersAcc");
				ЗаписьХМЛ.ЗаписатьАтрибут("ID", ЛицевойСчет.ID);
				ЗаписьХМЛ.ЗаписатьАтрибут("AddressCity", ЛицевойСчет.AddressCity);
				ЗаписьХМЛ.ЗаписатьАтрибут("AddressDistrict", ЛицевойСчет.AddressDistrict);
				ЗаписьХМЛ.ЗаписатьАтрибут("AddressFlat", ЛицевойСчет.AddressFlat);
				ЗаписьХМЛ.ЗаписатьАтрибут("AddressHouse", ЛицевойСчет.AddressHouse);
				ЗаписьХМЛ.ЗаписатьАтрибут("AddressRegion", ЛицевойСчет.AddressRegion);
				ЗаписьХМЛ.ЗаписатьАтрибут("AddressSettlement", ЛицевойСчет.AddressSettlement);
				ЗаписьХМЛ.ЗаписатьАтрибут("AddressStreet", ЛицевойСчет.AddressStreet);
				ЗаписьХМЛ.ЗаписатьАтрибут("Barcode", ЛицевойСчет.Barcode);
				ЗаписьХМЛ.ЗаписатьАтрибут("commonarea", ЛицевойСчет.commonarea);
				ЗаписьХМЛ.ЗаписатьАтрибут("debtbeg", ЛицевойСчет.debtbeg);
				ЗаписьХМЛ.ЗаписатьАтрибут("debtup", ЛицевойСчет.debtup);
				ЗаписьХМЛ.ЗаписатьАтрибут("debtdown", ЛицевойСчет.debtdown);
				ЗаписьХМЛ.ЗаписатьАтрибут("debtend", ЛицевойСчет.debtend);
				ЗаписьХМЛ.ЗаписатьАтрибут("email", ЛицевойСчет.email);
				ЗаписьХМЛ.ЗаписатьАтрибут("habarea", ЛицевойСчет.habarea);
				ЗаписьХМЛ.ЗаписатьАтрибут("kod_ls", ЛицевойСчет.kod_ls);
				ЗаписьХМЛ.ЗаписатьАтрибут("name", ЛицевойСчет.name);
				ЗаписьХМЛ.ЗаписатьАтрибут("name_ls", ЛицевойСчет.name_ls);
				ЗаписьХМЛ.ЗаписатьАтрибут("password", ЛицевойСчет.password);
				ЗаписьХМЛ.ЗаписатьАтрибут("people_Living", ЛицевойСчет.people_Living);
				ЗаписьХМЛ.ЗаписатьАтрибут("people_Prescription", ЛицевойСчет.people_Prescription);
				
				Для каждого УслугаЛС Из ЛицевойСчет.АктивныеУслуги Цикл
					Услуга =  УслугаЛС.Значение;
					ЗаписьХМЛ.ЗаписатьНачалоЭлемента("item");
						ЗаписьХМЛ.ЗаписатьАтрибут("ammount", Услуга.ammount);
						ЗаписьХМЛ.ЗаписатьАтрибут("edizm", Услуга.edizm);
						ЗаписьХМЛ.ЗаписатьАтрибут("ID", Услуга.ID);
						ЗаписьХМЛ.ЗаписатьАтрибут("Name", Услуга.name);
						ЗаписьХМЛ.ЗаписатьАтрибут("DetailsOf_Payment", Услуга.DetailsOf_Payment);
						ЗаписьХМЛ.ЗаписатьАтрибут("norm", Услуга.norm);
						ЗаписьХМЛ.ЗаписатьАтрибут("sum", Услуга.sum);
						ЗаписьХМЛ.ЗаписатьАтрибут("sumpayed", Услуга.sumpayed);
						ЗаписьХМЛ.ЗаписатьАтрибут("tarif", Услуга.tarif);
						Если Услуга.ЭтоСчетчик Тогда
							ПоказанияСчетчика = Услуга.ПоказанияСчетчика;
							ЗаписьХМЛ.ЗаписатьНачалоЭлемента("meter");
								ЗаписьХМЛ.ЗаписатьАтрибут("value_count", ПоказанияСчетчика.value_count);
								ЗаписьХМЛ.ЗаписатьАтрибут("indicbef1", ПоказанияСчетчика.indicbef1);
								ЗаписьХМЛ.ЗаписатьАтрибут("indiccur1", ПоказанияСчетчика.indiccur1);
								ЗаписьХМЛ.ЗаписатьАтрибут("ID", ПоказанияСчетчика.ID);
								ЗаписьХМЛ.ЗаписатьАтрибут("name", ПоказанияСчетчика.name);
								ЗаписьХМЛ.ЗаписатьАтрибут("service", ПоказанияСчетчика.service);
							ЗаписьХМЛ.ЗаписатьКонецЭлемента();
						КонецЕсли;
					ЗаписьХМЛ.ЗаписатьКонецЭлемента();
				КонецЦикла;
				
				//Формируем ПДФ Квитанцию на оплату
				ТабДокПДФ = ПечатьПДФКвитанции(ЛицевойСчет.ПараметрыПечати);
				
				//Опридиляем путь сохранения пдф квитанций                             
				ТабДокПДФ.АвтоМасштаб = Истина;                                
				ТабДокПДФ.Записать(ПолучитьПутьКаталога(Объект.ИмяФайлаДанных)+ЛицевойСчет.Barcode+".pdf", ТипФайлаТабличногоДокумента.PDF);
				//Конец формирования ПДФ квитанции
				
			ЗаписьХМЛ.ЗаписатьКонецЭлемента();
		КонецЦикла;
		
		МассивДокументов = ПолучитьДокументыДляВыгрузки();
		
		//Выгружаем на сайт Заявки на проведения работ
		ЗаписьХМЛ.ЗаписатьНачалоЭлемента("requests");
			//ЗаписьХМЛ.ЗаписатьАтрибут("filedate", "Дата документа");
			//ЗаписьХМЛ.ЗаписатьАтрибут("filetype", "Тип документа");
			
			ЗаписьХМЛ.ЗаписатьНачалоЭлемента("statuses");
				// Цикл на 5 статусов
				ЗаписьХМЛ.ЗаписатьНачалоЭлемента("status");
					ЗаписьХМЛ.ЗаписатьАтрибут("id","5");
					ЗаписьХМЛ.ЗаписатьАтрибут("title","Новая заявка");
				ЗаписьХМЛ.ЗаписатьКонецЭлемента();
				ЗаписьХМЛ.ЗаписатьНачалоЭлемента("status");
					ЗаписьХМЛ.ЗаписатьАтрибут("id","6");
					ЗаписьХМЛ.ЗаписатьАтрибут("title","Передана на исполнение");
				ЗаписьХМЛ.ЗаписатьКонецЭлемента();
				ЗаписьХМЛ.ЗаписатьНачалоЭлемента("status");
					ЗаписьХМЛ.ЗаписатьАтрибут("id","7");
					ЗаписьХМЛ.ЗаписатьАтрибут("title","Принята на исполнения");
				ЗаписьХМЛ.ЗаписатьКонецЭлемента();
				ЗаписьХМЛ.ЗаписатьНачалоЭлемента("status");
					ЗаписьХМЛ.ЗаписатьАтрибут("id","8");
					ЗаписьХМЛ.ЗаписатьАтрибут("title","Выполнена");
				ЗаписьХМЛ.ЗаписатьКонецЭлемента();
				ЗаписьХМЛ.ЗаписатьНачалоЭлемента("status");
					ЗаписьХМЛ.ЗаписатьАтрибут("id","9");
					ЗаписьХМЛ.ЗаписатьАтрибут("title","Завершена");
				ЗаписьХМЛ.ЗаписатьКонецЭлемента();
				//Конец цикла на статусы
			ЗаписьХМЛ.ЗаписатьКонецЭлемента();
			
			ЗаписьХМЛ.ЗаписатьНачалоЭлемента("categories");
				ЗаписьХМЛ.ЗаписатьНачалоЭлемента("category");
					ЗаписьХМЛ.ЗаписатьАтрибут("id","");			// Номер категории
					ЗаписьХМЛ.ЗаписатьАтрибут("title","");		//категория
				ЗаписьХМЛ.ЗаписатьКонецЭлемента();
			ЗаписьХМЛ.ЗаписатьКонецЭлемента();
			
			Для каждого ДокументЗаявка Из МассивДокументов Цикл
				Заявка = ДокументЗаявка.Значение;
				
				ЗаписьХМЛ.ЗаписатьНачалоЭлемента("request");
					ЗаписьХМЛ.ЗаписатьАтрибут("id", Заявка.Ссылка); 	//id документа
					ЗаписьХМЛ.ЗаписатьАтрибут("number", Заявка.Номер); 	// Номер документа
					ЗаписьХМЛ.ЗаписатьАтрибут("status", Заявка.Статус); // статус документа
					ЗаписьХМЛ.ЗаписатьАтрибут("category", Заявка.ВидЗаявки); // категория документа
					ЗаписьХМЛ.ЗаписатьАтрибут("title",СтрПолучитьСтроку(Заявка.ТекстЗаявки,1)); // заголовок документа
					ЗаписьХМЛ.ЗаписатьАтрибут("text", Заявка.ТекстЗаявки); // текст заявки
					ЗаписьХМЛ.ЗаписатьАтрибут("date", Формат(Заявка.ВремяУдобноеДляЗаказчика,"ДФ='dd.MM.yyyy ЧЧ.мм.сс'")); //назанченая дата для исполнения
					ЗаписьХМЛ.ЗаписатьАтрибут("controldate", Формат(Заявка.ВремяФактическогоВыполнения,"ДФ='dd.MM.yyyy ЧЧ.мм.сс'")); //фактическая дата исполнения 
					
					ЗаписьХМЛ.ЗаписатьНачалоЭлемента("address");
						ЗаписьХМЛ.ЗаписатьАтрибут("building", Заявка.Здание); //адрес дома
						ЗаписьХМЛ.ЗаписатьАтрибут("flat", Заявка.Квартира); // квартира
					ЗаписьХМЛ.ЗаписатьКонецЭлемента();
					
					ЗаписьХМЛ.ЗаписатьНачалоЭлемента("correspondence");
						ЗаписьХМЛ.ЗаписатьАтрибут("text","текст переписки");
					ЗаписьХМЛ.ЗаписатьКонецЭлемента();

					ЗаписьХМЛ.ЗаписатьАтрибут("fio", Заявка.ОтветственныйВладелец); // ФИО владельца
					ЗаписьХМЛ.ЗаписатьАтрибут("account",Заявка.ЛицевойСчет); // Лицевой счет
					
					ЗаписьХМЛ.ЗаписатьНачалоЭлемента("status");
						ЗаписьХМЛ.ЗаписатьАтрибут("status", Заявка.Статус);
						ЗаписьХМЛ.ЗаписатьАтрибут("date",Формат(Заявка.ДатаПоследнегоИзменения,"ДФ='dd.MM.yyyy ЧЧ.мм.сс'"));
						ЗаписьХМЛ.ЗаписатьАтрибут("user", Заявка.Автор);
						ЗаписьХМЛ.ЗаписатьАтрибут("user_name", Заявка.АвторПоследнегоИзменения);
					ЗаписьХМЛ.ЗаписатьКонецЭлемента();
				ЗаписьХМЛ.ЗаписатьКонецЭлемента();
				
			КонецЦикла; 
		ЗаписьХМЛ.ЗаписатьКонецЭлемента();
	
	ЗаписьХМЛ.ЗаписатьКонецЭлемента();
	ЗаписьХМЛ.Закрыть();
	ЗаписатьПДФ = Новый ЗаписьZipФайла;
	ЗаписатьПДФ.Открыть(Лев(ПутьКаталога, СтрДлина(ПутьКаталога)-1)+".zip",Пароль);
	ЗаписатьПДФ.Добавить(ПутьКаталога);
	ЗаписатьПДФ.Добавить(ИмяФайла);
	ЗаписатьПДФ.Записать();
	УдалитьФайлы(ПутьКаталога);
	УдалитьФайлы(ИмяФайла);
	
	Режим = РежимДиалогаВопрос.ОК;
	Текст = "ru = 'Выгрузка данных в файл окончена!'; uk='Вивантаження даних в файл завершено!'";
	Ответ = Вопрос(НСтр(Текст), Режим, 0);
	
КонецПроцедуры

&НаКлиенте

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ
//

// Открывает диалог выбора файла
//
// Параметры:
//  Элемент                - Элемент управления, для которого выбираем файл
//  ПроверятьСуществование - Если Истина, то выбор отменяется если файл не существует
// 
&НаКлиенте
Процедура ВыборФайла(Элемент, ПроверятьСуществование=Ложь, Знач РасширениеПоУмолчанию = "xml", 
	АрхивироватьФайлДанных = Истина, ВыборФайлаПравил = Ложь)
	
	ДиалогВыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр						=	"Файл данных (*.xml)|*.xml|Архивный файл данных (*.zip)|*.zip";
	ДиалогВыбораФайла.Расширение					=	"xml";
	
	ДиалогВыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	ДиалогВыбораФайла.ПолноеИмяФайла				=	Элемент.ТекстРедактирования;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	=	ПроверятьСуществование;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Объект.ИмяФайлаДанных = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры  //ВыборФайла()

// Обработчик события НачалоВыбора элемента ИмяФайлаДанных.
&НаКлиенте
Процедура ИмяФайлаДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыборФайла(Элемент, , , );
КонецПроцедуры

// Обработчик события Открытие элемента ИмяФайлаДанных.
&НаКлиенте
Процедура ИмяФайлаДанныхОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗапуститьПриложение("explorer " + Элемент.ТекстРедактирования);
	СтандартнаяОбработка = ЛОЖЬ;
	
КонецПроцедуры  //ИмяФайлаДанныхОткрытие()

//------------------------------------------------------------------------------

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНДНОЙ ПАНЕЛИ ФОРМЫ
//
&НаКлиенте
Процедура Очистить(Команда)
	Объект.ЛицевыеСчета.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = НСтр("ru='Не заполнены реквизиты Организация.';uk='Не заповнені реквізити Організація.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
		
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище)

	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
	Для каждого Строка Из ТаблицаДляЗагрузки Цикл
		НоваяСтрока = Объект.ЛицевыеСчета.Добавить();
		НоваяСтрока.ЛицевойСчет = Строка.ЛицевойСчет;
		НоваяСтрока.Владелец = Строка.ОтветственныйВладелец.Наименование;
		НоваяСтрока.Адрес = Строка.Здание.Наименование + ", " + Строка.ЛицевойСчет.ОбъектЛицевогоСчета.Наименование;
	КонецЦикла; 

КонецПроцедуры // ()


&НаКлиенте
Процедура МесяцСтрокаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, 
														СтандартнаяОбработка, 
														Объект.ПериодПросмотра, 
														ЭтаФорма);
																		 
КонецПроцедуры

// Процедура обрабатывает событие начала выбора из списка в поле периода регистрации
//
&НаКлиенте
Процедура НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, ПериодРегистрации, ЭтаФорма, НачальноеЗначение = Неопределено)
	СтандартнаяОбработка = Ложь;
	
	Если НачальноеЗначение = Неопределено Тогда
		НачальноеЗначение = ПериодРегистрации;
	КонецЕсли; 
	
	СписокВыбора = Новый СписокЗначений;
	НачалоТекущегоГода = НачалоГода(НачальноеЗначение);
	НачалоПрошлогоГода = НачалоГода(НачалоТекущегоГода - 1);
	СписокВыбора.Добавить(НачалоПрошлогоГода, (Формат(НачалоПрошлогоГода, "ДФ='yyyy'") + "..."));
	НачалоМесяцаЗаполнения = НачалоТекущегоГода;
	ЭлементПоУмолчанию = Неопределено;
	Для а = 1 По 12 Цикл
		ДобавленныйЭлемент = СписокВыбора.Добавить(НачалоМесяцаЗаполнения, ПолучитьПредставлениеПериодаРегистрации(НачалоМесяцаЗаполнения));
		Если НачальноеЗначение = НачалоМесяцаЗаполнения Тогда
			ЭлементПоУмолчанию = ДобавленныйЭлемент;
		КонецЕсли; 
		НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
	КонецЦикла;
	НачалоСледующегоГода = КонецГода(НачалоТекущегоГода) + 1;
	СписокВыбора.Добавить(НачалоСледующегоГода, (Формат(НачалоСледующегоГода, "ДФ='yyyy'") + "..."));
	
	ВыбранныйЭлемент = ЭтаФорма.ВыбратьИзСписка(СписокВыбора, Элемент, ЭлементПоУмолчанию);
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	ИначеЕсли Год(ВыбранныйЭлемент.Значение) <> Год(НачальноеЗначение) Тогда
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, ПериодРегистрации, ЭтаФорма, ВыбранныйЭлемент.Значение);
		Возврат;
	КонецЕсли;
	
	ПериодРегистрации = ВыбранныйЭлемент.Значение;
	МесяцСтрока  = ПолучитьПредставлениеПериодаРегистрации(ПериодРегистрации);
	
КонецПроцедуры

Функция ПолучитьПредставлениеПериодаРегистрации(ПериодРегистрации)
	
	Возврат Формат(ПериодРегистрации, "ДФ='MMMM yyyy'");

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ПериодПросмотра = ТекущаяДата();
	
КонецПроцедуры
 
Функция ДатаКакМесяцПредставление(ДатаДата)
    Возврат Формат(ДатаДата, "ДФ='ММММ гггг'");
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МесяцСтрока = ДатаКакМесяцПредставление(Объект.ПериодПросмотра);
	Объект.РасчетныйСчетОрганизации = ПолучитьРасчетныйСчетНаСервере(Объект.Организация);
	ИнициализацияМастераНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаПриИзменении(Элемент)
	ДатаКакМесяцПодобратьДатуПоТексту(Элемент.ТекстРедактирования, Объект.ПериодПросмотра);
	МесяцСтрока = ДатаКакМесяцПредставление(Объект.ПериодПросмотра);
КонецПроцедуры

&НаКлиенте
Функция ДатаКакМесяцПодобратьДатуПоТексту(Текст, ДатаПоТексту = НеОпределено)
	СписокВозврата = Новый СписокЗначений;
    ТекущийГод = Год(ТекущаяДата());
    
    Если ПустаяСтрока(Текст) Тогда
        Возврат СписокВозврата;
    КонецЕсли;
    Если Найти(Текст, ".") <> 0 Тогда
        Подстроки = РазложитьСтрокуВМассивПодстрок(Текст, ".");
    ИначеЕсли Найти(Текст, ",") <> 0 Тогда
        Подстроки = РазложитьСтрокуВМассивПодстрок(Текст, ",");
    ИначеЕсли Найти(Текст, "-") <> 0 Тогда
        Подстроки = РазложитьСтрокуВМассивПодстрок(Текст, "-");
    ИначеЕсли Найти(Текст, "/") <> 0 Тогда
        Подстроки = РазложитьСтрокуВМассивПодстрок(Текст, "/");
    ИначеЕсли Найти(Текст, "\") <> 0 Тогда
        Подстроки = РазложитьСтрокуВМассивПодстрок(Текст, "\");
    Иначе
        Подстроки = РазложитьСтрокуВМассивПодстрок(Текст, " ");
    КонецЕсли;
    Если Подстроки.Количество() = 1 Тогда
        // единственное слово - пытаемся получить месяц
        Если ТолькоЦифрыВСтроке(Текст) Тогда
            МесяцЧислом = Число(Текст);
            Если МесяцЧислом >= 1 и МесяцЧислом <=12 Тогда
                ДатаПоТексту = Дата(ТекущийГод, МесяцЧислом, 1);
                Если СтрДлина(Текст) = 1 Тогда
                    СписокВозврата.Добавить(Формат(ДатаПоТексту, "ДФ='М/гг'"));
                Иначе
                    СписокВозврата.Добавить(Формат(ДатаПоТексту, "ДФ='ММ/гг'"));
                КонецЕсли;
            Иначе
                Возврат СписокВозврата;
            КонецЕсли;                
        Иначе
            СписокМесяцев = СписокМесяцевПоСтроке(Текст);
            Для Каждого Месяц Из СписокМесяцев Цикл
                ДатаПоТексту = Дата(ТекущийГод, Месяц, 1);
                СписокВозврата.Добавить(Формат(ДатаПоТексту, "ДФ='ММММ гг'"));
            КонецЦикла;
        КонецЕсли;
    ИначеЕсли Подстроки.Количество() = 2 Тогда
        // два слова - первое считаем месяцем, второе - годом
        Если ТолькоЦифрыВСтроке(Подстроки[1]) Тогда
            Если ПустаяСтрока(Подстроки[1]) Тогда
                ГодЧислом = 0;
                Подстроки[1] = "0";
                ТекстВозврата = Текст + "0";
            Иначе
                ГодЧислом = Число(Подстроки[1]);
                ТекстВозврата = "";
            КонецЕсли;
            Если ГодЧислом > 3000 Тогда
                Возврат СписокВозврата;
            КонецЕсли;
            Если СтрДлина(Подстроки[1]) <= 1 Тогда
                ГодЧислом = Число(Лев(Формат(ТекущийГод, "ЧГ="), 3) + Подстроки[1]);
                СтрокаФорматированияГода = "г";
            ИначеЕсли СтрДлина(Подстроки[1]) = 2 Тогда
                ГодЧислом = Число(Лев(Формат(ТекущийГод, "ЧГ="), 2) + Подстроки[1]);
                СтрокаФорматированияГода = "гг";
            ИначеЕсли СтрДлина(Подстроки[1]) = 3 Тогда
                ГодЧислом = Число(Лев(Формат(ТекущийГод, "ЧГ="), 1) + Подстроки[1]);
                СтрокаФорматированияГода = "гггг";
            КонецЕсли;                    
        Иначе
            // второе слово может быть только годом
            Возврат СписокВозврата;
        КонецЕсли;                
        Если ТолькоЦифрыВСтроке(Подстроки[0]) Тогда
            МесяцЧислом = Число(Подстроки[0]);
            Если МесяцЧислом >= 1 и МесяцЧислом <= 12 Тогда
                // если "правильный" месяц и год
                ДатаПоТексту = Дата(ГодЧислом, МесяцЧислом, 1);
                СписокВозврата.Добавить(ТекстВозврата);
            Иначе
                Возврат СписокВозврата;
            КонецЕсли;                
        Иначе
            СписокМесяцев = СписокМесяцевПоСтроке(Подстроки[0]);
            Если СписокМесяцев.Количество() = 1 Тогда
                ДатаПоТексту = Дата(ГодЧислом, СписокМесяцев[0], 1);
                СписокВозврата.Добавить("");
            Иначе
                Для Каждого Месяц Из СписокМесяцев Цикл
                    ДатаПоТексту = Дата(ГодЧислом, Месяц, 1);
                    СписокВозврата.Добавить(Формат(Дата(ГодЧислом, Месяц, 1), "ДФ='ММММ гг'"));
                КонецЦикла;
            КонецЕсли;
        КонецЕсли;
    КонецЕсли;
    Возврат СписокВозврата;
КонецФункции

&НаКлиенте
Функция СписокМесяцевПоСтроке(Текст)
    СписокМесяцев = Новый СписокЗначений;
    Месяцы = Новый Соответствие;
    МесяцыВозврата = Новый Массив;
    Для Счетчик = 1 По 12 Цикл
        Представление = Формат(Дата(2000, Счетчик, 1), "ДФ='ММММ'");
        СписокМесяцев.Добавить(Счетчик, Представление);
        Представление = Формат(Дата(2000, Счетчик, 1), "ДФ='МММ'");
        СписокМесяцев.Добавить(Счетчик, Представление);
    КонецЦикла;
    Для Каждого ЭлементСписка Из СписокМесяцев Цикл
        Если ВРег(Текст) = ВРег(Лев(ЭлементСписка.Представление, СтрДлина(Текст))) Тогда
            Месяцы[ЭлементСписка.Значение] = 0;
        КонецЕсли;
    КонецЦикла;
    Для Каждого Элемент Из Месяцы Цикл
        МесяцыВозврата.Добавить(Элемент.Ключ);
    КонецЦикла;
    Возврат МесяцыВозврата;
КонецФункции

&НаКлиенте
Процедура МесяцСтрокаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Объект.ПериодПросмотра  = ДобавитьМесяц(Объект.ПериодПросмотра, Направление);
	МесяцСтрока = ДатаКакМесяцПредставление(Объект.ПериодПросмотра);
КонецПроцедуры

&НаКлиенте
Процедура ДатаКакМесяцАвтоПодборТекста(Текст, ТекстАвтоПодбора, СтандартнаяОбработка)
    Список = ДатаКакМесяцПодобратьДатуПоТексту(Текст);
    Если Список.Количество() = 1 Тогда
        ТекстАвтоПодбора = Список[0];
    КонецЕсли;
    СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	ДатаКакМесяцАвтоПодборТекста(Текст, МесяцСтрока, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",")
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Функция ТолькоЦифрыВСтроке(Знач СтрокаПроверки, УчитыватьЛидирующиеНули = Истина, УчитыватьПробелы = Истина)
	
	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаПроверки) Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Если НЕ УчитыватьПробелы Тогда
		СтрокаПроверки = СтрЗаменить(СтрокаПроверки, " ", "");
	КонецЕсли;
	
	Если НЕ УчитыватьЛидирующиеНули Тогда
		НомерПервойЦифры = 0;
		Для а = 1 По СтрДлина(СтрокаПроверки) Цикл
			НомерПервойЦифры = НомерПервойЦифры + 1;
			КодСимвола = КодСимвола(Сред(СтрокаПроверки, а, 1));
			Если КодСимвола <> 48 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		СтрокаПроверки = Сред(СтрокаПроверки, НомерПервойЦифры);
	КонецЕсли;
	
	Для а = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, а, 1));
		Если НЕ (КодСимвола >= 48 И КодСимвола <= 57) Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла; 

	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура МесяцСтрокаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	ДатаКакМесяцОкончаниеВводаТекста(Текст, МесяцСтрока, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДатаКакМесяцОкончаниеВводаТекста(Текст, Значение, СтандартнаяОбработка)
    Список = ДатаКакМесяцПодобратьДатуПоТексту(Текст);
    Если Список.Количество() = 1 Тогда
        Значение = Текст;
    Иначе
        Значение = Список;
    КонецЕсли;
    СтандартнаяОбработка = Ложь;
КонецПроцедуры

//=============================  СФОРМИРОВАТЬ ФАЙЛ ВЫГРУЗКИ XML =============================================//
// Функция записывает данные по лицевым счетам в XML-файл
// Возвращает имя файла
//
&НаСервере
Функция СформироватьфайлДляВыгрузки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетам.Услуга,
	               |	РасчетыПоЛицевымСчетам.МесяцНачисления,
	               |	РасчетыПоЛицевымСчетам.Сумма,
	               |	РасчетыПоЛицевымСчетам.Тариф,
	               |	РасчетыПоЛицевымСчетам.ДнейНачислено,
	               |	РасчетыПоЛицевымСчетам.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	РасчетыПоЛицевымСчетам.ВидНачисления,
	               |	РасчетыПоЛицевымСчетам.Количество,
	               |	РасчетыПоЛицевымСчетам.Организация,
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец,
	               |	ЛицевыеСчета.КоличествоПрописанных,
	               |	ЛицевыеСчета.КоличествоПроживающих
	               |ПОМЕСТИТЬ РасчетыПоЛицСчетам
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчета КАК ЛицевыеСчета
	               |		ПО РасчетыПоЛицевымСчетам.ЛицевойСчет = ЛицевыеСчета.ЛицевойСчет
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет В(&ЛицевойСчет)
	               |	И РасчетыПоЛицевымСчетам.ДатаНачалаПериода > ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), СЕКУНДА, -1)
	               |	И РасчетыПоЛицевымСчетам.ДатаНачалаПериода < ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), СЕКУНДА, 1)
	               |	И РасчетыПоЛицевымСчетам.Сумма <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицСчетам.ЛицевойСчет КАК ЛицевойСчет,
	               |	РасчетыПоЛицСчетам.Услуга КАК Услуга,
	               |	РасчетыПоЛицСчетам.МесяцНачисления,
	               |	РасчетыПоЛицСчетам.Сумма КАК Сумма,
	               |	РасчетыПоЛицСчетам.Тариф,
	               |	РасчетыПоЛицСчетам.ДнейНачислено,
	               |	РасчетыПоЛицСчетам.ЕдиницаИзмерения,
	               |	РасчетыПоЛицСчетам.ВидНачисления КАК ВидНачисления,
	               |	РасчетыПоЛицСчетам.Количество,
	               |	ТарифыСрезПоследних.НормаПотребления,
	               |	ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.ПриборУчета, 0) КАК ПриборУчета,
	               |	ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Действует, ЛОЖЬ) КАК Действует,
	               |	ЕСТЬNULL(Аванс.АвансИлиДолг, 0) КАК Аванс,
	               |	Аванс.Начислено КАК Начислено,
	               |	ЕСТЬNULL(Аванс.Оплачено, 0) КАК Оплачено,
	               |	Аванс.КВыплате КАК КВыплате,
	               |	РасчетыПоЛицСчетам.КоличествоПрописанных КАК КоличествоПрописанных,
	               |	РасчетыПоЛицСчетам.КоличествоПроживающих КАК КоличествоПроживающих,
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаНачальныйОстаток КАК ОстатокНаначалоПериодаПоУслуге,
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход КАК НачисленоПоУслуге,
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход КАК ОплаченоПоУслуге,
	               |	РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток КАК ОстатокНаКонецПериодаПоУслуге,
	               |	ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец, """") КАК ОтветственныйВладелец,
	               |	ПоказанияПриборовУчета.Тек КАК ТекущиеПоказания,
	               |	ПоказанияПриборовУчета.Пред КАК ПредыдущиеПоказания
	               |ИЗ
	               |	РасчетыПоЛицСчетам КАК РасчетыПоЛицСчетам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Тарифы.СрезПоследних(&Дата, ) КАК ТарифыСрезПоследних
	               |		ПО РасчетыПоЛицСчетам.Услуга = ТарифыСрезПоследних.Услуга
	               |			И РасчетыПоЛицСчетам.Организация = ТарифыСрезПоследних.Организация
	               |			И РасчетыПоЛицСчетам.ЛицевойСчетВладелец = ТарифыСрезПоследних.Здание
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета.СрезПоследних КАК УстановленныеПриборыУчетаСрезПоследних
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				Текущие.ПриборУчета КАК ПриборУчета,
	               |				ЕСТЬNULL(Текущие.Значение, 0) КАК Тек,
	               |				ЕСТЬNULL(Прошлые.Значение, 0) КАК Пред
	               |			ИЗ
	               |				РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ) КАК Текущие
	               |					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), МЕСЯЦ, -1), ) КАК Прошлые
	               |					ПО Текущие.ПриборУчета = Прошлые.ПриборУчета
	               |						И Текущие.ВидТарифа = Прошлые.ВидТарифа) КАК ПоказанияПриборовУчета
	               |			ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчета.ПриборУчета
	               |		ПО РасчетыПоЛицСчетам.ЛицевойСчет = УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки
	               |			И РасчетыПоЛицСчетам.Услуга = УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаНачальныйОстаток КАК АвансИлиДолг,
	               |			РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход КАК Начислено,
	               |			РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход КАК Оплачено,
	               |			РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток КАК КВыплате,
	               |			НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) КАК НачалоПериода,
	               |			КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ) КАК КонецПериода,
	               |			РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет
	               |		ИЗ
	               |			РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), Месяц, , ЛицевойСчет В (&ЛицевойСчет)) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты) КАК Аванс
	               |		ПО РасчетыПоЛицСчетам.ЛицевойСчет = Аванс.ЛицевойСчет
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
	               |		ПО РасчетыПоЛицСчетам.Услуга = РасчетыПоЛицевымСчетамОстаткиИОбороты.Услуга
	               |			И РасчетыПоЛицСчетам.ЛицевойСчет = РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет
	               |			И РасчетыПоЛицСчетам.Организация = РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Дата, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	               |		ПО РасчетыПоЛицСчетам.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
	               |ИТОГИ
	               |	СУММА(Сумма),
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВидНачисления),
	               |	МАКСИМУМ(Действует),
	               |	МАКСИМУМ(Аванс),
	               |	МАКСИМУМ(Начислено),
	               |	МАКСИМУМ(Оплачено),
	               |	МАКСИМУМ(КВыплате),
	               |	МАКСИМУМ(КоличествоПрописанных),
	               |	МАКСИМУМ(КоличествоПроживающих),
	               |	МАКСИМУМ(ОстатокНаначалоПериодаПоУслуге),
	               |	МАКСИМУМ(НачисленоПоУслуге),
	               |	МАКСИМУМ(ОплаченоПоУслуге),
	               |	МАКСИМУМ(ОстатокНаКонецПериодаПоУслуге),
	               |	МАКСИМУМ(ОтветственныйВладелец)
	               |ПО
	               |	ЛицевойСчет,
	               |	Услуга";
	//Передаем параметры в Запрос ("Дата" и Список "ЛицевойСчет")
	Запрос.УстановитьПараметр("Дата", Объект.ПериодПросмотра);
	
	СписокЛицевыхСчетов = Новый СписокЗначений;
	Для каждого Строка Из Объект.ЛицевыеСчета Цикл
		СписокЛицевыхСчетов.Добавить(Строка.ЛицевойСчет);
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("ЛицевойСчет", СписокЛицевыхСчетов);
	
	Выгрузка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивЛС = Новый Структура;
	НомерЛС = 0;
	
	Пока Выгрузка.Следующий() Цикл
			СтруктураЛС = Новый Структура;
			
			Адрес = Выгрузка.ЛицевойСчет.Владелец.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗданияИСооружения,"Вид").ЗначенияПолей;
			
			ОтборПлощади = Новый Структура("Помещение", Выгрузка.ЛицевойСчет.ОбъектЛицевогоСчета);    
			ВыборкаПлощади = РегистрыСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(ТекущаяДата(),ОтборПлощади);
			
			Для Каждого Строка Из ВыборкаПлощади Цикл
				Если Строка.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
					ПлощадьОтоп = Строка.Площадь;
				ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
					ПлощадьВся = Строка.Площадь;
				ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ЖилаяПолощадь Тогда
					ЖилаяПлощадь = Строка.Площадь;
				КонецЕсли;
			КонецЦикла;
			
			СтруктураЛС.Вставить("ID", XMLСтрока(Выгрузка.ЛицевойСчет));
			СтруктураЛС.Вставить("AddressCity", НайтиЗначениеАдреса(Адрес, "Город="));
			СтруктураЛС.Вставить("AddressDistrict",НайтиЗначениеАдреса(Адрес, "Район="));
			СтруктураЛС.Вставить("AddressFlat",Выгрузка.ЛицевойСчет.ОбъектЛицевогоСчета.Наименование);
			СтруктураЛС.Вставить("AddressHouse",НайтиЗначениеАдреса(Адрес, "Дом="));
			СтруктураЛС.Вставить("AddressRegion",НайтиЗначениеАдреса(Адрес, "Регион="));
			СтруктураЛС.Вставить("AddressSettlement",НайтиЗначениеАдреса(Адрес, "Город="));
			СтруктураЛС.Вставить("AddressStreet",НайтиЗначениеАдреса(Адрес, "Улица="));
			
				//Опредиляем Штрихкод и параметры печати
				ШтрихкодНовый = Строка(Формат(НачалоМесяца(Объект.ПериодПросмотра),"ДФ=ddMMyyyy"))+"-"+Выгрузка.ЛицевойСчет.Наименование+"-"+((Выгрузка.КВыплате)*100);
				
				Штрихкод = СтрЗаменить(ШтрихкодНовый,"/","");
				
				ПараметрыПечати = Новый Структура();
				ПараметрыПечати.Вставить("ЛицевойСчет",Выгрузка.ЛицевойСчет);
				ПараметрыПечати.Вставить("ПериодПечати",Объект.ПериодПросмотра);
				
				//Добавляем в структуру ЛС параметры печати по которым будем выводит ПДФ файлы
				СтруктураЛС.Вставить("ПараметрыПечати", ПараметрыПечати);
			
			СтруктураЛС.Вставить("Barcode",Штрихкод);
			СтруктураЛС.Вставить("commonarea",XMLСтрока(ПлощадьВся));
			СтруктураЛС.Вставить("debtbeg",XMLСтрока(Выгрузка.Аванс));
			СтруктураЛС.Вставить("debtup",XMLСтрока(Выгрузка.Начислено));
			СтруктураЛС.Вставить("debtdown",XMLСтрока(Выгрузка.Оплачено));
			СтруктураЛС.Вставить("debtend",XMLСтрока(Выгрузка.КВыплате));
			
			ВладелецЛицевогоСчета = ?(Выгрузка.ОтветственныйВладелец.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо, Выгрузка.ОтветственныйВладелец.ФизЛицо, Выгрузка.ОтветственныйВладелец.ЮрЛицо);
			ИнфоЭлектронныйАдрес = ВладелецЛицевогоСчета.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,"Тип");
			
			СтруктураЛС.Вставить("email",?(ИнфоЭлектронныйАдрес = Неопределено, "null@mail.com", ИнфоЭлектронныйАдрес.АдресЭП));
			СтруктураЛС.Вставить("habarea",XMLСтрока(ЖилаяПлощадь));
			СтруктураЛС.Вставить("kod_ls",Выгрузка.ЛицевойСчет.Наименование);
			СтруктураЛС.Вставить("name",Выгрузка.ОтветственныйВладелец.Наименование);
			СтруктураЛС.Вставить("name_ls",Выгрузка.ЛицевойСчет.Наименование);
			СтруктураЛС.Вставить("password","");
			СтруктураЛС.Вставить("people_Living",XMLСтрока(Выгрузка.КоличествоПроживающих));
			СтруктураЛС.Вставить("people_Prescription",XMLСтрока(Выгрузка.КоличествоПрописанных));
			
			ВыгрузкаПоказания = Выгрузка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			МассивУслуг = Новый Структура;
            УслугаЛС = 0;
			Пока ВыгрузкаПоказания.Следующий() Цикл
				
				СтруктураАктивныхУслугЛС = Новый Структура;
				
				ВыгрузкаУслуга = ВыгрузкаПоказания.Выбрать();
				
				Пока ВыгрузкаУслуга.Следующий() Цикл
					Количество 			= XMLСтрока(ВыгрузкаУслуга.Количество);
					ЕдИз 				= ВыгрузкаУслуга.ЕдиницаИзмерения.Наименование;
					Код 				= XMLСтрока(ВыгрузкаУслуга.Услуга.Ссылка);
					Наименование 		= ВыгрузкаУслуга.Услуга.Наименование;
					Норма 				= XMLСтрока(ВыгрузкаУслуга.НормаПотребления);
					СуммаОплачено 		= XMLСтрока(ВыгрузкаУслуга.ОплаченоПоУслуге);
					Тариф 				= XMLСтрока(ВыгрузкаУслуга.Тариф);
					НазначениеПлатежа	= ВыгрузкаУслуга.Услуга.НазначениеПлатежа;
				КонецЦикла; 
								
				СтруктураАктивныхУслугЛС.Вставить("ammount",Количество);
				СтруктураАктивныхУслугЛС.Вставить("edizm",ЕдИз);
				СтруктураАктивныхУслугЛС.Вставить("ID",Код);
				СтруктураАктивныхУслугЛС.Вставить("name",Наименование);
				СтруктураАктивныхУслугЛС.Вставить("DetailsOf_Payment",НазначениеПлатежа);
				СтруктураАктивныхУслугЛС.Вставить("norm",Норма);
				СтруктураАктивныхУслугЛС.Вставить("sum",XMLСтрока(ВыгрузкаПоказания.Сумма));
				СтруктураАктивныхУслугЛС.Вставить("sumpayed",СуммаОплачено);
				СтруктураАктивныхУслугЛС.Вставить("tarif",Тариф);
				СтруктураАктивныхУслугЛС.Вставить("ЭтоСчетчик", Ложь);
				
				Если ВыгрузкаПоказания.Действует Тогда
					СтруктураПоказанияСчетчика = Новый Структура;
					
					ВыгрузкаСчетчик = ВыгрузкаПоказания.Выбрать();
					Пока ВыгрузкаСчетчик.Следующий() Цикл
						Код 				= XMLСтрока(ВыгрузкаСчетчик.Услуга.Ссылка);
						Наименование 		= ВыгрузкаСчетчик.Услуга.Наименование;
						НомерСчетчика		= ВыгрузкаСчетчик.ПриборУчета.ЗаводскойНомер;
						ТекущиеПоказания = XMLСтрока(ВыгрузкаСчетчик.ТекущиеПоказания);
						ПредыдущиееПоказания = XMLСтрока(ВыгрузкаСчетчик.ПредыдущиеПоказания);
					КонецЦикла; 
					
					СтруктураПоказанияСчетчика.Вставить("value_count","1");
					СтруктураПоказанияСчетчика.Вставить("indicbef1",ПредыдущиееПоказания);
					СтруктураПоказанияСчетчика.Вставить("indiccur1",ТекущиеПоказания);
					СтруктураПоказанияСчетчика.Вставить("ID",Код);
					СтруктураПоказанияСчетчика.Вставить("name",НомерСчетчика);
					СтруктураПоказанияСчетчика.Вставить("service",Наименование);
					
					//Записываем структуру показания счетчика
					СтруктураАктивныхУслугЛС.Вставить("ЭтоСчетчик", Истина);
					СтруктураАктивныхУслугЛС.Вставить("ПоказанияСчетчика", СтруктураПоказанияСчетчика);
				КонецЕсли;
				УслугаЛС = УслугаЛС + 1;
				МассивУслуг.Вставить("Услуга"+УслугаЛС,СтруктураАктивныхУслугЛС);
			КонецЦикла;
			СтруктураЛС.Вставить("АктивныеУслуги", МассивУслуг);
			НомерЛС = НомерЛС +1;
			МассивЛС.Вставить("ЛС"+НомерЛС,СтруктураЛС);
		КонецЦикла;
			
	Возврат МассивЛС;
	
КонецФункции

&НаСервере
Функция  ПечатьПДФКвитанции(ПараметрыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = Обработки.ВыгрузкаДанныхЛицевыхСчетовДляСайтаЖКХ.ПолучитьМакет("МакетКвитанцииНаОплату");
			
	//ШАПКА
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Месяц = Формат(ПараметрыПечати.ПериодПечати,"Л=uk_UA; ДФ=MMMM");
	ОбластьШапка.Параметры.год = Формат(ПараметрыПечати.ПериодПечати,"ДФ=yyyy");
	ОбластьШапка.Параметры.Получатель = Объект.Организация.НаименованиеПолное;
	ОбластьШапка.Параметры.ЄДРПОУ = Объект.Организация.КодПоЕДРПОУ;
	ТабличныйДокумент.Вывести(ОбластьШапка);

	//БанковскийСчет
	ОбластьБанковскийСчет = Макет.ПолучитьОбласть("БанковскийСчет");
	ОбластьБанковскийСчет.Параметры.Рр = ПараметрыПечати.ЛицевойСчет.Владелец.Организация.БанковскийСчетПоУмолчанию.НомерСчета;
	ОбластьБанковскийСчет.Параметры.Банк = ПараметрыПечати.ЛицевойСчет.Владелец.Организация.БанковскийСчетПоУмолчанию.Банк.Наименование;
	ОбластьБанковскийСчет.Параметры.МФО = ПараметрыПечати.ЛицевойСчет.Владелец.Организация.БанковскийСчетПоУмолчанию.Банк.Код;
	ТабличныйДокумент.Вывести(ОбластьБанковскийСчет);
	 

	//ШапкаОсновнойЧасти 
	ОтборПлощади = Новый Структура("Помещение",ПараметрыПечати.ЛицевойСчет.ОбъектЛицевогоСчета);    
	ВыборкаПлощади = РегистрыСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(ТекущаяДата(),ОтборПлощади);

	ОбластьШапкаОсновнойЧасти = Макет.ПолучитьОбласть("ШапкаОсновнойЧасти");
	Для Каждого Строка Из ВыборкаПлощади Цикл
		Если Строка.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
			ОбластьШапкаОсновнойЧасти.Параметры.ПлощадьОтоп = Строка.Площадь;
		ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
			ОбластьШапкаОсновнойЧасти.Параметры.ПлощадьВся = Строка.Площадь;
		КонецЕсли;
	КонецЦикла;

	ОтборКолПроживающих = Новый Структура("ЛицевойСчет",ПараметрыПечати.ЛицевойСчет);
	ВыборкаКолПроживающих = РегистрыСведений.ЛицевыеСчета.СрезПоследних(ТекущаяДата(),ОтборКолПроживающих);
	Попытка
		ОбластьШапкаОсновнойЧасти.Параметры.Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ПараметрыПечати.ЛицевойСчет))[0].ОтветственныйВладелец.Наименование;
	Исключение
	КонецПопытки;

	Для Каждого Строка Из ВыборкаКолПроживающих Цикл
		ОбластьШапкаОсновнойЧасти.Параметры.КолЧеловек = Строка.КоличествоПроживающих;
	КонецЦикла;
	ОбластьШапкаОсновнойЧасти.Параметры.КоличествоМестПаркинг = "";
	ОбластьШапкаОсновнойЧасти.Параметры.ЛицевойСчет = ПараметрыПечати.ЛицевойСчет;
	ОбластьШапкаОсновнойЧасти.Параметры.Адрес = ПараметрыПечати.ЛицевойСчет.Владелец.Наименование+" "+ПараметрыПечати.ЛицевойСчет.ОбъектЛицевогоСчета.Наименование;
	ТабличныйДокумент.Вывести(ОбластьШапкаОсновнойЧасти);

	//ШапкаТаблицыУслуг
	ОбластьШапкаТаблицыУслуг = Макет.ПолучитьОбласть("ШапкаТаблицыУслуг");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыУслуг);

	//СтрокаУслуг
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет,
	               |	РасчетыПоЛицевымСчетам.Услуга,
	               |	РасчетыПоЛицевымСчетам.МесяцНачисления,
	               |	РасчетыПоЛицевымСчетам.Сумма,
	               |	РасчетыПоЛицевымСчетам.Тариф,
	               |	РасчетыПоЛицевымСчетам.ДнейНачислено,
	               |	РасчетыПоЛицевымСчетам.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	РасчетыПоЛицевымСчетам.ВидНачисления,
	               |	РасчетыПоЛицевымСчетам.Количество,
	               |	РасчетыПоЛицевымСчетам.Организация,
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец
	               |ПОМЕСТИТЬ РасчетыПоЛицСчетам
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетам.ЛицевойСчет В(&ЛицевойСчет)
	               |	И РасчетыПоЛицевымСчетам.ДатаНачалаПериода > ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), СЕКУНДА, -1)
	               |	И РасчетыПоЛицевымСчетам.ДатаНачалаПериода < ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), СЕКУНДА, 1)
	               |	И РасчетыПоЛицевымСчетам.Сумма <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыПоЛицСчетам.ЛицевойСчет КАК ЛицевойСчет,
	               |	РасчетыПоЛицСчетам.Услуга КАК Услуга,
	               |	РасчетыПоЛицСчетам.МесяцНачисления,
	               |	РасчетыПоЛицСчетам.Сумма КАК Сумма,
	               |	РасчетыПоЛицСчетам.Тариф,
	               |	РасчетыПоЛицСчетам.ДнейНачислено,
	               |	ВЫБОР
	               |		КОГДА РасчетыПоЛицСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	               |			ТОГДА ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Долг,
	               |	РасчетыПоЛицСчетам.ЕдиницаИзмерения,
	               |	РасчетыПоЛицСчетам.ВидНачисления КАК ВидНачисления,
	               |	РасчетыПоЛицСчетам.Количество,
	               |	ТарифыСрезПоследних.НормаПотребления,
	               |	ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.ПриборУчета, 0) КАК ПриборУчета,
	               |	ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Действует, ЛОЖЬ) КАК Действует,
	               |	ЕСТЬNULL(Аванс.АвансИлиДолг, 0) КАК Аванс,
	               |	Аванс.Начислено КАК Начислено,
	               |	Аванс.КВыплате КАК КВыплате,
	               |	ПоказанияПриборовУчета.Тек КАК ТекущиеПоказания,
	               |	ПоказанияПриборовУчета.Пред КАК ПредыдущиеПоказания
	               |ИЗ
	               |	РасчетыПоЛицСчетам КАК РасчетыПоЛицСчетам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Тарифы.СрезПоследних(&Дата, ) КАК ТарифыСрезПоследних
	               |		ПО РасчетыПоЛицСчетам.Услуга = ТарифыСрезПоследних.Услуга
	               |			И РасчетыПоЛицСчетам.Организация = ТарифыСрезПоследних.Организация
	               |			И РасчетыПоЛицСчетам.ЛицевойСчетВладелец = ТарифыСрезПоследних.Здание
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета.СрезПоследних КАК УстановленныеПриборыУчетаСрезПоследних
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				Текущие.ПриборУчета КАК ПриборУчета,
	               |				ЕСТЬNULL(Текущие.Значение, 0) КАК Тек,
	               |				ЕСТЬNULL(Прошлые.Значение, 0) КАК Пред
	               |			ИЗ
	               |				РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ) КАК Текущие
	               |					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), МЕСЯЦ, -1), ) КАК Прошлые
	               |					ПО Текущие.ПриборУчета = Прошлые.ПриборУчета
	               |						И Текущие.ВидТарифа = Прошлые.ВидТарифа) КАК ПоказанияПриборовУчета
	               |			ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчета.ПриборУчета
	               |		ПО РасчетыПоЛицСчетам.ЛицевойСчет = УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки
	               |			И РасчетыПоЛицСчетам.Услуга = УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ЛицевойСчет В (&ЛицевойСчет)) КАК РасчетыПоЛицевымСчетамОстатки
	               |		ПО РасчетыПоЛицСчетам.Услуга = РасчетыПоЛицевымСчетамОстатки.Услуга
	               |			И РасчетыПоЛицСчетам.ЛицевойСчет = РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет
	               |			И РасчетыПоЛицСчетам.Организация = РасчетыПоЛицевымСчетамОстатки.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаНачальныйОстаток КАК АвансИлиДолг,
	               |			РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаПриход КАК Начислено,
	               |			РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаРасход КАК Оплачено,
	               |			РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток КАК КВыплате,
	               |			НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) КАК НачалоПериода,
	               |			КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ) КАК КонецПериода,
	               |			РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет
	               |		ИЗ
	               |			РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), , , ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты) КАК Аванс
	               |		ПО РасчетыПоЛицСчетам.ЛицевойСчет = Аванс.ЛицевойСчет
	               |ИТОГИ
	               |	СУММА(Сумма),
	               |	СУММА(Долг),
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВидНачисления),
	               |	МАКСИМУМ(Действует),
	               |	МАКСИМУМ(Аванс),
	               |	МАКСИМУМ(Начислено),
	               |	МАКСИМУМ(КВыплате)
	               |ПО
	               |	ЛицевойСчет,
	               |	Услуга";
	Запрос.УстановитьПараметр("ЛицевойСчет",ПараметрыПечати.ЛицевойСчет);
	Запрос.УстановитьПараметр("Дата",ПараметрыПечати.ПериодПечати);
	ВыборкаЛицевойСчет = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Аванс = 0;
	Долг = 0;
	ДолгВсего = 0;
	НачисленоВсего = 0;
	Пока ВыборкаЛицевойСчет.Следующий() Цикл
		ВыборкаУслуга = ВыборкаЛицевойСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаУслуга.Следующий() Цикл
			Если ВыборкаУслуга.Аванс < 0 Тогда
				Аванс = ВыборкаУслуга.Аванс;
				Долг = 0;
			Иначе
				Долг = ВыборкаУслуга.Аванс;
				Аванс = 0;
			КонецЕсли;
			
			НачисленоВсего = ВыборкаУслуга.Начислено;
			КВыплатеВсего = ВыборкаУслуга.КВыплате;
			
			Если ВыборкаУслуга.Действует Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьСтрокаУслуг = Макет.ПолучитьОбласть("СтрокаУслуг");
			Начисленно = 0;
			ВыборкаДетальныеЗаписи = ВыборкаУслуга.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ОбластьСтрокаУслуг.Параметры.НаименованиеУслуг = ВыборкаДетальныеЗаписи.Услуга;
				ОбластьСтрокаУслуг.Параметры.Тариф = ВыборкаДетальныеЗаписи.Тариф;
				ОбластьСтрокаУслуг.Параметры.ЕдИзмер = ВыборкаДетальныеЗаписи.ЕдиницаИзмерения;
				ОбластьСтрокаУслуг.Параметры.КолДней = ВыборкаДетальныеЗаписи.ДнейНачислено;
				
				Если ВыборкаДетальныеЗаписи.ВидНачисления = Перечисления.ВидыНачислений.Льгота Тогда
					ОбластьСтрокаУслуг.Параметры.Льготы = ВыборкаДетальныеЗаписи.Сумма;
				ИначеЕсли ВыборкаДетальныеЗаписи.ВидНачисления = Перечисления.ВидыНачислений.Субсидия Тогда
					ОбластьСтрокаУслуг.Параметры.Субсидия = ВыборкаДетальныеЗаписи.Сумма;
				ИначеЕсли ВыборкаДетальныеЗаписи.ВидНачисления = Перечисления.ВидыНачислений.Перерасчет Тогда
					ОбластьСтрокаУслуг.Параметры.Пересчет = ВыборкаДетальныеЗаписи.Сумма;
				ИначеЕсли ВыборкаДетальныеЗаписи.ВидНачисления = Перечисления.ВидыНачислений.Начисление Тогда
					ОбластьСтрокаУслуг.Параметры.НачисленоГрн = ВыборкаДетальныеЗаписи.Сумма;
				КонецЕсли;
				
				Начисленно = Начисленно + ВыборкаДетальныеЗаписи.Сумма;
				ОбластьСтрокаУслуг.Параметры.Начислено = Начисленно;
				ОбластьСтрокаУслуг.Параметры.Долг = ВыборкаДетальныеЗаписи.Долг;
				ОбластьСтрокаУслуг.Параметры.НачисленоКОплате =  Начисленно + ВыборкаДетальныеЗаписи.Долг;
				
			КонецЦикла; 
			ТабличныйДокумент.Вывести(ОбластьСтрокаУслуг);
		КонецЦикла;
		
		//ШапкаОбщиеПоказателиСчетчика
		ОбластьШапкаОбщиеПоказателиСчетчика = Макет.ПолучитьОбласть("ШапкаОбщиеПоказателиСчетчика");
		ТабличныйДокумент.Вывести(ОбластьШапкаОбщиеПоказателиСчетчика);
		
		ВыборкаУслуга = ВыборкаЛицевойСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаУслуга.Следующий() Цикл
			
			Если НЕ ВыборкаУслуга.Действует Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьСтрокаСчетчик = Макет.ПолучитьОбласть("СтрокаСчетчиков");
			Счет = 0;
			ВыборкаДетальныеЗаписи = ВыборкаУслуга.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Количество() > 1 И НЕ ВыборкаУслуга.ВидНачисления > 1 Тогда
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если НЕ Счет > 0 Тогда
						ТабличныйДокумент.Вывести(ВыводСтрокиУслуги (ОбластьСтрокаСчетчик, ВыборкаДетальныеЗаписи, Ложь));
						
						Счет = Счет + 1;
						
						НачисленоВсего = НачисленоВсего + ВыборкаДетальныеЗаписи.Сумма;
						ДолгВсего = ДолгВсего + ВыборкаДетальныеЗаписи.Долг;
					КонецЕсли;
					
					ОбластьДетальныеЗаписи = Макет.ПолучитьОбласть("СтрокаСчетчиковДетальныеЗаписи");
					
					ТабличныйДокумент.Вывести(ВыводСтрокиРасшифровки(ОбластьДетальныеЗаписи, ВыборкаДетальныеЗаписи));
				КонецЦикла; 
			Иначе
				Льгота = 0;
				Начисление = 0;
				Субсидия = 0;
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					//Получаем показания счетчика
					ТекущиеПоказания = ВыборкаДетальныеЗаписи.ТекущиеПоказания;
					ПредыдущиееПоказания = ВыборкаДетальныеЗаписи.ПредыдущиеПоказания;
										
					ОбластьСтрокаСчетчик.Параметры.Услуга = ВыборкаДетальныеЗаписи.Услуга.Наименование;
					ОбластьСтрокаСчетчик.Параметры.Коэффициент = ВыборкаДетальныеЗаписи.ПриборУчета.Коэффициент;
					ОбластьСтрокаСчетчик.Параметры.ЕдИзмерения = ВыборкаДетальныеЗаписи.ЕдиницаИзмерения.Наименование;
					ОбластьСтрокаСчетчик.Параметры.Тариф = ВыборкаДетальныеЗаписи.Тариф;
					ОбластьСтрокаСчетчик.Параметры.НормаПотребления = ВыборкаДетальныеЗаписи.НормаПотребления;
					ОбластьСтрокаСчетчик.Параметры.Долг = ВыборкаДетальныеЗаписи.Долг;
					ОбластьСтрокаСчетчик.Параметры.Поточные = ТекущиеПоказания;
					ОбластьСтрокаСчетчик.Параметры.Предыдущие = ПредыдущиееПоказания;
					ОбластьСтрокаСчетчик.Параметры.Разница = ВыборкаДетальныеЗаписи.Количество;
					ОбластьСтрокаСчетчик.Параметры.Счетчик = ВыборкаДетальныеЗаписи.ПриборУчета.ЗаводскойНомер;
					Если ВыборкаДетальныеЗаписи.ВидНачисления = Перечисления.ВидыНачислений.Начисление Тогда
						Начисление = Начисление + ВыборкаДетальныеЗаписи.Сумма;
						ОбластьСтрокаСчетчик.Параметры.Насчитано = Начисление;
					ИначеЕсли ВыборкаДетальныеЗаписи.ВидНачисления = Перечисления.ВидыНачислений.Льгота Тогда
						Льгота = Льгота + ВыборкаДетальныеЗаписи.Сумма;
						ОбластьСтрокаСчетчик.Параметры.Льготы = Льгота;
					ИначеЕсли ВыборкаДетальныеЗаписи.ВидНачисления = Перечисления.ВидыНачислений.Субсидия Тогда
						Субсидия = Субсидия + ВыборкаДетальныеЗаписи.Сумма;
						ОбластьСтрокаСчетчик.Параметры.Субсидии = Субсидия;
					КонецЕсли;
					
					ОбластьСтрокаСчетчик.Параметры.КОплате = ?(Начисление=Неопределено,0,Начисление)+ВыборкаДетальныеЗаписи.Долг + ?(Субсидия=Неопределено,0,Субсидия)+?(Льгота=Неопределено,0,Льгота);
					
				КонецЦикла; 
				ТабличныйДокумент.Вывести(ОбластьСтрокаСчетчик);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	//ПодвалОсновнойЧасти
	ОбластьПодвалОсновнойЧасти = Макет.ПолучитьОбласть("ПодвалОсновнойЧасти");
	ДолгВсего = ДолгВсего;
	НасчитаноЗаУслуги = НачисленоВсего;
	ОбластьПодвалОсновнойЧасти.Параметры.Нараховано = НачисленоВсего;
	ОбластьПодвалОсновнойЧасти.Параметры.Борг = Долг;
	ОбластьПодвалОсновнойЧасти.Параметры.Аванс = Аванс-(Аванс+Аванс);
	ОбластьПодвалОсновнойЧасти.Параметры.Всего = КВыплатеВсего;
	ТабличныйДокумент.Вывести(ОбластьПодвалОсновнойЧасти);

	//Подвал1
	ОбластьПодвал1 = Макет.ПолучитьОбласть("Подвал1");
	ОбластьПодвал1.Параметры.ЄДРПОУ = ПараметрыПечати.ЛицевойСчет.Владелец.Организация.КодПоЕДРПОУ;
	ОбластьПодвал1.Параметры.Получатель = ПараметрыПечати.ЛицевойСчет.Владелец.Организация.НаименованиеПолное;
	ОбластьПодвал1.Параметры.месяц = Формат(ПараметрыПечати.ПериодПечати,"Л=uk_UA; ДФ=MMMM");
	ОбластьПодвал1.Параметры.год = Формат(ПараметрыПечати.ПериодПечати,"ДФ=yyyy");
	ТабличныйДокумент.Вывести(ОбластьПодвал1);

	//Банковский Счет Подвал
		ОбластьБанковскийСчет = Макет.ПолучитьОбласть("БанковскийСчетПодвал");
		ОбластьБанковскийСчет.Параметры.Рр = ПараметрыПечати.ЛицевойСчет.Владелец.Организация.БанковскийСчетПоУмолчанию.НомерСчета;
		ОбластьБанковскийСчет.Параметры.Банк = ПараметрыПечати.ЛицевойСчет.Владелец.Организация.БанковскийСчетПоУмолчанию.Банк.Наименование;
		ОбластьБанковскийСчет.Параметры.МФО = ПараметрыПечати.ЛицевойСчет.Владелец.Организация.БанковскийСчетПоУмолчанию.Банк.Код;
		ТабличныйДокумент.Вывести(ОбластьБанковскийСчет);

	//ПОДВАЛ
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.месяц = Формат(ПараметрыПечати.ПериодПечати,"Л=uk_UA; ДФ=MMMM");
	ОбластьПодвал.Параметры.год = Формат(ПараметрыПечати.ПериодПечати,"ДФ=yyyy");
	ОбластьПодвал.Параметры.Нараховано = НачисленоВсего;
	ОбластьПодвал.Параметры.Борг = Долг;
	ОбластьПодвал.Параметры.Аванс = Аванс-(Аванс+Аванс);
	ОбластьПодвал.Параметры.Итого = КВыплатеВсего;
	ОбластьПодвал.Параметры.ЛицевойСчет = ПараметрыПечати.ЛицевойСчет;
	ОбластьПодвал.Параметры.Адрес = ПараметрыПечати.ЛицевойСчет.Владелец.Наименование+" "+ПараметрыПечати.ЛицевойСчет.ОбъектЛицевогоСчета.Наименование;
	Попытка
		ОбластьПодвал.Параметры.Плательщик = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ПараметрыПечати.ЛицевойСчет))[0].ОтветственныйВладелец.Наименование;
	Исключение
	КонецПопытки;

	Для Каждого Строка Из ВыборкаПлощади Цикл
		Если Строка.ВидПлощади = Справочники.ВидыПлощадей.ОтапливаемаяПлощадь Тогда
			ОбластьПодвал.Параметры.ПлощадьОтоп = Строка.Площадь;
		ИначеЕсли Строка.ВидПлощади = Справочники.ВидыПлощадей.ОбщаяПлощадь Тогда
			ОбластьПодвал.Параметры.ПлощадьВся = Строка.Площадь;
		КонецЕсли;
	КонецЦикла;

	Для Каждого Строка Из ВыборкаКолПроживающих Цикл
		ОбластьПодвал.Параметры.КолЧеловек = Строка.КоличествоПроживающих;
	КонецЦикла;
	ОбластьПодвал.Параметры.КоличествоМестПаркинг = "";

	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаКлиенте
Функция ПолучитьПутьКаталога(ПутьКФайлуВыгрузки)
	Путь = ПутьКФайлуВыгрузки;
	Каталог = "";
	Для Счет=1 По СтрЧислоВхождений(Путь,"\")Цикл
		Число = Найти(Путь,"\");
		Каталог = Каталог + Лев(Путь,СтрДлина(Путь)-(СтрДлина(Путь)-Число));
		Путь =  Прав(Путь,(СтрДлина(Путь)-Число));
	КонецЦикла;
	Возврат Каталог + "PDF\";
КонецФункции
 
Функция ВыводСтрокиУслуги (Макет, Услуга, ПоказанияСчет)
	Область = Макет;
	
	Льгота = 0;
	Начисление = 0;
	Субсидия = 0;
	
	//Получаем показания счетчика
	ТекущиеПоказания = Услуга.ТекущиеПоказания;
	ПредыдущиееПоказания = Услуга.ПредыдущиеПоказания;
	
	Область.Параметры.Услуга = Услуга.Услуга.Наименование;
	Область.Параметры.Коэффициент = Услуга.ПриборУчета.Коэффициент;
	Область.Параметры.ЕдИзмерения = Услуга.ЕдиницаИзмерения.Наименование;
	Область.Параметры.Тариф = Услуга.Тариф;
	Область.Параметры.НормаПотребления = Услуга.НормаПотребления;
	Область.Параметры.Долг = Услуга.Долг;
	Область.Параметры.Поточные = ?(ПоказанияСчет, ТекущиеПоказания, "-");
	Область.Параметры.Предыдущие = ?(ПоказанияСчет, ПредыдущиееПоказания, "-");
	Область.Параметры.Разница = Услуга.Количество;
	Область.Параметры.Счетчик = ?(ПоказанияСчет,"("+Услуга.ПриборУчета.ЗаводскойНомер+")","");
	Если Услуга.ВидНачисления = Перечисления.ВидыНачислений.Начисление Тогда
		Начисление = Начисление + Услуга.Сумма;
		Область.Параметры.Насчитано = Начисление;
	ИначеЕсли Услуга.ВидНачисления = Перечисления.ВидыНачислений.Льгота Тогда
		Льгота = Льгота + Услуга.Сумма;
		Область.Параметры.Льготы = Льгота;
	ИначеЕсли Услуга.ВидНачисления = Перечисления.ВидыНачислений.Субсидия Тогда
		Субсидия = Субсидия + Услуга.Сумма;
		Область.Параметры.Субсидии = Субсидия;
	КонецЕсли;
	Область.Параметры.КОплате = ?(Начисление=Неопределено,0,Начисление)+Услуга.Долг + ?(Субсидия=Неопределено,0,Субсидия)+?(Льгота=Неопределено,0,Льгота);
	
	Возврат Область;
КонецФункции 

Функция ВыводСтрокиРасшифровки(Макет, Счетчик)
	Область = Макет;//.ПолучитьОбласть("СтрокаСчетчиковДетальныеЗаписи");
	
	//Получаем показания счетчика
	ТекущиеПоказания = Счетчик.ТекущиеПоказания;
	ПредыдущиееПоказания = Счетчик.ПредыдущиеПоказания;
	
	Область.Параметры.Счетчик = Счетчик.ПриборУчета.ЗаводскойНомер;
	Область.Параметры.Поточные = ТекущиеПоказания;
	Область.Параметры.Предыдущие = ПредыдущиееПоказания;
	Область.Параметры.Разница = ТекущиеПоказания - ПредыдущиееПоказания;
	
	Возврат Область;
	
КонецФункции // ВыводСтрокиРозшифровки() 

&НаСервере
Функция НайтиЗначениеАдреса(Адрес, Значение)
	ЗначениеАдреса = "";
	Для Счет = 1 По СтрЧислоСтрок(Адрес) Цикл
		Строка = СтрПолучитьСтроку(Адрес, Счет);
		Если СтрЧислоВхождений(Строка, Значение)>0 Тогда
			Позиция = Найти(Строка, "=");
			ЗначениеАдреса = Прав(Строка,СтрДлина(Строка)-Позиция);
		КонецЕсли;
	КонецЦикла;
	Возврат ЗначениеАдреса;
КонецФункции 

&НаСервереБезКонтекста
Функция ДанныеХМЛБлокаОрганизации(Организация)
	СтруктураОрганизации = Новый Структура;
	СтруктураОрганизации.Вставить("Ссылка", XMLСтрока(Организация.Ссылка));
	СтруктураОрганизации.Вставить("ИНН", Организация.ИНН);
	СтруктураОрганизации.Вставить("НаименованиеПолное", Организация.НаименованиеПолное);
	Возврат СтруктураОрганизации;
КонецФункции  

&НаСервере
Функция  ПолучитьРеквизитыБанкаНаСервере(Банк)
	СтруктураРеквизитовБанка = Новый Структура;
	СтруктураРеквизитовБанка.Вставить("Receiver", Банк.Наименование);
	СтруктураРеквизитовБанка.Вставить("Code", Банк.Банк.КодПоЕДРПОУ);
	СтруктураРеквизитовБанка.Вставить("AccountNumber", Банк.НомерСчета);
	СтруктураРеквизитовБанка.Вставить("MFI_Bank", Банк.Банк.Код);
	Возврат СтруктураРеквизитовБанка;
КонецФункции
 
&НаСервере
Функция ПолучитьДокументыДляВыгрузки()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаНаПроведениеРемонта.Ссылка,
	               |	ЗаявкаНаПроведениеРемонта.Номер,
	               |	ВЫБОР
	               |		КОГДА ЗаявкаНаПроведениеРемонта.СтатусЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыСтатусовЗаявкиНаПроведениеРемонта.НоваяЗаявка)
	               |			ТОГДА ""5""
	               |		КОГДА ЗаявкаНаПроведениеРемонта.СтатусЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыСтатусовЗаявкиНаПроведениеРемонта.Принята)
	               |			ТОГДА ""7""
	               |		КОГДА ЗаявкаНаПроведениеРемонта.СтатусЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыСтатусовЗаявкиНаПроведениеРемонта.Выполнена)
	               |			ТОГДА ""8""
	               |		ИНАЧЕ ""9""
	               |	КОНЕЦ КАК Статус,
	               |	ЗаявкаНаПроведениеРемонта.ЛицевойСчет,
	               |	ЗаявкаНаПроведениеРемонта.ТекстЗаявки,
	               |	ЗаявкаНаПроведениеРемонта.ВремяУдобноеДляЗаказчика,
	               |	ЗаявкаНаПроведениеРемонта.ВремяФактическогоВыполнения,
	               |	ЗаявкаНаПроведениеРемонта.ДатаПоследнегоИзменения,
	               |	ЗаявкаНаПроведениеРемонта.Автор,
	               |	ЗаявкаНаПроведениеРемонта.АвторПоследнегоИзменения,
	               |	ЗаявкаНаПроведениеРемонта.ВидЗаявки,
	               |	ЗаявкаНаПроведениеРемонта.Здание,
	               |	ЕСТЬNULL(ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец.Наименование, """") КАК ОтветственныйВладелец
	               |ИЗ
	               |	Документ.ЗаявкаНаПроведениеРемонта КАК ЗаявкаНаПроведениеРемонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Дата, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	               |		ПО ЗаявкаНаПроведениеРемонта.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
	               |ГДЕ
	               |	ЗаявкаНаПроведениеРемонта.Проведен = ИСТИНА
	               |	И ЗаявкаНаПроведениеРемонта.ПометкаУдаления = ЛОЖЬ
	               |	И ЗаявкаНаПроведениеРемонта.Дата > ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), СЕКУНДА, -1)
	               |	И ЗаявкаНаПроведениеРемонта.Дата < ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), СЕКУНДА, 1)";
	Запрос.УстановитьПараметр("Дата", Объект.ПериодПросмотра);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДокументЗаявкаНаРемонт = Новый Структура;
	
	Номер = 1;
	Пока Выборка.Следующий() Цикл
		Заявка = Новый Структура;
		Заявка.Вставить("Автор",Выборка.Автор.Наименование);
		Заявка.Вставить("АвторПоследнегоИзменения",Выборка.АвторПоследнегоИзменения.Наименование);
		Заявка.Вставить("ВидЗаявки",XMLСтрока(Выборка.ВидЗаявки));
		Заявка.Вставить("ВремяУдобноеДляЗаказчика",Выборка.ВремяУдобноеДляЗаказчика);
		Заявка.Вставить("ВремяФактическогоВыполнения",Выборка.ВремяФактическогоВыполнения);
		Заявка.Вставить("ДатаПоследнегоИзменения",Выборка.ДатаПоследнегоИзменения);
		Заявка.Вставить("Здание",Выборка.Здание.Наименование);
		Заявка.Вставить("Квартира",XMLСтрока(Выборка.ЛицевойСчет.ОбъектЛицевогоСчета.Код));
		Заявка.Вставить("ЛицевойСчет",Выборка.ЛицевойСчет.Наименование);
		Заявка.Вставить("Номер",Выборка.Номер);
		Заявка.Вставить("ОтветственныйВладелец",Выборка.ОтветственныйВладелец);
		Заявка.Вставить("Ссылка",XMLСтрока(Выборка.Ссылка));
		Заявка.Вставить("Статус",Выборка.Статус);
		Заявка.Вставить("ТекстЗаявки",Выборка.ТекстЗаявки);
		
		ДокументЗаявкаНаРемонт.Вставить("Заявка"+Номер, Заявка);
		
		Номер = Номер + 1;
	КонецЦикла; 
	
	Возврат ДокументЗаявкаНаРемонт;

КонецФункции // ПолучитьДокументыДляВыгрузки()

//============================ ФУНКЦИИ ДЛЯ РАБОТЫ ПОМОЩНИКА =======================================//
&НаКлиенте
Процедура КомандаДалее(Команда)
	Если ТекущийНомерСтраницы = 2 Тогда
		
		ИзменитьНомерСтраницы(+1);
		
	Иначе                             
		
		ИзменитьНомерСтраницы(+1);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)
	Если ТекущийНомерСтраницы = 3 Тогда
		
		ИзменитьНомерСтраницы(-1);
		
	Иначе
		
		ИзменитьНомерСтраницы(-1);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНомерСтраницы(Итератор)
	
	Отказ = Ложь;
	
	// Изменяем номер текущей страницы.
	Инкремент(ТекущийНомерСтраницы, Итератор);
	
	// Обработчики событий при смене страницы мастера.
	ВыполнитьОбработчикиСобытийМастераПриСменеСтраницы(Отказ, Итератор > 0);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Отображаем новую страницу мастера.
	УстановитьВидимостьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНаКлиенте()
	
	// устанавливаем текущую страницу мастера
	Элементы.СтраницыМастера.ТекущаяСтраница = СтраницыМастера[ТекущийНомерСтраницы];
	
	// устанавливаем текущую страницу кнопок мастера
	Элементы.КнопкиМастера.ТекущаяСтраница = КнопкиМастера[ТекущийНомерСтраницы];
		
КонецПроцедуры

&НаКлиенте
Процедура Инкремент(Число, Знач Итератор = 1)
	
	Число = Число + Итератор;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработчикиСобытийМастераПриСменеСтраницы(Отказ, ЭтоУвеличениеНомераСтраницы)
	
	Если ЭтоУвеличениеНомераСтраницы Тогда
		
		ВыполнитьПроверкиПриПереходеНаСледующуюСтраницу(Отказ);
		
	КонецЕсли;
	
	Если Отказ Тогда
		
		Инкремент(ТекущийНомерСтраницы, ?(ЭтоУвеличениеНомераСтраницы, -1, +1));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкиПриПереходеНаСледующуюСтраницу(Отказ)
	
	ОчиститьСообщения();
	
	Если ТекущийНомерСтраницы = 2 Тогда 
		Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
			Сообщение = НСтр("ru = 'Укажите наименование организации!'; uk='Вкажіть найменування організації!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение,, "Объект.Организация",, Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(МесяцСтрока) Тогда
			Сообщение = НСтр("ru = 'Укажите период выгрузки!'; uk='Вкажіть період вивантаження!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение,, "МесяцСтрока",, Отказ);
		КонецЕсли;
	ИначеЕсли ТекущийНомерСтраницы = 3 Тогда 
		Если Объект.ЛицевыеСчета.Количество() = 0 Тогда
			Сообщение = НСтр("ru = 'Выберите хотя бы один лицевой счет!'; uk='Виберіть як мінімум один особовий рахунок!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение,, "Объект.ЛицевыеСчета",, Отказ);
		КонецЕсли;
	ИначеЕсли ТекущийНомерСтраницы = 4 Тогда 
		Если Не ЗначениеЗаполнено(Объект.ИмяФайлаДанных) Тогда
			Сообщение = НСтр("ru = 'Укажите каталог и имя файла выгрузки!'; uk='Вкажіть директорію та ім’я файлу вивантаження!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение,, "Объект.ИмяФайлаДанных",, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализацияМастераНаКлиенте()
	
	ТекущийНомерСтраницы = 1;
	
	СтраницыМастера = Новый Соответствие;
	КнопкиМастера   = Новый Соответствие;
	
	// СТРАНИЦЫ МАСТЕРА
	
	СтраницыМастера.Вставить(1, Элементы.СтраницаМастераНачало);
	СтраницыМастера.Вставить(2, Элементы.СтраницаМастераНастройкиВыборЛицевыхСчетов);
	СтраницыМастера.Вставить(3, Элементы.СтраницаМастераНастройкиВыбораКаталогаВыгрузки);
	
	// КНОПКИ МАСТЕРА
	
	КнопкиМастера.Вставить(1, Элементы.КнопкиНачала);
	КнопкиМастера.Вставить(2, Элементы.КнопкиПродолжения);
	КнопкиМастера.Вставить(3, Элементы.КнопкиОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаЛицевойСчетПриИзменении(Элемент)
	Стр = Элементы.ЛицевыеСчета.ТекущиеДанные;
	                                               
	Стр.Владелец = ПолучитьВладельцаЛицевогоСчета(Стр.ЛицевойСчет);
	Стр.Адрес = ПолучитьАдресЛицевогоСчета(Стр.ЛицевойСчет);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВладельцаЛицевогоСчета(ЛицевойСчет)
	Возврат РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(),Новый Структура("ЛицевойСчет",ЛицевойСчет))[0].ОтветственныйВладелец.Наименование;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьАдресЛицевогоСчета(ЛицевойСчет)
	Возврат ЛицевойСчет.Владелец.Наименование+", "+ЛицевойСчет.ОбъектЛицевогоСчета.Наименование;
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.РасчетныйСчетОрганизации = ПолучитьРасчетныйСчетНаСервере(Объект.Организация);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРасчетныйСчетНаСервере(Организация)
	Возврат Организация.БанковскийСчетПоУмолчанию;
КонецФункции // ()


 
 
