
&НаКлиенте
Процедура СменитьРабочийСтол(Команда)
	
	ОткрытьФорму("Обработка.УправлениеРабочимСтолом.Форма.Форма");
	
КонецПроцедуры


&НаКлиенте
Процедура ЖилецНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НовыйМассив = ПолучитьПрописанныхЖильцов(ЛицевойСчет, ТекущаяДата());
	
	ФиксированныйМассивФизЛиц = Новый ФиксированныйМассив(НовыйМассив);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ФиксированныйМассивФизЛиц);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.Жилец.ПараметрыВыбора = НовыеПараметры;

КонецПроцедуры

// Функция возвращает список прописанных жильцов.
//
&НаСервере
Функция ПолучитьПрописанныхЖильцов(ЛицевойСчет, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОПрописанныхЖильцахСрезПоследних.Жилец
		|ИЗ
		|	РегистрСведений.СведенияОПрописанныхЖильцах.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК СведенияОПрописанныхЖильцахСрезПоследних
		|ГДЕ
		|	СведенияОПрописанныхЖильцахСрезПоследних.Прописан = ИСТИНА";
		
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет); 
	Запрос.УстановитьПараметр("Период", Дата); 
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Жилец");
	
КонецФункции


&НаКлиенте
Процедура ПечатьСправкаОПрописке(Команда)
	
	Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("ТекущийЖитель",Жилец);
		
		МассивСсылкаЛицевогоСчета = Новый Массив;
		МассивСсылкаЛицевогоСчета.Добавить(ЛицевойСчет);
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "СправкаОПрописке", МассивСсылкаЛицевогоСчета, ЭтаФорма, ПараметрыПечати);
	Иначе
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "СправкаОПрописке", Неопределено, Неопределено, Неопределено);	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура БланкСправкаОПрописке(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "СправкаОПрописке", Неопределено, Неопределено, Неопределено);

КонецПроцедуры


&НаКлиенте
Процедура ПечатьСправкиОСостоянииСемьи(Команда)
	
	Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
		
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("ТекущийЖитель",Жилец);
		
		МассивСсылкаЛицевогоСчета = Новый Массив;
		МассивСсылкаЛицевогоСчета.Добавить(ЛицевойСчет);
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "МакетСправкиПрописанных", МассивСсылкаЛицевогоСчета, ЭтаФорма, ПараметрыПечати);
	Иначе
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "СправкаОСоставеСемьи", Неопределено, Неопределено, Неопределено);	

	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПечатьФормаА1(Команда)
	
	Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("ТекущийЖитель",Жилец);
		
		МассивСсылкаЛицевогоСчета = Новый Массив;
		МассивСсылкаЛицевогоСчета.Добавить(ЛицевойСчет);
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "МакетКарточкиПрописки", МассивСсылкаЛицевогоСчета, ЭтаФорма, ПараметрыПечати);
	Иначе
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ФормаА1", Неопределено, Неопределено, Неопределено);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура БланкСправкиОСоставеСемьи(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "СправкаОСоставеСемьи", Неопределено, Неопределено, Неопределено);	

КонецПроцедуры


&НаКлиенте
Процедура БланкФормаА1(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ФормаА1", Неопределено, Неопределено, Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура БланкТалонПрибытия(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ТалонПрибытия", Неопределено, Неопределено, Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура БланкЗаявлениеОРегистрации(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ЗаявлениеОРегистрации", Неопределено, Неопределено, Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура БланкТалонаУбытия(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ТалонУбытия", Неопределено, Неопределено, Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура БланкЗаявленияНаСнятиеСРегистрации(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ЗаявлениеОВыписке", Неопределено, Неопределено, Неопределено);
КонецПроцедуры

