
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаОткрытиеЛицевогоСчета, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ОткрытиеЛицевогоСчета.ЛицевойСчет,
	 |	ОткрытиеЛицевогоСчета.Дата КАК Период,
	 |	ИСТИНА КАК Действует,
	 |	ОткрытиеЛицевогоСчета.КоличествоПрописанных,
	 |	ОткрытиеЛицевогоСчета.КоличествоПроживающих
	 |ИЗ
	 |	Документ.ОткрытиеЛицевогоСчета КАК ОткрытиеЛицевогоСчета
	 |ГДЕ
	 |	ОткрытиеЛицевогоСчета.Ссылка = &Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ОткрытиеЛицевогоСчета.Дата КАК Период,
	 |	ОткрытиеЛицевогоСчета.ЛицевойСчет,
	 |	ОткрытиеЛицевогоСчета.ОтветственныйВладелец
	 |ИЗ
	 |	Документ.ОткрытиеЛицевогоСчета КАК ОткрытиеЛицевогоСчета
	 |ГДЕ
	 |	ОткрытиеЛицевогоСчета.Ссылка = &Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ОткрытиеЛицевогоСчетаДополнительныеРеквизиты.Ссылка.Дата КАК Период,
	 |	ОткрытиеЛицевогоСчетаДополнительныеРеквизиты.Ссылка.ЛицевойСчет,
	 |	ОткрытиеЛицевогоСчетаДополнительныеРеквизиты.ДополнительныйРеквизит,
	 |	ОткрытиеЛицевогоСчетаДополнительныеРеквизиты.Значение
	 |ИЗ
	 |	Документ.ОткрытиеЛицевогоСчета.ДополнительныеРеквизиты КАК ОткрытиеЛицевогоСчетаДополнительныеРеквизиты
	 |ГДЕ
	 |	ОткрытиеЛицевогоСчетаДополнительныеРеквизиты.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаОткрытиеЛицевогоСчета);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЛицевыеСчета", МассивРезультатов[0].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтветственныйВладелецЛицевогоСчета", МассивРезультатов[1].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДополнительныеРеквизитыЛицевогоСчета", МассивРезультатов[2].Выгрузить());
	
КонецПроцедуры
