////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ВводПоказанийПриборовУчета.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ПроведениеСервер.ОтразитьРасчетПоказанийПриборовУчета(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьПоказанияПриборовУчета(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.ВводПоказанийПриборовУчета.ВыполнитьКонтрольПовторногоНачисления(Ссылка, ДополнительныеСвойства, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого СтрокаОсновная Из Основная Цикл
		
		Если СтрокаОсновная.Разница < 0 Тогда
			
			ТекстСообщения = НСтр("ru='В строке №%Номер% табл. части показания прибора учета к расчету < 0.';uk='В рядку №%Номер% табл. частині показання приладу обліку до розрахунку < 0.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номер%", СтрокаОсновная.НомерСтроки);
			Поле = "Основная[" + (СтрокаОсновная.НомерСтроки - 1) + "].Разница";

			ОСМДСервер.СообщитьОбОшибке(
				ТекстСообщения,
				ЭтотОбъект,
				Отказ,
				Поле
			);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ИспользуетсяМобильноеПриложение = Константы.ИспользоватьМобильноеПриложение.Получить();
	
	Если ИспользуетсяМобильноеПриложение Тогда
		Если ЭтотОбъект.ПометкаУдаления = Ложь Тогда
			Если ЗначениеЗаполнено(Исполнитель) и КонецДня(ГраничнаяДатаСъема) >= КонецДня(ТекущаяДата()) тогда
					НаборЗаписей = РегистрыСведений.ЗаданияНаСнятиеПоказанийПриборовУчета.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Регистратор.Использование = истина;
					НаборЗаписей.Отбор.Регистратор.Значение = Ссылка;
					
					Для Каждого Строка из Основная Цикл
						Если Не Строка.Отключен и Строка.Показание = 0 Тогда      
							Запись = НаборЗаписей.Добавить();
							Запись.Период 				= ТекущаяДата();
							Запись.Здание 				= Здание;
							Запись.Исполнитель  		= Исполнитель;
							Запись.ГраничнаяДатаСъема   = ГраничнаяДатаСъема;
							Запись.ОбъектЛицевогоСчета  = Строка.ОбъектЛицевогоСчета;
							Запись.ПриборУчета			= Строка.ПриборУчета;
						КонецЕсли;
					КонецЦикла;
					
					НаборЗаписей.Записывать = Истина;
					НаборЗаписей.Записать();
					
			Иначе
			СоздатьПустойНаборЗаписей();	
			КонецЕсли;
			
		Иначе
			
			СоздатьПустойНаборЗаписей();
			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура СоздатьПустойНаборЗаписей()
	
			НаборЗаписей = РегистрыСведений.ЗаданияНаСнятиеПоказанийПриборовУчета.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Использование = истина;
			НаборЗаписей.Отбор.Регистратор.Значение = Ссылка;
			НаборЗаписей.Очистить();
			
			НаборЗаписей.Записывать = Истина;
			НаборЗаписей.Записать();
	
КонецПроцедуры





