////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаКлиенте
// Обработчик события ОбработкаЗаписиНового.
//
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Элементы.Список.ТекущаяСтрока = НовыйОбъект;
	
КонецПроцедуры

&НаКлиенте
// Обработчик события Действие команды КомандаПодборИзКлассификатора.
//
Процедура ПодобратьИзКлассификатора(Команда)
	
	ОткрытьФормуМодально("Справочник.КлассификаторЕдиницИзмерения.Форма.КлассификаторЕдиницИзмерения");
	Элементы.Список.Обновить();
	
КонецПроцедуры

