
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Форма = ПолучитьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораПериодаОплаты");
	Форма.ЛицевойСчет.ЗагрузитьЗначения(ПараметрКоманды);
	ПараметрыПечати = Форма.ОткрытьМодально();
	
	Если ПараметрыПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "МакетКвитанцииНаОплату", ПараметрКоманды, ПараметрыВыполненияКоманды, ПараметрыПечати);
КонецПроцедуры
