//
// У модуля установлен режим повторного использования возращаемых объектов 
// "на время сеанса". 
//
// Это значит, что в рамках текущего сеанса после первого вызова функции этого 
// модуля результат выполнения будет сохранен. При повторных вызовах этой функции 
// будет возвращаться это сохраненнное значение, код функции при этом выполняться 
// не будет.
//

//
// Функция, возвращает объект экспортируемый компонентой
//
Функция ОбъектКомпоненты() Экспорт
	// Подключаем компоненту только в случае необходимости (см. блок Исключение)
	Попытка
		// Считаем, что компонента уже подключена
		Возврат Новый("AddIn.Licence.LicenceExtension");
	Исключение
		// Исключение возможно только если компонента еще не подключена
	КонецПопытки;
	СЛК.ПодключитьКомпоненту();
	Возврат Новый("AddIn.Licence.LicenceExtension");
КонецФункции

//
// Функция, возвращает менеджер объектов. 
//
Функция МенеджерОбъектов() Экспорт
	
	// Получение объекта компоненты
	Объект = СЛК.ОбъектКомпоненты();
	
	// Контрль версии компоненты
	НеобходимаяВерсия = "3.0.14";
	Если НЕ Объект.ПроверитьВерсию(НеобходимаяВерсия) Тогда
		ВызватьИсключение "(EVersionMismatch) Устаревшая версия СЛК " + Объект.Версия + ", для работы конфигурации необходима СЛК " + НеобходимаяВерсия + " или выше";
	КонецЕсли;
	
	// Установка параметров связи с сервером СЛК
	Параметры = СЛК.ПолучитьПараметрыСвязи();
	Объект.ПараметрыСвязи = "ServerAddr=" + Параметры.АдресСервера + ";ServerPort=" + Параметры.ПортСервера;
	
	// Запуск: определение серии ключей защиты и установка соединения 
	// с сервером СЛК
	Если НЕ Объект.Запуск(СЛК.Серия()) Тогда
		ВызватьИсключение Объект.ПолучитьОписаниеОшибки();
	КонецЕсли;
	
	// Получаем имя менеджера объектов
	//Имя = Объект.ПолучитьМенеджерОбъектов();
	Имя = Объект.ПолучитьМенеджерОбъектов();
	Если Имя = Неопределено Тогда
		ВызватьИсключение Объект.ПолучитьОписаниеОшибки();
	КонецЕсли;
	
	// Отключаем предупреждения о загрузке обработок из непроверенных источников
	Если ТекущийРежимЗапуска() <> РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение Тогда
		Попытка
			Защита = Новый ("ОписаниеЗащитыОтОпасныхДействий");
			Защита.ПредупреждатьОбОпасныхДействиях = Ложь;
		Исключение
			// Исключение возможно на предыдущих версиях платформы без механизма
			// защиты от опасных действий
			Защита = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	// Создание менеджера объектов
	Попытка
		
		Если Защита = Неопределено Тогда
			МенеджерОбъектов = ВнешниеОбработки.Создать(Имя, БезопасныйРежим());
		Иначе
			МенеджерОбъектов = ВнешниеОбработки.Создать(
				ВнешниеОбработки.Подключить(ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Имя)), , БезопасныйРежим(), Защита));
		КонецЕсли;
			
		// Настраиваем менеджер объектов, дополнительно передаем объект для отключения
		// предупреждений об опасных действиях
		МенеджерОбъектов.УстановитьОбъектКомпоненты(Объект, Защита);
			
		// Установка кода доступа к ключам. Значение должно соответствовать коду доступа, назначенному 
		// ключу / ключам на сервере СЛК.
		//МенеджерОбъектов.УстановитьКодДоступа();
		
		#Область Отладка
		// Для отладки устанавливаем параметры контроля лицензий.
		// В реальной работе эта операция должна выполняться в защищенном 
		// объекте в предопределнной процедуре "ПриСозданииОбъекта"
		
		// Установка параметров контроля лицензии
		//МенеджерОбъектов.УстановитьПараметрыКонтроляЛицензии(СЛК.ТолькоНаличиеКлюча(), 77000000, 77000); // ИНН, КПП, ВерсияПродукта, РегНомер, СерийныйНомер);
		
		// Пример контроля по ИНН/КПП
		//МенеджерОбъектов.УстановитьПараметрыКонтроляЛицензии(, ИНН, КПП);
		
		// Пример подключения к конкретному ключу
		//МенеджерОбъектов.УстановитьПараметрыКонтроляЛицензии(, , , , , СерийныйНомер);
		#КонецОбласти
	Исключение
		// Логгируем и получаем описание ошибки
		ВызватьИсключение Объект.ОшибкаСозданияОбъекта(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат МенеджерОбъектов;
КонецФункции

//
// Функция создания защищенного объекта
// 
Функция СоздатьОбъект(Имя) Экспорт
	Возврат СЛК.МенеджерОбъектов().СоздатьОбъект(Имя);
КонецФункции

