
////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
// Функция возвращает расписание регламентного задания.
//
Процедура СоздатьРегламентноеЗадание()
	
	ОбъектЗадания = РегламентныеЗадания.СоздатьРегламентноеЗадание("ОбменДаннымиССайтом");
	Попытка
		// Запишем регламентное задание.
		ОбъектЗадания.Наименование = "Обмен данными с сайтом: " + Объект.Наименование;
		ОбъектЗадания.Записать();
		Объект.РегламентноеЗадание = Строка(ОбъектЗадания.УникальныйИдентификатор);
		
		// Запишем текущий элемент для сохранения данных о регламентном задании.
		Записать();
	Исключение
		ВызватьИсключение "Произошла ошибка при создании расписания.
		|" + ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры // СоздатьРегламентноеЗадание()

&НаСервере
// Записывает в параметры регламетного задания данные для поиска элемента текущего
// справочника, соответствующего регламентному заданию.
// 
Процедура УстановитьПараметрыРегламентногоЗадания()
	
	Если Объект.РегламентноеЗадание = "" Тогда
		Возврат;
	КонецЕсли;
	
	мРегламентноеЗадание = ПолучитьРегламентноеЗадание(Объект.РегламентноеЗадание);
	
	Если мРегламентноеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Массив = Новый Массив();
	Массив.Добавить(Объект.Код);
	
	мРегламентноеЗадание.Параметры = Массив;
	мРегламентноеЗадание.Ключ      = Объект.Код;
	мРегламентноеЗадание.Записать();
	
КонецПроцедуры // УстановитьПараметрыРегламентногоЗадания()

&НаСервереБезКонтекста
// Возвращает РегламентноеЗадание из информационной базы.
//
// Параметры:
//  Идентификатор - ОбъектМетаданных регламентного задания для поиска
//                  предопределенного регламентного задания.
//                - УникальныйИдентификатор регламентного задания.
//                - Строка уникального идентификатора регламентного задания.
//                - РегламентноеЗадание из которого нужно получить уникальный
//                  идентификатор для получения свежей копии регламентного задания.
// 
// Возвращаемое значение:
//  РегламентноеЗадание, прочитанное из базы данных.
//
Функция ПолучитьРегламентноеЗадание(Знач Идентификатор)
	
	//РегламентныеЗаданияСервер.ВызватьИсключениеЕслиНетПраваАдминистрирования();
	УстановитьПривилегированныйРежим(Истина);
	
	РегламентноеЗадание = Неопределено;
	
	Если Не ПустаяСтрока(Идентификатор) Тогда
		Идентификатор = Новый УникальныйИдентификатор(Идентификатор);
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
	КонецЕсли;
	
	Возврат РегламентноеЗадание;
	
КонецФункции // ПолучитьРегламентноеЗадание()

&НаСервере
// Процедура создает регламентное задание, если оно не определено.
//
Процедура ОпределитьРегламентноеЗадание()
	
	Задание = ПолучитьРегламентноеЗадание(Объект.РегламентноеЗадание);
	
	Если Задание = Неопределено Или ПустаяСтрока(Объект.РегламентноеЗадание) Тогда
		СоздатьРегламентноеЗадание();
	КонецЕсли;
	
КонецПроцедуры // ОпределитьРегламентноеЗадание()

&НаСервере
// Функция возвращает расписание регламентного задания.
//
Функция ПолучитьРасписание()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОпределитьРегламентноеЗадание();
	
	Возврат ОбщегоНазначенияКлиентСервер.СтруктураВРасписание(РегламентныеЗаданияСервер.ПолучитьРасписаниеРегламентногоЗаданияВСтруктуре(Объект.РегламентноеЗадание));
	
КонецФункции // ПолучитьРасписание()

&НаСервереБезКонтекста
// Процедура устанавливает расписание регламентного задания.
//
Процедура УстановитьРасписание(ИдентификаторРегламентногоЗадания, Знач Расписание)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = РегламентныеЗаданияСервер.ПолучитьРегламентноеЗадание(ИдентификаторРегламентногоЗадания);
	
	Если ТипЗнч(Расписание) = Тип("РасписаниеРегламентногоЗадания") Тогда
		Задание.Расписание = Расписание;
	Иначе
		Задание.Расписание = ОбщегоНазначенияКлиентСервер.СтруктураВРасписание(Расписание);
	КонецЕсли;
	
	Задание.Записать();
		
КонецПроцедуры // УстановитьРасписание()

&НаСервереБезКонтекста
// Устанавливает использование регламентного задания.
//  Перед вызовом требуется иметь право Администрирования
// или УстановитьПривилегированныйРежим.
//
// Параметры:
//  Идентификатор - ОбъектМетаданных регламентного задания для поиска
//                  предопределенного регламентного задания.
//                - УникальныйИдентификатор регламентного задания.
//                - Строка уникального идентификатора регламентного задания.
//                - РегламентноеЗадание.
//
// Использование  - Булево.
// 
Процедура УстановитьИспользованиеРегламентногоЗадания(Знач Идентификатор, Знач Использование)
	
	//РегламентныеЗаданияСервер.ВызватьИсключениеЕслиНетПраваАдминистрирования();
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = ПолучитьРегламентноеЗадание(Идентификатор);
	
	Если Не Задание = Неопределено И Задание.Использование <> Использование Тогда
		Задание.Использование = Использование;
		Задание.Записать();
	КонецЕсли;
	
КонецПроцедуры // УстановитьИспользованиеРегламентногоЗадания()

&НаСервереБезКонтекста
// Функция формирует текст расписания регламентного задания.
//
Функция ПолучитьПараметрыРегламентногоЗадания(ИдентификаторРегламентногоЗадания)
	
	Задание = Неопределено;
	
	Если Не ПустаяСтрока(ИдентификаторРегламентногоЗадания) Тогда
		Задание = ПолучитьРегламентноеЗадание(ИдентификаторРегламентногоЗадания);
	КонецЕсли;
	
	Использование   = Ложь;
	ТекстРасписания = "<Расписание не задано>";
	
	Если Не Задание = Неопределено Тогда
		
		Использование = Задание.Использование;
		
		Если Задание.Использование Тогда
			ПрефиксРасписания = "Расписание: ";
		Иначе
			ПрефиксРасписания = "Расписание (НЕ АКТИВНО): ";
		КонецЕсли;
		
		ТекстРасписания = ПрефиксРасписания + Строка(Задание.Расписание);
		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Использование",   Использование);
	СтруктураПараметров.Вставить("ТекстРасписания", ТекстРасписания);
	
	Возврат СтруктураПараметров;
	
КонецФункции // ПолучитьПараметрыРегламентногоЗадания()

&НаКлиентеНаСервереБезКонтекста
// Процедура управления видимостью.
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Элементы.РасписаниеРегламентногоЗадания.Доступность = Объект.ИспользоватьРегламентноеЗадание;
	
КонецПроцедуры // УправлениеФормой()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Обработчик события "ПриСозданииНаСервере" формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыРегламентногоЗадания = ПолучитьПараметрыРегламентногоЗадания(Объект.РегламентноеЗадание);
	Объект.ИспользоватьРегламентноеЗадание = ПараметрыРегламентногоЗадания.Использование;
	РасписаниеРегламентногоЗадания  = ПараметрыРегламентногоЗадания.ТекстРасписания;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Обработчик события "ПриСозданииНаСервере" формы.
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	УстановитьПараметрыРегламентногоЗадания();
	
КонецПроцедуры // ПередЗаписью()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
// Обработчик нажатия надписи "РасписаниеРегламентногоЗадания".
//
Процедура РасписаниеРегламентногоЗаданияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Предупреждение("Перед редактированием настроек расписания необходимо записать элемент!", , "Внимание");
		Возврат;
		
	КонецЕсли;
	
	Расписание = ПолучитьРасписание();
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	
	Если Диалог.ОткрытьМодально() Тогда
		
		УстановитьРасписание(Объект.РегламентноеЗадание, Диалог.Расписание);
		
		ПараметрыРегламентногоЗадания  = ПолучитьПараметрыРегламентногоЗадания(Объект.РегламентноеЗадание);
		РасписаниеРегламентногоЗадания = ПараметрыРегламентногоЗадания.ТекстРасписания;
		
	КонецЕсли;
	
КонецПроцедуры // РасписаниеРегламентногоЗаданияНажатие()

&НаКлиенте
// Обработчик события "ПриИзменении" поля "ИспользоватьРегламентноеЗадание".
//
Процедура ИспользоватьРегламентноеЗаданиеПриИзменении(Элемент)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Предупреждение("Перед редактированием настроек расписания необходимо записать элемент!", , "Внимание");
		Объект.ИспользоватьРегламентноеЗадание = Не Объект.ИспользоватьРегламентноеЗадание;
		Возврат;
		
	КонецЕсли;
	
	ОпределитьРегламентноеЗадание();
	
	УстановитьИспользованиеРегламентногоЗадания(Объект.РегламентноеЗадание, Объект.ИспользоватьРегламентноеЗадание);
	
	ПараметрыРегламентногоЗадания  = ПолучитьПараметрыРегламентногоЗадания(Объект.РегламентноеЗадание);
	РасписаниеРегламентногоЗадания = ПараметрыРегламентногоЗадания.ТекстРасписания;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры // ИспользоватьРегламентноеЗаданиеПриИзменении()

