  
// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция РассчитатьСуммыНачислений(СтруктураДляРасчета) Экспорт	
	
	Попытка
		Менеджер = Слк.МенеджерОбъектов();
		Объект = Менеджер.СоздатьОбъект("ОбъектыСЛК.УчетКоммунальныхУслугЗащищенный");
		Возврат Объект.РассчитатьСуммыНачислений(СтруктураДляРасчета);
	Исключение
		Возврат Ложь;
	КонецПопытки;	

КонецФункции		

// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция РассчитатьСуммыПерерасчета(СтруктураДляПерерасчета) Экспорт
	Попытка
		Менеджер = Слк.МенеджерОбъектов();
		Объект = Менеджер.СоздатьОбъект("ОбъектыСЛК.УчетКоммунальныхУслугЗащищенный");
		Возврат Объект.РассчитатьСуммыПерерасчета(СтруктураДляПерерасчета);
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции

Функция РассчтитатьСуммыПерерасчетаЛьгот(СтруктураДляРасчета) Экспорт 
	
	
	Попытка
		Менеджер = Слк.МенеджерОбъектов();
		Объект = Менеджер.СоздатьОбъект("ОбъектыСЛК.УчетКоммунальныхУслугЗащищенный");
		Возврат Объект.РассчтитатьСуммыПерерасчетаЛьгот(СтруктураДляРасчета);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	 
КонецФункции

//Получает строку состояния БД
Функция  ПолучитьСтрокуСостоянияБД() Экспорт
	
	 Попытка
		Менеджер = Слк.МенеджерОбъектов();
		Объект = Менеджер.СоздатьОбъект("ОбъектыСЛК.УчетКоммунальныхУслугЗащищенный");
		Возврат Объект.ПолучитьСтрокуСостоянияБД();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	 
КонецФункции

//Получает идентификатор базы данных
Функция  ПолучитьИдентификаторБД()  Экспорт
	
 	Попытка
		Менеджер = Слк.МенеджерОбъектов();
		Объект = Менеджер.СоздатьОбъект("ОбъектыСЛК.УчетКоммунальныхУслугЗащищенный");
		Возврат Объект.ПолучитьИдентификаторБД();
	Исключение
		Возврат Ложь;
	КонецПопытки;	

КонецФункции // ПолучитьИдентификаторБД()

Функция ПолучитьОписаниеИсточника() Экспорт
	
	
	Попытка
		Менеджер = Слк.МенеджерОбъектов();
		Объект = Менеджер.СоздатьОбъект("ОбъектыСЛК.УчетКоммунальныхУслугЗащищенный");
		Возврат Объект.ПолучитьОписаниеИсточника();
	Исключение
		Возврат Ложь;
	КонецПопытки;

	
КонецФункции

Функция ПолучитьПрокси() Экспорт
	Попытка
		Менеджер = Слк.МенеджерОбъектов();
		Объект = Менеджер.СоздатьОбъект("ОбъектыСЛК.УчетКоммунальныхУслугЗащищенный");
		Возврат Объект.ПолучитьПрокси();
	Исключение
		Возврат Ложь;
	КонецПопытки;	
КонецФункции

Процедура ЗаписатьНастрокиСлужбыПоддержки(Структура) Экспорт 
	Попытка
		Менеджер = Слк.МенеджерОбъектов();
		Объект = Менеджер.СоздатьОбъект("ОбъектыСЛК.УчетКоммунальныхУслугЗащищенный");
		
		Объект.ЗаписатьНастрокиСлужбыПоддержки(Структура);
	Исключение
		Возврат;
	КонецПопытки;	
 КонецПроцедуры

Функция ПолучитьНастрокиСлужбыПоддержки() Экспорт
	Попытка
		Менеджер = Слк.МенеджерОбъектов();
		Объект = Менеджер.СоздатьОбъект("ОбъектыСЛК.УчетКоммунальныхУслугЗащищенный");
		Возврат Объект.ПолучитьНастрокиСлужбыПоддержки();
	Исключение
		Возврат Ложь;
	КонецПопытки;
 КонецФункции

 Процедура СформироватьНачислениеПодомовойУчет(ДокументСсылкаЗакрытиеЛицевогоСчета) Экспорт
	
	Попытка
		Менеджер = Слк.МенеджерОбъектов();
		Объект = Менеджер.СоздатьОбъект("ОбъектыСЛК.УчетКоммунальныхУслугЗащищенный");
		
		Объект.СформироватьНачислениеПодомовойУчет(ДокументСсылкаЗакрытиеЛицевогоСчета);
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьНачислениеПодомовойУчет(ДокументСсылкаЗакрытиеЛицевогоСчета) Экспорт
	
	Попытка
		Менеджер = Слк.МенеджерОбъектов();
		Объект = Менеджер.СоздатьОбъект("ОбъектыСЛК.УчетКоммунальныхУслугЗащищенный");
		
		Объект.УдалитьНачислениеПодомовойУчет(ДокументСсылкаЗакрытиеЛицевогоСчета);
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Процедура СформироватьЛьготыСубсидииПодомовойУчет(ДокументСсылкаЗакрытиеЛицевогоСчета) Экспорт
	
	Попытка
		Менеджер = Слк.МенеджерОбъектов();
		Объект = Менеджер.СоздатьОбъект("УчетКоммунальныхУслугЗащищенный");
		
		Объект.СформироватьЛьготыСубсидииПодомовойУчет(ДокументСсылкаЗакрытиеЛицевогоСчета);
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьЛьготыСубсидииПодомовойУчет(ДокументСсылкаЗакрытиеЛицевогоСчета) Экспорт
Попытка
		Менеджер = Слк.МенеджерОбъектов();
		Объект = Менеджер.СоздатьОбъект("УчетКоммунальныхУслугЗащищенный");
		
		Объект.УдалитьЛьготыСубсидииПодомовойУчет(ДокументСсылкаЗакрытиеЛицевогоСчета);
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры
 
