
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура - обработчик события ПриИзменении поля ввода ЛицевойСчет.
//
&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	Объект.Должник = ПолучитьВладельцаЛС();
	Объект.НачальнаяСуммаДолга = ПолучитьСуммуДолга();

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода НаДату.
//
&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
	
	Объект.НачальнаяСуммаДолга = ПолучитьСуммуДолга();
	Если НЕ ЗначениеЗаполнено(Объект.СуммаДолга) Тогда
		
		Объект.СуммаДолга = Объект.НачальнаяСуммаДолга;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает владельца лицевого счета.
//
&НаСервере
Функция ПолучитьВладельцаЛС();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец
		|ИЗ
		|	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|ГДЕ
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет = &ЛицевойСчет";

	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		
	    Возврат Выборка.ОтветственныйВладелец;
		
	КонецЦикла;

	
КонецФункции

// Функция возвращает сумму долга лицевого счета.
//
&НаСервере
Функция ПолучитьСуммуДолга();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РасчетыПоЛицевымСчетамОстаткиИОбороты.СуммаКонечныйОстаток) КАК Долг
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.ОстаткиИОбороты(, , Авто, , ) КАК РасчетыПоЛицевымСчетамОстаткиИОбороты
		|ГДЕ
		|	РасчетыПоЛицевымСчетамОстаткиИОбороты.Организация = &Организация
		|	И РасчетыПоЛицевымСчетамОстаткиИОбороты.ЛицевойСчет = &ЛицевойСчет
		|	И РасчетыПоЛицевымСчетамОстаткиИОбороты.МесяцНачисления < &ПериодМесяц";

	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	Запрос.УстановитьПараметр("ПериодМесяц", Объект.КонецПериода);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Долг;
		
	КонецЦикла;	
	
	Возврат 0;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);

	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	 //Конец ДополнительныеОтчетыИОбработки
	 
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	 
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.НачалоПериода > Объект.КонецПериода Тогда
		
		Сообщить(НСтр("ru='Документ не записан. Конец периода должен быть позже, чем начало периода.';uk='Документ не записаний. Кінець періоду має бути пізніший, ніж початок періоду.'"));
		Отказ = Истина;
	
	КонецЕсли;
	
КонецПроцедуры



