
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ДЛЯ СОЗДАНИЯ ОТБОРОВ

// Процедура создает отбор по виду операции.
//
&НаКлиенте
Процедура ОтборВидОперацииПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ВидОперации", ОтборВидОперации, ЗначениеЗаполнено(ОтборВидОперации));
	
КонецПроцедуры

// Процедура создает отбор по статусу заявки.
//
&НаКлиенте
Процедура ОтборСтатусЗаявкиПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "СтатусЗаявки", ОтборСтатусЗаявки, ЗначениеЗаполнено(ОтборСтатусЗаявки));
	
КонецПроцедуры

// Процедура создает отбор по ответственному.
//
&НаКлиенте
Процедура ОтборМастерПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ОтветственныйЗаПроведениеРемонта", ОтборМастер, ЗначениеЗаполнено(ОтборМастер));
	
КонецПроцедуры

// Процедура создает отбор по зданию.
//
&НаКлиенте
Процедура ОтборЗданиеПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Здание", ОтборЗдание, ЗначениеЗаполнено(ОтборЗдание));
	
КонецПроцедуры

// Процедура создает отбор по виду заявки.
//
&НаКлиенте
Процедура ОтборВидЗаявкиПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ВидЗаявки", ОтборВидЗаявки, ЗначениеЗаполнено(ОтборВидЗаявки));

КонецПроцедуры

// Процедура создает отбор по организации.
//
&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Если ВебКлиент Тогда
		ТекстСкрипта = РаботаСКартамиСервер.ПолучитьТекстМакета();
	#КонецЕсли

	
	Список.Параметры.УстановитьЗначениеПараметра("ТекВремя", ТекущаяДата());

	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура - обработчик события ПередНачаломДобавления списка.
//
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
		
		Отказ = Истина;
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("ВидЗаявки", ОтборВидЗаявки);
		СтруктураПараметров.Вставить("Организация", ОтборОрганизация);
		СтруктураПараметров.Вставить("ВидОперации", ОтборВидОперации);
		СтруктураПараметров.Вставить("Здание", ОтборЗдание);
		
		ОткрытьФорму("Документ.ЗаявкаНаПроведениеРемонта" + ".ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураПараметров));
		
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	//Временно отключено
	//Строка = Элементы.Список.ТекущиеДанные;
	//Здание = Строка.Здание;
	//
	//Попытка
	//
	//	ДобавитьЭлементМаркера();
	//
	//Исключение
	//
	//КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлементМаркера(АдресЗдания = Неопределено)
	
	Если АдресЗдания = Неопределено Тогда
		Строка = Элементы.Список.ТекущиеДанные;
		Здание = Строка.Здание;
	Иначе
		Здание = Строка.Организация;
	КонецЕсли;	
	
	Стр = ПолучитьРеквизитыЗданияНаСервере(Здание);

	Документ = Элементы.ПолеСкрипта.Document;
	
	Документ.parentWindow.ClearCollection();
	
	Если НЕ ЗначениеЗаполнено(Здание) Тогда
		Документ.parentWindow.ClearCollection();
		Возврат;
	КонецЕсли;
	
	лЗаголовок = "";
	Описание = "";
	Подвал = "";
	
	Если Стр.Свойство("Заголовок") Тогда
		лЗаголовок = Стр.Заголовок;
	КонецЕсли;
	
	Если Стр.Свойство("Описание") Тогда
		Описание = Стр.Описание;
	КонецЕсли;
	
	Если Стр.Свойство("Подвал") Тогда
		Подвал = Стр.Подвал;
	КонецЕсли;
	
	Если Стр.Свойство("Подсказка") Тогда
		Подсказка = Стр.Подсказка;
	КонецЕсли;
	
	ОтображаемаяИконка = "";
	
	//#Если Не ВебКлиент Тогда
	//	ОтображаемаяИконка = КаталогИконок + Стр.Иконка + ".png";	
	//#Иначе	
	//	КаталогИконокНаСайте = "http://www.agentplus.ru/download/1CModules/8/8.2/11/icons/";	
	//	ОтображаемаяИконка = КаталогИконокНаСайте + апСервер.Транслит(Стр.Иконка) + ".png";
	//	
	//	Если Найти(Стр.Иконка, "партнер")>0 Тогда //индивидуальная иконка партнера
	//		ОтображаемаяИконка = КаталогИконокНаСайте + апСервер.Транслит("ИконкаКонтрагент") + ".png";	
	//	КонецЕсли;
	//#КонецЕсли
	
	Документ.parentWindow.setMarker(Стр.Широта, Стр.Долгота, ОтображаемаяИконка, лЗаголовок, Описание, Подвал, Подсказка);
		
КонецПроцедуры //ДобавитьЭлементМаркера 

 &НаСервере
Функция ПолучитьЗдание(ВхПараметр = Неопределено)
	
	Если ВхПараметр <> Неопределено Тогда
		ДокументСсылка = Документы.ЗаявкаНаПроведениеРемонта.НайтиПоНомеру(ВхПараметр);
		Возврат ДокументСсылка.Здание;
	Иначе
		//ЗданиеСсылка = Справочники.ЗданияИСооружения.НайтиПоНаименованию(Элементы.ДекорацияАдресДома.Заголовок);
		//Возврат ЗданиеСсылка;
	КонецЕсли;
	
КонецФункции


 &НаСервере
Функция ПолучитьРеквизитыЗданияНаСервере(Здание)
	
	Стр = Новый Структура("Иконка, Заголовок, Описание, Подвал, Широта, Долгота, Подсказка",
	"1", "2", "", "3", Здание.Широта, Здание.Долгота, "4");

	Возврат Стр;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьМакет();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМакет()
	ТекстМакета	= РаботаСКартамиКлиент.ПолучитьТекстМакета();
	//ТекстМакета = СтрЗаменить(ТекстМакета, "uk-UA", "ru-RU");
#Если Не ВебКлиент Тогда
	Документ = Элементы.ПолеСкрипта.Document;	
	
	Если Документ<>Неопределено Тогда 
		Документ.designMode = "On";
		Документ.write(ТекстМакета);	
		Документ.designMode = "Off";  		
	КонецЕсли;
	//передаем параметр, показывающий, что файл скрипта используется для отчета		
	//Документ.parentWindow.name = РаботаСКартамиСервер.СформироватьПараметрРежимРедактора("Report", Объект.ИсточникКарты);

#Иначе
	ТекстСкрипта = ТекстМакета;
#КонецЕсли
КонецПроцедуры
