&НаКлиенте
Процедура ЗаполнитьИнформациюПоОрганизации(Команда)
	ОткрытьФорму("Справочник.Организации.ФормаСписка");	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформациюПоУслугам(Команда)
	ОткрытьФорму("Справочник.Услуги.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформациюПоЗданиям(Команда)
	ОткрытьФорму("Справочник.ЗданияИСооружения.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформациюПоТарифам(Команда)
	ОткрытьФорму("Документ.УправлениеТарифами.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ВводОстатков(Команда)
	ОткрытьФорму("Документ.ВводНачальныхОстатков.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформациюПоЛицевымСчетам(Команда)
	ОткрытьФорму("Справочник.ЛицевыеСчета.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформациюПоПараметрамУчета(Команда)
	ОткрытьФорму("ОбщаяФорма.НастройкаПараметровУчета");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформациюПоОбъектамУчета(Команда)
	ОткрытьФорму("Справочник.ОбъектыЛицевыхСчетов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформациюПоФизицескимЛицам(Команда)
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаНачальныхОстатковИзExcel(Команда)
	
	ОткрытьФорму("Обработка.ЗагрузкаИзExcel.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьРабочийСтол(Команда)
	
	ОткрытьФорму("Обработка.УправлениеРабочимСтолом.Форма.Форма");

КонецПроцедуры
