
&НаСервере
Процедура ВыбратьДанныеНаСервере1(ТабДок)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!
	
	Макет = Отчеты.ОтчетОплатыМВК.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Ссылка,
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Представление,
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.БанковскийСчет,
		|	ПРЕДСТАВЛЕНИЕ(ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.БанковскийСчет),
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.ЛицевойСчет,
		|	ПРЕДСТАВЛЕНИЕ(ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.ЛицевойСчет),
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.СуммаПлатежа КАК СуммаПлатежа,
		|	СУММА(ОплатаУслугМВКРасшифровкаПлатежа.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ОплатаУслугМВК.РасшифровкаПлатежа КАК ОплатаУслугМВКРасшифровкаПлатежа
		|ГДЕ
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачПериода И &КонПериода
		|	И ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Ссылка,
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Представление,
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.БанковскийСчет,
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.ЛицевойСчет,
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.СуммаПлатежа";
	
	Запрос.УстановитьПараметр("КонПериода", КонецДня(Отчет.КонПериода));
	Запрос.УстановитьПараметр("НачПериода", Отчет.НачПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Сумма <> ВыборкаДетальныеЗаписи.СуммаПлатежа ИЛИ ВыборкаДетальныеЗаписи.Сумма = 0 Тогда
		    ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		    ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаСервере
Процедура ВыбратьДанныеНаСервере(ТабДок)
	Макет = Отчеты.ОтчетОплатыМВК.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Ссылка КАК Ссылка,
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.БанковскийСчет КАК БанковскийСчет,
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.ЛицевойСчет КАК ЛицевойСчет,
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.СуммаПлатежа КАК СуммаПлатежа,
	    |	СУММА(ОплатаУслугМВКРасшифровкаПлатежа.Сумма) КАК Сумма,
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Номер
	    |ИЗ
	    |	Документ.ОплатаУслугМВК.РасшифровкаПлатежа КАК ОплатаУслугМВКРасшифровкаПлатежа
	    |ГДЕ
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачПериода И &КонПериода
	    |	И ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.ЛицевойСчет,
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Ссылка,
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.БанковскийСчет,
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.СуммаПлатежа,
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Номер";
	Запрос.УстановитьПараметр("НачПериода", Отчет.НачПериода);
	Запрос.УстановитьПараметр("КонПериода", КонецДня(Отчет.КонПериода));
	Результат = Запрос.Выполнить().Выгрузить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	Для Каждого стр Из Результат Цикл
		Док = стр.Ссылка.ПолучитьОбъект();
		Если Док.РасшифровкаПлатежа.Количество() = 0 ИЛИ стр.СуммаПлатежа <> стр.Сумма Тогда
			ОбластьДетальныхЗаписей.Параметры.Представление = стр.Ссылка;
			ОбластьДетальныхЗаписей.Параметры.БанковскийСчетПредставление = стр.БанковскийСчет;
			ОбластьДетальныхЗаписей.Параметры.ЛицевойСчетПредставление = стр.ЛицевойСчет;
			ОбластьДетальныхЗаписей.Параметры.СуммаПлатежа = стр.СуммаПлатежа;
			ОбластьДетальныхЗаписей.Параметры.Сумма = стр.Сумма;
			ОбластьДетальныхЗаписей.Параметры.Номер = стр.Номер;
			ТабДок.Вывести(ОбластьДетальныхЗаписей);
		КонецЕсли;
	КонецЦикла;
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДанные(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ВыбратьДанныеНаСервере(ТабДок);
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ПустаяТабЧастьНаСервере(ТабДок)
	Макет = Отчеты.ОтчетОплатыМВК.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ОплатаУслугМВК.Ссылка,
	    |	ОплатаУслугМВК.Номер
	    |ИЗ
	    |	Документ.ОплатаУслугМВК КАК ОплатаУслугМВК
	    |ГДЕ
	    |	ОплатаУслугМВК.Дата МЕЖДУ &НачПериода И &КонПериода
	    |	И ОплатаУслугМВК.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("НачПериода", Отчет.НачПериода);
	Запрос.УстановитьПараметр("КонПериода", КонецДня(Отчет.КонПериода));
	Результат = Запрос.Выполнить().Выгрузить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	Для Каждого стр Из Результат Цикл
		Док = стр.Ссылка.ПолучитьОбъект();
		Если Док.РасшифровкаПлатежа.Количество() = 0 Тогда
			ОбластьДетальныхЗаписей.Параметры.Представление = стр.Ссылка;
			ОбластьДетальныхЗаписей.Параметры.Номер = стр.Номер;
			ТабДок.Вывести(ОбластьДетальныхЗаписей);
		КонецЕсли;
	КонецЦикла;
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры

&НаКлиенте
Процедура ПустаяТабЧасть(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПустаяТабЧастьНаСервере(ТабДок);
	ТабДок.Показать();
КонецПроцедуры
