
// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ИнформацияОПоследнемИзменении(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Источник.АвторПоследнегоИзменения = Пользователи.ТекущийПользователь();
	Источник.ДатаПоследнегоИзменения  = ТекущаяДата();
	
КонецПроцедуры // ИнформацияОПоследнемИзменении()
