
&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	ПолучитьЛСНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЛСНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
	               |	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(, ) КАК РасчетыПоЛицевымСчетамОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	               |		ПО РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
	               |ГДЕ
	               |	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет = &ЛицевойСчет";
				   
	Запрос.УстановитьПараметр("Дата",Объект.Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	
	Объект.ОтветственныйВладелец = Результат.ОтветственныйВладелец;
	Если Объект.ВидОперации = Перечисления.ВидыОперацийДоговораРеструктуризацииДолга.ЗаключениеДоговора Тогда
		Объект.СуммаДолга  = Результат.СуммаОстаток;
	Иначе
		Объект.СуммаДолга  = ПолучитьСуммуРеструктуризации(Объект.Дата,Объект.ЛицевойСчет);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаРассрочки)  Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не установлена дата начала реструктуризации. Автоматическое распределение невозможно!'; uk = 'Не встановлена дата початку реструктуризації. Автоматичний розподіл неможливий!'");
		Сообщение.Поле = "Объект.ДатаНачалаРассрочки";
		Сообщение.Сообщить();
		Возврат;
	ИначеЕсли  НЕ ЗначениеЗаполнено(Объект.ДатаЗавершенияРассрочки)	Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не установлена дата окончания реструктуризации. Автоматическое распределение невозможно!'; uk = 'Не встановлена дата зкінчення реструктуризації. Автоматичний розподіл неможливий!'");
		Сообщение.Поле = "Объект.ДатаЗавершенияРассрочки";
		Сообщение.Сообщить(); 
		Возврат;
		
	ИначеЕсли Объект.ДатаЗавершенияРассрочки < Объект.ДатаНачалаРассрочки Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Дата окончания реструктуризации меньше даты начала! '; uk = 'Дата закінчення реструктуризації менше дати початку!'");
		Сообщение.Сообщить(); 
		Возврат;
		
	КонецЕсли;	
			
	ЗначениеКорректировкиОкругления = 0.01;
	ИтогБазыРаспределения = Объект.СтруктураДолга.Итог("Коэффициент");
	
	ОшибкаОкругления = 0;
	Для Каждого СтрокаСтруктуры Из Объект.СтруктураДолга Цикл
		
		СуммаПлатежа = Объект.СуммаДолга * (СтрокаСтруктуры.Коэффициент / ИтогБазыРаспределения);
		СтрокаСтруктуры.СуммаПлатежа = СуммаПлатежа;
		
		ОшибкаОкругления = ОшибкаОкругления + (СуммаПлатежа - СтрокаСтруктуры.СуммаПлатежа);
		Если ОшибкаОкругления >= ЗначениеКорректировкиОкругления Тогда
			СтрокаСтруктуры.СуммаПлатежа = СтрокаСтруктуры.СуммаПлатежа + ЗначениеКорректировкиОкругления;
			ОшибкаОкругления = ОшибкаОкругления - ЗначениеКорректировкиОкругления;
		ИначеЕсли ОшибкаОкругления <= -ЗначениеКорректировкиОкругления Тогда
			СтрокаСтруктуры.СуммаПлатежа = СтрокаСтруктуры.СуммаПлатежа - ЗначениеКорректировкиОкругления;
			ОшибкаОкругления = ОшибкаОкругления + ЗначениеКорректировкиОкругления;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаСтруктуры Из Объект.СтруктураДолга Цикл
		
		Если СтрокаСтруктуры.СуммаПлатежа > 0 Тогда
			СтрокаСтруктуры.СуммаПлатежа = СтрокаСтруктуры.СуммаПлатежа + (Объект.СуммаДолга - Объект.СтруктураДолга.Итог("СуммаПлатежа"));
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ТекстВопроса = НСтр("ru = 'Таблица будет очищена. Продолжить?'; uk = 'Таблиця буде очищена. Продовжити?'");
	Ответ = Вопрос(ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		Объект.СтруктураДолга.Очистить();
		
		ДатаНачисления = НачалоМесяца(Объект.ДатаНачалаРассрочки);
		
		Пока ДатаНачисления <= НачалоМесяца(Объект.ДатаЗавершенияРассрочки) Цикл
			ДобСтрока  = Объект.СтруктураДолга.Добавить();
			ДобСтрока.МесяцНачисления  = НачалоМесяца(ДатаНачисления);
			ДобСтрока.Коэффициент = 1;
			ДатаНачисления = ДобавитьМесяц(ДатаНачисления,1);
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ДатуЗапретаИзмененияДанных(Здание)

	  Запрос = Новый Запрос;
	  ЗАпрос.Текст = "ВЫБРАТЬ
	                 |	ДатыЗапретаИзменения.ДатаЗапрета,
	                 |	ДатыЗапретаИзменения.Объект
	                 |ИЗ
	                 |	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	                 |ГДЕ
	                 |	ДатыЗапретаИзменения.Объект = &Объект";
		Запрос.УстановитьПараметр("Объект",Здание);
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Возврат Выборка.ДатаЗапрета;
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
			

КонецФункции // ДатаЗапретаИзмененияДанных()


&НаСервереБезКонтекста
Функция ПолучитьСуммуРеструктуризации(ДатаРазрыва,ЛицевойСчет)

	 ЗАпрос = Новый Запрос;
	 Запрос.Текст =  "ВЫБРАТЬ
	                 |	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	                 |ИЗ
	                 |	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	                 |			&Период,
	                 |			Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
	                 |				И ЛицевойСчет = &ЛицевойСчет) КАК РасчетыПоЛицевымСчетамОстатки";
	Запрос.УстановитьПараметр("Период",ДатаРазрыва);
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	
	Результат = Запрос.Выполнить();
	
	Если  НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.СуммаОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;	 
		 

КонецФункции // ПолучитьСуммуРеструктуризации()


&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();
		
КонецПроцедуры

// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()

	Если Объект.ВидОперации = Перечисления.ВидыОперацийДоговораРеструктуризацииДолга.РасторжениеДоговора Тогда
		Элементы.Группа3.Видимость = Ложь;
		Элементы.Группа5.Видимость = Ложь;
		Элементы.Комментарий.Видимость = Истина;
	Иначе
		Элементы.Группа3.Видимость = Истина;
		Элементы.Группа5.Видимость = Истина;
		Элементы.Комментарий.Видимость = Ложь;

	КонецЕсли;	

КонецПроцедуры // УстановитьВидимостьИДоступность()



&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		Объект.СуммаДолга = ПолучитьСуммуРеструктуризации(Объект.Дата,Объект.ЛицевойСчет);
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если  НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Объект.ВидОперации = Перечисления.ВидыОперацийДоговораРеструктуризацииДолга.ЗаключениеДоговора;
	КонецЕсли;
	
	УстановитьВидимостьИДоступность();
КонецПроцедуры

