
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Печатать = ПроверитьВидОперации(ПараметрКоманды);
	Если Печатать Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ДоговорРеструктуризацииДолга", "ДоговорРеструктуризацииДолга", ПараметрКоманды, ПараметрыВыполненияКоманды, Неопределено);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСТР("ru = 'Для закрытых договоров печатная форма не доступна'; uk = 'Для закритих договорів друкарська форма не доступна'");
		Сообщение.Сообщить();
	КонецЕсли;	
	
КонецПроцедуры

 &НаСервере
Функция ПроверитьВидОперации(Ссылка)
  
  	Объект = Ссылка.ПолучитьОбъект();
	Если Объект.ВидОперации = Перечисления.ВидыОперацийДоговораРеструктуризацииДолга.ЗаключениеДоговора Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
  
КонецФункции // ()
  