
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПерейтиВГолосования = "Перейти в...";
	ПерейтиВЗапасы = "Перейти в...";
	ПерейтиВЛицевыеСчета = "Перейти в...";
	ПерейтиВНачисления = "Перейти в...";
	ПерейтиВПаспортныйСтол = "Перейти в...";
	ПерейтиВПриборыУчета= "Перейти в...";
	ПерейтиВСлужбу= "Перейти в...";
	
КонецПроцедуры


&НаКлиенте
Процедура ПаспортныйСтолКартинкаНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/ПаспортныйСтол/ОбщаяКоманда.ОткрытьМенюФункцийПаспортныйСтол");

КонецПроцедуры

&НаКлиенте
Процедура ПаспортныйСтолЗаголовокНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/ПаспортныйСтол/ОбщаяКоманда.ОткрытьМенюФункцийПаспортныйСтол");

КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаКартинкаНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/ЛицевыеСчета/ЖурналДокументов.ДокументыПоЛицевымСчетам.Команда.ОткрытьДокументыПоЛицевымСчетам");

КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаЗаголовокНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/ЛицевыеСчета/ЖурналДокументов.ДокументыПоЛицевымСчетам.Команда.ОткрытьДокументыПоЛицевымСчетам");

КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаКартинкаНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/ПриборыУчета/Справочник.ПриборыУчета.Команда.ОткрытьПриборыУчета");

КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаЗаголовокНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/ПриборыУчета/Справочник.ПриборыУчета.Команда.ОткрытьПриборыУчета");
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияКартинкаНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Начисления/ЖурналДокументов.ДокументыПоНачислениям.Команда.ОткрытьДокументыПоНачислениям");
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияЗаголовокНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Начисления/ЖурналДокументов.ДокументыПоНачислениям.Команда.ОткрытьДокументыПоНачислениям");

КонецПроцедуры

&НаКлиенте
Процедура АварийноДиспетчерскаяСлужбаКартинкаНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/АварийноДиспечерскаяСлужба/Документ.ЗаявкаНаПроведениеРемонта.Команда.ОткрытьЗаявку");
	
КонецПроцедуры

&НаКлиенте
Процедура АварийноДиспетчерскаяСлужбаЗаголовокНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/АварийноДиспечерскаяСлужба/Документ.ЗаявкаНаПроведениеРемонта.Команда.ОткрытьЗаявку");
	
КонецПроцедуры

&НаКлиенте
Процедура ГолосованияКартинкаНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Голосование/ЖурналДокументов.ДокументыПоГолосованию.Команда.ОткрытьДокументыПоГолосованию");
	
КонецПроцедуры

&НаКлиенте
Процедура ГолосованияЗаголовокНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Голосование/ЖурналДокументов.ДокументыПоГолосованию.Команда.ОткрытьДокументыПоГолосованию");

КонецПроцедуры

&НаКлиенте
Процедура ПаспортныйСтолПерейтиВПриИзменении(Элемент)
	
	Если ПерейтиВПаспортныйСтол = "Управление составом жильцов" Тогда
		ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/ПаспортныйСтол/Документ.УправлениеСоставомЖильцов.Команда.ОткрытьУправлениеСоставомЖильцов");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаПерейтиВПриИзменении(Элемент)
	
	Если ПерейтиВЛицевыеСчета = "Открытие лицевого счета" Тогда
		ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/ЛицевыеСчета/Документ.ОткрытиеЛицевогоСчета.Команда.ОткрытьОткрытиеЛицевогоСчета");
	ИначеЕсли ПерейтиВЛицевыеСчета = "Закрытие лицевого счета" Тогда
		ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/ЛицевыеСчета/Документ.ЗакрытиеЛицевогоСчета.Команда.ОткрытьЗакрытиеЛицевогоСчета");	
	ИначеЕсли ПерейтиВЛицевыеСчета = "Изменение лицевого счета" Тогда
		ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/ЛицевыеСчета/Документ.ИзменениеЛицевогоСчета.Команда.ОткрытьИзменениеЛицевогоСчета");			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачисленияПерейтиВПриИзменении(Элемент)
	
	Если ПерейтиВНачисления = "Начисления по лицевым счетам" Тогда
		ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Начисления/Документ.НачислениеПоЛС.Команда.ОткрытьНачисленияПоЛС");
	ИначеЕсли ПерейтиВНачисления = "Перерасчет по лицевым счетам" Тогда
		ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Начисления/Документ.ПерерасчетПоЛС.Команда.ОткрытьПерерасчетПоЛС");	
	ИначеЕсли ПерейтиВНачисления = "Разовые начисления услуг" Тогда
		ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Начисления/Документ.РазовоеНачислениеУслуг.Команда.ОткрытьРазовоеНачислениеУслуг");	
	ИначеЕсли ПерейтиВНачисления = "Распределение дополнительных начислений" Тогда
		ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Начисления/Документ.РаспределениеДополнительныхНачислений.Команда.ОткрытьРаспределениеДополнительныхНачислений");	
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаПерейтиВПриИзменении(Элемент)
	
	Если ПерейтиВПриборыУчета = "Управление приборами учета" Тогда
		ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/ПриборыУчета/Документ.УправлениеПриборамиУчета.Команда.ОткрытьУправлениеПриборамиУчета");
	ИначеЕсли ПерейтиВПриборыУчета = "Ввод показаний" Тогда
		ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/ПриборыУчета/Документ.ВводПоказанийПриборовУчета.Команда.ОткрытьВводПоказанийПриборовУчета"); 	
	ИначеЕсли ПерейтиВПриборыУчета = "Корректировка показаний приборов учета" Тогда
		ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/ПриборыУчета/Документ.КорректировкаПоказанийПриборовУчета.Команда.ОткрытьКорректировкаПоказанийПриборовУчета"); 	
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СлужбаПерейтиВПриИзменении(Элемент)
	
	Если ПерейтиВСлужбу = "Заявка на проведение ремонта" Тогда
		ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/АварийноДиспечерскаяСлужба/Документ.ЗаявкаНаПроведениеРемонта.Команда.ОткрытьЗаявку");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ГолосованиеПерейтиВПриИзменении(Элемент)
	Если ПерейтиВГолосования = "Голосование" Тогда
			ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Голосование/Документ.Голосование.Команда.ОткрытьГолосование");
	ИначеЕсли ПерейтиВГолосования = "Информационный лист для голосования" Тогда
			ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Голосование/Документ.ИнформационныйЛистДляГолосования.Команда.ОткрытьИнформационныйЛист");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПерейтиВПриИзменении(Элемент)
	
	Если ПерейтиВЗапасы = "Поступление запасов и услуг" Тогда
			ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Запасы/Документ.ПоступлениеЗапасовУслуг.Команда.ОткрытьПоступлениеЗапасовИУслуг");
	ИначеЕсли ПерейтиВЗапасы = "Перемещение запасов" Тогда
			ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Запасы/Документ.ПеремещениеЗапасов.Команда.ОткрытьПеремещениеЗапасов");
	ИначеЕсли ПерейтиВЗапасы = "Инвентаризация запасов" Тогда
			ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Запасы/Документ.ИнвентаризацияЗапасов.Команда.ОткрытьИнвентаризацияЗапасов");
	ИначеЕсли ПерейтиВЗапасы = "Установка цен номенклатуры" Тогда
			ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Запасы/Документ.УстановкаЦенНоменклатуры.Команда.ОткрытьУстановкаЦенНоменклатуры");		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыЗаголовокНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Запасы/ЖурналДокументов.ДокументыПоЗапасам.Команда.ОткрытьДокументыПоЗапасам");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыКартинкаНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("e1cib/navigationpoint/Запасы/ЖурналДокументов.ДокументыПоЗапасам.Команда.ОткрытьДокументыПоЗапасам");

КонецПроцедуры



