
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = ПутьКФайлу;
	Фильтр = "Электронная таблица Excel(*.xls)|*.xls";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)

   Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить("Не удалось подключиться" + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(ПутьКФайлу);
	
	Excel.Sheets(1).select();
	КоличествоСтрок = Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик=2 По КоличествоСтрок Цикл
		
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.ЛицевойСчет = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.ПриборУчета = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.Показание =   Excel.Cells(Счетчик, 3).Value
	КонецЦикла;
	
	Excel.Workbooks.Close();
 	
	Закрыть(ВыполнитьВозварат());

КонецПроцедуры


&НаСервере
Функция ВыполнитьВозварат()

	 Возврат ПоместитьВоВременноеХранилище(Таблица.Выгрузить());

КонецФункции // ВыполнитьВозварат()()

&НаКлиенте
Процедура ЗакрытьОкно(Команда)

	  Закрыть();
КонецПроцедуры



