
&НаКлиенте
Процедура УправлениеСоставомЖильцовНажатие(Элемент)
	
	ОткрытьФорму("Документ.УправлениеСоставомЖильцов.Форма.ФормаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ТалонПрибытияНажатие(Элемент)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ТалонПрибытия", Неопределено, Неопределено, Неопределено);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеоРегистрацииНажатие(Элемент)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ЗаявлениеОРегистрации", Неопределено, Неопределено, Неопределено);	
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеСоставомЖильцов2Нажатие(Элемент)
	
	ОткрытьФорму("Документ.УправлениеСоставомЖильцов.Форма.ФормаСписка");

КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаНажатие(Элемент)
	
	ОткрытьФорму("Справочник.ФизическиеЛица.Форма.ФормаСписка");

КонецПроцедуры

&НаКлиенте
Процедура ПотребителиУслугНажатие(Элемент)
	
	ОткрытьФорму("Справочник.ПотребителиУслуг.Форма.ФормаСписка");	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеОСнятииСРегистрацииНажатие(Элемент)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ЗаявлениеОВыписке", Неопределено, Неопределено, Неопределено);	

КонецПроцедуры

&НаКлиенте
Процедура ТалонУбытияНажатие(Элемент)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ТалонУбытия", Неопределено, Неопределено, Неопределено);	
	
КонецПроцедуры

&НаКлиенте
Процедура СправкаОСоставеСемьиНажатие(Элемент)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "СправкаОСоставеСемьи", Неопределено, Неопределено, Неопределено);	

КонецПроцедуры

&НаКлиенте
Процедура ФормаА1Нажатие(Элемент)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ФормаА1", Неопределено, Неопределено, Неопределено);	

КонецПроцедуры

&НаКлиенте
Процедура СправкаОПропискеНажатие(Элемент)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "СправкаОПрописке", Неопределено, Неопределено, Неопределено);	

КонецПроцедуры


&НаКлиенте
Процедура ДобавитьФизЛицоНажатие(Элемент)
	
	ОткрытьФорму("Справочник.ФизическиеЛица.Форма.ФормаЭлемента");
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьПотребителяНажатие(Элемент)
	
	ОткрытьФорму("Справочник.ПотребителиУслуг.Форма.ФормаЭлемента");
	
КонецПроцедуры

