////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Взаимодействия.ПользовательЯвляетсяОтветственнымЗаВедениеПапок(Владелец) Тогда
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Данная операция досупна только ответственному за ведение папок для данной учетной записи';uk='Ця операція досупна тільки відповідальному за ведення тек для цього облікового запису'"),
	                                                  Ссылка,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры
