
&НаКлиенте
Процедура НомерПодъездаПриИзменении(Элемент)
	
	Если Объект.Вид = "Подъезд" Тогда
		Объект.Наименование = "Подъезд № " + Объект.НомерПодъезда + Объект.Суффикс;
	Иначе
		Объект.Наименование = "Секция № " + Объект.НомерПодъезда + Объект.Суффикс;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СуффиксПриИзменении(Элемент)
	Если Объект.Вид = "Подъезд" Тогда
		Объект.Наименование = "Подъезд № " + Объект.НомерПодъезда + Объект.Суффикс;
	Иначе
		Объект.Наименование = "Секция № " + Объект.НомерПодъезда + Объект.Суффикс;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
		Объект.Наименование = Элементы.Вид.ТекстРедактирования + " № " + Объект.НомерПодъезда + Объект.Суффикс;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьИДоступность();
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВариантКоттеджныйПоселок") Тогда
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ЭтаФорма.Заголовок = НСтр("ru='Улица (создание)';uk='Вулиця (створення)'");
		Иначе
			ЭтаФорма.Заголовок = Объект.Наименование + НСтр("ru=' (Улица)';uk=' (Вулиця)'");
		КонецЕсли;
		
	ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьВариантГород") И Объект.Владелец.ТипСооружения = Перечисления.ТипыСооружений.ГруппаЗданий Тогда
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ЭтаФорма.Заголовок = НСтр("ru='Улица (создание)';uk='Вулиця (створення)'");
		Иначе
			ЭтаФорма.Заголовок = Объект.Наименование + НСтр("ru=' (Улица)';uk=' (Вулиця)'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВариантКоттеджныйПоселок") Тогда
		
		Элементы.Вид.Видимость = Ложь;
		Элементы.Суффикс.Видимость = Ложь;
		Элементы.НомерПодъезда.Видимость = Ложь;
		Элементы.КоличествоЭтажей.Видимость = Ложь;
		Элементы.Наименование.Видимость = Ложь;
		
		Элементы.Владелец.Заголовок = НСтр("ru='Коттеджный поселок';uk='Котеджне селище'");
		Элементы.НомерПервойКвартиры.Заголовок = НСтр("ru='Номера коттеджей с';uk='Номери котеджів з'");
		Элементы.НомерПоследнейКвартиры.Заголовок = НСтр("ru='по';uk='по'");
		
		Элементы.Владелец.Подсказка = НСтр("ru='Коттеджный поселок';uk='Котеджне селище'");
		Элементы.НомерПервойКвартиры.Подсказка = НСтр("ru='Номера коттеджей с';uk='Номери котеджів з'");
		Элементы.НомерПоследнейКвартиры.Подсказка = НСтр("ru='по';uk='по'");
		
	ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьВариантГород") И Объект.Владелец.ТипСооружения = Перечисления.ТипыСооружений.ГруппаЗданий Тогда
		
		Элементы.Вид.Видимость = Ложь;
		Элементы.Суффикс.Видимость = Ложь;
		Элементы.НомерПодъезда.Видимость = Ложь;
		Элементы.КоличествоЭтажей.Видимость = Ложь;
		Элементы.Наименование.Видимость = Ложь;
		
		Элементы.Владелец.Заголовок = НСтр("ru='Группа зданий (поселок)';uk='Група будівель (селище)'");
		Элементы.НомерПервойКвартиры.Заголовок = НСтр("ru='Номера коттеджей с';uk='Номери котеджів з'");
		Элементы.НомерПоследнейКвартиры.Заголовок = НСтр("ru='по';uk='по'");
		
		Элементы.Владелец.Подсказка = НСтр("ru='Группа зданий (поселок)';uk='Група будівель (селище)'");
		Элементы.НомерПервойКвартиры.Подсказка = НСтр("ru='Номера коттеджей с';uk='Номери котеджів з'");
		Элементы.НомерПоследнейКвартиры.Подсказка = НСтр("ru='по';uk='по'");
		
	Иначе
		Элементы.Наименование1.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьИДоступность()
