
// Состояние лицензии
Функция СостояниеЛицензии(Лицензия) Экспорт
	Если Лицензия.Enabled Тогда
		Возврат "Доступен";
	ИначеЕсли Лицензия.Expired Тогда
		Возврат "Срок действия истек";
	ИначеЕсли НЕ Лицензия.Workable Тогда
		Возврат "Недоступен: " + ?(Лицензия.Type = "USB", "Аппаратный ключ неисправен", "Изменена конфигурация компьютера");
	Иначе
		Возврат "Недоступен (?)";
	КонецЕсли; 	
КонецФункции

Функция ПолучитьФлаги(Флаги)
	Стр = "";
	Для каждого Флаг Из Флаги Цикл
		Стр = Стр + ? (Флаг, "1", "0");
	КонецЦикла; 
	Возврат Стр;
КонецФункции // ()

Функция ТипКлюча(Тип) Экспорт
	Если Тип = 3 Тогда
		Возврат "Основной"
	ИначеЕсли Тип = 4 Тогда
		Возврат "Дополнительный"
	ИначеЕсли Тип = 5 Тогда
		Возврат "Демонстрационный"
	Иначе
		Возврат "Неизвестный тип (" + Строка(Тип) + ")";
	КонецЕсли
КонецФункции

// Получение значения по имени поля, применяестя для полей, которых может 
// не быть предыдущих версиях
Функция ПолучитьЗначениеПоля(Структура, Поле, ЗначениеПоУмолчанию = Неопределено)
	Для каждого Элемент из Структура Цикл
		Если Элемент.Ключ = Поле Тогда
			Возврат Элемент.Значение;
		КонецЕсли;
	КонецЦикла;
	Возврат ЗначениеПоУмолчанию;
КонецФункции

Функция ПараметрКлюча(Наименование, Значение)
	Возврат ?(Значение <> "", Наименование + " " + Значение + ", ", "");
КонецФункции

// Краткое описание лицензии
Функция ОписаниеЛицензии(Лицензия, ПоказатьСостояние = Истина) Экспорт
	
	Стр = 
		"С/Н " + Формат(Лицензия.KeyNo, "ЧГ=0") + ", " + 
		?(Лицензия.Type = "USB", Лицензия.Type, "Программный") + " (" + Лицензия.Version + "), ";
	
	Если Лицензия.IsBlank Тогда
		Стр = Стр + 
			"Неактивированный ключ (болванка)";
	Иначе
		Если Лицензия.Workable Тогда
			Стр = Стр +
				ПараметрКлюча("Рег.№", Формат(Лицензия.RegNo, "ЧГ=0")) + 
				ПараметрКлюча("ИНН", Формат(Лицензия.ITN, "ЧГ=0")) + 
				ПараметрКлюча("КПП", Формат(Лицензия.IEC, "ЧГ=0")) +
				ПараметрКлюча("Флаги", ?(Найти(Лицензия.Flags, "1") > 0, Лицензия.Flags, "")) +
				ПараметрКлюча("Версия продукта", ?(Лицензия.ProductVersion > 0, Лицензия.ProductVersion, ""));
			Сервис = ПолучитьЗначениеПоля(Лицензия, "ServiceType", 0);
			Стр = Стр +
				ПараметрКлюча("Сервис", ? (Сервис > 0, Сервис, ""));
		КонецЕсли;
		  
		Стр = Стр + 
			ТипКлюча(Лицензия.KeyType) + " (Лицензий: " + Формат(Лицензия.LicenceCount, "ЧГ=0") + ")";
	КонецЕсли;
	
	Стр = Стр + 
		?(ПоказатьСостояние, " - " + СостояниеЛицензии(Лицензия), "");
	
	Возврат Стр;
КонецФункции

// Все поля струкутуры в виде строки
Функция СтруктураВСтроку(Структура, РазделительЗначений = ": ", РазделительПолей = ", ") Экспорт
		Стр = "";
		Для каждого Поле Из Структура Цикл
			Стр = Стр + ?(Стр <> "", РазделительПолей, "") + Поле.Ключ + РазделительЗначений;// + Поле.Значение;
			Если ТипЗнч(Поле.Значение) = Тип("ФиксированнаяСтруктура") Тогда
				Стр = Стр + "(" + СтруктураВСтроку(Поле.Значение, РазделительЗначений, РазделительПолей) + ")";
			Иначе
				Стр = Стр + Поле.Значение;
			КонецЕсли;
		КонецЦикла; 
		Возврат Стр;
КонецФункции // ()

// Извлечение имени класса исключения из описания ошибки
Функция ПолучитьКлассИсключения(ОписаниеОшибки) Экспорт
	С = ОписаниеОшибки;
	Н = Найти(С, "(E");
	Если Н > 0 Тогда
		С = Прав(С, СтрДлина(С) - Н);
		Н = Найти(С, ")");
	КонецЕсли;
	Если Н > 1 Тогда
		Возврат Лев(С, Н - 1);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

// Контрольная сумма строки для телефонной активации
Функция КонтрольнаяСумма(Строка) Экспорт
	Результат = 0;
	Индекс = 0;
	Длина = СтрДлина(Строка);
	Для С = 1 по Длина Цикл
		Код = КодСимвола(Строка, С);
		Если Код >= 48 И Код <= 58 Тогда
			Результат = Результат + Код + Индекс;	
			Индекс = Индекс + 1;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Результат % 256;
КонецФункции

Функция ИзвлечьНомер(Стр, Разделитель)
	Номер = -1;
	Если Стр > "" Тогда
		Н = Найти(Стр, Разделитель);
      	Если Н > 0 Тогда
        	Номер = Число(Лев(Стр, Н - 1));
        	Стр = Прав(Стр, СтрДлина(Стр) - Н);
		Иначе
        	Номер = Число(Стр);
			Стр = "";
    	КонецЕсли;
	КонецЕсли;
	Возврат Номер;
КонецФункции

Функция СравнитьВерсииВнутр(Версия1, Версия2, Разделитель) 
    Н1 = ИзвлечьНомер(Версия1, Разделитель);
    Н2 = ИзвлечьНомер(Версия2, Разделитель);
    Если Н1 = -1 И (Н1 = Н2) Тогда
    	Возврат 0;
    ИначеЕсли Н1 = Н2 Тогда
      	Возврат СравнитьВерсииВнутр(Версия1, Версия2, Разделитель)
    ИначеЕсли Н1 > Н2 Тогда
      	Возврат  1;
    ИначеЕсли Н1 < Н2 Тогда
      	Возврат -1;
	КонецЕсли;
КонецФункции

// Сравнение версий в виде строки
Функция СравнитьВерсии(Версия1, Версия2, Разделитель = ".") Экспорт
	В1 = Версия1;
	В2 = Версия2;
	Возврат СравнитьВерсииВнутр(В1, В2, Разделитель);
	
//	Массив1 = СтрРазделить(Версия1, Разделитель);
//	Массив2 = СтрРазделить(Версия2, Разделитель);
//	
//	Результат = 0;
//	ЧислоРазрядов = ?(Массив1.Количество() <= Массив2.Количество(), Массив1.Количество(), Массив2.Количество());
//	Для Разряд = 0 По ЧислоРазрядов - 1 Цикл
//		Результат = Число(Массив1[Разряд]) - Число(Массив2[Разряд]);
//		Если Результат <> 0 Тогда
//			Возврат Результат;
//		КонецЕсли;
//	КонецЦикла;
//	Возврат Результат;
	
КонецФункции
