
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок                   = "Виберіть файл";
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
	    Объект.Файл = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	Объект.ТаблицаДанных.Очистить();
	Текст = Новый ТекстовыйДокумент;
	Текст.Прочитать(Объект.Файл);
	Для НомерСтроки = 2 По Текст.КоличествоСтрок() Цикл
		ТекСтрока = Текст.ПолучитьСтроку(НомерСтроки);
		МассивСлов = СтрРазделить(ТекСтрока, ";");
		Если МассивСлов.Количество() < 20 Тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтрока = Объект.ТаблицаДанных.Добавить();
		НоваяСтрока.ID       = МассивСлов[0];
		НоваяСтрока.OZN      = МассивСлов[1];
		НоваяСтрока.CDPR     = МассивСлов[2];
		НоваяСтрока.NCARD    = МассивСлов[3];
		НоваяСтрока.OSOB     = МассивСлов[4];
		НоваяСтрока.EIS      = МассивСлов[5];
		НоваяСтрока.FIO      = МассивСлов[6];
		НоваяСтрока.IDPIL    = МассивСлов[7];
		НоваяСтрока.INDEX    = МассивСлов[8];
		НоваяСтрока.CDUL     = МассивСлов[9];
		НоваяСтрока.UL       = МассивСлов[10];
		НоваяСтрока.HOUSE    = МассивСлов[11];
		НоваяСтрока.BLILD    = МассивСлов[12];
		НоваяСтрока.APT      = МассивСлов[13];
		НоваяСтрока.PLZAG    = МассивСлов[14];
		НоваяСтрока.PLOPAL   = МассивСлов[15];
		НоваяСтрока.ZABORG   = МассивСлов[16];
		НоваяСтрока.COD      = МассивСлов[17];
		НоваяСтрока.PIDTVERD = МассивСлов[18];
		НоваяСтрока.TARIF    = МассивСлов[19];
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Для Каждого стр Из Объект.ТаблицаДанных Цикл
		_ЛицевойСчет = СтрЗаменить(стр.OSOB, """", "");
		ЛицевойСчет = ОбщийМодульМВК.ПолучитьЛС(СтрЗаменить(_ЛицевойСчет, Символы.НПП, ""));
		Если ЛицевойСчет = Неопределено Тогда
			стр.TARIF = 0.00;
			стр.ZABORG = 0.00;
			стр.PIDTVERD = 0;
		Иначе
			УслугиЛС    = ОбщийМодульМВК.ПолучитьУслуги(ЛицевойСчет, Объект.Период);
			УслугиЛС.Свернуть("УслугаКодУслугиПФУ");
			Если УслугиЛС.Количество() <> 0 Тогда
				Услуга = УслугиЛС.Найти(СтрЗаменить(стр.COD, """", ""));
				Если Услуга <> Неопределено Тогда
					Тариф = ОбщийМодульМВК.ПолучитьТарифПоУслугеДляПФУ(Услуга.УслугаКодУслугиПФУ, ЛицевойСчет.Владелец);
					стр.TARIF = Тариф.ЗначениеТарифа;
					стр.ZABORG = "0";   //ОбщийМодульМВК.ПолучитьОстаткиДляПФУ(ДобавитьМесяц(Объект.Период, -1), ЛицевойСчет, Услуга.УслугаКодУслугиПФУ);
					стр.PIDTVERD = "1";
				Иначе
					стр.TARIF = 0.00;
					стр.ZABORG = 0.00;
					стр.PIDTVERD = 0;
				КонецЕсли;
			КонецЕсли;;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВФайл(Команда)
	Разделитель = ";";
	Таблица = Объект.ТаблицаДанных;
	Текст = "";
	Для Каждого Запись из Таблица Цикл
		Если Текст = "" Тогда
			Текст = СоздатьЗаголовки(Таблица, Разделитель) + Символы.ПС;
		КонецЕсли;
		Текст = Текст + Запись.ID + Разделитель + Запись.OZN + Разделитель + Запись.CDPR + Разделитель + Запись.NCARD + Разделитель +
		        Запись.OSOB + Разделитель + Запись.EIS + Разделитель + Запись.FIO + Разделитель + Запись.IDPIL + Разделитель +
				Запись.INDEX + Разделитель + Запись.CDUL + Разделитель + Запись.UL + Разделитель + Запись.HOUSE + Разделитель +
				Запись.BLILD + Разделитель + Запись.APT + Разделитель + Запись.PLZAG + Разделитель + Запись.PLOPAL + Разделитель +
				СтрЗаменить(Запись.ZABORG, Символы.НПП, "") + Разделитель + Запись.COD + Разделитель + Запись.PIDTVERD + Разделитель + СтрЗаменить(Запись.TARIF, Символы.НПП, "") + Символы.ПС;
	КонецЦикла;
	Кодировка = КодировкаТекста.ANSI;
	ТекстовыйФайлЗапись = Новый ЗаписьТекста(Объект.Файл, Кодировка);
	ТекстовыйФайлЗапись.Записать(Текст);
	ТекстовыйФайлЗапись.Закрыть();
КонецПроцедуры

&НаСервере
Функция СоздатьЗаголовки(ТаблицаДокументов, Разделитель)
	НоваяТаблица = ТаблицаДокументов.Выгрузить();
	КолонкиТЗ = НоваяТаблица.Колонки;
	Для каждого Колонка Из КолонкиТЗ Цикл
		Если Колонка.Имя = "НомерСтроки" ИЛИ Колонка.Имя = "ИсходныйНомерСтроки" Тогда
			Продолжить;
		Иначе
		    СтрКолонки = "" + СтрКолонки + Колонка.Имя + Разделитель;
		КонецЕсли;
	КонецЦикла; 
	Возврат СтрКолонки;
КонецФункции
