////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ОплатаУслугМВК.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
    // Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ПроведениеСервер.ОтразитьРасчетыПоЛицевымСчетам(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьДенежныеСредства(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьВзаиморасчетыПоСубсидиям(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьВзаиморасчетыПоЛьготам(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьВзаиморасчетыПоРегиональнымСубсидиям(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	//Документы.ОплатаУслугМВК.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
	// Создадим документ корректировки показаний приборов учета
	//Для Каждого стр Из РасшифровкаПлатежа Цикл
	//	Если стр.ТекущиеПоказания <> 0 Тогда
	//		Док = Документы.ВводПоказанийПриборовВоды.СоздатьДокумент();
	//		Док.Дата = Дата;
	//		Док.ЛицевойСчет = ЛицевойСчет;
	//		Док.Здание = ЛицевойСчет.Владелец;
	//		Док.Комментарий = НСтр("ru = 'Создано автоматически документом ""Оплата услуг МВК"".'; uk = 'Створено автоматично документом ""Оплата послуг МВК"".'");
	//		Док.Организация = Организация;
	//		Док.ПериодНачисления = Док.Дата;

	//		НовСтр = Док.ПриборыУчета.Добавить();
	//		НовСтр.ВидТарифа = Перечисления.ВидыТарифов.Общий;
	//		НовСтр.Источник = Перечисления.ИсточникиПоказаний.Банк;
	//		НовСтр.ПриборУчета = стр.НомерСчетчика;		
	//		Если стр.ТекущиеПоказания = 0 Тогда
	//			НовСтр.ТекущиеПоказания = НовСтр.ПредыдущиеПоказания;
	//		Иначе
	//			НовСтр.ТекущиеПоказания = стр.ТекущиеПоказания;
	//		КонецЕсли;
	//		НовСтр.ПредыдущиеПоказания = стр.ПредыдущиеПоказания;
	//		НовСтр.КвоКубов = стр.ТекущиеПоказания - стр.ПредыдущиеПоказания;
	//		НовСтр.Услуга = стр.Услуга;
	//		Попытка
	//			Док.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	//		Исключение
	//			Док.Записать();
	//			Сообщение = Новый СообщениеПользователю;
	//			Сообщение.Текст = НСтр("ru = 'Не удалось провести документ '; uk = 'Не вдалося провести документ '" + Док.Ссылка); 
	//			Сообщение.Сообщить();
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Для Каждого стр Из РасшифровкаПлатежа Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		    "ВЫБРАТЬ
		    |	ВводПоказанийПриборовВоды.Ссылка
		    |ИЗ
		    |	Документ.ВводПоказанийПриборовВоды КАК ВводПоказанийПриборовВоды
		    |ГДЕ
		    |	ВводПоказанийПриборовВоды.ЛицевойСчет = &ЛицевойСчет
		    |	И ВводПоказанийПриборовВоды.Дата = &Дата
		    |	И ВводПоказанийПриборовВоды.Проведен = ИСТИНА";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
		Запрос.УстановитьПараметр("Дата", Дата);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокВВодПоказаний = Выборка.Ссылка.ПолучитьОбъект();
			ДокВВодПоказаний.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			ДокВВодПоказаний.ПометкаУдаления = ИСТИНА;
			ДокВводПоказаний.Записать();
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры