////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаСервере
// Устанавливает текущую страницу для типа денежных средств.
//
// Параметры:
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операции
//
Процедура УстановитьТекущуюСтраницу()
	
	Если Объект.ТипДенежныхСредств = СтруктураТипыДенежныхСредств.Безналичные Тогда
		
		Элементы.БанковскийСчет.Доступность = Истина;
		Элементы.БанковскийСчет.Видимость 	= Истина;
		Элементы.Касса.Видимость 			= Ложь;
		
	ИначеЕсли Объект.ТипДенежныхСредств = СтруктураТипыДенежныхСредств.Наличные Тогда
		
		Элементы.Касса.Доступность 			= Истина;
		Элементы.БанковскийСчет.Видимость 	= Ложь;
		Элементы.Касса.Видимость 			= Истина;
		
	Иначе
		
		Элементы.БанковскийСчет.Доступность = Ложь;
		Элементы.Касса.Доступность 			= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьТекущуюСтраницу()

&НаСервере
// Устанавливает текущую страницу для типа денежных средств.
//
// Параметры:
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операции
//
Процедура УстановитьТекущуюСтраницуПолучателя()
	
	Если Объект.ТипДенежныхСредствПолучатель = СтруктураТипыДенежныхСредств.Безналичные Тогда
		
		Элементы.БанковскийСчетПолучатель.Доступность 	= Истина;
		Элементы.БанковскийСчетПолучатель.Видимость 	= Истина;
		Элементы.КассаПолучатель.Видимость 				= Ложь;
		
	ИначеЕсли Объект.ТипДенежныхСредствПолучатель = СтруктураТипыДенежныхСредств.Наличные Тогда
		
		Элементы.КассаПолучатель.Доступность 			= Истина;
		Элементы.БанковскийСчетПолучатель.Видимость 	= Ложь;
		Элементы.КассаПолучатель.Видимость 				= Истина;
		
	Иначе
		
		Элементы.БанковскийСчетПолучатель.Доступность 	= Ложь;
		Элементы.КассаПолучатель.Доступность 			= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьТекущуюСтраницуПолучателя()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);

	СтруктураТипыДенежныхСредств = Новый Структура;
	СтруктураТипыДенежныхСредств.Вставить("Безналичные", Перечисления.ТипыДенежныхСредств.Безналичные);
	СтруктураТипыДенежныхСредств.Вставить("Наличные", Перечисления.ТипыДенежныхСредств.Наличные);
	
	ВалютаДенежныхСредств = Константы.ВалютаУчета.Получить();
	
	УстановитьТекущуюСтраницу();
	УстановитьТекущуюСтраницуПолучателя();
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры


&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода ТипДенежныхСредств.
//
Процедура ТипДенежныхСредствПриИзменении(Элемент)
	
	УстановитьТекущуюСтраницу();
	
КонецПроцедуры // ТипДенежныхСредствПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода ТипДенежныхСредствПолучатель.
//
Процедура ТипДенежныхСредствПолучательПриИзменении(Элемент)
	
	УстановитьТекущуюСтраницуПолучателя();
	
КонецПроцедуры // ТипДенежныхСредствПолучательПриИзменении()

