
&НаСервере
Функция ПроверитьЗакрытиеМесяца()
	Здание = Справочники.ЗданияИСооружения.НайтиПоКоду("000001239");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗакрытиеМесяца.Проведен
	|ИЗ
	|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
	|ГДЕ
	|	ЗакрытиеМесяца.Организация = &Организация
	|	И ЗакрытиеМесяца.Здание = &Здание
	|	И МЕСЯЦ(ЗакрытиеМесяца.Дата) = &Месяц
	|	И ГОД(ЗакрытиеМесяца.Дата) = &Год";
	
	Запрос.УстановитьПараметр("Год", Год(Объект.МесяцНачислений));
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("Месяц", Месяц(Объект.МесяцНачислений));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	МесяцЗакрыт = Ложь;
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Проведен Тогда
			МесяцЗакрыт = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МесяцЗакрыт;
	
КонецФункции

&НаКлиенте
Процедура МногоквартирныеПриИзменении(Элемент)
	Если Объект.Многоквартирные = Истина Тогда
	    ЭтаФорма.Элементы.Здание.ТолькоПросмотр = Истина;
	Иначе
		ЭтаФорма.Элементы.Здание.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос = Новый Запрос;
	Если Объект.Многоквартирные = Истина Тогда
		Условие = " И ЗданияИСооружения.МногоКвартирный = ИСТИНА";
	Иначе
		Условие = " И ЗданияИСооружения.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Объект.Здание);
	КонецЕсли;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ЗданияИСооружения.Наименование КАК Здание,
	    |	ЗданияИСооружения.Ссылка
	    |ИЗ
	    |	Справочник.ЗданияИСооружения КАК ЗданияИСооружения
	    |ГДЕ
	    |	ЗданияИСооружения.ПометкаУдаления = ЛОЖЬ" + Условие + "";
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого стр Из Результат Цикл
		Запрос = Новый Запрос;
		Запрос.Текст =
		    "ВЫБРАТЬ
		    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет
		    |ИЗ
		    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(
		    |			&НаДату,
		    |			Действует = ИСТИНА
		    |				И ЛицевойСчет.Владелец = &Здание) КАК ЛицевыеСчетаСрезПоследних";
		Запрос.УстановитьПараметр("НаДату", Объект.МесяцНачислений);
		Запрос.УстановитьПараметр("Здание", стр.Ссылка);
		ЛицСчета = Запрос.Выполнить().Выбрать();
		Пока ЛицСчета.Следующий() Цикл
			НовСтрока = Объект.ЛицевыеСчета.Добавить();
			НовСтрока.Здание = стр.Ссылка;
			НовСтрока.ЛицевойСчет = ЛицСчета.ЛицевойСчет;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.МесяцНачислений = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	
	ОтображениеПериодаНачисления = Формат(ЭтаФорма.Объект.МесяцНачислений, "ДФ='MMMM yyyy'");
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	УстановитьСписокСчетов();
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокСчетов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Организация);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Объект.БанковскиеСчета.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.БанковскиеСчета.Добавить();
		НоваяСтрока.Печать = Истина;
		НоваяСтрока.БанковскийСчет = Выборка.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Сообщить(НСтр("ru='Поле ""Организация"" не заполнено';uk='Полі ""Організація"" не заповнено'"));
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.МесяцНачислений) Тогда
		Сообщить(НСтр("ru='Поле ""МесяцНачислений"" не заполнено';uk='Полі ""МесяцНачислений"" не заповнено'"));
		Возврат;
	Иначе
		МесяцЗакрыт = ПроверитьЗакрытиеМесяца();
		Если НЕ МесяцЗакрыт Тогда
			Сообщить(НСтр("ru='Месяц не закрыт!';uk='Місяць не закритий!'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ГрупповаяПечать();
КонецПроцедуры

&НаКлиенте
Процедура ГрупповаяПечать()
	ТипМакета = "МакетКвитанцииНаОплатуУпрощенная";
	СчетчикСтатус = 0;
	Список = Новый СписокЗначений;
	Список.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЛицевыеСчета");
	Для каждого Строка из Объект.ЛицевыеСчета Цикл
		Список.Добавить(Строка.ЛицевойСчет);
		МассивОбъектов = Новый Массив;
		Структура = Новый Структура;
		Структура.Вставить("Счет", Список);
		Структура.Вставить("Месяц", Объект.МесяцНачислений);
		Структура.Вставить("БанковскийСчет", Объект.БанковскиеСчета);
		МассивОбъектов.Добавить(Структура);
		//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьКвитанций", ТипМакета, МассивОбъектов, ЭтаФорма, Неопределено);
		//Список.Очистить();
		//МассивОбъектов.Очистить();
		//СчетчикСтатус = СчетчикСтатус+1;
		//Состояние(Нстр("ru = 'Выполняется формирование квитанций'; uk = 'Виконується формування квитанцій'"),Окр(СчетчикСтатус/Мин(КоличествоВГруппеНаПечать,КонСтрока)*100));
	КонецЦикла;
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьКвитанций", ТипМакета, МассивОбъектов, ЭтаФорма, Неопределено);
КонецПроцедуры