
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРазовоеНачислениеУслуг, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	КОНЕЦПЕРИОДА(РазовоеНачислениеУслугЛицевыеСчета.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Период,
		|	РазовоеНачислениеУслугЛицевыеСчета.Ссылка.Организация,
		|	НАЧАЛОПЕРИОДА(РазовоеНачислениеУслугЛицевыеСчета.Ссылка.ПериодНачисления, МЕСЯЦ) КАК МесяцНачисления,
		|	РазовоеНачислениеУслугЛицевыеСчета.Ссылка.Услуга,
		|	РазовоеНачислениеУслугЛицевыеСчета.ЛицевойСчет,
		|	РазовоеНачислениеУслугЛицевыеСчета.Количество,
		|	РазовоеНачислениеУслугЛицевыеСчета.Тариф,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РазовоеНачисление) КАК ВидНачисления,
		|	РазовоеНачислениеУслугЛицевыеСчета.СуммаНачислено КАК Сумма,
		|	ДЕНЬ(КОНЕЦПЕРИОДА(РазовоеНачислениеУслугЛицевыеСчета.Ссылка.ПериодНачисления, МЕСЯЦ)) КАК ДнейНачислено
		|ИЗ
		|	Документ.РазовоеНачислениеУслуг.ЛицевыеСчета КАК РазовоеНачислениеУслугЛицевыеСчета
		|ГДЕ
		|	РазовоеНачислениеУслугЛицевыеСчета.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРазовоеНачислениеУслуг);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЛицевымСчетам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры


// Выполняет контроль повторного начисления.
//
Процедура ВыполнитьКонтрольПовторногоНачисления(ДокументСсылкаРазовоеНачислениеУслуг, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Если СтруктураВременныеТаблицы.ДвиженияРасчетыПоЛицевымСчетамИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасчетыПоЛицевымСчетамОбороты.Регистратор КАК Регистратор
		|ИЗ
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение КАК ДвиженияРасчетыПоЛицевымСчетамИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(
		|				,
		|				,
		|				Регистратор,
		|				(Организация, ЛицевойСчет, Услуга, МесяцНачисления) В
		|					(ВЫБРАТЬ
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация КАК Организация,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет КАК ЛицевойСчет,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга КАК Услуга,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления КАК МесяцНачисления
		|					ИЗ
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение КАК ДвиженияРасчетыПоЛицевымСчетамИзменение)) КАК РасчетыПоЛицевымСчетамОбороты
		|		ПО ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация = РасчетыПоЛицевымСчетамОбороты.Организация
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет = РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга = РасчетыПоЛицевымСчетамОбороты.Услуга
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления = РасчетыПоЛицевымСчетамОбороты.МесяцНачисления
		|ГДЕ
		|	РасчетыПоЛицевымСчетамОбороты.Регистратор <> &Ссылка
		|	И РасчетыПоЛицевымСчетамОбороты.Регистратор ССЫЛКА Документ.НачислениеПоЛС");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРазовоеНачислениеУслуг);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ДокументОбъектРазовоеНачислениеУслуг = ДокументСсылкаРазовоеНачислениеУслуг.ПолучитьОбъект();
			
			ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
			ОСМДСервер.СообщитьОбОшибкахПроведенияПоПовторномуНачислению(ДокументОбъектРазовоеНачислениеУслуг, ВыборкаИзРезультатаЗапроса, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
