Перем ИзменениеТарифности_Контроль;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//Объект.ОбщедомовойСчетчик = Ложь;
	Если ЗначениеЗаполнено(Объект.Услуга) И Не ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) Тогда
		Объект.ЕдиницаИзмерения = Объект.Услуга.ЕдиницаИзмерения;
		Объект.Коэффициент =1;
	КонецЕсли;
	
КонецПроцедуры

// Получает набор данных с сервера для процедуры УслугаПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеУслугаПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Услуга.ЕдиницаИзмерения);
		
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеУслугаПриИзменении()

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Услуга", Объект.Услуга);
	
	СтруктураДанные = ПолучитьДанныеУслугаПриИзменении(СтруктураДанные);
	
	Объект.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	Объект.Коэффициент =1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ОбщедомовойСчетчик = Истина Тогда
		Элементы.Здание.Видимость = Истина;
	Иначе
		Элементы.Здание.Видимость = Ложь;
	КонецЕсли;
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Если ЗначениеЗаполнено(Объект.Тарифность)И
		НЕ Объект.Ссылка.Пустая()  Тогда
		ЕстьПоказания = ПроверитьНаНаличиеПоказаний(Объект.Ссылка);
		Если ЕстьПоказания Тогда
			Элементы.Тарифность.ТолькоПросмотр = Истина;
		Иначе
			Элементы.Тарифность.ТолькоПросмотр = Ложь;
		КонецЕсли;
	Иначе	
		Элементы.Тарифность.ТолькоПросмотр = Ложь;
	КонецЕсли;
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервере
Функция  ПроверитьНаНаличиеПоказаний(ПриборУчета)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказанияПриборовУчетаСрезПоследних.Значение
		|ИЗ
		|	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(, ПриборУчета = &ПриборУчета) КАК ПоказанияПриборовУчетаСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоказанияПриборовУчетаССайтаСрезПоследних.Значение
		|ИЗ
		|	РегистрСведений.ПоказанияПриборовУчетаССайта.СрезПоследних(, ПриборУчета = &ПриборУчета) КАК ПоказанияПриборовУчетаССайтаСрезПоследних";
	
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат истина;
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Процедура ОбщедомовойСчетчикПриИзменении(Элемент)
	Если Объект.ОбщедомовойСчетчик = Истина Тогда
		Элементы.Здание.Видимость = Истина;
	Иначе
		Элементы.Здание.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры


