//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ   
//

// Процедура - обработчик события формы "ПриЗагрузкеДанныхИзНастроекНаСервере".
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		
		Элементы.ГруппаОтборы.Видимость = Ложь;
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Здание",	Параметры.Отбор.Владелец,	ЗначениеЗаполнено(Параметры.Отбор.Владелец));
		
	Иначе
	
		ОтборОрганизация	 		        = Настройки.Получить("ОтборОрганизация");
		ОтборЗдание		 			        = Настройки.Получить("ОтборЗдание");
		ОтборЛицевойСчетСпецКомунТранс	    = Настройки.Получить("ОтборЛицевойСчетСпецКомунТранс");
		ОтборОтветственныйВладелец	        = Настройки.Получить("ОтборОтветственныйВладелец");
		ОтборЖилойФонд				        = Настройки.Получить("ОтборЖилойФонд");
		ОтборЛицевыеСчета                   = Настройки.Получить("ОтборЛицевыеСчета");
				
		УстановитьСвязиПараметровВыбора();
		
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Наименование", ОтборЛицевыеСчета, ЗначениеЗаполнено(ОтборЛицевыеСчета));
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Здание", ОтборЗдание, ЗначениеЗаполнено(ОтборЗдание));
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчетСпецКомунТранс", ОтборЛицевойСчетСпецКомунТранс, ЗначениеЗаполнено(ОтборЛицевойСчетСпецКомунТранс));
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ОтветственныйВладелец", ОтборОтветственныйВладелец, ЗначениеЗаполнено(ОтборОтветственныйВладелец));
		ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ЖилойФонд", ОтборЖилойФонд, ЗначениеЗаполнено(ОтборЖилойФонд));
		
	КонецЕсли;
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СозданЛицевойСчет" Тогда
		ОтобразитьИзменениеДанных(Параметр, ВидИзмененияДанных.Добавление);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор()
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Здание", ОтборЗдание, ЗначениеЗаполнено(ОтборЗдание));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Подъезд", ОтборЛицевойСчетСпецКомунТранс, ЗначениеЗаполнено(ОтборЛицевойСчетСпецКомунТранс));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗданиеПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодъездПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчетСпецКомунТранс", ОтборЛицевойСчетСпецКомунТранс, ЗначениеЗаполнено(ОтборЛицевойСчетСпецКомунТранс));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветсвенныйВладелецПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ОтветственныйВладелец", ОтборОтветственныйВладелец, ЗначениеЗаполнено(ОтборОтветственныйВладелец));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЖилойФондПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ЖилойФонд", ОтборЖилойФонд, ЗначениеЗаполнено(ОтборЖилойФонд));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбора()
	
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Организация", "ОтборОрганизация", РежимИзмененияСвязанногоЗначения.НеИзменять);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		Элементы.ОтборЗдание.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
		Если ОтборЗдание.Организация <> ОтборОрганизация Тогда
			ОтборЗдание = Справочники.ЗданияИСооружения.ПустаяСсылка();
			ОтборЛицевойСчетСпецКомунТранс = Справочники.Подъезды.ПустаяСсылка();
		КонецЕсли;
	Иначе		
		Элементы.ОтборЗдание.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив());
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
		
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Здание", ОтборЗдание);
	СтруктураПараметров.Вставить("Организация", ОтборОрганизация);
	СтруктураПараметров.Вставить("ЖилойФонд", ОтборЖилойФонд);
		
	ОткрытьФорму("Обработка.ПомощникСозданияЛицевогоСчета.Форма.Форма", СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЛицевыеСчетаПриИзменении(Элемент)
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Наименование", ОтборЛицевыеСчета, ЗначениеЗаполнено(ОтборЛицевыеСчета), ВидСравненияКомпоновкиДанных.Подобно);
КонецПроцедуры

&НаКлиенте
Процедура ОтборЛицевойСчетСпецКомунТрансПриИзменении(Элемент)
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчетСпецКомунТранс", ОтборЛицевыеСчета, ЗначениеЗаполнено(ОтборЛицевыеСчета), ВидСравненияКомпоновкиДанных.Подобно);
КонецПроцедуры

&НаКлиенте
Процедура ОтборТеплосетьПриИзменении(Элемент)
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчетТеплосеть", ОтборЛицевыеСчета, ЗначениеЗаполнено(ОтборЛицевыеСчета), ВидСравненияКомпоновкиДанных.Подобно);
КонецПроцедуры

&НаКлиенте
Процедура ОтборЖЕКПриИзменении(Элемент)
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчетЖЕК", ОтборЛицевыеСчета, ЗначениеЗаполнено(ОтборЛицевыеСчета), ВидСравненияКомпоновкиДанных.Подобно);
КонецПроцедуры



