
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.Свойство("ДатаДокумента") Тогда
		ДатаДокумента = Параметры.ДатаДокумента;
	КонецЕсли;
	
	Если Параметры.Свойство("ЛицевойСчет") Тогда
		ЛицевойСчет = Параметры.ЛицевойСчет;
	КонецЕсли;
	
	Если Параметры.Свойство("ПриборУчета") Тогда
		ПриборУчета = Параметры.ПриборУчета;
		Услуга = ПриборУчета.Услуга;
		ВидТарифа = Параметры.ВидТарифа;
		ВидРасчетаСреднегоЗначения = Услуга.ВидРасчетаПоСредней;
		Если ВидРасчетаСреднегоЗначения = Перечисления.ВидыРасчетаПоСредней.ПоПрошлымМесяцам тогда
			КоличествоМесяцев = Услуга.БазаДляРасчетаПоСредней;
		КонецЕсли;
	КонецЕсли;
	
	Текст = Нстр("ru = 'Расчет среднемесячного потребления ведется '; uk = 'Розрахунок середньомісячного споживання ведеться '") + НРег(ВидРасчетаСреднегоЗначения);
	
	Элементы.ОписаниеВидаРасчета.Заголовок = Текст;
	
	ПолучитьСтруктуруДляРасчета();
	
	ТаблицаРасчета = ЗаполнитьФормулуНаСервере();
		
	Для Каждого Строка из ТаблицаРасчета Цикл
		НоваяСтрока = ДанныеДляРасчета.Добавить();
		НоваяСтрока.Период = Строка.период;
		НоваяСтрока.Сумма = Строка.Сумма;
	КонецЦикла;
	
	Если ДанныеДляРасчета.Количество() > 0 Тогда
	
		КоличествоМесяцев = ДанныеДляРасчета.Количество();
		СуммаДляРасчета = ДанныеДляРасчета.Итог("Сумма");
		
		ФормулаРасчета =  Строка(СуммаДляРасчета) + "/" + Строка(КоличествоМесяцев);
		
		СреденееПоказание = СуммаДляРасчета/КоличествоМесяцев;
	Иначе
		
		ФормулаРасчета =  НСтр("ru = 'Данные для расчета отсутствуют. Введите среднемесячное показание вручную.'; uk = 'Дані для розрахунку відсутні. Введіть середньомісячне свідчення вручну.'");
	КонецЕсли;
	
	
	
	
КонецПроцедуры

&НаСервере
Процедура  ПолучитьСтруктуруДляРасчета()

	Если НЕ ЗначениеЗаполнено(ВидРасчетаСреднегоЗначения ) Тогда
		Элементы.ОписаниеВидаРасчета.Заголовок = НСТР("ru = 'Для услуги не выбран метод расчета по средней'; uk = 'Для послуги не вибраний метод розрахунку по середній'")+ СТРОКА(Услуга.Наименование);
		Элементы.ОписаниеВидаРасчета.ЦветТекста =  Новый Цвет(255, 0, 0);
		НачалоПериодаРасчета = Дата(1,1,1);
		КонецПериодаРасчета = Дата(1,1,1);
		Возврат;
	КонецЕсли;
	
	
	Если ВидРасчетаСреднегоЗначения = Перечисления.ВидыРасчетаПоСредней.ПоПрошлымМесяцам Тогда
		Если НЕ ЗначениеЗаполнено(КоличествоМесяцев) Тогда
			
			Элементы.ОписаниеВидаРасчета.Заголовок = НСТР("ru = 'Не установлено количество месяцев для расчета среднемесячного потребления для услуги'; uk = 'Не встановлено кількість місяців для розрахунку середньомісячного споживання'")+ СТРОКА(Услуга.Наименование);
			Элементы.ОписаниеВидаРасчета.ЦветТекста =  Новый Цвет(255, 0, 0);
			
		Иначе
			
			НачалоПериодаРасчета = НачалоМесяца(ДобавитьМесяц(ДатаДокумента,-КоличествоМесяцев));
			КонецПериодаРасчета = НачалоМесяца(ДатаДокумента);
			
		КонецЕсли;                
	ИначеЕсли ВидРасчетаСреднегоЗначения = Перечисления.ВидыРасчетаПоСредней.ЗаГод Тогда
		
		НачалоПериодаРасчета = ДобавитьМесяц(ДатаДокумента,(-12));
		КонецПериодаРасчета = НачалоМесяца(ДатаДокумента);
		
	ИначеЕсли ВидРасчетаСреднегоЗначения = Перечисления.ВидыРасчетаПоСредней.ЗаПрошлыйСезон Тогда
		
		Если ЗначениеЗаполнено(Услуга.КонецСезона) и ЗначениеЗаполнено(Услуга.НачалоСезона) Тогда		
			МесяцНачалоПериодаРасчета = Месяц(Услуга.НачалоСезона);
			МесяцКонецПериодаРасчета = Месяц(Услуга.КонецСезона);
			МесяцДокумента = Месяц(ДатаДокумента);
			
			Если МесяцКонецПериодаРасчета > МесяцДокумента Тогда
				ГодКонцаСезона = Год(ДатаДокумента);
			Иначе
				ГодКонцаСезона = Год(ДатаДокумента)-1;
			КонецЕсли;	
			
			Если МесяцКонецПериодаРасчета > МесяцНачалоПериодаРасчета Тогда
				ГодНачалаСезона = ГодКонцаСезона;
			Иначе
				ГодНачалаСезона = ГодКонцаСезона-1;
			КонецЕсли;
			
			НачалоПериодаРасчета = НачалоМесяца(Дата(ГодНачалаСезона,МесяцНачалоПериодаРасчета,1,0,0,0));
			КонецПериодаРасчета = КонецМесяца(Дата(ГодКонцаСезона,МесяцКонецПериодаРасчета,1,0,0,0));
		Иначе
			Элементы.ОписаниеВидаРасчета.Заголовок = НСТР("ru = 'Не установлены начало и конец сезона для расчета среднемесячного потребления для услуги'; uk = 'Не встановлено початок і кінець сезону для розрахунку середньомісячного споживання'")+ СТРОКА(Услуга.Наименование);
			Элементы.ОписаниеВидаРасчета.ЦветТекста =  Новый Цвет(255, 0, 0);
		КонецЕсли;
	ИначеЕсли   ВидРасчетаСреднегоЗначения = Перечисления.ВидыРасчетаПоСредней.АналогичныйПериод Тогда
		ГодПериодаРасчета  = Год(ДатаДокумента)-1;
		МесяцПериодаРасчета = Месяц(ДатаДокумента);
		
		НачалоПериодаРасчета = НачалоМесяца(Дата(ГодПериодаРасчета,МесяцПериодаРасчета,1,0,0,0));
		КонецПериодаРасчета = КонецМесяца(Дата(ГодПериодаРасчета,МесяцПериодаРасчета,1,0,0,0));

		
	КонецЕсли;	
		
		
		
		
КонецПроцедуры // СтруктураДляРасчета()


&НаСервере
Функция ЗаполнитьФормулуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасчетПоказанийПриборовУчета.Период КАК Период,
	               |	СУММА(ЕСТЬNULL(РасчетПоказанийПриборовУчета.Значение, 0)) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.РасчетПоказанийПриборовУчета КАК РасчетПоказанийПриборовУчета
	               |ГДЕ
	               |	РасчетПоказанийПриборовУчета.Период МЕЖДУ &НачалоРасчета И &КонецРасчета
	               |	И РасчетПоказанийПриборовУчета.ПриборУчета = &ПриборУчета
	               |	И РасчетПоказанийПриборовУчета.Услуга = &Услуга
	               |	И РасчетПоказанийПриборовУчета.ОбъектУстановки = &ОбъектУстановки
	               |	И РасчетПоказанийПриборовУчета.ВидТарифа = &ВидТарифа
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетПоказанийПриборовУчета.Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	Запрос.УстановитьПараметр("НачалоРасчета",НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецРасчета",КонецПериодаРасчета);
	Запрос.УстановитьПараметр("Услуга",Услуга);
	Запрос.УстановитьПараметр("ОбъектУстановки",ЛицевойСчет);
	Запрос.УстановитьПараметр("ПриборУчета",ПриборУчета);
	Запрос.УстановитьПараметр("ВидТарифа",ВидТарифа);
	
	результат = Запрос.Выполнить().Выгрузить();
	
	Возврат результат;
	
КонецФункции


&НаКлиенте
Процедура Ок(Команда)
	
	Закрыть(ЗаписатьВоВременноеХранилище(СреденееПоказание));
КонецПроцедуры


&НаСервере
Функция ЗаписатьВоВременноеХранилище(Среденемесячное)

	 Возврат ПоместитьВоВременноеХранилище(Среденемесячное);

КонецФункции // ЗаписатьВоВременноеХранилище()

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()

	Если НЕ ЗначениеЗаполнено(Услуга.ВидРасчетаПоСредней) Тогда
		Элементы.ОписаниеВидаРасчета.Видимость = Ложь;
	Иначе
		Элементы.ОписаниеВидаРасчета.Видимость = Истина;
	КонецЕсли;	
		

КонецПроцедуры // УстановитьВидимостьДоступность()
