Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУправлениеУслугами, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	Запрос.Текст =
       "ВЫБРАТЬ
       |	УправлениеПенейЛицевыеСчета.ЛицевойСчет,
       |	УправлениеПенейЛицевыеСчета.Ссылка.Организация,
       |	УправлениеПенейЛицевыеСчета.Ссылка.Здание,
       |	УправлениеПенейЛицевыеСчета.Ссылка.ДатаНачала КАК Период,
       |	ЛОЖЬ КАК Действует
       |ИЗ
       |	Документ.УправлениеПеней.ЛицевыеСчета КАК УправлениеПенейЛицевыеСчета
       |ГДЕ
       |	УправлениеПенейЛицевыеСчета.Ссылка = &Ссылка
       |
       |СГРУППИРОВАТЬ ПО
       |	УправлениеПенейЛицевыеСчета.ЛицевойСчет,
       |	УправлениеПенейЛицевыеСчета.Ссылка.ДатаНачала,
       |	УправлениеПенейЛицевыеСчета.Ссылка.Организация,
       |	УправлениеПенейЛицевыеСчета.Ссылка.Здание
       |
       |ОБЪЕДИНИТЬ ВСЕ
       |
       |ВЫБРАТЬ
       |	УправлениеПенейЛицевыеСчета.ЛицевойСчет,
       |	УправлениеПенейЛицевыеСчета.Ссылка.Организация,
       |	УправлениеПенейЛицевыеСчета.Ссылка.Здание,
       |	КОНЕЦПЕРИОДА(УправлениеПенейЛицевыеСчета.Ссылка.ДатаОкончания, ДЕНЬ),
       |	ИСТИНА
       |ИЗ
       |	Документ.УправлениеПеней.ЛицевыеСчета КАК УправлениеПенейЛицевыеСчета
       |ГДЕ
       |	УправлениеПенейЛицевыеСчета.Ссылка = &Ссылка
       |
       |СГРУППИРОВАТЬ ПО
       |	УправлениеПенейЛицевыеСчета.Ссылка.Организация,
       |	УправлениеПенейЛицевыеСчета.Ссылка.Здание,
       |	УправлениеПенейЛицевыеСчета.ЛицевойСчет,
       |	КОНЕЦПЕРИОДА(УправлениеПенейЛицевыеСчета.Ссылка.ДатаОкончания, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУправлениеУслугами);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДействиеПени", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
