////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
// Процедура устанавливает видимость реквизитов формы.
//
// Параметры:
//  Нет.
//
Процедура УстановитьВидимостьРеквизитов()
	
	Если Объект.ЮрФизЛицо = ЮрЛицо Тогда
		Элементы.НомерСвидетельства.Видимость = Истина;
		Элементы.ФизическоеЛицо.Видимость = Ложь;
		Объект.ФизическоеЛицо = Неопределено;
		Элементы.КодПоЕДРПОУ.Видимость = Истина;
	Иначе
		Элементы.НомерСвидетельства.Видимость = Ложь;
		Элементы.ФизическоеЛицо.Видимость = Истина;
		Объект.НомерСвидетельства = "";
		Элементы.КодПоЕДРПОУ.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьРеквизитов()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЮрЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
		
	Если Объект.ЮрФизЛицо = ЮрЛицо Тогда
		Элементы.НомерСвидетельства.Видимость = Истина;
		Элементы.ФизическоеЛицо.Видимость = Ложь;
		Объект.ФизическоеЛицо = Неопределено;
	Иначе
		Элементы.НомерСвидетельства.Видимость = Ложь;
		Элементы.ФизическоеЛицо.Видимость = Истина;
		Объект.НомерСвидетельства = "";
	КонецЕсли;
	
	Если Объект.ТабличнаяКонтрагентовДляСубсидийИЛьгот.Количество() = 0 Тогда
		ЗаполнитьВидыУслуг();
	КонецЕсли;	
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, Объект, "ГруппаКонтактнаяИнформация");
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
// Процедура обработчик события ПриИзменении поля ввода Наименование.
//
Процедура НаименованиеПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры // НаименованиеПриИзменении()

&НаКлиенте
// Процедура обработчик события ПриИзменении поля ввода ЮрФизЛицо.
//
Процедура ЮрФизЛицоПриИзменении(Элемент)
	
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры // ЮрФизЛицоПриИзменении()

&НаКлиенте
// Процедура - обработчик события НачалоВыбора поля  БанковскийСчетПоУмолчанию.
//
Процедура БанковскийСчетПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		СтандартнаяОбработка = Ложь;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Элемент справочника еще не записан.';uk='Елемент довідника ще не записаний.'");
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры // БанковскийСчетПоУмолчаниюНачалоВыбора()


&НаКлиенте
Процедура КомандаУказатьНаКарте(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Сначала необходимо сохранить запись");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Партнер, Широта, Долгота, РежимРедактора", Объект.Ссылка, Объект.Широта, Объект.Долгота, "ДляЗаписи"); 
	ОткрытьФорму("ОбщаяФорма.РедакторМеток", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОпределитьКоординатыПоАдресу(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Сначала необходимо сохранить запись");
		Возврат;
	КонецЕсли;
	
	ТекЗдание = Объект.Ссылка;
	АдресЗдания = РаботаСКартамиСервер.ПолучитьАдресЗдания(ТекЗдание);
	
	Если ПустаяСтрока(АдресЗдания) Тогда
		Сообщить("Для здания не задан адрес в контактной информации, по которому можно определить координаты");
		Возврат;
	КонецЕсли;
	
	Попытка
		СтруктураОтвета = РаботаСКартамиКлиент.ПолучитьКоординатыПоЗапросу(АдресЗдания);
	Исключение
		Сообщить("Невозможно определить координаты для здания " + СокрЛП(ТекЗдание));
	КонецПопытки;
	
	Если Не СтруктураОтвета = Неопределено Тогда 					
		НайденныеКоординаты = СтруктураОтвета.Координаты;
						
		МассивКоординат = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НайденныеКоординаты, " ");		
			
		Объект.Широта  = МассивКоординат[1]; 
		Объект.Долгота = МассивКоординат[0];
			
		АвтопоискАдрес = СокрЛП(СтруктураОтвета.Область) + ", " + СокрЛП(СтруктураОтвета.НаселенныйПункт) + ", " + СокрЛП(СтруктураОтвета.Улица) + ", " + СокрЛП(СтруктураОтвета.Дом); 
		
		ТекстСообщения = "Адрес по справочнику: " + АдресЗдания + Символы.ПС +
						 "Адрес, для которого определены координаты: " + АвтопоискАдрес;		
		Сообщить(ТекстСообщения);
		
	Иначе
		
		ТекстСообщения = "Координаты по адресу: " + АдресЗдания + Символы.ПС +
						 "не найдены. Возможно ошибка в адресе.";		
		Сообщить(ТекстСообщения);	
		
	КонецЕсли; 	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "КОНТАКТНАЯ ИНФОРМАЦИЯ"

// СтандартныеПодсистемы.КонтактнаяИнформация

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.КонтактнаяИнформация

//////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ НАЧАЛЬНОГО ЗАПОЛНЕНИЯ
&НаСервере
Процедура ЗаполнитьВидыУслуг()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВидыУслуг.Ссылка КАК ВидУслуги
	|ИЗ
	|	Справочник.ВидыУслуг КАК ВидыУслуг
	|ГДЕ
	|	ВидыУслуг.ПометкаУдаления = ЛОЖЬ");
	
	Объект.ТабличнаяКонтрагентовДляСубсидийИЛьгот.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
КонецПроцедуры