
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЖилойФонд = Перечисления.ЖилойНеЖилойФонд.Жилой  Тогда
		Если ПолучитьФункциональнуюОпцию("ИспользоватьВариантКоттеджныйПоселок") Тогда
			Наименование = "д. №" + Прав("    "+Код,4) + СокрЛП(Суффикс);
			
		ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьВариантГород") Тогда
			Если Владелец.ТипСооружения = Перечисления.ТипыСооружений.ГруппаЗданий Тогда
				Наименование = "д. №" + Прав("    "+Код,4) + СокрЛП(Суффикс);
			Иначе
				Наименование = "кв. №" + Прав("    "+Код,4) + СокрЛП(Суффикс);
			КонецЕсли;
		Иначе
			Наименование = "кв. №" + Прав("    "+Код,4) + СокрЛП(Суффикс);
		КонецЕсли;
	ИначеЕсли Паркинг тогда
		
		Наименование = "м.м № " + СокрЛП(Суффикс);
		
	ИначеЕсли ЗначениеЗаполнено(Префикс) Тогда
		Наименование = СокрЛП(Префикс) + " №" + Прав("    "+Код,4) + СокрЛП(Суффикс);
	Иначе
		
		Наименование = "оф. №" + Прав("    "+Код,4) + СокрЛП(Суффикс);
		
	КонецЕсли;
	
КонецПроцедуры
