
&НаКлиенте
Процедура ФайлЕксельНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ФайлЕксель;
	Фильтр = "Электронная таблица Excel(*.xlsx)|*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ФайлЕксель = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Путь = Объект.ФайлЕксель;
	Если НЕ ЗначениеЗаполнено(Объект.ФайлЕксель) Тогда
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
	КонецЕсли;
	Если Объект.ЛицевыеСчета.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	Объект.ЛицевыеСчета.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.ActiveSheet.UsedRange.Rows.Count();//Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик = 2 По КоличествоСтрок Цикл
		НоваяСтрока                  = Объект.ЛицевыеСчета.Добавить();
		НоваяСтрока.Адрес            = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.УслугаСтарая     = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.ЛицевойСчет      = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.Услуга1          = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.Услуга2          = Excel.Cells(Счетчик, 5).Value;
		НоваяСтрока.Услуга3          = Excel.Cells(Счетчик, 6).Value;
		НоваяСтрока.Услуга4          = Excel.Cells(Счетчик, 7).Value;
		НоваяСтрока.Услуга5          = Excel.Cells(Счетчик, 8).Value;
		НоваяСтрока.Услуга6          = Excel.Cells(Счетчик, 9).Value;
		НоваяСтрока.Услуга7          = Excel.Cells(Счетчик, 10).Value;
		НоваяСтрока.Услуга8          = Excel.Cells(Счетчик, 11).Value;
		НоваяСтрока.Услуга9          = Excel.Cells(Счетчик, 12).Value;
		НоваяСтрока.Услуга10         = Excel.Cells(Счетчик, 13).Value;
		НоваяСтрока.Услуга11         = Excel.Cells(Счетчик, 14).Value;
		НоваяСтрока.Услуга12         = Excel.Cells(Счетчик, 15).Value;
	КонецЦикла;
	Excel.Workbooks.Close();
	Excel.Quit();
КонецПроцедуры

&НаСервере
Процедура УстановитьУслугиНаСервере()
	Для Каждого стр Из Объект.ЛицевыеСчета Цикл
		ЛС = НайтиЛицевойСчет(СтрЗаменить(Строка(стр.ЛицевойСчет), Символы.НПП, ""));
		// Отключение услуги
		НазначенныеУслуги = НайтиУслугиПоЛС(ЛС, Объект.НаДату);
		ДокОтменаУслуг = Документы.УправлениеУслугами.СоздатьДокумент();
		ДокОтменаУслуг.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.ОтключениеУслуги;
		ДокОтменаУслуг.Автор = ПараметрыСеанса.ТекущийПользователь;
		ДокОтменаУслуг.Дата = Объект.НаДату;
		ДокОтменаУслуг.ДатаОкончания = Объект.НаДату;
		ДокОтменаУслуг.Здание = ЛС.Владелец;
		ДокОтменаУслуг.Организация = Объект.Организация;
		НовЛС = ДокОтменаУслуг.ЛицевыеСчета.Добавить();
		НовЛС.ЛицевойСчет = ЛС;
		Для Каждого стрУслуги Из НазначенныеУслуги Цикл
			НовСтрока = ДокОтменаУслуг.Услуги.Добавить();
			НовСтрока.Услуга = стрУслуги.Услуга;
		КонецЦикла;
		Попытка
			ДокОтменаУслуг.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			ДокОтменаУслуг.Записать();
			Сообщить("Не вдалося зупинити послуги по особовому рахунку № " + ЛС);
		КонецПопытки;
		
		// Назначить новые услуги
		ДокНазначениеУслуг = Документы.УправлениеУслугами.СоздатьДокумент();
		ДокНазначениеУслуг.Автор = ПараметрыСеанса.ТекущийПользователь;
		ДокНазначениеУслуг.Дата = Объект.НаДату;
		ДокНазначениеУслуг.ДатаНачала = НачалоДня(Объект.НаДату);
		ДокНазначениеУслуг.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.НазначениеУслуги;
		ДокНазначениеУслуг.Здание = ЛС.Владелец;
		НовЛС = ДокНазначениеУслуг.ЛицевыеСчета.Добавить();
		НовЛС.ЛицевойСчет = ЛС;
		ДокНазначениеУслуг.Организация = Объект.Организация;
		Если ЗначениеЗаполнено(стр.Услуга1) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга1);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга2) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга2);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга3) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга3);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга4) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга4);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга5) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга5);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга6) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга6);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга7) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга7);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга8) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга8);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга9) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга9);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга10) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга10);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга11) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга11);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга12) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга12);
		КонецЕсли;
		Попытка
			ДокНазначениеУслуг.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			ДокНазначениеУслуг.Записать();
			Сообщить("Не вдалося призначити послуги по особовому рахунку № " + ЛС);
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьУслуги(Команда)
	УстановитьУслугиНаСервере();
КонецПроцедуры

&НаСервере
Функция НайтиЛицевойСчет(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, ЛицевойСчет.Наименование = &ЛицевойСчет И Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛС = Выборка.ЛицевойСчет;
	КонецЦикла;
	Возврат ЛС;
КонецФункции

&НаСервере
Функция НайтиУслугиПоЛС(ЛС, Дата)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.Услуга
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			ЛицевойСчет = &ЛицевойСчет
	    |				И Действует = ИСТИНА) КАК НазначенныеУслугиСрезПоследних";
    Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции