
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуУстановленныеПриборыУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаПриборыУчетаВключение.ПриборУчетаНовый КАК ПриборУчета,
		|	ТаблицаПриборыУчетаВключение.ОбъектУстановки КАК ОбъектУстановки,
		|	ТаблицаПриборыУчетаВключение.Дата КАК Период,
		|	МАКСИМУМ(ИСТИНА) КАК Действует
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаПриборыУчетаВключение
		|ГДЕ
		|	ТаблицаПриборыУчетаВключение.ПриборУчетаНовый <> ЗНАЧЕНИЕ(Справочник.ПриборыУчета.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПриборыУчетаВключение.ПриборУчетаНовый,
		|	ТаблицаПриборыУчетаВключение.ОбъектУстановки,
		|	ТаблицаПриборыУчетаВключение.Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаПриборыУчетаОтключение.ПриборУчета,
		|	ТаблицаПриборыУчетаОтключение.ОбъектУстановки,
		|	ТаблицаПриборыУчетаОтключение.Дата,
		|	МАКСИМУМ(ЛОЖЬ)
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаПриборыУчетаОтключение
		|ГДЕ
		|	ТаблицаПриборыУчетаОтключение.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.ПриборыУчета.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПриборыУчетаОтключение.Дата,
		|	ТаблицаПриборыУчетаОтключение.ПриборУчета,
		|	ТаблицаПриборыУчетаОтключение.ОбъектУстановки";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУстановленныеПриборыУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуУстановленныеПриборыУчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуПоказанияПриборовУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаПриборыУчетаВключение.ПриборУчетаНовый КАК ПриборУчета,
		|	ТаблицаПриборыУчетаВключение.ВидТарифаНовый КАК ВидТарифа,
		|	ТаблицаПриборыУчетаВключение.Дата КАК Период,
		|	ТаблицаПриборыУчетаВключение.ПоказаниеНовое КАК Значение,
		|	ЛОЖЬ КАК Отключен
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаПриборыУчетаВключение
		|ГДЕ
		|	ТаблицаПриборыУчетаВключение.ПриборУчетаНовый <> ЗНАЧЕНИЕ(Справочник.ПриборыУчета.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаПриборыУчетаОтключение.ПриборУчета,
		|	ТаблицаПриборыУчетаОтключение.ВидТарифаПредыдущий,
		|	ТаблицаПриборыУчетаОтключение.Дата,
		|	ТаблицаПриборыУчетаОтключение.Показание,
		|	ИСТИНА
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаПриборыУчетаОтключение
		|ГДЕ
		|	ТаблицаПриборыУчетаОтключение.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.ПриборыУчета.ПустаяСсылка)";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПоказанияПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуУстановленныеПриборыУчета()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуЗаменыПриборовУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаЗаменыПриборовУчета.Дата КАК Период,
		|	ТаблицаЗаменыПриборовУчета.ОбъектУстановки КАК ОбъектУстановки,
		|	ТаблицаЗаменыПриборовУчета.ПриборУчета КАК ПриборУчета,
		|	ТаблицаЗаменыПриборовУчета.Услуга КАК Услуга,
		|	ТаблицаЗаменыПриборовУчета.ВидТарифаПредыдущий КАК ВидТарифа,
		|	ТаблицаЗаменыПриборовУчета.Показание КАК Показание,
		|	ТаблицаЗаменыПриборовУчета.ПоказаниеПредыдущее КАК ПоказаниеПредыдущее
		|ИЗ
		|	ВременнаяТаблицаПриборыУчета КАК ТаблицаЗаменыПриборовУчета
		|ГДЕ
		|	ТаблицаЗаменыПриборовУчета.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.ПриборыУчета.ПустаяСсылка)";	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаменыПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуЗаменыПриборовУчета()

Процедура СформироватьТаблицуПломбыПриборовУчета(ДокументСсылкаУправлениеПриборамиУчета, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВременнаяТаблицаПриборыУчета.ПриборУчета,
	               |	ВременнаяТаблицаПриборыУчета.Дата КАК Период,
	               |	ВременнаяТаблицаПриборыУчета.ВидПломбы,
	               |	ВременнаяТаблицаПриборыУчета.СерийныйНомер,
	               |	ЛОЖЬ КАК Действует,
	               |	ВременнаяТаблицаПриборыУчета.Организация,
	               |	ВременнаяТаблицаПриборыУчета.Здание,
	               |	ВременнаяТаблицаПриборыУчета.ОбъектУстановки КАК ЛицевойСчет
	               |ИЗ
	               |	ВременнаяТаблицаПриборыУчета КАК ВременнаяТаблицаПриборыУчета
	               |ГДЕ
	               |	ВременнаяТаблицаПриборыУчета.ВидПломбы <> &ВидПломбы
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВременнаяТаблицаПриборыУчета.ПриборУчетаНовый,
	               |	ВременнаяТаблицаПриборыУчета.Дата,
	               |	ВременнаяТаблицаПриборыУчета.ВидПломбыНовый,
	               |	ВременнаяТаблицаПриборыУчета.СерийныйНомерНовый,
	               |	ИСТИНА,
	               |	ВременнаяТаблицаПриборыУчета.Организация,
	               |	ВременнаяТаблицаПриборыУчета.Здание,
	               |	ВременнаяТаблицаПриборыУчета.ОбъектУстановки
	               |ИЗ
	               |	ВременнаяТаблицаПриборыУчета КАК ВременнаяТаблицаПриборыУчета
	               |ГДЕ
	               |	ВременнаяТаблицаПриборыУчета.ВидПломбыНовый <> &ВидПломбы";
		
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("ВидПломбы", Справочники.ВидыПломбПриборовУчета.ПустаяСсылка());

	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ПломбыПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуУстановленныеПриборыУчета()

Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаЗаменаПриборовУчета, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ЗаменаПриборовУчетаОсновная.Ссылка.Дата,
		 |	ЗаменаПриборовУчетаОсновная.ОбъектУстановки,
		 |	ЗаменаПриборовУчетаОсновная.ПриборУчета,
		 |	ЗаменаПриборовУчетаОсновная.Показание,
		 |	ЗаменаПриборовУчетаОсновная.ПриборУчетаНовый,
		 |	ЗаменаПриборовУчетаОсновная.ПоказаниеНовое,
		 |	ЗаменаПриборовУчетаОсновная.ПоказаниеПредыдущее,
		 |	ЗаменаПриборовУчетаОсновная.ПриборУчета.Услуга КАК Услуга,
		 |	ЗаменаПриборовУчетаОсновная.ВидТарифаПредыдущий,
		 |	ЗаменаПриборовУчетаОсновная.ВидТарифаНовый,
		 |	ЗаменаПриборовУчетаОсновная.Ссылка.УказатьПломбыПриборовУчета,
		 |	ЗаменаПриборовУчетаОсновная.СерийныйНомер,
		 |	ЗаменаПриборовУчетаОсновная.СерийныйНомерНовый,
		 |	ЗаменаПриборовУчетаОсновная.ВидПломбы,
		 |	ЗаменаПриборовУчетаОсновная.ВидПломбыНовый,
		 |	ЗаменаПриборовУчетаОсновная.Ссылка.Организация,
		 |	ЗаменаПриборовУчетаОсновная.Ссылка.Здание
		 |ПОМЕСТИТЬ ВременнаяТаблицаПриборыУчета
		 |ИЗ
		 |	Документ.ЗаменаПриборовУчета.Основная КАК ЗаменаПриборовУчетаОсновная
		 |ГДЕ
		 |	ЗаменаПриборовУчетаОсновная.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗаменаПриборовУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицуУстановленныеПриборыУчета(ДокументСсылкаЗаменаПриборовУчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицуПоказанияПриборовУчета(ДокументСсылкаЗаменаПриборовУчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицуЗаменыПриборовУчета(ДокументСсылкаЗаменаПриборовУчета, СтруктураДополнительныеСвойства);
	СформироватьТаблицуПломбыПриборовУчета(ДокументСсылкаЗаменаПриборовУчета, СтруктураДополнительныеСвойства);
КонецПроцедуры

